<?php
return array(
	'legacy_urls:message' => '[Ŧħīş ƥȧɠḗ ħȧş ḿǿṽḗḓ ŧǿ %s. Ƥŀḗȧşḗ ŭƥḓȧŧḗ ẏǿŭř ƀǿǿķḿȧřķ ǿř řḗƥǿřŧ ŧħḗ ŀīƞķ ŧħȧŧ ŀḗḓ ħḗřḗ. ẛΰ靐ΰ ϰıϑı 靐衋ǲ]',

	'legacy_urls:instructions' => '[Şḗŀḗƈŧ ḿḗŧħǿḓ ƒǿř ħȧƞḓŀīƞɠ ŀḗɠȧƈẏ ŬŘĿş 靐ϵϖϰϖϰ ϕς靐ǲ]',
	'legacy_urls:immediate' => '[Īḿḿḗḓīȧŧḗŀẏ ƒǿřẇȧřḓ ŧǿ ŧħḗ ƞḗẇ ŬŘĿ ϰ靐ΐ鶱靐ϱΐẛϰǋ]',
	'legacy_urls:immediate_error' => '[Īḿḿḗḓīȧŧḗŀẏ ƒǿřẇȧřḓ ŧǿ ŧħḗ ƞḗẇ ŬŘĿ ȧƞḓ ḓīşƥŀȧẏ ȧƞ ḗřřǿř ḿḗşşȧɠḗ ǈϱϰϕϖϵ衋ǈϖ]',
	'legacy_urls:landing' => '[Ḓīşƥŀȧẏ ȧ ƥȧɠḗ ẇīŧħ ȧ ŀīƞķ ŧǿ ŧħḗ ŧħḗ ƞḗẇ ŬŘĿ ΐẛϱ衋ϕǋ靐 ς]',
);
