<?php
return array(
	'legacy_urls:message' => '[Ŧħīş ƥȧɠḗ ħȧş ḿǿṽḗḓ ŧǿ %s. Ƥŀḗȧşḗ ŭƥḓȧŧḗ ẏǿŭř ƀǿǿķḿȧřķ ǿř řḗƥǿřŧ ŧħḗ ŀīƞķ ŧħȧŧ ŀḗḓ ħḗřḗ. ıΰςΐ ϕǈΐΰ 衋ϕǈ]',

	'legacy_urls:instructions' => '[Şḗŀḗƈŧ ḿḗŧħǿḓ ƒǿř ħȧƞḓŀīƞɠ ŀḗɠȧƈẏ ŬŘĿş ϐǋıΐΐǅ ẛ衋ϵǅ]',
	'legacy_urls:immediate' => '[Īḿḿḗḓīȧŧḗŀẏ ƒǿřẇȧřḓ ŧǿ ŧħḗ ƞḗẇ ŬŘĿ ΰΰς衋衋ǋſ鶱ϵς]',
	'legacy_urls:immediate_error' => '[Īḿḿḗḓīȧŧḗŀẏ ƒǿřẇȧřḓ ŧǿ ŧħḗ ƞḗẇ ŬŘĿ ȧƞḓ ḓīşƥŀȧẏ ȧƞ ḗřřǿř ḿḗşşȧɠḗ ǅǲϕǅϐϱϰςϐ]',
	'legacy_urls:landing' => '[Ḓīşƥŀȧẏ ȧ ƥȧɠḗ ẇīŧħ ȧ ŀīƞķ ŧǿ ŧħḗ ŧħḗ ƞḗẇ ŬŘĿ ϱſ靐ϑϑ鶱ẛ ϐ]',
);
