<?php
return array(
	'twitter_api' => '[Ŧẇīŧŧḗř Şḗřṽīƈḗş ẛıϐςǋΰǈ ǅςſ]',

	'twitter_api:requires_oauth' => '[Ŧẇīŧŧḗř Şḗřṽīƈḗş řḗɋŭīřḗş ŧħḗ ǾȦŭŧħ Ŀīƀřȧřīḗş ƥŀŭɠīƞ ŧǿ ƀḗ ḗƞȧƀŀḗḓ. ΐϰẛςııϕ ϖς]',

	'twitter_api:consumer_key' => '[Ƈǿƞşŭḿḗř Ķḗẏ ẛǅǈΰ鶱ı衋ΐ ϑ]',
	'twitter_api:consumer_secret' => '[Ƈǿƞşŭḿḗř Şḗƈřḗŧ ǅϵϖǅςϐǅϕ ϖ]',

	'twitter_api:settings:instructions' => '[Ẏǿŭ ḿŭşŧ ǿƀŧȧīƞ ȧ ƈǿƞşŭḿḗř ķḗẏ ȧƞḓ şḗƈřḗŧ ƒřǿḿ <a href="https://dev.twitter.com/apps/new" target="_blank">Ŧẇīŧŧḗř</a>. Ƒīŀŀ ǿŭŧ ŧħḗ ƞḗẇ ȧƥƥ ȧƥƥŀīƈȧŧīǿƞ. Şḗŀḗƈŧ "Ɓřǿẇşḗř" ȧş ŧħḗ ȧƥƥŀīƈȧŧīǿƞ ŧẏƥḗ ȧƞḓ "Řḗȧḓ & Ẇřīŧḗ" ƒǿř ŧħḗ ȧƈƈḗşş ŧẏƥḗ. Ŧħḗ ƈȧŀŀƀȧƈķ ŭřŀ īş %sŧẇīŧŧḗř_ȧƥī/ȧŭŧħǿřīzḗ ϕıϖ ǅϕǈẛ ǲΰ靐ΰϕϖ ς ǅǋſẛǲςΰǈ ΰſǈ ϱϰǲ ΐΰΰςϖ鶱 ǋ衋ϐǋ 靐ϱ ςſ]',

	'twitter_api:usersettings:description' => "[Ŀīƞķ ẏǿŭř %s ȧƈƈǿŭƞŧ ẇīŧħ Ŧẇīŧŧḗř. ǋſẛ靐 ıϕϐ靐]",
	'twitter_api:usersettings:request' => "[Ẏǿŭ ḿŭşŧ ƒīřşŧ <a href=\"%s\">ȧŭŧħǿřīzḗ</a> %s ŧǿ ȧƈƈḗşş ẏǿŭř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ. ΐ衋ϰ ϑ衋ϰǅ ϱςς]",
	'twitter_api:usersettings:cannot_revoke' => "[Ẏǿŭ ƈȧƞƞǿŧ ŭƞŀīƞķ ẏǿŭ ȧƈƈǿŭƞŧ ẇīŧħ Ŧẇīŧŧḗř ƀḗƈȧŭşḗ ẏǿŭ ħȧṽḗƞ'ŧ ƥřǿṽīḓḗḓ ȧƞ ḗḿȧīŀ ȧḓḓřḗşş ǿř ƥȧşşẇǿřḓ. <a href=\"%s\">Ƥřǿṽīḓḗ ŧħḗḿ ƞǿẇ</a>. ẛẛϕ ΐẛϑϱſϵ 衋ıΐϐıı ϑǋǋ 鶱ϑ]",
	'twitter_api:authorize:error' => '[Ŭƞȧƀŀḗ ŧǿ ȧŭŧħǿřīzḗ Ŧẇīŧŧḗř. ϖϵẛϱǈΐ ϰ衋 衋]',
	'twitter_api:authorize:success' => '[Ŧẇīŧŧḗř ȧƈƈḗşş ħȧş ƀḗḗƞ ȧŭŧħǿřīzḗḓ. ϱǅϖǲΐϐẛ ǲϐǈ]',

	'twitter_api:usersettings:authorized' => "[Ẏǿŭ ħȧṽḗ ȧŭŧħǿřīzḗḓ %s ŧǿ ȧƈƈḗşş ẏǿŭř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ: @%s. ϐẛ靐 ǈϱǲς]",
	'twitter_api:usersettings:revoke' => '[Ƈŀīƈķ <a href="%s">ħḗřḗ</a> ŧǿ řḗṽǿķḗ ȧƈƈḗşş. ǅǋſϱϱ ΰϕ ϖ]',
	'twitter_api:usersettings:site_not_configured' => '[Ȧƞ ȧḓḿīƞīşŧřȧŧǿř ḿŭşŧ ƒīřşŧ ƈǿƞƒīɠŭřḗ Ŧẇīŧŧḗř ƀḗƒǿřḗ īŧ ƈȧƞ ƀḗ ŭşḗḓ. ǲ鶱 衋ϑẛϑϱǈϕ]',

	'twitter_api:revoke:success' => '[Ŧẇīŧŧḗř ȧƈƈḗşş ħȧş ƀḗḗƞ řḗṽǿķḗḓ. ϵıϵǈǋϖẛ ϰςẛ]',

	'twitter_api:post_to_twitter' => "[Şḗƞḓ ŭşḗřş' ẇīřḗ ƥǿşŧş ŧǿ Ŧẇīŧŧḗř? ſǋΰϑ ΰ鶱ẛ鶱ϑ]",

	'twitter_api:login' => '[Ȧŀŀǿẇ ŭşḗřş ŧǿ şīɠƞ īƞ ẇīŧħ Ŧẇīŧŧḗř? ϰϕϐςϱ ϰΐẛϑ]',
	'twitter_api:new_users' => '[Ȧŀŀǿẇ ƞḗẇ ŭşḗřş ŧǿ şīɠƞ ŭƥ ŭşīƞɠ ŧħḗīř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ ḗṽḗƞ īƒ ŭşḗř řḗɠīşŧřȧŧīǿƞ īş ḓīşȧƀŀḗḓ? ǈǲ衋ϖẛ ǲǅ衋 ϰςϕΰǋ]',
	'twitter_api:login:success' => '[Ẏǿŭ ħȧṽḗ ƀḗḗƞ ŀǿɠɠḗḓ īƞ. ςϱǋ ϵǅıϱ ǲ]',
	'twitter_api:login:error' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿɠīƞ ẇīŧħ Ŧẇīŧŧḗř. ϕıǋẛſǅ ϱǅ 衋]',
	'twitter_api:login:email' => "[Ẏǿŭ ḿŭşŧ ḗƞŧḗř ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ƒǿř ẏǿŭř ƞḗẇ %s ȧƈƈǿŭƞŧ. ϰ靐ǋ ǈ衋ΐϖ]",

	'twitter_api:invalid_page' => '[Īƞṽȧŀīḓ ƥȧɠḗ ϕſϖſſıẛ ǈϵ]',

	'twitter_api:deprecated_callback_url' => '[Ŧħḗ ƈȧŀŀƀȧƈķ ŬŘĿ ħȧş ƈħȧƞɠḗḓ ƒǿř Ŧẇīŧŧḗř ȦƤĪ ŧǿ %s.  Ƥŀḗȧşḗ ȧşķ ẏǿŭř ȧḓḿīƞīşŧřȧŧǿř ŧǿ ƈħȧƞɠḗ īŧ. ǅϑẛ ΰϱϐΐϑϰẛǲ ıϐς]',

	'twitter_api:interstitial:settings' => '[Ƈǿƞƒīɠŭřḗ ẏǿŭř şḗŧŧīƞɠş ſϵǈϰϐſΐıς ǋ]',
	'twitter_api:interstitial:description' => '[Ẏǿŭ\'řḗ ȧŀḿǿşŧ řḗȧḓẏ ŧǿ ŭşḗ %s! Ẇḗ ƞḗḗḓ ȧ ƒḗẇ ḿǿřḗ ḓḗŧȧīŀş ƀḗƒǿřḗ ẏǿŭ ƈȧƞ ƈǿƞŧīƞŭḗ. Ŧħḗşḗ ȧřḗ ǿƥŧīǿƞȧŀ, ƀŭŧ ẇīŀŀ ȧŀŀǿẇ ẏǿŭ ŀǿɠīƞ īƒ Ŧẇīŧŧḗř ɠǿḗş ḓǿẇƞ ǿř ẏǿŭ ḓḗƈīḓḗ ŧǿ ŭƞŀīƞķ ẏǿŭř ȧƈƈǿŭƞŧş. ςϖ靐ǲẛǅ 靐衋鶱ſ靐ϐ 靐ςſǈ靐 鶱ϕ ΰıϖ 衋ΐϕ ϕϖ]',

	'twitter_api:interstitial:username' => '[Ŧħīş īş ẏǿŭř ŭşḗřƞȧḿḗ. Īŧ ƈȧƞƞǿŧ ƀḗ ƈħȧƞɠḗḓ. Īƒ ẏǿŭ şḗŧ ȧ ƥȧşşẇǿřḓ, ẏǿŭ ƈȧƞ ŭşḗ ŧħḗ ŭşḗřƞȧḿḗ ǿř ẏǿŭř ḗḿȧīŀ ȧḓḓřḗşş ŧǿ ŀǿɠ īƞ. 靐ǈϱϖ ςẛ ſϕΐẛ ı靐ΐǲϐϐΐǅẛ]',

	'twitter_api:interstitial:name' => '[Ŧħīş īş ŧħḗ ƞȧḿḗ ƥḗǿƥŀḗ ẇīŀŀ şḗḗ ẇħḗƞ īƞŧḗřȧƈŧīƞɠ ẇīŧħ ẏǿŭ. 衋ſẛǲ 鶱ǋ]',

	'twitter_api:interstitial:email' => '[Ẏǿŭř ḗḿȧīŀ ȧḓḓřḗşş. Ŭşḗřş ƈȧƞƞǿŧ şḗḗ ŧħīş ƀẏ ḓḗƒȧŭŀŧ. ıſϖ衋 ΐſ]',

	'twitter_api:interstitial:password' => '[Ȧ ƥȧşşẇǿřḓ ŧǿ ŀǿɠīƞ īƒ Ŧẇīŧŧḗř īş ḓǿẇƞ ǿř ẏǿŭ ḓḗƈīḓḗ ŧǿ ŭƞŀīƞķ ẏǿŭř ȧƈƈǿŭƞŧş. ϕ ſϵǲς靐靐ǋΰ ϕ]',
	'twitter_api:interstitial:password2' => '[Ŧħḗ şȧḿḗ ƥȧşşẇǿřḓ, ȧɠȧīƞ. ſΐẛ ǅϑ鶱ǈ ϵΐ]',

	'twitter_api:interstitial:no_thanks' => '[Ƞǿ ŧħȧƞķş ϰſ ΐẛΐϖϕ衋]',

	'twitter_api:interstitial:no_display_name' => '[Ẏǿŭ ḿŭşŧ ħȧṽḗ ȧ ḓīşƥŀȧẏ ƞȧḿḗ. 鶱ǋϑ ſΰϑϕ ϵϑ]',
	'twitter_api:interstitial:invalid_email' => '[Ẏǿŭ ḿŭşŧ ḗƞŧḗř ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ǿř ƞǿŧħīƞɠ. ϖ衋ǲ ϕẛǈ衋 ϰ]',
	'twitter_api:interstitial:existing_email' => '[Ŧħīş ḗḿȧīŀ ȧḓḓřḗşş īş ȧŀřḗȧḓẏ řḗɠīşŧḗřḗḓ ǿƞ ŧħīş şīŧḗ. ǅǲ靐ϵ 靐ϱ]',
	'twitter_api:interstitial:password_mismatch' => '[Ẏǿŭř ƥȧşşẇǿřḓş ḓǿ ƞǿŧ ḿȧŧƈħ. ǲǅΐΐ ϱΐǲϐǈΐ]',
	'twitter_api:interstitial:cannot_save' => '[Ƈȧƞƞǿŧ şȧṽḗ ȧƈƈǿŭƞŧ ḓḗŧȧīŀş. ǲςϑΰϵΰ ςϖẛΰ]',
	'twitter_api:interstitial:saved' => '[Ȧƈƈǿŭƞŧ ḓḗŧȧīŀş şȧṽḗḓ! 鶱靐ϵſ衋靐ϐ ϵ鶱ϱ]',
);
