<?php
return array(
	'twitter_api' => '[Ŧẇīŧŧḗř Şḗřṽīƈḗş ϕ靐ςıΰ鶱ϵ ǈǲϱ]',

	'twitter_api:requires_oauth' => '[Ŧẇīŧŧḗř Şḗřṽīƈḗş řḗɋŭīřḗş ŧħḗ ǾȦŭŧħ Ŀīƀřȧřīḗş ƥŀŭɠīƞ ŧǿ ƀḗ ḗƞȧƀŀḗḓ. ϱϑϐǅ衋ϕǈ 衋ǈ]',

	'twitter_api:consumer_key' => '[Ƈǿƞşŭḿḗř Ķḗẏ ǋϐΐϑ靐鶱衋ΰ ϵ]',
	'twitter_api:consumer_secret' => '[Ƈǿƞşŭḿḗř Şḗƈřḗŧ 衋鶱ıϰǋǋΐ鶱 ϑ]',

	'twitter_api:settings:instructions' => '[Ẏǿŭ ḿŭşŧ ǿƀŧȧīƞ ȧ ƈǿƞşŭḿḗř ķḗẏ ȧƞḓ şḗƈřḗŧ ƒřǿḿ <a href="https://dev.twitter.com/apps/new" target="_blank">Ŧẇīŧŧḗř</a>. Ƒīŀŀ ǿŭŧ ŧħḗ ƞḗẇ ȧƥƥ ȧƥƥŀīƈȧŧīǿƞ. Şḗŀḗƈŧ "Ɓřǿẇşḗř" ȧş ŧħḗ ȧƥƥŀīƈȧŧīǿƞ ŧẏƥḗ ȧƞḓ "Řḗȧḓ & Ẇřīŧḗ" ƒǿř ŧħḗ ȧƈƈḗşş ŧẏƥḗ. Ŧħḗ ƈȧŀŀƀȧƈķ ŭřŀ īş %sŧẇīŧŧḗř_ȧƥī/ȧŭŧħǿřīzḗ ϐǈſ ϰ衋ϐǲ ϕ鶱ϱẛϐǋ ΐ 靐ϵ衋ſẛϱϵΰ ϱϱϕ ıςς ẛſςϵςΐ ıϖẛǋ ſ衋 ϱΐ]',

	'twitter_api:usersettings:description' => "[Ŀīƞķ ẏǿŭř %s ȧƈƈǿŭƞŧ ẇīŧħ Ŧẇīŧŧḗř. ϵıſϖ ΰϕϕ鶱]",
	'twitter_api:usersettings:request' => "[Ẏǿŭ ḿŭşŧ ƒīřşŧ <a href=\"%s\">ȧŭŧħǿřīzḗ</a> %s ŧǿ ȧƈƈḗşş ẏǿŭř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ. ϐſ靐 ϖϖϐϰ ǅǲǋ]",
	'twitter_api:usersettings:cannot_revoke' => "[Ẏǿŭ ƈȧƞƞǿŧ ŭƞŀīƞķ ẏǿŭ ȧƈƈǿŭƞŧ ẇīŧħ Ŧẇīŧŧḗř ƀḗƈȧŭşḗ ẏǿŭ ħȧṽḗƞ'ŧ ƥřǿṽīḓḗḓ ȧƞ ḗḿȧīŀ ȧḓḓřḗşş ǿř ƥȧşşẇǿřḓ. <a href=\"%s\">Ƥřǿṽīḓḗ ŧħḗḿ ƞǿẇ</a>. ǋΐϵ ςẛǅǲẛϖ ϐǅϖǈϵǅ ϐıς 衋ΰ]",
	'twitter_api:authorize:error' => '[Ŭƞȧƀŀḗ ŧǿ ȧŭŧħǿřīzḗ Ŧẇīŧŧḗř. ΐẛςϕǋǲ ϵϱ ϖ]',
	'twitter_api:authorize:success' => '[Ŧẇīŧŧḗř ȧƈƈḗşş ħȧş ƀḗḗƞ ȧŭŧħǿřīzḗḓ. ǈſǲǲ鶱ϱϱ ϵ衋靐]',

	'twitter_api:usersettings:authorized' => "[Ẏǿŭ ħȧṽḗ ȧŭŧħǿřīzḗḓ %s ŧǿ ȧƈƈḗşş ẏǿŭř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ: @%s. ſẛǈ 衋ǋϰ衋]",
	'twitter_api:usersettings:revoke' => '[Ƈŀīƈķ <a href="%s">ħḗřḗ</a> ŧǿ řḗṽǿķḗ ȧƈƈḗşş. 靐ǋϰǈẛ 鶱ı ϖ]',
	'twitter_api:usersettings:site_not_configured' => '[Ȧƞ ȧḓḿīƞīşŧřȧŧǿř ḿŭşŧ ƒīřşŧ ƈǿƞƒīɠŭřḗ Ŧẇīŧŧḗř ƀḗƒǿřḗ īŧ ƈȧƞ ƀḗ ŭşḗḓ. ẛ靐 ϑϑϐǲı鶱ϑ]',

	'twitter_api:revoke:success' => '[Ŧẇīŧŧḗř ȧƈƈḗşş ħȧş ƀḗḗƞ řḗṽǿķḗḓ. ǈǅ靐ǲςϖς ǈǋΰ]',

	'twitter_api:post_to_twitter' => "[Şḗƞḓ ŭşḗřş' ẇīřḗ ƥǿşŧş ŧǿ Ŧẇīŧŧḗř? 衋ı衋ϐ 衋靐ΐǈϖ]",

	'twitter_api:login' => '[Ȧŀŀǿẇ ŭşḗřş ŧǿ şīɠƞ īƞ ẇīŧħ Ŧẇīŧŧḗř? ẛ靐ΰǅ鶱 ϵǋıϰ]',
	'twitter_api:new_users' => '[Ȧŀŀǿẇ ƞḗẇ ŭşḗřş ŧǿ şīɠƞ ŭƥ ŭşīƞɠ ŧħḗīř Ŧẇīŧŧḗř ȧƈƈǿŭƞŧ ḗṽḗƞ īƒ ŭşḗř řḗɠīşŧřȧŧīǿƞ īş ḓīşȧƀŀḗḓ? ϵǋ衋ẛϵ ǋΐı ΐſǅϐϑ]',
	'twitter_api:login:success' => '[Ẏǿŭ ħȧṽḗ ƀḗḗƞ ŀǿɠɠḗḓ īƞ. ǋ鶱ı ǋıϰΐ ǈ]',
	'twitter_api:login:error' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿɠīƞ ẇīŧħ Ŧẇīŧŧḗř. ϵΰϱẛǲϑ 衋ϰ 衋]',
	'twitter_api:login:email' => "[Ẏǿŭ ḿŭşŧ ḗƞŧḗř ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ƒǿř ẏǿŭř ƞḗẇ %s ȧƈƈǿŭƞŧ. ϐǅς 靐ǋẛϵ]",

	'twitter_api:invalid_page' => '[Īƞṽȧŀīḓ ƥȧɠḗ ςςΰǅϖΰς ΰϱ]',

	'twitter_api:deprecated_callback_url' => '[Ŧħḗ ƈȧŀŀƀȧƈķ ŬŘĿ ħȧş ƈħȧƞɠḗḓ ƒǿř Ŧẇīŧŧḗř ȦƤĪ ŧǿ %s.  Ƥŀḗȧşḗ ȧşķ ẏǿŭř ȧḓḿīƞīşŧřȧŧǿř ŧǿ ƈħȧƞɠḗ īŧ. ϰẛ靐 ϕϰ衋ſςıǅǅ ϐΐǋ]',

	'twitter_api:interstitial:settings' => '[Ƈǿƞƒīɠŭřḗ ẏǿŭř şḗŧŧīƞɠş ϑǈϑϖϑϑ鶱ǋϖ ϵ]',
	'twitter_api:interstitial:description' => '[Ẏǿŭ\'řḗ ȧŀḿǿşŧ řḗȧḓẏ ŧǿ ŭşḗ %s! Ẇḗ ƞḗḗḓ ȧ ƒḗẇ ḿǿřḗ ḓḗŧȧīŀş ƀḗƒǿřḗ ẏǿŭ ƈȧƞ ƈǿƞŧīƞŭḗ. Ŧħḗşḗ ȧřḗ ǿƥŧīǿƞȧŀ, ƀŭŧ ẇīŀŀ ȧŀŀǿẇ ẏǿŭ ŀǿɠīƞ īƒ Ŧẇīŧŧḗř ɠǿḗş ḓǿẇƞ ǿř ẏǿŭ ḓḗƈīḓḗ ŧǿ ŭƞŀīƞķ ẏǿŭř ȧƈƈǿŭƞŧş. ıǈΐϑǋϖ ǈǈǋΰϕǋ ẛϖΐǅǋ 衋ǲ ϐǲſ ϵſǲ 衋ẛ]',

	'twitter_api:interstitial:username' => '[Ŧħīş īş ẏǿŭř ŭşḗřƞȧḿḗ. Īŧ ƈȧƞƞǿŧ ƀḗ ƈħȧƞɠḗḓ. Īƒ ẏǿŭ şḗŧ ȧ ƥȧşşẇǿřḓ, ẏǿŭ ƈȧƞ ŭşḗ ŧħḗ ŭşḗřƞȧḿḗ ǿř ẏǿŭř ḗḿȧīŀ ȧḓḓřḗşş ŧǿ ŀǿɠ īƞ. ǲΐϵǲ ϵ鶱 ϕϵΐϑ ϑſΐſ靐ıϰǲſ]',

	'twitter_api:interstitial:name' => '[Ŧħīş īş ŧħḗ ƞȧḿḗ ƥḗǿƥŀḗ ẇīŀŀ şḗḗ ẇħḗƞ īƞŧḗřȧƈŧīƞɠ ẇīŧħ ẏǿŭ. ϰϖϵϰ 鶱靐]',

	'twitter_api:interstitial:email' => '[Ẏǿŭř ḗḿȧīŀ ȧḓḓřḗşş. Ŭşḗřş ƈȧƞƞǿŧ şḗḗ ŧħīş ƀẏ ḓḗƒȧŭŀŧ. ςẛǈǋ ϑẛ]',

	'twitter_api:interstitial:password' => '[Ȧ ƥȧşşẇǿřḓ ŧǿ ŀǿɠīƞ īƒ Ŧẇīŧŧḗř īş ḓǿẇƞ ǿř ẏǿŭ ḓḗƈīḓḗ ŧǿ ŭƞŀīƞķ ẏǿŭř ȧƈƈǿŭƞŧş. 衋 ııςſςǲıϕ ϵ]',
	'twitter_api:interstitial:password2' => '[Ŧħḗ şȧḿḗ ƥȧşşẇǿřḓ, ȧɠȧīƞ. ſ衋ı 鶱ǅΰ衋 ςϱ]',

	'twitter_api:interstitial:no_thanks' => '[Ƞǿ ŧħȧƞķş ΰı 鶱ſϱϑǲϑ]',

	'twitter_api:interstitial:no_display_name' => '[Ẏǿŭ ḿŭşŧ ħȧṽḗ ȧ ḓīşƥŀȧẏ ƞȧḿḗ. ǲẛϕ ıǈǲ鶱 ϑϕ]',
	'twitter_api:interstitial:invalid_email' => '[Ẏǿŭ ḿŭşŧ ḗƞŧḗř ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ǿř ƞǿŧħīƞɠ. ϰẛΰ ςΐ靐ǈ ẛ]',
	'twitter_api:interstitial:existing_email' => '[Ŧħīş ḗḿȧīŀ ȧḓḓřḗşş īş ȧŀřḗȧḓẏ řḗɠīşŧḗřḗḓ ǿƞ ŧħīş şīŧḗ. ǲϱıϰ ϐ靐]',
	'twitter_api:interstitial:password_mismatch' => '[Ẏǿŭř ƥȧşşẇǿřḓş ḓǿ ƞǿŧ ḿȧŧƈħ. ϰǈςẛ ϰϐΐẛϱΰ]',
	'twitter_api:interstitial:cannot_save' => '[Ƈȧƞƞǿŧ şȧṽḗ ȧƈƈǿŭƞŧ ḓḗŧȧīŀş. ϐϐ鶱ϵΐϱ ϕſϕ靐]',
	'twitter_api:interstitial:saved' => '[Ȧƈƈǿŭƞŧ ḓḗŧȧīŀş şȧṽḗḓ! ǈϵϐǅıǈϰ ǲϕϱ]',
);
