Repository: Elgg/Elgg
Catalog: languages/*/LC_MESSAGES/*.po
Languages: pt_br

source: Recent activity
pt_br: Atividade recente

source: Currently viewing recent activity since
pt_br: Atividade desde

source: You may view recent activity during the following time-frames:
pt_br: Você pode ver a atividade recente durante os seguintes intervalos de tempo:

source: The last 24 hours
pt_br: Últimas 24 horas

source: The last 48 hours
pt_br: Últimas 48 horas

source: The last week
pt_br: Última semana

source: The last month
pt_br: Último mês

source: Your recent messages
pt_br: Suas mensagens recentes

source: Activity on weblog posts you have marked as interesting
pt_br: Atividade nas mensagens de blog que você marcou como interessantes

source: Read more
pt_br: Leia mais

source: your blog
pt_br: seu blog

source: <b>You</b> commented on weblog post '%s' in %s:
pt_br: <b>Você</b> comentou a mensagem '%s' de %s:

source: <b>%s</b> commented on weblog post '%s' in %s:
pt_br: <b>%s</b> comentou a mensagem '%s' de %s:

source: No activity during this time period.
pt_br: Sem atividade durante esse período.

source: Manage users
pt_br: Administrar usuários

source: Spam blocking
pt_br: Bloqueio de spam

source: Content flags
pt_br: Indicadores de conteúdo

source: Administration
pt_br: Administração

source: Add multiple users
pt_br: Adicione vários usuários

source: Error! Your username must contain letters and numbers only, cannot be blank, and must be between 3 and 12 characters in length.
pt_br: Erro! Seu nome de usuário deve ter entre 3 e 12 caracteres (somente letras e números, sem espaço em branco).

source: The username %s is already taken by another user. You will need to pick a different one.
pt_br: O nome do usuário %s já está sendo usado por um outro usuário. Você terá que escolher um novo nome.

source: User addition %d failed: Unknown reason, please contact you system administrator.
pt_br: Adição do usuário %d falhou: razão desconhecida - por favor entre em contato com o administrador do sistema.

source: Communities
pt_br: Comunidades

source: Members
pt_br: Membros

source: Owned Communities
pt_br: Suas comunidades

source: Membership requests
pt_br: Requisições de membro

source: About %s
pt_br: Sobre o %s

source: If you have a friend or colleague you would like to join the system, perhaps because you would like to share protected resources or reflections with them, you can enter their details below. They will then receive a special invitation email containing a code that allows them to create a new account; once they do so, a mutual friend connection will be created between their account and yours.
pt_br: Se quiser convidar um amigo ou colega para participar do sistema, talvez porque gostaria de compartilhar com ele recursos ou arquivos de acesso controlado, preencha as informações dele abaixo. Ele vai receber um e-mail de convite com um código, permitindo a criação de uma conta nova; no momento em que ele se inscrever, passará a fazer parte dos seus contatos.

source: Welcome
pt_br: Bem-vindo

source: This is %s, a learning landscape. Why not check out <a href="%s">what people are saying</a> right now.
pt_br: Isto é o %s. Do <a href="%s">que estamos falando</a> agora?

source: <a href="%s">Find others</a> with similar interests and goals.
pt_br: Encontre <a href="%s">outras pessoas</a> com interesses e objetivos similares.

source: Here are some example users:
pt_br: Veja alguns usuários:

source: Here is an example user:
pt_br: Veja um usuário:

source: If you like what you see, why not <a href="%s">register for an account</a>?
pt_br: Se ficou interessado, por que não <a href="%s">se cadastra</a>?

source: Latest news
pt_br: Últimas notícias

source: Why not <a href="%s">create your profile</a>?
pt_br: Por que não <a href="%s">criar o seu perfil</a>?

source: Tell people about yourself and connect to others with similar interests and goals.
pt_br: Divulgue os seus interesses e objetivos.

source: Here are some examples of complete profiles:
pt_br: Veja alguns exemplos de perfis completos:

source: Here is an example of a complete profile:
pt_br: Veja um exemplo de perfil completo:

source: Or you could <a href="%s">start your blog</a>?
pt_br: Ou você poderia <a href="%s">começar o seu blog</a>?

source: Comment on what you're learning, collect interesting links and decide who gets to see what you're writing. Here's what <a href="%s">everyone else is talking about</a> right now.
pt_br: Comente, colecione recursos e links e decida quem pode ver o que você está escrevendo. Veja do que <a href="%s">todo mundo está falando</a> agora

source: %s Privacy Policy
pt_br: Política de Privacidade do %s

source: Running Your Own %s
pt_br: Rodando Seu Próprio %s

source: %s Terms &amp; Conditions
pt_br: Termos &amp; Condições de Uso do %s

source: Edit File
pt_br: Editar Arquivo

source: Edit Folder
pt_br: Editar Pasta

source: Files
pt_br: Arquivos

source: Files tagged with %s
pt_br: Arquivos com os seguintes tags %s

source: Files for %s, hosted on %s.
pt_br: Arquivos para %s, hospedado no %s.

source: Friends who have linked to you
pt_br: Contatos conectados a você

source: Friends I have linked to
pt_br: Meus Contatos

source: Friendship requests
pt_br: Requisições de contato

source: Access Controls
pt_br: Controles de Acesso

source: 'Your blog' help
pt_br: Ajuda com 'Seu blog'

source: Calendar help
pt_br: Ajuda com Calendário

source: 'Your calendar' help
pt_br: Ajuda com 'Seu Calendário'

source: Help for %s
pt_br: Ajuda para %s

source: 'Your Files' help
pt_br: Ajuda com 'Seus Arquivos'

source: 'Your Network' help
pt_br: Ajuda com 'Sua Rede'

source: 'Your Profile' help
pt_br: Ajuda com 'Seu Perfil'

source: Main Index
pt_br: Início

source: Manage user icons
pt_br: Administrar ícones

source: Generate a New Password
pt_br: Gerar uma Nova Senha

source: Invite a Friend
pt_br: Convidar um Amigo

source: Join %s
pt_br: Participe de %s

source: Get new %s password
pt_br: Obter nova senha para %s

source: Success
pt_br: Sucesso

source: Error
pt_br: Erro!

source: Publishing RSS
pt_br: Publicando RSS

source: Publishing RSS for user %d
pt_br: Publicando RSS para o usuário %d

source: Adjusting file repository information
pt_br: Ajustando informação do repositório de arquivos

source: Updating file %d: %s
pt_br: Atualizando arquivo %d: %s

source: Need to upgrade database
pt_br: Precisa atualizar o banco de dados

source: Register
pt_br: Cadastrar

source: Log On
pt_br: Entrar

source: Username
pt_br: Nome de Usuário

source: Password
pt_br: Senha

source: Log on
pt_br: Entrar

source: Go
pt_br: Ok

source: Remember Login
pt_br: Lembrar neste computador

source: Forgotten password
pt_br: Senha esquecida

source: Add User
pt_br: Adicionar Usuário

source: Send Message
pt_br: Enviar Mensagem

source: Add Buddy
pt_br: Adicionar contato

source: Administrator
pt_br: Administrador

source: Do not reply
pt_br: Não responda

source: Close this window
pt_br: Fechar esta janela

source: Choose
pt_br: Confirmar

source: Elgg auto-format
pt_br: Formato Elgg

source: HTML format
pt_br: Formato HTML

source: Plain text format
pt_br: Formato texto

source: Markdown format
pt_br: Formato Markdown

source: Continue
pt_br: Continuar

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: You have been banned from the system!
pt_br: Você foi expulso do sistema!

source: Sorry, but your IP number seems to have changed from when you first logged in. This security feature prevents crackers stealing your identity while logged in to this site. Normal users should not be seeing this message - please ask the site administrator for help.
pt_br: Desculpe, mas seu número de IP parece ter mudado em relação à primeira vezque você acessou o sistema. Esta medida de segurança previne que 'crackers' roubem sua identidade enquanto você está online no site. Usuários comuns não deveriam estar vendo esta mensagem - por favor, contate o administrador do site para ajuda.

source: The system will remember you and automatically log you in next time.
pt_br: Lembraremos dos seus dados e da próxima vez você entrará automaticamente no sistema.

source: Logged in users
pt_br: Usuários online

source: Private
pt_br: Privado

source: Restricted
pt_br: Restrito

source: Click to view link
pt_br: Clique aqui para visualizar

source: This is how the story goes.
pt_br: Isto é como as coisas funcionam.

source: Stylesheet
pt_br: Folha de estilo

source: The Cascading Style Sheet for the template.
pt_br: Folha de estilo CSS para a moldura.

source: Page Shell
pt_br: Esqueleto de Página

source: The main page shell, including headers and footers.
pt_br: O esqueleto de página principal, incluindo cabeçalhos e rodapés.

source: Page metatags (mandatory) - must be in the 'head' portion of the page
pt_br: Metatags da página (obrigatório) - devem ficar na seção 'head' da página

source: Page title
pt_br: Título da Página

source: Status menu
pt_br: Menu de Status

source: Main body
pt_br: Corpo principal

source: Sidebar
pt_br: Barra lateral

source: Content holder
pt_br: Conteúdo do proprietário

source: Contains the main content for a page (as opposed to the sidebar or the title).
pt_br: Contém o conteúdo principal para uma página (ao contrário da barra lateral ou do título).

source: The title
pt_br: Título

source: The page submenu
pt_br: Sub-menu da página

source: The body of the page
pt_br: Corpo da página

source: Owner box
pt_br: Caixa do usuário

source: A box containing a description of the owner of the current profile.
pt_br: Uma caixa com uma descrição do dono do perfil.

source: The user's name
pt_br: Nome do usuário

source: The URL of the user's profile page, including terminating slash
pt_br: URL da página do perfil do usuário, incluindo uma barra (/) no final

source: The user's icon, if it exists
pt_br: Ícones do usuário, se existirem

source: A short blurb about the user
pt_br: Uma breve descrição sobre o usuário

source: Links to friend / unfriend a user
pt_br: Links para adicionar / remover contato

source: Links to any lms hosts the user is attached to
pt_br: Links para servidores de Sistema de Gestão de Aprendizagem (LMS) aos quais o usuário está conectado

source: Resources
pt_br: Feeds

source: Information Box
pt_br: Caixa de Informação

source: A box containing a caption and some text, used extensively throughout the site. For example, the 'friends' box and most page bodies are info boxes. Of course, you can alter this template however you wish - it doesn't need to be an actual box.
pt_br: Uma caixa contendo uma legenda e algum texto, muito usada por todo o site. Por exemplo, a caixa 'contatos' e a maioria dos corpos de página são caixas de informação. É claro que você pode alterar esta moldura da maneira que quiser - não é necessário que seja uma caixa real.

source: The contents of the box
pt_br: Conteúdo da caixa

source: System message shell
pt_br: Esqueleto da mensagem do sistema

source: A list of system messages will be placed within the message shell.
pt_br: Uma lista de mensagens do sistema será colocada no esqueleto da mensagem.

source: The messages
pt_br: Mensagens

source: Individual system messages
pt_br: Mensagens individuais do sistema

source: Each individual system message.
pt_br: Cada mensagem individual do sistema

source: The system message
pt_br: Mensagem do sistema

source: Main menu shell
pt_br: Esqueleto do menu principal

source: A list of main menu items will be placed within the menubar shell.
pt_br: Uma lista dos principais itens do menu será colocada dentro do esqueleto da barra de menu.

source: The menu items
pt_br: Itens do menu

source: Individual main menu item
pt_br: Item individual do menu principal

source: This is the template for each individual main menu item. A series of these is placed within the menubar shell template.
pt_br: Esta é a moldura para cada item do menu principal. Uma série deles é inserida no esqueleto padrão da barra de menu.

source: The URL of the menu item
pt_br: URL do item do menu

source: The menu item's name
pt_br: Nome do item do menu

source: Selected individual main menu item
pt_br: Item individual do menu princal selecionado

source: This is the template for an individual main menu item if it is selected.
pt_br: Esta é uma moldura para um item individual do menu principal se ele estiver selecionado.

source: Sub-menubar shell
pt_br: Esqueleto da barra do sub-menu

source: A list of sub-menu items will be placed within the menubar shell.
pt_br: Uma lista de itens do sub-menu será colocada dentro do esqueleto da barra de menu.

source: Individual sub-menu item
pt_br: Item individual do sub-menu

source: This is the template for each individual sub-menu item. A series of these is placed within the sub-menubar shell template.
pt_br: Esta é uma moldura para cada item do sub-menu. Uma série deles é inserida no esqueleto padrão da barra do sub-menu.

source: Status menubar shell
pt_br: Esqueleto da barra de menu de estados

source: A list of statusbar menu items will be placed within the status menubar shell.
pt_br: Uma lista de itens do menu da barra de estados será inserida no esqueleto da barra de menus de estados.

source: Individual statusbar menu item
pt_br: Item do menu da barra de estados

source: This is the template for each individual statusbar menu item. A series of these is placed within the status menubar shell template.
pt_br: Esta é a moldura para cada item do menu da barra de estados. Uma série deles é inserida no esqueleto da moldura da barra de menu de estados.

source: Data input box (two columns)
pt_br: Caixa de entrada de dados (duas colunas)

source: This is mostly used whenever some input is taken from the user. For example, each of the fields in the profile edit screen is a data input box.
pt_br: Isto é mais usado sempre que alguma entrada provém do usuário. Por exemplo, cada um dos campos na tela de edição do perfil é um dado da caixa de entrada de dados.

source: The name for the data we're inputting
pt_br: Nome dos dados que estamos adicionando

source: The first item of data
pt_br: Primeiro item dos dados

source: The second item of data
pt_br: Segundo item dos dados

source: Data input box (one column)
pt_br: Caixa de entrada de dados (uma coluna)

source: A single-column version of the data box.
pt_br: Versão de uma única coluna da caixa de dados.

source: The name of the data we're inputting
pt_br: Nome dos dados que estamos adicionando

source: The data itself
pt_br: Dados

source: Data input box (vertical)
pt_br: Caixa de entrada de dados (vertical)

source: A slightly different version of the data box, used on this edit page amongst other places.
pt_br: Uma versão ligeiramente diferente da caixa de dados, usada nesta página de edição, entre outros locais.

source: Name of the data we\'re inputting
pt_br: Nome dos dados que estamos adicionando

source: Change theme
pt_br: Mudar Tema

source: Account settings
pt_br: Configurações da conta

source: Log off
pt_br: Sair

source: Edit user details
pt_br: Editar detalhes do usuário

source: Your site picture
pt_br: Sua foto

source: Main
pt_br: Início

source: Add users
pt_br: Adicionar usuários

source: Manage flagged content
pt_br: Administrar conteúdo marcado

source: Spam control
pt_br: Controle de spam

source: Your current template has been changed.
pt_br: Sua moldura atual foi mudada.

source: Your template has been updated.
pt_br: Sua moldura foi atualizada.

source: Your template was deleted.
pt_br: Sua moldura foi removida.

source: Create theme
pt_br: Criar tema

source: Here you can create your own themes based on one of the existing public themes. Just select which public theme you would like to alter and then create your own. You will now have edit privilages.
pt_br: Aqui você pode criar seus próprios temas baseado em um dos temas públicos existentes. Simplesmente selecione um tema público que você gostaria de alterar e então crie seu próprio tema. Agora você terá privilégios de edição.

source: Theme name
pt_br: Nome do tema

source: Default Theme
pt_br: Tema padrão

source: Based on
pt_br: Baseado no

source: Create Theme
pt_br: Criar Tema

source: Theme Name
pt_br: Nome do Tema

source: Glossary
pt_br: Glossário

source: Save
pt_br: Salvar

source: You may not edit this theme. To create a new, editable theme based on the default, go to <a href="index.php">the main themes page</a>.
pt_br: Você não pode alterar este tema. Para criar um novo tema editável basado no tema padrão, entre na <a href="index.php">página principal de temas</a>

source: Heading one
pt_br: Heading 1

source: Heading two
pt_br: Heading 2

source: A bullet list
pt_br: Uma lista de 'bullets'

source: Heading three
pt_br: Heading 3

source: A numbered list
pt_br: Uma lista numerada

source: Some text input
pt_br: Algum texto de entrada

source: Some longer text input
pt_br: Algum texto mais longo de entrada

source: Further text input
pt_br: Texto de entrada adicional

source: Select / Create / Edit Themes
pt_br: Selecionar / Criar / Editar Temas

source: Public Themes
pt_br: Temas Públicos

source: The following are public themes that you can use to change the way your %s looks - these do not change the content only the appearance. Check the preview and then select the one you want. If you wish you can adapt one of these using the 'create theme' option below.
pt_br: Seguem temas públicos que você pode usar para mudar a aparência do seu %s site. Somente vai mudar o visual - não o conteúdo - das páginas. Você pode escolher um tema pronto, ou adaptar uma deles usando a opção 'criar tema' abaixo.

source: preview
pt_br: visualizar

source: Personal themes
pt_br: Temas Pessoais

source: These are themes that you have created. You can edit and delete these. These theme(s) only control actual look and feel - you cannot change any content here. To change any of your content you need to use the other menu options such as: edit profile, update weblog etc.
pt_br: Estes são os temas que você criou. Você pode editá-los e removê-los. Estes temas somente determinam a aparência - não afetam nenhum conteúdo. Para mudar qualquer conteúdo você precisa usar outras opções do menu como 'editar perfil', criar uma mensagem do seu blog etc.

source: Edit
pt_br: Editar

source: Are you sure you want to permanently remove this template?
pt_br: Tem certeza de que deseja remover esta moldura permanentemente?

source: Delete
pt_br: Remover

source: Select new theme
pt_br: Escolher um tema novo

source: Guest
pt_br: Visitante

source: Log in
pt_br: Entre

source: Your file upload has failed because there was a problem with one of the files, %s.<br /> Here is a log of the problems:<br />%s<br />Not recovering.
pt_br: O envio deste arquivo ao servidor não foi possível em razão de um problema com o seguinte arquivo, %s.<br /> Este é o relatório do problema:<br />%s<br />

source: File was renamed from %s to %s because of invalid characters.
pt_br: O arquivo foi renomeado de %s para %s por causa de caracteres inválidos.

source: Sorry, but that file is too big (limit is %s)
pt_br: Desculpe, este arquivo é grande demais (o limite é %s)

source: File uploaded successfully
pt_br: Arquivo enviado com sucesso

source: No file was found - are you sure you selected one to upload?
pt_br: Não achamos nenhum arquivo - tem certeza de que selecionou um?

source: The old file(s) in your upload area have been deleted
pt_br: O arquivo antigo na sua área de envio foi removido

source: File was renamed from %s to %s because there was a filename conflict.
pt_br: O arquivo foi renomeado de %s para %s por causa de um conflito de nomes.

source: An unknown problem occurred while uploading the file '%s' (perhaps it was too large?)
pt_br: Algum problema desconhecido ocorreu enquanto tentava enviar o arquivo '%s' (talvez ele seja muito grande?).

source: Uploaded file exceeded the maximum size limit set by the server
pt_br: O arquivo enviado excedeu o limite máximo permitido pelo servidor

source: Uploaded file exceeded the maximum size limit set by the form
pt_br: O arquivo enviado excedeu o limite máximo permitido pelo formulário

source: File was only partially uploaded
pt_br: O arquivo foi enviado apenas parcialmente

source: Upload log for file %u
pt_br: Relatório de envio do arquivo %u

source: Title:
pt_br: Título:

source: The file has been moved to a quarantine directory.
pt_br: O arquivo foi transferido para um diretório de quarentena.

source: The file has been moved to your specified quarantine directory, the new location is %s
pt_br: O arquivo foi transferio para o diretório de quarentena especificado. O novo local é %s

source: The file has been deleted
pt_br: O arquivo foi removido

source: Could not move the file into your specified quarantine directory, %s. You need to fix this as files are being deleted if they're found to be infected.
pt_br: Não conseguimos transferir o arquivo para o diretório de quarentena que você especificou, %s. É preciso consertar isso, pois estamos removendo arquivos se achamos que estão infectados.

source: The file could not be deleted
pt_br: Não foi possível remover o arquivo

source: This file that has been uploaded was found to contain a virus and has been moved or delted and the user notified.
pt_br: Neste arquivo achamos um vírus. O arquivo foi removido ou deletado e o usuário foi notificado

source: Elgg is configured to run clam on file upload, but the path supplied to Clam AV, %s, is invalid.
pt_br: O sistema está configurado para executar Clam ao fazer o upload de arquivos, mas o caminho para Clam AV, %s, é inválido.

source: In addition, Elgg is configured so that if clam fails to run, files are treated like viruses. This essentially means that no student can upload a file successfully until you fix this.
pt_br: E mais: o sistema é configurado de modo que, se Clam não roda, todos os arquivos são tratados como vírus. Isto significa que ninguém pode fazer o upload de um arquivo até este problema ser solucionado.

source: Your administrator has enabled virus checking for file uploads but has misconfigured something.<br />Your file upload was NOT successful. Your administrator has been emailed to notify them so they can fix it.<br />Maybe try uploading this file later.
pt_br: O seu arquivo <strong>não</strong> foi enviado. O administrador do sistema habilitou a filtração de vírus ao fazer upload de arquivos, mas algo está errado.<br />. Estamos tentando resolver o problema. Tente enviar este arquivo mais tarde.

source: Attention administrator! Clam AV has found a virus in a file uploaded by %s. Here is the output of clamscan:
pt_br: Atenção administrador! Clam AV encontrou um vírus em um arquivo enviado por %s. Eis a saída de Clamscan:

source: The file you have uploaded, %s, has been scanned by a virus checker and found to be infected! Your file upload was NOT successful.
pt_br: Achamos um vírus no seu arquivo, %s. Este arquivo <strong>não</strong> foi salvo.

source: Clam AV has failed to run. The return error message was %s. Here is the output from Clam:
pt_br: Clam AV não funcionou. A mensagem de erro foi %s. Eis o output de Clam:

source: %s :: Clam AV notification
pt_br: %s :: aviso do Clam AV

source: There was an unknown error with clam.
pt_br: Erro desconhecido com Clam.

source: You have been logged on.
pt_br: Você entrou no sistema.

source: Unrecognised username or password. The system could not log you on, or you may not have activated your account.
pt_br: Não reconhecemos esta conta ou senha. O sistema não te deixou entrar, ou a sua conta ainda não foi ativada.

source: Either the username or password were not specified. The system could not log you on.
pt_br: Você não especificou o nome de usuário ou a senha. O sistema não te deixou entrar.

source: You cannot reply to this message by email.
pt_br: Você não pode responder a essa mensagem por email.
