Repository: Elgg/Elgg
Catalog: languages/*/LC_MESSAGES/*.po
Languages: pt_br

source: Failed to send email. An unknown error occurred.
pt_br: Falhou ao enviar o email. Ocorreu um erro desconhecido.

source: Failed to send message. An unknown error occurred.
pt_br: Falhou em enviar a mensagem. Ocorreu um erro desconhecido.

source: System
pt_br: Sistema

source: Error! Invalid password. Your passwords must match and be between 6 and 16 characters in length.
pt_br: Erro! Senha inválida: sua senha deve coincidir com a registrada e ter entre 6 e 16 caracteres.

source: Error! You must enter your fullname
pt_br: Erro! Forneça o seu nome completo

source: Error! Your username and password does not match our record.
pt_br: Erro! Esta combinação de nome de usuário e senha não coincide com a registrada.

source: Fatal Error! Unknown action requested.
pt_br: Falha Fatal! Requisição de uma ação desconhecida.

source: Your account creation was successful!
pt_br: A sua conta foi criada com sucesso!

source: Join up
pt_br: Criar conta

source: Login
pt_br: Entrar

source: Activity for %s, hosted on %s.
pt_br: Atividade de %s, no %s.

source: Activity
pt_br: Atividade

source: %s posted on weblog post:
pt_br: %s respondeu à mensagem do blog:

source: %s posted on weblog post '%s'
pt_br: %s criou artigo no blog '%s'

source: No activity
pt_br: Sem atividade

source: You are already logged on.
pt_br: Você já entrou no sistema.

source: The password for this account is extremely insecure and represents a major security risk. You should change it immediately.
pt_br: A senha desta conta é extremamente insegura e representa um grande risco de segurança. Você deve mudá-la imediatamente.

source: Please log in
pt_br: Entre no sistema, por favor

source: Add dashboard items
pt_br: Adicionar itens ao painel

source: Widget added.
pt_br: Caixa adicionada.

source: Select a widget type from the list below:
pt_br: Selecione um tipo de caixa da lista abaixo:

source: Add
pt_br: Adicionar

source: You do not have permission to add widgets to this dashboard.
pt_br: Você não tem permissão para adicionar caixas a este painel.

source: Widget deleted.
pt_br: Caixa removida.

source: Edit widget
pt_br: Editar caixa

source: Widget edited.
pt_br: Caixa editada.

source: You do not have permission to edit this widget.
pt_br: Você não tem permissão para acessar este arquivo.

source: Dashboard
pt_br: Painel

source: This dashboard is currently empty. Why not add some widgets by clicking 'add new item' above?
pt_br: Este painel está vazio. Por que não adicionar algumas caixas clicando em 'Adicionar um novo item'?

source: This dashboard is currently empty.
pt_br: Este painel está vazio.

source: Your Dashboard
pt_br: Seu Painel

source: Add new item
pt_br: Adicionar novo item

source: Text box
pt_br: Caixa de texto

source: Displays the text of your choice.
pt_br: Mostra o texto de sua escolha.

source: Delete widget
pt_br: Remover caixa

source: Move up
pt_br: Mover para cima

source: Move down
pt_br: Mover para baixo

source: Access for this widget:
pt_br: Acesso a esta caixa:

source: Save widget
pt_br: Salvar caixa

source: This text box is undefined. If you are the widget owner, click 'edit widget' to add your own content.
pt_br: Esta caixa de texto não está definida. Se você é o dono dessa caixa, clique em 'editar caixa' para adicionar o conteúdo que deseja.

source: This widget displays the text content of your choice. All you need to do is enter the title and body below:
pt_br: Esta caixa mostra o conteúdo do texto que você quiser. Tudo o que você precisa fazer é escrever abaixo o título e o corpo:

source: Widget moved.
pt_br: Caixa movida.

source: Your Blog
pt_br: Seu Blog

source: Post a new entry
pt_br: Nova mensagem

source: View blog
pt_br: Ver blog

source: Archive
pt_br: Arquivo

source: Friends' blogs
pt_br: Blogs dos contatos

source: Interesting posts
pt_br: Mensagens interessantes

source: View all posts
pt_br: Todas mensagens

source: Page help
pt_br: Página de ajuda

source: Blog widget
pt_br: Caixa de blog

source: Displays the latest blog posts from a blog of your choice.
pt_br: Mostra as últimas mensagens de um blog de sua escolha.

source: Blog dashboard widget
pt_br: Caixa de blog do painel

source: This widget displays the last couple of blog posts from an individual user. To begin, select the user from your connections below:
pt_br: Esta caixa mostra os última mensagens do blog de um usuário. Para começar, selecione o usuário entre suas conexões abaixo:

source: Then enter the number of blog posts you'd like to display:
pt_br: Entre o número de mensagens do blog que você gostaria de mostrar:

source: Browser
pt_br: Navegador

source: All
pt_br: Tudo

source: Users
pt_br: Usuários

source: Browse
pt_br: Navegar

source: Filter
pt_br: Filtrar

source: Name
pt_br: Nome

source: Description
pt_br: Descrição

source: Connections
pt_br: Conexões

source: Posts
pt_br: Mensagens

source: Type
pt_br: Tipo

source: Edit this profile
pt_br: Editar este perfil

source: Community site picture
pt_br: Foto da comunidade

source: Edit community details
pt_br: Editar detalhes da comunidade

source: View membership requests
pt_br: Ver requisições para participarem

source: Your Files
pt_br: Seus Arquivos

source: Add a file or a folder
pt_br: Adicionar arquivo ou pasta

source: RSS feed for files
pt_br: Feed destes arquivos

source: Your Network
pt_br: Sua Rede

source: Friends
pt_br: Contatos

source: Friend of
pt_br: Contato de

source: Access controls
pt_br: Controles de Acesso

source: Invite a friend
pt_br: Convidar alguém

source: Language
pt_br: Língua

source: default
pt_br: padrão

source: Your Resources
pt_br: Seu Agregador

source: Publish to blog
pt_br: Publique para blog

source: View aggregator
pt_br: Ver agregador

source: Popular Feeds
pt_br: Feeds populares

source: Feed widget
pt_br: Caixa de feed

source: Displays the latest entries from an external feed of your choice.
pt_br: Mostra as últimas entradas de um feed externo de sua escolha.

source: This feed is currently empty.
pt_br: Este feed está vazio.

source: This feed widget is undefined.
pt_br: Esta caixa de feed não está definida.

source: Feeds dashboard widget
pt_br: Caixa de feeds do painel

source: This widget displays the last couple of entries from an external feed you have subscribed to. To begin, select the feed from your subscriptions below:
pt_br: Esta caixa mostra as últimas entradas de um feed externo ao qual você se inscreveu. Para começar, selecione o feed de suas inscrições abaixo:

source: Then enter the number of feed entries you'd like to display:
pt_br: Entre o número de entradas do feed que voê gostaria de mostrar:

source: You can't select a feed for this widget because you don't have any feed subscriptions. Click on <a href="%s">Your</a> Resources to subscribe to a feed.
pt_br: Você não pode selecionar um feed para esta caixa porque você não tem nenhum feed inscrito. Clique em <a href=\"%s\">Seu</a> Agregador para se increver num feed.

source: Your Profile
pt_br: Seu Perfil

source: Change site picture
pt_br: Mudar Foto

source: People
pt_br: Perfil

source: Profile widget
pt_br: Caixa de perfil

source: Displays the contents of a profile field.
pt_br: Mostra o conteúdo de um campo do perfil.

source: This profile box is undefined.
pt_br: Esta caixa do perfil está indefinida.

source: Select a profile field below; the widget will then display the profile content from this field.
pt_br: Selecione um campo do perfil abaixo; esta caixa mostrará o conteúdo deste campo do perfil.

source: Who am I?
pt_br: Quem sou eu?

source: A short introduction for you.
pt_br: Uma introdução breve sobre você.

source: Introduction
pt_br: Introdução

source: A short introduction to this community.
pt_br: Uma introdução breve sobre você para esta comunidade.

source: Brief description
pt_br: Descrição breve

source: For use in your sidebar profile.
pt_br: Para uso no seu perfil na coluna lateral.

source: Street address
pt_br: Rua, Avenida etc.

source: Town
pt_br: Cidade

source: State / Region
pt_br: Estado

source: Postal code
pt_br: CEP

source: Country
pt_br: País

source: Email address
pt_br: Email

source: Work telephone
pt_br: Telefone Comercial

source: Home telephone
pt_br: Telefone Residencial

source: Mobile telephone
pt_br: Celular

source: Official website address
pt_br: Site oficial

source: The URL to your official website, if you have one.
pt_br: O URL do seu site oficial, se tiver.

source: Personal website address
pt_br: Site pessoal

source: The URL to your personal website, if you have one.
pt_br: O URL do seu site pessoal, se tiver.

source: ICQ number
pt_br: ICQ

source: MSN chat
pt_br: MSN

source: AIM screenname
pt_br: AIM

source: Skype username
pt_br: Skype

source: Jabber username
pt_br: Jabber ou GTalk

source: Interests
pt_br: Interesses

source: Separated with commas.
pt_br: Separados por vírgulas.

source: Likes
pt_br: Gosto de

source: Dislikes
pt_br: Não gosto de

source: Occupation
pt_br: Ocupação

source: Industry
pt_br: Ramo

source: Company / Institution
pt_br: Empresa / Instituição

source: Job Title
pt_br: Função

source: Job Description
pt_br: Descrição da função

source: I would like to ...
pt_br: Eu gostaria de...

source: Career Goals
pt_br: Objetivos Profissionais

source: Freeform: let colleagues and potential employers know what you'd like to get out of your career.
pt_br: Descreva aqui o que você gostaria de conseguir na sua carreira nos próximos anos.

source: Level of Education
pt_br: Nível de educação

source: High School
pt_br: Colégio

source: University / College
pt_br: Universidade / Faculdade

source: Degree
pt_br: Diploma

source: Main Skills
pt_br: Habilidades principais

source: Edit profile
pt_br: Editar perfil

source: Profile updated.
pt_br: O seu perfil foi atualizado.

source: Click here to edit this profile.
pt_br: Clique aqui para editar este perfil.

source: This screen allows you to edit your profile. Blank fields will not show up on your profile screen in any view; you can change the access level for each piece of information in order to prevent it from falling into the wrong hands. For example, we strongly recommend you keep your address to yourself or a few trusted parties.
pt_br: Aqui você pode editar o seu perfil. Campos em branco não serão mostrados; você pode controlar quem tem acesso a cada campo do seu perfil, prevenindo que seus dados caiam em mãos erradas. Por exemplo, recomendamos que você mantenha seu endereço somente para você e os seus contatos mais próximos.

source: You can import some profile data by uploading a FOAF file here:
pt_br: Aqui você pode importar dados do seu perfil enviando um arquivo FOAF:

source: Upload a FOAF file:
pt_br: Enviar um arquivo FOAF:

source: Upload
pt_br: Enviar

source: Or you can fill in your profile directly below:
pt_br: Ou você pode preencher o seu perfil diretamente abaixo:

source: Submit details:
pt_br: Editar detalhes do usuário

source: Save your profile
pt_br: Salvar o seu perfil

source: Access Restriction:
pt_br: Restrição de Acesso:

source: Profiles where
pt_br: Perfis onde

source: There was an error uploading the file. Possibly the file was too large, or the upload was interrupted.
pt_br: Ocorreu um erro ao enviar o arquivo. Possivelmente o arquivo era grande demais ou o envio foi interrompido.

source: Data from your FOAF file has been preloaded. You must click Save at the bottom of the page for the changes to take effect.
pt_br: Os dados do seu arquivo FOAF foram importados, mas ainda é preciso clicar em Salvar, no final da página, para as mudanças serem incorporadas.

source: Error: supplied file did not appear to be a FOAF file.
pt_br: Erro: o arquivo não foi reconhecido como arquivo FOAF.

source: Profile Owner
pt_br: Dono do Perfil

source: You
pt_br: Você

source: Activity tagged with %s
pt_br: Atividades marcadas com o tag %s

source: Search Profiles
pt_br: Buscar Perfis

source: Publish feeds to blog
pt_br: Publicar feeds no blog

source: Feed detail
pt_br: Detalhes do Feed

source: Popular feeds
pt_br: Feeds populares

source: RSS Management
pt_br: Administração do RSS

source: To add this feed to your resources page, click here.
pt_br: Para adicionar este feed ao seu agregador, clique aqui.

source: To add this feed to an external RSS aggregator, click the link that corresponds to your aggregator:
pt_br: Para adicionar este feed a um agregador RSS externo, clique no link que corresponde ao seu agregador:

source: Summary
pt_br: Resumo

source: This is an RSS feed for
pt_br: Este é um feed RSS de

source: Didn't mean to come here? Click to exit!
pt_br: Não queria vir aqui? Clique aqui para sair!

source: Searching Everything
pt_br: Procurando Tudo

source: Search
pt_br: Procurar

source: Search for results from:
pt_br: Procurar por resultados de:

source: Filter by content type:
pt_br: Filtrar pelo tipo de conteúdo:

source: Everything
pt_br: Procurando Tudo

source: Users and communities
pt_br: Usuários e comunidades

source: Some Tags
pt_br: Alguns Tags

source: Template Edit
pt_br: Editar Moldura

source: Select / Create Themes
pt_br: Selecionar / Criar Temas

source: Template Preview
pt_br: Visualizar Moldura

source: This screen displays recent activity on your account by other users over a given time range.
pt_br: Atividade recente na sua conta por outros usuários, num determinado período.

source: Error! The new username must contain letters and numbers only, cannot be blank, and must be between 3 and 12 characters in length.
pt_br: Erro! O novo nome da conta deve conter entre 3 e 12 caracteres (somente letras e números).

source: Username was changed to %s.
pt_br: O nome de usuário foi mudado para %s.

source: File quota was changed to %d.
pt_br: O limite de espaço para arquivos foi mudado para %d.

source: Icon quota was changed to %d.
pt_br: O limite de espaço para ícones foi alterado para %d.

source: User flag '%s' set to '%s'
pt_br: Opção '%s' do usuário ajustada como '%s'

source: Spam list updated.
pt_br: Lista de Spam atualizada.

source: User addition %d failed: at least one field was blank. Username: %s, name: %s, email: %s
pt_br: Adição do usuário %d falhou: ao menos um campo estava em branco. Nome do usuário: %s, nome: %s, email: %s

source: New username %d (%s) was invalid; usernames must contain letters and numbers only, cannot be blank, and must be between 3 and 12 characters in length.
pt_br: Novo nome do usuário %d (%s) era inválido; nomes de usuários devem conter somente letras e números, não pode ter espaço em branco, e dever ter entre 3 e 12 caracteres.

source: User addition %d failed: username %s is already in use.
pt_br: Adição do usuário %d falhou: nome do usuário %s já existe.

source: User addition %d failed: email address %s appears to be invalid.
pt_br: Adição do usuário %d falhou: o endereço de email %s parece ser inválido.

source: Your new %s account
pt_br: Sua conta no %s

source: You have been added to %s! For your records, your %s username and password are: Username: %s
pt_br: Você foi adicionado a %s! Para memorizar, seu nome de usário %s e senha são: Nome de usuário: %s \t

source: User %s was created.
pt_br: Usuário %s foi criado.

source: The following pages have been flagged as having obscene or inappropriate content. They are ordered by number of complaints.
pt_br: As seguintes páginas foram denunciadas como possuindo conteúdo obsceno ou inapropriado. Elas estão ordenadas por número de reclamações.

source: To view the pages in question, click the following links. To remove the flags, for example if the flag is a false positive or if you've deleted the offending content, check the appropriate box and click the 'delete' button below.
pt_br: Para ver as páginas em questão, clique nos seguintes links. Para remover a denúncia, por exemplo se a denúncia não é válida ou se você deletou o conteúdo ofensivo, cheque a caixa apropriada e clique no botão 'remover' abaixo.

source: Page URL
pt_br: URL da página

source: Number of objections
pt_br: Número de reclamações

source: Remove flag(s)
pt_br: Remover denúncia(s)

source: No content flags were found at present.
pt_br: Não foram encontradas denúncias.

source: Site statistics
pt_br: Estatísticas do site

source: Accounts of type '%s'
pt_br: Contas do tipo '%s'

source: Weblog statistics
pt_br: Estatística do blog

source: All-time:
pt_br: Todos os tempos:

source: %u weblog posts, %u comments
pt_br: %u mensagens de blog, %u comentários

source: Last 7 days:
pt_br: Últimos 7 dias:

source: File statistics
pt_br: Estatísticas de arquivos

source: %u files (%s bytes)
pt_br: %u arquivos (%s bytes)

source: Database statistics
pt_br: Estatísticas do banco de dados

source: Total database size:
pt_br: Tamanho total do banco de dados:

source: Users online now
pt_br: Usuários online agora

source: The following users have an active session and have performed an action within the past 10 minutes.
pt_br: Os seguintes usuários possuem uma sessão ativa e realizaram uma ação nos últimos 10 minutos.

source: Full name
pt_br: Nome completo

source: %u users in total.
pt_br: %u usuários no total.

source: Add regular expressions below, one per line, to block spam. For example, 'foo' will block all comments containing the word foo, (foo|bar) will block comments containing the word foo or bar.
pt_br: Adicione expressões regulares abaixo, uma por linha, para bloquear spam. Por exemplo, 'panaca' bloqueará todos comentário contendo a palavra panaca, (panaca|mané) bloqueará comentário contendo as palavras panaca ou mané.

source: Blank lines and lines starting with # will be ignored.
pt_br: Linhas em branco e linhas começando com # serão ignoradas.

source: Regular expressions
pt_br: Expressões regulares

source: Change username:
pt_br: Mudar nome do usuário:

source: New username:
pt_br: Novo nome de usuário:

source: Change file quota (in bytes):
pt_br: Alterar o limite de espaço em disco (em bytes):

source: New file quota:
pt_br: Novo limite de espaço em disco:

source: Change icon quota:
pt_br: Alterar limite de ícones:

source: New icon quota:
pt_br: Novo limite de ícones:

source: User flags:
pt_br: Opções do usuário:

source: Site administrator:
pt_br: Administrador do site:

source: Banned:
pt_br: Expulso:

source: You can create up to 12 users below; passwords will be autogenerated and emailed to the account owners. You must include all fields, but you may leave rows blank.
pt_br: Aqui você pode criar até 12 usuários; senhas serão geradas automaticamente e enviadas por email para os donos das contas. Você deve incluir todos os campos, mas você pode deixar linhas em branco.

source: Profile
pt_br: Perfil

source: The following is a list of all the users in the system, 50 users at a time. You can click each one to edit their user details as if you were logged in as them, as well as set user flags (including 'ban user' and 'set user as administrator').
pt_br: A seguir, uma lista de todos os usuários do sistema, 50 usuários por página. Você pode clicar em cada um para editar os detalhes dele como se você estivesse online com o perfil dele, assim como ajustar os atributos dos usuários (incluindo 'banir usuário' e 'tornar usuário um administrador').

source: If you know the username of the user you would like to edit, you can also enter it below.
pt_br: Se você sabe o nome do usuário que você gostaria de editar, você também pode digitá-lo abaixo.

source: Enter username
pt_br: Entre com o nome do usuário

source: Edit user
pt_br: Editar usuário

source: Next
pt_br: Próximo

source: Previous
pt_br: Anterior

source: Flag content
pt_br: Marcar conteúdo

source: To mark this content as obscene or inappropriate, click the 'Flag' button and an administrator will view it in due course.
pt_br: Para indicar este conteúdo como sendo obsceno ou inapropriado, clique no botão 'Denunciar' e um administrador analisará seu conteúdo em breve.

source: Flag
pt_br: Denunciar

source: Community
pt_br: Comunidade

source: Error! The community username must contain letters and numbers only, cannot be blank, and must be between 3 and 12 characters in length.
pt_br: Erro! O nome da conta da comunidade deve conter entre 3 e 12 caracteres (somente letras e números).

source: Error! The community name cannot be blank.
pt_br: Erro! O nome da comunidade não pode ser deixado em branco.

source: Your community was created and you were added as its first member.
pt_br: Sua comunidade foi criada e você foi adicionado como primeiro membro.

source: You joined %s.
pt_br: Juntou-se a %s.

source: %s has joined %s! To visit this user's profile, click on the following link:
pt_br: %s juntou-se a %s! Para ver o perfil deste usuário, clique no link abaixo:

source: New %s member
pt_br: Novo membro do %s

source: Membership of %s needs to be approved. Your request has been added to the list.
pt_br: Novos membros do %s precisam ser aprovados. O seu pedido será examinado em breve.

source: %s has applied to join %s! To visit this user's profile, click on the following link:
pt_br: %s pediu para participar de %s! Para ver o perfil deste usuário, clique no link abaixo:

source: New %s member request
pt_br: Nova requisição de %s para participar

source: %s is a private community. Your membership request has been declined.
pt_br: %s é um grupo privado. Você não pode se associar.

source: You left %s.
pt_br: Você saiu da comunidade %s.

source: Your post has been added to the community weblog.
pt_br: Sua mensagem foi adicionada ao blog da comunidade.

source: You approved the membership request. %s is now a member of this community.
pt_br: Você aprovou a requisição do membro. %s agora é um membro desta comunidade.

source: An error occurred: the membership request could not be approved.
pt_br: Um erro ocorreu; não foi possível aprovar a requisição.

source: Error: you do not have authority to modify this membership request.
pt_br: Erro: você não tem privilégios para modificar esta requisição de participação

source: An error occurred: the membership request could not be found.
pt_br: Um erro ocorreu: a requisição para participar não pôde ser encontrada.

source: You declined the membership request. %s is not a member of this community.
pt_br: Você não aceitou a requisição para participar. %s não é um membro desta comunidade.

source: Create a new community
pt_br: Criar uma nova comunidade

source: Community name:
pt_br: Nome da comunidade:

source: Username for community:
pt_br: Nome da conta da comunidade:

source: Create
pt_br: Criar

source: You don't have any communities listed! To join a community, click the 'join' button underneath a community's icon. You can find communities you're interested in by using the search function.
pt_br: Você não está participando de nenhuma comunidade! Para se associar a uma comunidade, clique no botão 'juntar-se' embaixo do ícone da comunidade. A função busca pode ajudá-lo a achar comunidades interessantes.

source: This user is not currently a member of any communities.
pt_br: Este usuário não participa de nenhuma comunidade.

source: The following users would like to join this community. They need your approval to do this (to change this setting, visit the 'community settings' page).
pt_br: Estes usuários gostariam de participar desta comunidade. Eles precisam de sua aprovação (para mudar esta configuração, visite a página 'configurações da comunidade').

source: You have no pending membership requests.
pt_br: Não há requisições de membros para serem aprovados.

source: This community doesn't currently have any members.
pt_br: Esta comunidade ainda não possui membros.

source: You don't own any communities. Why not create one?
pt_br: Não criou nenhuma comunidade. Por que não criar uma?

source: This user is not currently moderating any communities.
pt_br: Este usuário não modera nenhuma comunidade.

source: Owned communities
pt_br: Comunidades de que você é dono
