Repository: Elgg/Elgg
Catalog: languages/*/LC_MESSAGES/*.po
Languages: pt_br

source: Your %s password has been reset. For your records, your new password is:
pt_br: A sua senha no %s foi mudada. Para seus registros, sua senha nova é:

source: Your password request code appears to be invalid. Try generating a new one?
pt_br: O seu código de requisição de senha parece inválido. Tentar gerar um novo?

source: Sorry, your code was invalid.
pt_br: Desculpe, o código não é válido.

source: To generate a new password at %s!, enter your username below. We will send the address of a unique verification page to you via email click on the link in the body of the message and a new password will be sent to you.
pt_br: Para gerar uma nova senha no %s!, forneça o seu nome de usuário abaixo. Mandaremos um link de verificação via email. Clique no link no email e mandaremos uma senha nova em seguida.

source: This method reduces the chance of a mistakenly reset password.
pt_br: Esse método reduz as chances de mudar a senha por engano.

source: Your username
pt_br: Seu nome de usuário

source: Request new password
pt_br: Obter nova senha para

source: Feed Post
pt_br: Item do Feed

source: A template for each post in a feed.
pt_br: Uma moldura para cada item do feed.

source: Post title
pt_br: Título da mensagem

source: The text of the post
pt_br: Texto da mensagem

source: An icon for the user
pt_br: Um ícone para o usuário

source: The feed name
pt_br: O nome do feed

source: A short description of the feed
pt_br: Uma descrição curta do feed

source: A link to the post
pt_br: Um link para o item

source: A link to the host site
pt_br: Um link para o site

source: A link to the host feed
pt_br: Um link para o site do feed

source: Buttons to subscribe or unsubscribe
pt_br: Botões para se inscrever ou cancelar inscrição

source: Added
pt_br: Adicionado

source: Your feed subscription was successful.
pt_br: Feed assinado.

source: Feed subscription failed: you are already subscribed to this feed.
pt_br: Erro ao assinar este feed: ele já está assinado.

source: Your have successfully removed this feed from your subscriptions.
pt_br: Feed removido das suas assinaturas.

source: Feed unsubscription failed: you are not subscribed to this feed.
pt_br: Feed não removido: não está assinando esse feed.

source: Feed not imported to blog: You cannot import a feed from this account.
pt_br: Feed não importado para o blog: não pode importar feeds desta conta.

source: Feed subscription failed: this feed subscription already exists.
pt_br: Erro ao assinar este feed: ele já está assinado.

source: Feed subscription failed: SSL feed reading is not enabled.
pt_br: Erro ao assinar este feed: leitura de feed SSL não está habilitada.

source: Feed subscription failed: feed appears to be invalid. Please check your link or try later.
pt_br: Erro ao assinar este feed: o feed parece ser inválido. Verifique o seu link ou tente mais tarde.

source: Feed subscription failed: could not get feed. Please check your link or try later.
pt_br: Erro ao assinar este feed: não foi possível acessar o feed. Verifique o seu link ou tente mais tarde.

source: Error message was:
pt_br: A mensagem de erro foi:

source: Feeds are information streams from other sites. You will often see a link to an 'RSS' feed while browsing; enter the link address into the 'add feed' box at the bottom of the page to read that information from within your learning landscape.
pt_br: Um 'Feed' é uma maneira de 'assinar' as mudanças de um site. Navegando na Internet, muitas vezes você encontrará um link para um feed 'RSS'; forneça o endereço deste link na caixa 'adicionar feed' logo abaixo para receber essas informações dentro do seu ambiente.

source: Last updated
pt_br: Última vez atualizado

source: Resource name
pt_br: Nome

source: View content
pt_br: Ver conteúdo

source: Are you sure you want to unsubscribe from this feed?
pt_br: Tem certeza de que quer cancelar esta inscrição?

source: Unsubscribe
pt_br: Cancelar inscrição

source: Update
pt_br: Atualizar

source: You are not subscribed to any feeds.
pt_br: Você não se inscreveu em nenhum feed.

source: No feeds were found.
pt_br: Não foram encontrados feeds

source: To subscribe to a new feed, enter its address below:
pt_br: Para inscrever um novo feed, forneça o endereço abaixo:

source: Subscribe
pt_br: Inscrever

source: This is a list of the feeds with the most subscribers.
pt_br: Esta é uma lista dos feeds com o maior número de assinantes.

source: Link to site
pt_br: Link para o site

source: Unnamed Feed
pt_br: Feed sem nome

source: View posts
pt_br: Ver itens

source: Are you sure you want to subscribe to this feed?
pt_br: Tem certeza de que quer assinar este feed?

source: Subscribers
pt_br: Inscritos

source: No-one has subscribed to any feeds.
pt_br: Ninguém inscreveu-se em nenhum feed

source: Click a box below to automatically import content from a feed into your blog. You can also add default keywords for content from that feed. (You should only do this if you have the legal right to use this resource - in other words, you must have permission from the content owner.)
pt_br: Escolha uma opção em baixo para importar o conteúdo de um feed no seu blog. Você pode também associar palavras-chave padrão para o conteúdo deste feed. (Você pode fazer isso somente se possuir direitos para usar este recurso - em outras palavras, você deve ter permissão ao conteúdo.)

source: Are you sure you want to import this content into your personal blog?\nYou should make sure you own it or have permission from the copyright holder.
pt_br: Tem certeza de que quer importar este conteúdo para o seu blog pessoal? Você deve ter certeza de que tem permissão para isso.

source: Back
pt_br: Voltar

source: unknown
pt_br: desconhecido

source: View site
pt_br: Ver site

source: Your LMS hosts
pt_br: Seus Sistemas de Gestão de Aprendizagem (LMS)

source: Items tagged with "%s" from %s
pt_br: Itens com tags "%s" no %s

source: Syndication
pt_br: Sindicação

source: RSS feed for this tag
pt_br: Feed para este tag

source: Automatic tag suggestion:
pt_br: Sugestão automática de tag:

source: Matching accounts:
pt_br: Contas encontradas:

source: Random tags
pt_br: Tags aleatórios

source: No tags found for this user.
pt_br: Não existem tags para este usuário.

source: The following is a selection of keywords used within this site. Click one to see related users, weblog posts or objects.
pt_br: Seguem algumas palavras-chave usadas neste site. Clique em uma para ver usuários ou itens de conteúdo relacionado.

source: Sidebar section holder
pt_br: Base da barra lateral

source: Contains the sidebar section titles
pt_br: Contém os títulos da barra lateral

source: The header
pt_br: Cabeçalho

source: adminTable
pt_br: Tabela de administração

source: This table is used to house stats and administration details until a good CSS solution can be applied.
pt_br: Esta tabela é usada para estatística do sistema e detalhes de administração até que uma boa solução de CSS possa ser usada.

source: Column One
pt_br: Coluna Um

source: Column Two
pt_br: Coluna Dois

source: Column Three
pt_br: Coluna Três

source: flagContent
pt_br: Conteúdo de denúncia

source: This holds the flag content function throughout Elgg
pt_br: Isto mantém a função do conteúdo de denúncia por todo o Elgg

source: The templates have been changed according to your choices.
pt_br: As molduras foram modificadas de acordo com suas escolhas.

source: No changes made as no area of change where selected!
pt_br: Nenhuma mudança foi feita pois nenhuma área de mudança foi selecionada!

source: Change templates
pt_br: Mudar molduras

source: The selected changes will affect:
pt_br: As mudanças selecionadas afetarão:

source: Your personal space
pt_br: Seu espaço pessoal

source: Community:
pt_br: Comunidade:

source: Your editor preferences have been saved
pt_br: As suas preferências de editor foram salvas

source: Your editor preferences have been changed
pt_br: As suas preferência de editor foram alteradas

source: Your editor preferences could not be changed
pt_br: As suas preferência de editor não foram alteradas

source: Visual text editing
pt_br: Edição visual de texto

source: Set this to 'yes' if you would like to use a visual (WYSIWYG) text editor for your posts and comments.
pt_br: Escolha 'sim' se gostaria de usar um editor de texto visual (WYSIWYG) para os seus itens.

source: Enable visual editor:
pt_br: Abilitar o editor visual:

source: Public
pt_br: Público

source: There are %d active users.
pt_br: Há %d usuários ativos.

source: (%d logged on.)
pt_br: (%d conectados)

source: User Statistics
pt_br: Estatísticas dos usuários

source: Your suggested name was too long. Please try something shorter.
pt_br: O seu nome sugerido é longo demais. Por favor tente algo menor.

source: Email address updated.
pt_br: Endereço de email atualizado.

source: Your moderation preferences have been changed.
pt_br: As suas preferências de moderação foram mudadas.

source: Public comments and discussion set to 'on'.
pt_br: Comentários e discussão públicos permitidos.

source: Public comments and discussion set to 'off'.
pt_br: Comentários e discussão públicos não permitidos.

source: Email comments and discussion set to 'on'.
pt_br: Envio de comentários e discussão por email ativado.

source: Email comments and discussion set to 'off'.
pt_br: Envio de comentários e discussão por email desativado.

source: Email notifications set to 'on'.
pt_br: Notificações de email ativadas.

source: Email notifications set to 'off'.
pt_br: Notifições de email desativadas.

source: Details were not changed.
pt_br: Detalhes não alterados.

source: Password not changed: Your password is either too short or too long. It must be between 4 and 32 characters in length.
pt_br: A senha não foi alterada: era curta ou longa demais. A senha deveria ter entre 4 e 32 caracteres.

source: Password not changed: Your password can only consist of letters or numbers.
pt_br: A senha não foi alterada: deveria ter somente letras e números.

source: Your password was updated.
pt_br: A senha foi atualizada.

source: Password not changed: The password and its verification string did not match.
pt_br: A senha não foi alterada: a senha e sua verificação não coincidiram.

source: Change your full name:
pt_br: Mudar o seu nome completo:

source: Your full name
pt_br: Seu nome completo

source: Your email address:
pt_br: Seu endereço de email:

source: This will not be displayed to other users; you can choose to make an email address available via the profile screen.
pt_br: Isto não será mostrado a outros usuários; você pode divulgar um endereço de email usando seu 'perfil'.

source: Your email address
pt_br: Seu email

source: Friendship moderation:
pt_br: Moderação de contatos:

source: This allows you to choose who can list you as a friend.
pt_br: Isso permite controlar quem pode adicioná-lo a uma lista de contatos.

source: No moderation: anyone can list you as a friend. (Recommended)
pt_br: Sem moderação: todo mundo pode adicioná-lo como contato. (recomendado)

source: Moderation: friendships must be approved by you.
pt_br: Moderação: requisições de contato precisam ser aprovados por você.

source: Private: nobody can list you as a friend.
pt_br: Privado: ninguém pode adicioná-lo à lista de contatos.

source: Friendship moderation
pt_br: Moderação de contatos

source: Make comments public
pt_br: Fazer comentários públicos

source: Set this to 'yes' if you would like anyone to be able to comment on your resources (by default only logged-in users can). Note that this may make you vulnerable to spam.
pt_br: Escolha 'sim' se você quiser que todo mundo possa deixar comentários no seu blog, arquivos, etc. (o padrão é que somente usuários online podem deixar comentários). Note que isso pode deixá-lo vulnerável a spam.

source: Public comments:
pt_br: Comentários públicos:

source: Receive email notifications
pt_br: Receber notificações por email

source: Set this to 'yes' if you would like to receive email copies of any messages you receive. This includes blog comments, notifications when people add you as a friend and more. You can always view these online as part of your recent activity page.
pt_br: Escolha 'sim' se você gostaria de receber cópias por email de qualquer mensagem que recebe. Isto inclui comentários no blog, notificações quando alguém o adiciona como contato e mais. Você sempre pode ver isso enquanto online na sua página de atividades recentes.

source: Receive notifications:
pt_br: Receber notificações por email:

source: Change your password:
pt_br: Mudar sua senha:

source: Leave this blank if you're happy to leave your password as it is.
pt_br: Deixar em branco se não quiser mudar a sua senha.

source: Your password:
pt_br: Sua senha:

source: Again for verification purposes:
pt_br: Sua senha novamente (para verificação):

source: None.
pt_br: Nenhum.

source: There are no weblog posts to archive as yet.
pt_br: Não há mensagens no blog para arquivar ainda.

source: Weblog Archive
pt_br: Arquivo do Blog

source: Weblog Post
pt_br: Mensagem do Blog

source: A template for each weblog post.
pt_br: Uma moldura para cada mensagem do blog.

source: The username of the person making the post
pt_br: Nome do usuário que escreveu a mensagem

source: Their user icon
pt_br: Ícone do usuário

source: Their full name
pt_br: Nome completo dele

source: The time and date of the post
pt_br: Data e horário da mensagem

source: A link to any comments
pt_br: Um link para os comentários

source: A link to any trackbacks
pt_br: Um link para 'trackbacks'

source: A list of comments, if any
pt_br: Uma lista de comentários, se houver

source: Posted by
pt_br: Escrito por

source: Weblog Comments
pt_br: Comentários do Blog

source: A placeholder for weblog comments.
pt_br: Um marcador de lugar para comentários do blog.

source: The list of comments themselves
pt_br: Lista dos comentários

source: The list of page links when there are lots of comments
pt_br: A lista de links quando há muitos comentários

source: Comments
pt_br: Comentários

source: Individual weblog comment
pt_br: Comentário individual no blog

source: A template for each individual weblog comment. (Displayed one after the other, embedded in the comment placeholder.)
pt_br: Uma moldura para cada comentário do blog. (Mostrados um após o outro)

source: Post body
pt_br: Corpo da mensagem

source: The name of the person making the comment
pt_br: O nome da pessoa fazendo o comentário

source: When the comment was posted
pt_br: Quando o comentário foi enviado

source: The usericon of the person making the comment, if available
pt_br: A foto da pessoa fazendo o comentário, se disponível

source: A permalink to the comment
pt_br: Um permalink para o comentário

source: Stop keeping track of this post
pt_br: Parar de acompanhar esta mensagem

source: You have marked this post as interesting; all comments will appear on your 'recent activity' page. If you would like to remove this flag, click here.
pt_br: Você marcou esta mensagem como interessante; os comentários aparecerão na sua página de 'atividade recente'. Se quiser parar de acompanhar esta mensagem, clique aqui.

source: Remove interesting flag
pt_br: Remover a marca 'interessante'

source: Keep track of this post
pt_br: Marcar e acompanhar esta mensagem

source: Click the 'Mark interesting' button to monitor new comments on your 'recent activity' page.
pt_br: Clique no botão 'marcar como interessante' para monitorar novos comentários na sua página de 'atividade recente'.

source: Mark interesting
pt_br: Marcar como interessante

source: Weblog
pt_br: Blog

source: The weblog for %s, hosted on %s.
pt_br: Blog de %s, hospedado no %s.

source: Weblog posts by
pt_br: Mensagens do blog de

source: in category
pt_br: na categoria

source: RSS feed for weblog posts by
pt_br: Feed RSS das mensagens do blog de

source: Other users with weblog posts in category
pt_br: Outros usuários com mensagens do blog na categoria

source: Users with weblog posts in category
pt_br: Usuários com mensagens de blog na categoria

source: Weblog post
pt_br: Mensagem do blog

source: Unkind Guest
pt_br: Visitante descortês

source: I mock you, Babbage! Your difference engine will never catch on.
pt_br: Eu rio de você, Babbage! Sua máquina diferencial nunca vai funcionar.

source: Says you!
pt_br: Diga você!

source: The Analytical Engine - introduction from Chapter VIII
pt_br: A Máquina Analítica - Introdução do Capítulo VIII

source: The circular arrangement of the axes of the Difference Engine round the large central wheels led to the most extended prospects. The whole of arithmetic now appeared within the grasp of mechanism. A vague glimpse even of an Analytical Engine at length opened out, and I pursued with enthusiasm the shadowy vision. The drawings and the experiments were of the most costly kind. Draftsmen of the highest order were necessary to economize the labour of my own head; whilst skilled workmen were required to execute the experimental machinery to which I was obliged constantly to have recourse. In order to carry out my pursuits successfully, I had purchased a house with above a quarter of an acre of ground in a very quiet locality. My coach-house was now converted into a forge and a foundry, whilst my stables were transformed into a workshop. I built other extensive workshops myself, and had a fireproof building for my drawings and draftsmen. Having myself worked with a variety of tools, and having studied the art of constructing each of them, I at length laid it down as a principle - that, except in rare cases, I would never do anything myself if I could afford to hire another person who could do it for me.
pt_br: O arranjo circular de eixos da Máquina Diferencial ao redor das grandes rodas centrais levam aos mais extensos prospectos. Agora toda a aritmética parecia dentro da compreensão da máquina. Um piscar, mesmo que vago, de uma Máquina Analítica finalmente acendeu-se, e eu persegui com entusiasmo sua visão obscura. Os desenhos e os experimentos eram dos mais caros. Desenhistas do mais alto nível eram necessários para economizar o trabalho de minha própria cabeça; enquanto que trabalhadores habilidosos eram requeridos para executar a maquinaria experimental ao qual eu tinha de recorrer constantemente. Para levar minhas buscas a cabo com sucesso, comprei uma casa com mais de um quarto de um acre de tereno em um local muito calmo. Meu dormitório tinha se convertido numa forja, enquanto que meus estábulos se transformaram numa oficina. Construí outras grandes oficinas eu mesmo, e tive uma construção à prova de fogo para meus desenhos e desenhistas. Tendo eu mesmo trabalhado com várias ferramentas, e tendo estudado a arte de construir cada uma delas, eu ao final tomei isto como princípio - de que, exceto em casos raros, eu jamais faria qualquer coisa eu mesmo se eu pudesse contratar outra pessoa que poderia fazê-lo por mim.

source: Your post has been added to your weblog.
pt_br: O seu item foi adicionado ao seu blog

source: The weblog post has been modified.
pt_br: O item foi modificado

source: This weblog post has now been added to your 'interesting' list.
pt_br: Este item foi adicionado à sua lista de itens interessantes

source: You are no longer monitoring this weblog post.
pt_br: Você não está mais monitorando este item.

source: The selected weblog post was deleted.
pt_br: O item do blog selecionado foi removido.

source: You do not appear to have permission to delete this weblog post. It was not deleted.
pt_br: Aparentemente você não tem permissão para remover esta mensagem do blog. Não foi removida.

source: Your comment has been added.
pt_br: O seu comentário foi adicionado.

source: Your comment could not be posted. The system thought it was spam.
pt_br: O seu comentário não foi enviado. O sistema achou que era spam!

source: Your comment was deleted.
pt_br: Seu comentário foi removido.

source: Remove filter
pt_br: Remover o filtro

source: Filtered: Showing personal blog posts
pt_br: Filtrado: mostrando mensagens do seu blog pessoal

source: Filtered: Showing community blog posts
pt_br: Filtrado: mostrando mensagens do blog das suas comunidades

source: Filtered: Showing posts with comments
pt_br: Filtrado: mostrando mensagens com comentários

source: Filtered: Showing posts with no comments
pt_br: Filtrado: mostrando mensagens sem comentários

source: Filtered: Showing posts from
pt_br: Filtrado: mostrando mensagens de

source: Filtered: Showing posts tagged with
pt_br: Filtrado: mostrando mensagens com os Tags

source: Add a comment
pt_br: Escreva um comentário

source: Your comment text
pt_br: Seu comentário

source: Add comment
pt_br: Escrever comentário

source: Click here to post to this weblog.
pt_br: Clique aqui para escrever um item neste blog

source: Add a new post
pt_br: Escrever nova mensagem

source: Post title:
pt_br: Título da mensagem:

source: Post body:
pt_br: Conteúdo da mensagem:

source: Keywords (Separated by commas):
pt_br: Palavras-chave (separadas por vírgulas):

source: Keywords commonly referred to as 'Tags' are words that represent the weblog post you have just made. This will make it easier for others to search and find your posting.
pt_br: Palavras-chave (também conhecidas como tags) são palavras relacionadas com a mensagem do blog que você acabou de escrever. Elas ajudam outras pessoas a buscar e achar sua mensagem.

source: Post
pt_br: Enviar

source: You must be logged in to post a new weblog entry. You may do so using the login pane to the right of the screen.
pt_br: Você deve estar online para enviar uma nova mensagem no seu blog. Você podefazer isso usando o painel à direita na sua tela para entrar.

source: Access Denied
pt_br: Acesso negado

source: Edit a post
pt_br: Editar uma mensagem

source: Save Post
pt_br: Salvar mensagem

source: More
pt_br: Mais

source: Keywords:
pt_br: Palavras-chave:

source: comment(s)
pt_br: comentário(s)

source: Are you sure you want to permanently delete this weblog post?
pt_br: Tem certeza de que quer remover permanentemente este item?

source: Page:
pt_br: Página:

source: Are you sure you want to permanently delete this weblog comment?
pt_br: Tem certeza de que quer remover permanentemente este comentário?

source: You must be logged in to post a comment.
pt_br: Você deve entrar no sistema para escrever um comentário.

source: Recent Activity
pt_br: Atividade Recente

source: View your activity
pt_br: Ver sua atividade

source: Personal blog
pt_br: Seu blog

source: Community blog
pt_br: Blog do grupo

source: Friends blog
pt_br: Blog dos Contatos

source: XML error:
pt_br: Erro de XML:

source: Blog Archives
pt_br: Arquivo do Blog

source: All blogs
pt_br: Todos os blogs

source: You can filter this page to certain types of posts:
pt_br: Filtrar esta página para conter somente certos tipos de itens:

source: Personal blog posts
pt_br: Itens do seu blog

source: Community blog posts
pt_br: Itens do blog da comunidade

source: Posts with comments
pt_br: Itens com comentários

source: Posts with no comments
pt_br: Itens sem comentários

source: Weblog items tagged with %s
pt_br: Itens do blog com os Tags %s

source: Weblog items
pt_br: Itens do blog

source: All users
pt_br: Todos os usuários

source: The most recent weblog posts on %s.
pt_br: Mensagens mais recentes do blog de %s.

source: Access denied or post not found
pt_br: Mensagem não existente ou acesso negado

source: Either this blog post doesn't exist or you don't currently have access privileges to view it.
pt_br: A mensagem deste blog não existe ou você não possui privilégios de acesso para vê-la.
