Repository: Elgg/Elgg
Catalog: languages/*/LC_MESSAGES/*.po
Languages: pt_br

source: Community memberships
pt_br: Comunidades de que participa

source: Community Wiki
pt_br: Wiki da comunidade

source: Upload / edit site pictures for this community.
pt_br: Mudar a foto desta comunidade.

source: Change this community's name.
pt_br: Mudar o nome desta comunidade.

source: Community ownership transferred to %s.
pt_br: Posse da comunidade transferida para %s.

source: Could not retrieve community details.
pt_br: Não foi possível encontrar detalhes da comunidade.

source: Change your community name
pt_br: Mudar o nome da sua comunidade

source: This name will be displayed throughout the system.
pt_br: Este nome poderá ser visto no sistema inteiro.

source: Community name
pt_br: Nome da comunidade

source: Membership restriction:
pt_br: Restrição de associados:

source: This allows you to choose who can join this community.
pt_br: Permite que você escolha quem pode se associar a esta comunidade.

source: No moderation: anyone can join this community.
pt_br: Sem moderação: todos podem associar-se a esta comunidade.

source: Moderation: memberships must be approved by you.
pt_br: Moderação: novos associados devem ser aprovados por você.

source: Private: nobody can join this community.
pt_br: Privado: ninguém pode associar-se a esta comunidade.

source: Membership restriction
pt_br: Restrição de associado

source: Community ownership
pt_br: Posse da comunidade

source: Type the username of the user who you want to own this community below. You cannot leave this blank, or specify a community or a user that doesn't exist.
pt_br: Digite abaixo o nome de usuário daquele que você quer que seja dono da comunidade. Você não pode deixar este campo em branco nem especificar uma comunidade ou usuário que não exista.

source: Community owner
pt_br: Dono da comunidade

source: Are you sure you want to join this community?
pt_br: Tem certeza de que quer participar dessa comunidade?

source: Click here to join this community.
pt_br: Clique aqui para participar desta comunidade.

source: Are you sure you want to apply to join this community?
pt_br: Tem certeza que quer participar desta comunidade?

source: Click here to apply to join this community.
pt_br: Clique aqui para pedir para participar desta communidade.

source: Are you sure you want to leave this community?
pt_br: Tem certeza de que quer sair desta comunidade?

source: Click here to leave this community.
pt_br: Clique aqui para deixar esta comunidade.

source: Folder
pt_br: Pasta

source: Each individual folder
pt_br: Cada pasta individual

source: The owner of the folder
pt_br: Proprietário da pasta

source: The name of the folder
pt_br: Nome da pasta

source: The folder's URL
pt_br: URL da pasta

source: Menu items for folder owner (edit, delete, etc)
pt_br: Itens do menu para o proprietário da pasta (editar, deletar, etc.)

source: The URL of the file's icon
pt_br: URL do ícone do arquivo

source: Keywords associated with the folder
pt_br: Palavras-chave associadas à pasta

source: File
pt_br: Arquivo

source: Each individual file within a folder
pt_br: Cada arquivo individual dentro de uma pasta

source: The file's URL
pt_br: O URL do arquivo

source: Its filename
pt_br: O nome do arquivo

source: A description of the file
pt_br: Uma descrição do arquivo

source: Its title
pt_br: O título

source: Menu items for file owner (edit, delete, etc)
pt_br: Itens do menu para o proprietário do arquivo (editar, deletar, etc.)

source: The URL of its icon
pt_br: URL do ícone

source: File title:
pt_br: Título do arquivo:

source: File description:
pt_br: Descrição do arquivo:

source: Access restrictions:
pt_br: Restrições de Acesso:

source: File folder:
pt_br: Pasta de arquivos:

source: Keywords (comma separated):
pt_br: Palavras-chave (separadas por vírgulas):

source: Save changes
pt_br: Salvar mudanças

source: Edit
pt_br: Editar

source: Edit this folder
pt_br: Editar esta pasta

source: Folder name:
pt_br: Nome da pasta:

source: Parent folder
pt_br: Pasta Superior

source: Access restrictions
pt_br: Restrições de Acesso

source: Upload files and folders
pt_br: Enviar arquivos e pastas

source: Create a new folder
pt_br: Criar uma nova pasta

source: To create a new folder, enter its name:
pt_br: Para criar uma nova pasta, dê o nome:

source: Upload a file
pt_br: Enviar um arquivo

source: You have used %s Mb of a total %s Mb.
pt_br: Você usou %s Mb de um total de %s Mb.

source: Used space: %s Mb.
pt_br: Espaço usado: %s Mb.

source: File to upload:
pt_br: Arquivo para enviar:

source: File Description:
pt_br: Descrição do arquivo:

source: By checking this box, you are asserting that you have the legal right to share this file, and that you understand you are sharing it with other users of the system.
pt_br: Selecionando esta opção, você está afirmando que tem o direito de compartilhar este arquivo e que entende que vai compartilhar o arquivo com outros usuários deste sistema.

source: Your folder was created.
pt_br: Sua pasta foi criada.

source: Could not create folder. Perhaps the folder name was blank?
pt_br: A pasta não foi criada. Talvez o nome da pasta estava em branco?

source: Upload unsuccessful. You must check the copyright box for a file to be uploaded.
pt_br: Envio não efetuado. Você deve selecionar a caixa de direitos autorais para o arquivo poder ser enviado.

source: The file was successfully uploaded.
pt_br: O arquivo foi enviado.

source: The file was updated.
pt_br: O arquivo foi atualizado.

source: The folder was edited.
pt_br: A pasta foi editada.

source: Error: a folder cannot be its own parent.
pt_br: Erro: uma pasta não pode conter a si mesma.

source: The folder was deleted.
pt_br: A pasta foi apagada.

source: The file was deleted.
pt_br: O arquivo foi apagado.

source: You do not have permission to access this file
pt_br: Você não tem permissão para acessar este arquivo

source: File does not exist
pt_br: O arquivo não existe

source: File Storage
pt_br: Armazenamento de arquivos

source: Root Folder
pt_br: Pasta Raiz

source: Return to
pt_br: Voltar para

source: Subfolders
pt_br: Sub-pastas

source: Are you sure you want to permanently delete this folder?
pt_br: Tem certeza de que quer apagar completamente esta pasta?

source: Keywords:
pt_br: Palavras-chave:

source: Are you sure you want to permanently delete this file?
pt_br: Tem certeza de que quer remover completamente este arquivo?

source: This folder is currently empty.
pt_br: Esta pasta está vazia.

source: Folders owned by '%s' in category '%s'
pt_br: Pasta de '%s' na categoria '%s'

source: Files owned by %s in category '%s'
pt_br: Arquivos de %s na categoria '%s'

source: View folder
pt_br: Abrir pasta

source: RSS feed for files owned by %s
pt_br: Feed RSS para arquivos de %s

source: Users with files or folders in category
pt_br: Usuários com arquivos ou pastas na categoria

source: File folder
pt_br: Pasta de arquivos

source: Folder name
pt_br: Nome da pasta

source: test
pt_br: teste

source: Subfolder
pt_br: Sub-pasta

source: A sample file
pt_br: Um arquivo de teste

source: This is a file
pt_br: Isto é um arquivo

source: filename
pt_br: nome do arquivo

source: Files and folders
pt_br: Arquivos e pastas

source: Embed a file from your %s file storage:
pt_br: Embutir um arquivo do seu armazenamento de arquivos no %s:

source: This will add a code to your weblog post that will be converted into an embedded file.
pt_br: Isto vai colocar um código na sua mensagem que será convertido em um arquivo ou imagem embutido.

source: %s was added to your friends list.
pt_br: %s foi adicionado à sua lista de contatos.

source: %s has added you as a friend! To visit this user's profile, click on the following link:
pt_br: %s adicionou você como contato! Para visitar o perfil deste usuário, clique no link seguinte:

source: New %s friend
pt_br: Novo contato no %s

source: %s couldn't be added to your friends list.
pt_br: Não foi possível adicionar %s à sua lista de contatos.

source: %s has elected to moderate friendship requests. Your request has been added to their moderation queue.
pt_br: %s está moderando requisições à sua lista de contatos. O seu pedido está na fila de moderação.

source: %s has requested to add you as a friend! To visit this user's profile, click on the following link:
pt_br: %s pediu para ser adicionado à sua lista de contatos! Para visitar o perfil deste usuário, clique no link seguinte:

source: New %s friend request
pt_br: Novo pedido de contato no %s.

source: %s has elected to moderate friendship requests, but your friend request couldn't be added to their moderation queue.
pt_br: %s está moderando requisições à sua lista de contatos, mas a sua requisição não pôde ser adicionada à fila de moderação.

source: %s has decided not to allow any new friendship requests at this time. Your friendship request has been declined.
pt_br: %s não está permitindo requisições de contato no momento. Sua requisição na lista de contatos dele(a) foi recusada.

source: was removed from your friends.
pt_br: foi removido da sua lista de contatos.

source: couldn't be removed from your friends.
pt_br: não pôde ser removido da lista de contatos.

source: You approved the friendship request. %s now lists you as a friend.
pt_br: Aprovou a requisição de contato. Agora você faz parte da lista de contatos de %s.

source: %s has approved your friendship request! To visit this user's profile, click on the following link:
pt_br: %s adicionou você como contato! Para visitar o perfil deste usuário, clique no link seguinte:

source: %s friend request approved!
pt_br: Requisição do contato %s aprovada!

source: An error occurred: couldn't add you as a friend
pt_br: Ocorreu um erro: não foi possível adicioná-lo como contato

source: Error: you do not have authority to modify this friendship request.
pt_br: Erro: você não tem permissão de modificar este pedido de contato.

source: An error occurred: the friendship request could not be found.
pt_br: Ocorreu um erro: não achamos este pedido de contato.

source: You declined the friendship request. %s does not list you as a friend.
pt_br: Você recusou a requisição de contato. %s não o lista como um contato.

source: %s has denied your friendship request. To visit this user's profile, click on the following link:
pt_br: %s recusou sua requisição de contato. Para visitar o perfil deste usuário, clique no link seguinte:

source: %s friend request denied
pt_br: Requisição do contato %s recusada

source: You don't have any friends listed! To add a user as a friend, click the 'friend' button underneath a user's icon.
pt_br: Você ainda não tem nenhum contato! Para adicionar contatos, vá até a página de algum usuário do sistema e clique no botão 'contato' logo abaixo da foto da pessoa.

source: This user doesn't currently have any friends listed. Maybe if you list them as a friend, it'll start the ball rolling ..?
pt_br: Este usuário ainda não possui nenhum contato. Talvez se você adicioná-lo como um contato, começará um efeito em cascata?

source: Displaying 1000 most recently active people, of %d found.
pt_br: Mostrando as 1000 pessoas mais ativas recentemente, de %d encontradas.

source: Nobody's listed you as a friend! Maybe you need to start chatting to some other users?
pt_br: Ninguém te adicionou como contato! Talvez você poderia começar a conversar com algum outro usuário?

source: This user isn't currently listed as anyone's friend. Maybe you could be the first?
pt_br: Este usuário ainda não tem contatos. Talvez você possa ser o primeiro?

source: View all Friends
pt_br: Ver todos os Contatos

source: Your Friends
pt_br: Seus Contatos

source: The following users would like to add you as a friend. They need your approval to do this (to change this setting, visit the 'account settings' page).
pt_br: Os usuários seguintes gostariam de adicionar você às suas listas de contato. Eles precisam da sua aprovação (para mudar esta configuração, visite a página 'configurações da conta').

source: You have no pending friendship requests.
pt_br: Você não tem requisições de contato pendentes.

source: Friends Screen
pt_br: Página de Contatos

source: Are you sure you want to add this user as a friend?
pt_br: Tem certeza de que quer adicionar este usuário como contato?

source: Click here to add this user as a friend.
pt_br: Clique aqui para adicionar este usuário como contato.

source: Are you sure you want to remove this user from your friends list?
pt_br: Tem certeza de que quer remover este usuário da sua lista de contatos?

source: Click here to remove this user from your friends list.
pt_br: Clique aqui para remover este usuário da sua lista de contatos.

source: Language selection
pt_br: Seleção de língua

source: Choose your preferred language for this site. The following languages are available on this system:
pt_br: Escolha sua língua para este site. As seguintes línguas estão disponíveis neste sistema:

source: No languages installed
pt_br: Nenhuma língua instalada.

source: Preferred language
pt_br: Língua escolhida

source: saved
pt_br: salvo

source: not changed
pt_br: não alterado

source: Group
pt_br: Grupo de Acesso

source: Your group was updated.
pt_br: O seu grupo de acesso foi atualizado

source: Create a new group
pt_br: Criar um novo grupo de acesso

source: Group name:
pt_br: Nome do grupo de acesso:

source: Group membership
pt_br: Membros deste grupo de acesso

source: Owned by %s
pt_br: Controlado por %s

source: Your friends:
pt_br: Seus Contatos:

source: Add selected to group
pt_br: Adicionar ao grupo de acesso

source: Remove selected from group
pt_br: Remover do grupo de acesso

source: Members of this group:
pt_br: Membros deste grupo de acesso

source: Save this group
pt_br: Salvar este grupo de acesso

source: Delete this group
pt_br: Remover este grupo de acesso

source: Groups you own
pt_br: Os seus grupos de acesso

source: Existing groups
pt_br: Grupos de Acesso existentes

source: Access is controlled through the use of Access groups and this is one of the most powerful features of Elgg. Access groups allow you to have complete control over who sees what within your environment. You can create as many access groups as you wish. Each access group can have as many of your friends as you like and each access group created becomes another option in the 'access restriction' dropdown menu beside each profile item, weblog post and file uploaded.
pt_br: O acesso aos seus vários itens de conteúdo é controlado por meio de Grupos de Acesso. Eles permitem controle total sobre quem pode ver o quê dentro do seu ambiente. Você pode criar tantos grupos de acesso quanto quiser. Cada grupo de acesso pode ter quantos contatos você quiser, e ele aparecerá nos menus 'restrições de acesso' ao lado de cada item de conteúdo que criar (itens do seu perfil, blog, arquivos compartilhados etc.)

source: When you create an access group, add people to it then select it as your access restriction on a weblog post only the people in that group will be able to see that weblog post and so on for all elements in your learning landscape.
pt_br: Ao criar um Grupo de Acesso, você está definindo um grupo de pessoas que podem ver determinados itens do seu perfil ou blog, por exemplo. Outros usuários não terão acesso a estes itens. Este controle de acesso pode ser definido para cada item do seu ambiente neste sistema.

source: This is a help file for the Groups functions.
pt_br: Esta é uma página de ajuda para as funções do 'Grupos de Acesso'

source: Your selected icons were deleted.
pt_br: Os ícones selecionados foram apagados.

source: You have already met your icon quota. You must delete some icons before you can upload any new ones.
pt_br: Você atingiu a seu quota de ícones. É preciso apagar alguns antes de enviar mais.

source: Attempting to upload icon file ...
pt_br: Tentando enviar o ícone...

source: The uploaded icon file was invalid. Please ensure you are using JPEG, GIF or PNG files.
pt_br: O ícone enviado não era válido. Verifique se está usando arquivos JPEG, GIF ou PNG.

source: The uploaded icon file was in an image format other than JPEG, GIF or PNG. These are unsupported at present.
pt_br: O ícone estava num formato diferente de JPEG, GIF ou PNG. Não temos suporte para esse formato no momento.

source: Your icon was uploaded successfully.
pt_br: Ícone enviado com sucesso.

source: An unknown error occurred when saving your icon. If this problem persists, please let us know and we'll do all we can to fix it quickly.
pt_br: Algum erro desconhecido ocorreu ao salvar o seu ícone. Se este problema persistir, por favor entre em contato e tentaremos achar uma solução.

source: Upload a new picture
pt_br: Enviar uma nova imagem

source: Upload a picture for this profile below. Pictures need to be 100x100 pixels or smaller, but don't worry - if you've selected a larger picture, we'll shrink it down for you. You may upload up to
pt_br: Envie uma imagem para este perfil. As imagens serão reduzidas a 100x100 pixels ou menores, mas não se preocupe, se você escolheu figuras maiores, nós a reduziremos para você. Você pode enviar até

source: pictures in total.
pt_br: imagens no total.

source: Picture to upload:
pt_br: Imagem para enviar:

source: Icon description:
pt_br: Descrição do ícone:

source: Make this the default icon:
pt_br: Tornar este ícone padrão:

source: Upload new icon
pt_br: Enviar um ícone novo

source: Site pictures
pt_br: Ímagens do site

source: Site pictures are small pictures that act as a representative icon throughout the system.
pt_br: Ímagens do site são pequenas imagens que atuam como ícones por todo o sistema.

source: Name:
pt_br: Nome:

source: Default:
pt_br: Padrão:

source: No default:
pt_br: Sem padrão:

source: You don't have any site pictures loaded yet.
pt_br: Você não enviou nenhuma imagem do site ainda.

source: They included the following message:
pt_br: Incluíram a mensagem seguinte:

source: Thank you for registering with %s.
pt_br: Obrigado por registrar no %s.

source: %s account verification
pt_br: Verifiação da conta no %s

source: has invited you to join
pt_br: convidou você a se associar a

source: a learning landscape system.
pt_br: um sistema de comunidades.

source: Dear %s, %s %s To join, visit the following URL: %s
pt_br: Caro(a) %s, %s %s Para se associar, visite o endereço seguinte: %s

source: Your invitation was sent to %s at %s. It will be valid for seven days.
pt_br: O seu convite foi enviado para %s em %s. Terá validade por sete dias.

source: User %s already has that email address. Invitation not sent.
pt_br: Usuário %s já tem este email. Convite não enviado.

source: Someone with that email address has already been invited to the system.
pt_br: Alguém com este email já foi convidado ao sistema.

source: Invitation failed: The email address was not valid.
pt_br: Convite falhou: email inválido.

source: Error: This community has reached its maximum number of users.
pt_br: Erro: Esta comunidade atingiu seu número máximo de usuários.

source: Invitation failed: you are not logged in.
pt_br: Convite falhou: você não está online.

source: Invitation failed: you must specify both a name and an email address.
pt_br: Convite falhou: é preciso especificar tanto um nome quanto um email.

source: Unfortunately this community has reached its account limit and you are unable to join at this time.
pt_br: Infelizmente esta comunidade atingiu seu limite de usuários e você não pode participar dela no momento.

source: You must indicate that you are at least 13 years old to join.
pt_br: Você precisa indicar que possui mais de 13 anos para participar.

source: Error! Invalid invite code.
pt_br: Erro! Código de convite inválido.

source: Your account was created! You can now log in using the username and password you supplied. You have been sent an email containing these details for reference purposes.
pt_br: A sua conta foi criada! Você pode entrar no sistema usando o nome da conta e senha que especificou. Foi enviado um email com estes detalhes.

source: Your %s account
pt_br: A sua conta no %s

source: Thanks for joining %s! For your records, your %s username and password are:
pt_br: Obrigado por participar do %s! Para os seus registros, seu nome de usuário no %s e sua senha são:

source: Verify your %s account password request
pt_br: Verifique o seu pedido de senha no %s

source: A request has been received to generate your account at %s a new password.
pt_br: Recebemos um pedido de gerar uma nova senha para sua conta no %s.

source: Your verification email was sent. Please check your inbox.
pt_br: O seu email de verificação foi mandado. Cheque sua caixa de entrada.

source: No user with that username was found.
pt_br: Não existe usuário com este nome de conta.

source: Thank you for registering for an account with %s! Registration is completely free, but before you confirm your details, please take a moment to read the following documents:
pt_br: Obrigado por registrar uma conta no %s! Antes de confirmar seus detalhes, por favor, leia os documentos a seguir:

source: terms and conditions
pt_br: termos e condições

source: Privacy policy
pt_br: Política de privacidade

source: Submitting the form below indicates acceptance of these terms. Please note that currently you must be at least 13 years of age to join the site.
pt_br: A submissão do formulário indica que aceita estes termos. Note que no momento a idade mínima é 13 anos para poder participar deste site.

source: Your name
pt_br: Seu nome

source: Your username - (Must be letters only)
pt_br: Seu nome de usuário (somente letras)

source: Enter a password
pt_br: Forneça uma senha

source: Your password again for verification purposes
pt_br: A sua senha de novo para fins de verificação

source: I am at least thirteen years of age.
pt_br: Tenho mais do que 13 anos de idade.

source: Join
pt_br: Participe

source: Your invitation code appears to be invalid. Codes only last for seven days; it's possible that yours is older. If you still want to join %s, it may be worth getting in touch with the person who invited you.
pt_br: O seu código de convite parece ser inválido. Estes códigos valem somente por sete dias; talvez o seu seja mais antigo. Se ainda quer participar do %s, entre em contato com a pessoa que o convidou.

source: For the moment, joining %s requires a specially tailored invite code. If you know someone who's a member, it may be worth asking them for one.
pt_br: Por enquanto, a participação no %s requer um código de convite. Se conhecer algum membro, poderia pedir um a ele.

source: Their name
pt_br: O nome deles

source: Their email address
pt_br: O email deles

source: An optional message
pt_br: Uma mensagem opcional

source: Invite
pt_br: Convidar

source: Thank you for registering for an account with %s! Registration is completely free, but before you fill in your details, please take a moment to read the following documents:
pt_br: Obrigado por registrar uma conta no %s! Antes de confirmar seus detalhes como usuário, por favor leia os documentos a seguir:

source: When you fill in the details below, we will send an "invitation code" to your email address in order to validate it. You must then click on this within seven days to create your account.
pt_br: Quando preencher os detalhes embaixo, mandaremos um "código de convite" ao seu endereço de email para validá-lo. Deve seguir o link dentro de 7 dias para criar a sua conta.

source: Your email address
pt_br: Seu endereço de email

source: A new password has been emailed to you at %s. You should be able to use it immediately; your old one has been deactivated.
pt_br: Uma nova senha foi enviado para %s. Você deve poder usá-la imediatamente; a senha antiga foi desativada

source: Your %s password
pt_br: A sua senha do %s
