<?php
return array(

	/**
	 * Menu items and titles
	 */
	'file' => "[Ƒīŀḗş ϕΐϐϵǲ]",
	'file:user' => "[%s'ş ƒīŀḗş 靐ϖ鶱ſ ϕſǈϕẛ]",
	'file:friends' => "[Ƒřīḗƞḓş' ƒīŀḗş ǈϰϑςẛϰǲϕ ΰΐς]",
	'file:all' => "[Ȧŀŀ şīŧḗ ƒīŀḗş ϱẛẛ ϱϕ衋ǅ ıϰǈ]",
	'file:edit' => "[Ḗḓīŧ ƒīŀḗ ϱ靐ϖẛ ϕẛΰſ]",
	'file:more' => "[Ḿǿřḗ ƒīŀḗş ςΰ衋ϐ ſϐẛǋ衋]",
	'file:list' => "[ŀīşŧ ṽīḗẇ ǲ衋靐ϰ ǲϕϖǅ]",
	'file:group' => "[Ɠřǿŭƥ ƒīŀḗş ϰẛẛǈ衋 衋ǋ鶱ıϐ]",
	'file:gallery' => "[ɠȧŀŀḗřẏ ṽīḗẇ ϕẛϰıϑϐſ ϰ鶱]",
	'file:gallery_list' => "[Ɠȧŀŀḗřẏ ǿř ŀīşŧ ṽīḗẇ ϕϵϑϵǅ靐ϵ 靐ΐ ǋ]",
	'file:num_files' => "[Ƞŭḿƀḗř ǿƒ ƒīŀḗş ŧǿ ḓīşƥŀȧẏ ϰẛΰǲ靐ı ΐ鶱 ϱ]",
	'file:user:gallery'=>'[Ṽīḗẇ %s ɠȧŀŀḗřẏ ſǋϐϱ ϵǲ ſǲ]',
	'file:upload' => "[Ŭƥŀǿȧḓ ȧ ƒīŀḗ ϕςΐϐǈϐ ΐ ϐ衋]",
	'file:replace' => '[Řḗƥŀȧƈḗ ƒīŀḗ ƈǿƞŧḗƞŧ (ŀḗȧṽḗ ƀŀȧƞķ ŧǿ ƞǿŧ ƈħȧƞɠḗ ƒīŀḗ) ϖ靐衋ϰϵǈſ]',
	'file:list:title' => "[%s'ş %s %s ϵǈΰΐ ϰϵ 衋ſ]",
	'file:title:friends' => "[Ƒřīḗƞḓş' ϐ衋ǲϐ靐ϵϱǲ]",

	'file:add' => '[Ŭƥŀǿȧḓ ȧ ƒīŀḗ ϐ衋靐ϖǲϰ ϱ ςΐ]',

	'file:file' => "[Ƒīŀḗ ǅǲǈΐ]",

	'file:list:list' => '[Şẇīŧƈħ ŧǿ ŧħḗ ŀīşŧ ṽīḗẇ ǋǈ衋ϖϵ靐 ς靐 ẛ]',
	'file:list:gallery' => '[Şẇīŧƈħ ŧǿ ŧħḗ ɠȧŀŀḗřẏ ṽīḗẇ ǅ衋ǈſ鶱ϑ ǈϐ ϐ]',

	'file:types' => "[Ŭƥŀǿȧḓḗḓ ƒīŀḗ ŧẏƥḗş ϵı衋ϕϕϱẛ衋 ẛϖ]",

	'file:type:' => '[Ƒīŀḗş ΰϕϐǅΰ]',
	'file:type:all' => "[Ȧŀŀ ƒīŀḗş 靐ǋı ϱϕϖſϱ]",
	'file:type:video' => "[Ṽīḓḗǿş ςıǋϰǈΰ]",
	'file:type:document' => "[Ḓǿƈŭḿḗƞŧş ςǈϵǅϖıǈſ靐]",
	'file:type:audio' => "[Ȧŭḓīǿ 鶱ϑſǲΰ]",
	'file:type:image' => "[Ƥīƈŧŭřḗş ϵǅǲǋǲϰϰ鶱]",
	'file:type:general' => "[Ɠḗƞḗřȧŀ ϰ靐ϕϰ衋ı靐]",

	'file:user:type:video' => "[%s'ş ṽīḓḗǿş ς鶱ϕϕ ςǅϖϵΰǈ]",
	'file:user:type:document' => "[%s'ş ḓǿƈŭḿḗƞŧş ǋıςǋ ϕϰΰǲς衋ǈ]",
	'file:user:type:audio' => "[%s'ş ȧŭḓīǿ ǋǋſ靐 衋ǅǅẛϐ]",
	'file:user:type:image' => "[%s'ş ƥīƈŧŭřḗş ϐǲǋΰ ςıǲǋıϐ]",
	'file:user:type:general' => "[%s'ş ɠḗƞḗřȧŀ ƒīŀḗş ǈ靐ϐı ǲϵıǲẛ]",

	'file:friends:type:video' => "[Ẏǿŭř ƒřīḗƞḓş' ṽīḓḗǿş ϕϕ靐ς ΐΐϑϑıſς]",
	'file:friends:type:document' => "[Ẏǿŭř ƒřīḗƞḓş' ḓǿƈŭḿḗƞŧş ΰ鶱ǅ衋 ϐǅẛΐıϵ]",
	'file:friends:type:audio' => "[Ẏǿŭř ƒřīḗƞḓş' ȧŭḓīǿ ϵǋ衋ǅ ıǅǅ靐ϑǋ]",
	'file:friends:type:image' => "[Ẏǿŭř ƒřīḗƞḓş' ƥīƈŧŭřḗş 靐ϐǋ衋 衋ẛẛ衋ϱſ]",
	'file:friends:type:general' => "[Ẏǿŭř ƒřīḗƞḓş' ɠḗƞḗřȧŀ ƒīŀḗş ı鶱衋ϰ ıϵǈΐς]",

	'file:widget' => "[Ƒīŀḗ ẇīḓɠḗŧ ϱϵϕΰ ϵϖϐϐ衋ΐ]",
	'file:widget:description' => "[Şħǿẇƈȧşḗ ẏǿŭř ŀȧŧḗşŧ ƒīŀḗş ϕǲϵǲϵϵǅǋ ǲΰ]",

	'groups:enablefiles' => '[Ḗƞȧƀŀḗ ɠřǿŭƥ ƒīŀḗş ǋǲϑϵẛΰ ı衋ǅ]',

	'file:delete:confirm' => "[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş ƒīŀḗ? ϖıϱ ςϐſ ǈ鶱]",

	'file:tagcloud' => "[Ŧȧɠ ƈŀǿŭḓ ıϑΐ ϑıΰıı]",

	'file:display:number' => "[Ƞŭḿƀḗř ǿƒ ƒīŀḗş ŧǿ ḓīşƥŀȧẏ 鶱ϕ靐ǲẛϖ ϕϵ ΐ]",

	'river:create:object:file' => '[%s ŭƥŀǿȧḓḗḓ ŧħḗ ƒīŀḗ %s ǅϰ ΐ鶱ϕ衋靐ϖ靐ǲ]',
	'river:comment:object:file' => '[%s ƈǿḿḿḗƞŧḗḓ ǿƞ ŧħḗ ƒīŀḗ %s ϱϰ ΐΐϵǈǲǋϑ]',

	'item:object:file' => '[Ƒīŀḗş ΐςǅǈ衋]',

	'file:notify:summary' => '[Ƞḗẇ ƒīŀḗ ƈȧŀŀḗḓ %s ϕϖǋ ϑ靐ϑ衋 ΐ]',
	'file:notify:subject' => '[Ƞḗẇ ƒīŀḗ: %s ϰǋϑ 衋ϱǅǈı]',
	'file:notify:body' =>
'[%s ŭƥŀǿȧḓḗḓ ȧ ƞḗẇ ƒīŀḗ: %s

%s

Ṽīḗẇ ȧƞḓ ƈǿḿḿḗƞŧ ǿƞ ŧħḗ ƒīŀḗ:
%s
 ΐǈ ϵǅıẛϵ鶱ǅ]',

	/**
	 * Status messages
	 */

	'file:saved' => "[Ẏǿŭř ƒīŀḗ ẇȧş şŭƈƈḗşşƒŭŀŀẏ şȧṽḗḓ. ϱΐǋϐ ς鶱衋靐]",
	'file:deleted' => "[Ẏǿŭř ƒīŀḗ ẇȧş şŭƈƈḗşşƒŭŀŀẏ ḓḗŀḗŧḗḓ. ϱΰǈẛ ϰϖ衋ΰ ϖ]",

	/**
	 * Error messages
	 */

	'file:none' => "[Ƞǿ ƒīŀḗş. 衋ΰ ϱǈϕǋϖǲ]",
	'file:uploadfailed' => "[Şǿřřẏ; ẇḗ ƈǿŭŀḓ ƞǿŧ şȧṽḗ ẏǿŭř ƒīŀḗ. ϱ衋ϑΐ鶱ǅ ǈϖ ΐ]",
	'file:downloadfailed' => "[Şǿřřẏ; ŧħīş ƒīŀḗ īş ƞǿŧ ȧṽȧīŀȧƀŀḗ ȧŧ ŧħīş ŧīḿḗ. ϐΰ鶱ẛſı ϕǈǅ]",
	'file:deletefailed' => "[Ẏǿŭř ƒīŀḗ ƈǿŭŀḓ ƞǿŧ ƀḗ ḓḗŀḗŧḗḓ ȧŧ ŧħīş ŧīḿḗ. ǲẛ鶱ı ΰϕϱϑ ϑ]",
	'file:noaccess' => "[Ẏǿŭ ḓǿ ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞş ŧǿ ƈħȧƞɠḗ ŧħīş ƒīŀḗ ſſſ ΐǈ ΐϵϐ]",
	'file:nofile' => "[Ẏǿŭ ḿŭşŧ şḗŀḗƈŧ ȧ ƒīŀḗ ıΰϖ ΐϵǈς ςϐ]",
);
