<?php
return array(

	/**
	 * Menu items and titles
	 */
	'file' => "[Ƒīŀḗş ǅΐ衋ΰς]",
	'file:user' => "[%s'ş ƒīŀḗş ϖẛ鶱ς ϵǋΰΰϑ]",
	'file:friends' => "[Ƒřīḗƞḓş' ƒīŀḗş ǈςϖϐ衋ϖϱΐ ϐϐϖ]",
	'file:all' => "[Ȧŀŀ şīŧḗ ƒīŀḗş ǈẛı ϖϐΰ靐 ϱẛς]",
	'file:edit' => "[Ḗḓīŧ ƒīŀḗ ıǋǅϕ ϐǅϐϐ]",
	'file:more' => "[Ḿǿřḗ ƒīŀḗş 靐ϐςΰ ẛıϱ鶱ϑ]",
	'file:list' => "[ŀīşŧ ṽīḗẇ ϰ靐ϱΐ ſϰẛ衋]",
	'file:group' => "[Ɠřǿŭƥ ƒīŀḗş ϖẛςǈς ǋǲϐ鶱ǅ]",
	'file:gallery' => "[ɠȧŀŀḗřẏ ṽīḗẇ ϑǈǋΰϰǈǋ 鶱衋]",
	'file:gallery_list' => "[Ɠȧŀŀḗřẏ ǿř ŀīşŧ ṽīḗẇ 靐ΐ衋ΰϕϵϕ 鶱ǲ 靐]",
	'file:num_files' => "[Ƞŭḿƀḗř ǿƒ ƒīŀḗş ŧǿ ḓīşƥŀȧẏ ςςſ鶱鶱衋 ΐΐ ϐ]",
	'file:user:gallery'=>'[Ṽīḗẇ %s ɠȧŀŀḗřẏ ǈϑ靐ẛ ϰſ ǈϐ]',
	'file:upload' => "[Ŭƥŀǿȧḓ ȧ ƒīŀḗ ıϕϰ鶱鶱ſ ǈ ǲΰ]",
	'file:replace' => '[Řḗƥŀȧƈḗ ƒīŀḗ ƈǿƞŧḗƞŧ (ŀḗȧṽḗ ƀŀȧƞķ ŧǿ ƞǿŧ ƈħȧƞɠḗ ƒīŀḗ) ẛΰǈ衋靐ΰΐ]',
	'file:list:title' => "[%s'ş %s %s 鶱ϵϖς ſΰ ϐϕ]",
	'file:title:friends' => "[Ƒřīḗƞḓş' ǲ衋ẛ鶱ϖıẛ靐]",

	'file:add' => '[Ŭƥŀǿȧḓ ȧ ƒīŀḗ ǲ鶱ſϵϖǈ ϑ ϰſ]',

	'file:file' => "[Ƒīŀḗ ΐϵ靐ſ]",

	'file:list:list' => '[Şẇīŧƈħ ŧǿ ŧħḗ ŀīşŧ ṽīḗẇ 鶱ϑſϖϰǲ ǋ衋 ϵ]',
	'file:list:gallery' => '[Şẇīŧƈħ ŧǿ ŧħḗ ɠȧŀŀḗřẏ ṽīḗẇ ΐϵϰıϕϰ ϰ靐 ϰ]',

	'file:types' => "[Ŭƥŀǿȧḓḗḓ ƒīŀḗ ŧẏƥḗş ΐſϑſΰΰΐ鶱 ϰǲ]",

	'file:type:' => '[Ƒīŀḗş 靐ϕẛϕς]',
	'file:type:all' => "[Ȧŀŀ ƒīŀḗş ϵǋϱ ϱϑẛſς]",
	'file:type:video' => "[Ṽīḓḗǿş 鶱ϑıǈǲϖ]",
	'file:type:document' => "[Ḓǿƈŭḿḗƞŧş ẛẛ鶱ϑıϕϰϕǅ]",
	'file:type:audio' => "[Ȧŭḓīǿ ϵ靐ıǋǈ]",
	'file:type:image' => "[Ƥīƈŧŭřḗş ΰǈıϵ靐ıς靐]",
	'file:type:general' => "[Ɠḗƞḗřȧŀ 鶱ΰǅϐϵϖΰ]",

	'file:user:type:video' => "[%s'ş ṽīḓḗǿş ẛϐǲǅ 衋鶱鶱ϖſϱ]",
	'file:user:type:document' => "[%s'ş ḓǿƈŭḿḗƞŧş 鶱ǋǋǈ ǲϵǋǋΐẛϕ]",
	'file:user:type:audio' => "[%s'ş ȧŭḓīǿ ǋϑǈſ ǋςϰǅǅ]",
	'file:user:type:image' => "[%s'ş ƥīƈŧŭřḗş ǋẛϐẛ ς衋ϵϐϵϱ]",
	'file:user:type:general' => "[%s'ş ɠḗƞḗřȧŀ ƒīŀḗş ϰſς鶱 衋ϐϐΐϱ]",

	'file:friends:type:video' => "[Ẏǿŭř ƒřīḗƞḓş' ṽīḓḗǿş ΰǲΰǈ ϖǈϱıǲǲΐ]",
	'file:friends:type:document' => "[Ẏǿŭř ƒřīḗƞḓş' ḓǿƈŭḿḗƞŧş 衋ϰςǲ ΐıı鶱ϕϖ]",
	'file:friends:type:audio' => "[Ẏǿŭř ƒřīḗƞḓş' ȧŭḓīǿ 衋ϑϵǲ ϖϖςϵǅς]",
	'file:friends:type:image' => "[Ẏǿŭř ƒřīḗƞḓş' ƥīƈŧŭřḗş ςǲǲϐ ǲǅΐϱſΰ]",
	'file:friends:type:general' => "[Ẏǿŭř ƒřīḗƞḓş' ɠḗƞḗřȧŀ ƒīŀḗş ϵſǈΰ ϖ衋靐ΐǲ]",

	'file:widget' => "[Ƒīŀḗ ẇīḓɠḗŧ ϑϑΐϵ ΐϱςſẛϖ]",
	'file:widget:description' => "[Şħǿẇƈȧşḗ ẏǿŭř ŀȧŧḗşŧ ƒīŀḗş 鶱ıϵẛϰẛıǅ ϰǅ]",

	'groups:enablefiles' => '[Ḗƞȧƀŀḗ ɠřǿŭƥ ƒīŀḗş ẛǲ鶱ϰǈϑ ſΰǅ]',

	'file:delete:confirm' => "[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş ƒīŀḗ? ǈϕ靐 ϐıı 衋ϱ]",

	'file:tagcloud' => "[Ŧȧɠ ƈŀǿŭḓ ϑΐϵ ϱ衋ǅǋϰ]",

	'file:display:number' => "[Ƞŭḿƀḗř ǿƒ ƒīŀḗş ŧǿ ḓīşƥŀȧẏ 衋ςſẛǋϖ ǋẛ ϖ]",

	'river:create:object:file' => '[%s ŭƥŀǿȧḓḗḓ ŧħḗ ƒīŀḗ %s ẛſ ẛ靐ǋſǋǲ衋ǅ]',
	'river:comment:object:file' => '[%s ƈǿḿḿḗƞŧḗḓ ǿƞ ŧħḗ ƒīŀḗ %s ǈǲ ǅıϰ衋ıẛΐ]',

	'item:object:file' => '[Ƒīŀḗş ϵςϐϱϖ]',

	'file:notify:summary' => '[Ƞḗẇ ƒīŀḗ ƈȧŀŀḗḓ %s 鶱ſǲ ΰΰıẛ ϰ]',
	'file:notify:subject' => '[Ƞḗẇ ƒīŀḗ: %s ϐϱ靐 ϵǅϰϱı]',
	'file:notify:body' =>
'[%s ŭƥŀǿȧḓḗḓ ȧ ƞḗẇ ƒīŀḗ: %s

%s

Ṽīḗẇ ȧƞḓ ƈǿḿḿḗƞŧ ǿƞ ŧħḗ ƒīŀḗ:
%s
 ϵǲ ϵϖΰΰǋςϑ]',

	/**
	 * Status messages
	 */

	'file:saved' => "[Ẏǿŭř ƒīŀḗ ẇȧş şŭƈƈḗşşƒŭŀŀẏ şȧṽḗḓ. ΰǈǋǈ ϐıẛ靐]",
	'file:deleted' => "[Ẏǿŭř ƒīŀḗ ẇȧş şŭƈƈḗşşƒŭŀŀẏ ḓḗŀḗŧḗḓ. ϖ靐ǲϰ ΰϰ衋ϵ ϕ]",

	/**
	 * Error messages
	 */

	'file:none' => "[Ƞǿ ƒīŀḗş. ϵΐ ſ靐ǈϖΐ鶱]",
	'file:uploadfailed' => "[Şǿřřẏ; ẇḗ ƈǿŭŀḓ ƞǿŧ şȧṽḗ ẏǿŭř ƒīŀḗ. 衋ϕϐ衋ẛǅ ΰϵ ϱ]",
	'file:downloadfailed' => "[Şǿřřẏ; ŧħīş ƒīŀḗ īş ƞǿŧ ȧṽȧīŀȧƀŀḗ ȧŧ ŧħīş ŧīḿḗ. ıϕẛϕϱẛ ıϐΰ]",
	'file:deletefailed' => "[Ẏǿŭř ƒīŀḗ ƈǿŭŀḓ ƞǿŧ ƀḗ ḓḗŀḗŧḗḓ ȧŧ ŧħīş ŧīḿḗ. ǈΰϐſ 衋ǅẛϰ 鶱]",
	'file:noaccess' => "[Ẏǿŭ ḓǿ ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞş ŧǿ ƈħȧƞɠḗ ŧħīş ƒīŀḗ ϱ鶱ς ϱ靐 ϰϵΐ]",
	'file:nofile' => "[Ẏǿŭ ḿŭşŧ şḗŀḗƈŧ ȧ ƒīŀḗ 鶱ǅϵ ǅıς鶱 ϵΰ]",
);
