<?php
return array(
	'categories' => '[Ƈȧŧḗɠǿřīḗş ϱı鶱ϵǈϖϐϵẛϵ]',
	'categories:settings' => '[Şḗŧ şīŧḗ ƈȧŧḗɠǿřīḗş 靐ǲǅ ǅςϐǅ ΐẛ]',
	'categories:explanation' => '[Ŧǿ şḗŧ şǿḿḗ ƥřḗḓḗƒīƞḗḓ şīŧḗ-ẇīḓḗ ƈȧŧḗɠǿřīḗş ŧħȧŧ ẇīŀŀ ƀḗ ŭşḗḓ ŧħřǿŭɠħǿŭŧ ẏǿŭř şẏşŧḗḿ, ḗƞŧḗř ŧħḗḿ ƀḗŀǿẇ, şḗƥȧřȧŧḗḓ ẇīŧħ ƈǿḿḿȧş. Ƈǿḿƥȧŧīƀŀḗ ŧǿǿŀş ẇīŀŀ ŧħḗƞ ḓīşƥŀȧẏ ŧħḗḿ ẇħḗƞ ŧħḗ ŭşḗř ƈřḗȧŧḗş ǿř ḗḓīŧş ƈǿƞŧḗƞŧ. ΐϵ ΰ衋衋 ǅẛıΐ 衋ϐǈıΰǈϖϵΐ鶱 ẛϕϑ靐ΐſΐϑẛ 鶱靐靐ϖϰ]',
	'categories:save:success' => '[Şīŧḗ ƈȧŧḗɠǿřīḗş ẇḗřḗ şŭƈƈḗşşƒŭŀŀẏ şȧṽḗḓ. ϐ衋ǈς ϖǈǅǋ衋]',
	'categories:results' => "[Řḗşŭŀŧş ƒǿř ŧħḗ şīŧḗ ƈȧŧḗɠǿřẏ: %s 靐ςϐ靐ǈϑς ſϰ]",
	'categories:on_activate_reminder' => "[Şīŧḗ-ẇīḓḗ Ƈȧŧḗɠǿřīḗş ẇǿƞ'ŧ ẇǿřķ ŭƞŧīŀ ẏǿŭ ȧḓḓ ƈȧŧḗɠǿřīḗş. <a href=\"%s\">Ȧḓḓ ƈȧŧḗɠǿřīḗş ƞǿẇ.</a> ǈςǅ靐ẛϖǲ衋ſ ϖǲǋϵϕ]",
);