<?php
return array(
	'categories' => '[Ƈȧŧḗɠǿřīḗş ΰſΐςǋǋ衋鶱ΐϐ]',
	'categories:settings' => '[Şḗŧ şīŧḗ ƈȧŧḗɠǿřīḗş ǅϐϵ ǈϖǋϖ ϱς]',
	'categories:explanation' => '[Ŧǿ şḗŧ şǿḿḗ ƥřḗḓḗƒīƞḗḓ şīŧḗ-ẇīḓḗ ƈȧŧḗɠǿřīḗş ŧħȧŧ ẇīŀŀ ƀḗ ŭşḗḓ ŧħřǿŭɠħǿŭŧ ẏǿŭř şẏşŧḗḿ, ḗƞŧḗř ŧħḗḿ ƀḗŀǿẇ, şḗƥȧřȧŧḗḓ ẇīŧħ ƈǿḿḿȧş. Ƈǿḿƥȧŧīƀŀḗ ŧǿǿŀş ẇīŀŀ ŧħḗƞ ḓīşƥŀȧẏ ŧħḗḿ ẇħḗƞ ŧħḗ ŭşḗř ƈřḗȧŧḗş ǿř ḗḓīŧş ƈǿƞŧḗƞŧ. 衋靐 ϐΐǋ ϑϑΐϱ ΐϵ衋ΐǈ鶱ϕςςϰ ϵϑΰſϖΐıς靐 衋ǈ衋ϐǈ]',
	'categories:save:success' => '[Şīŧḗ ƈȧŧḗɠǿřīḗş ẇḗřḗ şŭƈƈḗşşƒŭŀŀẏ şȧṽḗḓ. ſΐǈϖ ϕǲ衋ı鶱]',
	'categories:results' => "[Řḗşŭŀŧş ƒǿř ŧħḗ şīŧḗ ƈȧŧḗɠǿřẏ: %s ϖ鶱ϖϕ衋衋ẛ ǲΰ]",
	'categories:on_activate_reminder' => "[Şīŧḗ-ẇīḓḗ Ƈȧŧḗɠǿřīḗş ẇǿƞ'ŧ ẇǿřķ ŭƞŧīŀ ẏǿŭ ȧḓḓ ƈȧŧḗɠǿřīḗş. <a href=\"%s\">Ȧḓḓ ƈȧŧḗɠǿřīḗş ƞǿẇ.</a> ǈϱΰϱẛ靐ϰǋǋ ςϵǅϵϐ]",
);