<?php
return array(
	'install:title' => '[Ḗŀɠɠ Īƞşŧȧŀŀ ǲϕϕſ ςϐϱϑſ]',
	'install:welcome' => '[Ẇḗŀƈǿḿḗ ϐϑ衋ǲϕ衋ϰ]',
	'install:requirements' => '[Řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ ΰϵϱ鶱靐ǲςΐϱǋ]',
	'install:database' => '[Ḓȧŧȧƀȧşḗ īƞşŧȧŀŀȧŧīǿƞ ϵϰẛΐǅıϐẛ ϑ]',
	'install:settings' => '[Ƈǿƞƒīɠŭřḗ şīŧḗ ǲϑ衋衋ϱςϐΐ靐 ẛϰ]',
	'install:admin' => '[Ƈřḗȧŧḗ ȧḓḿīƞ ȧƈƈǿŭƞŧ ϕϰııϱ衋 ǋǅϵϑς]',
	'install:complete' => '[Ƒīƞīşħḗḓ ςϵϑϐ鶱衋衋ϰ]',

	'install:next' => '[Ƞḗẋŧ ςıſϕ]',
	'install:refresh' => '[Řḗƒřḗşħ ϱſ靐ϕǲϵς]',

	'install:welcome:instructions' => "[Īƞşŧȧŀŀīƞɠ Ḗŀɠɠ ħȧş 6 şīḿƥŀḗ şŧḗƥş ȧƞḓ řḗȧḓīƞɠ ŧħīş ẇḗŀƈǿḿḗ īş ŧħḗ ƒīřşŧ ǿƞḗ!

Īƒ ẏǿŭ ħȧṽḗƞ'ŧ ȧŀřḗȧḓẏ, řḗȧḓ ŧħřǿŭɠħ ŧħḗ īƞşŧȧŀŀȧŧīǿƞ īƞşŧřŭƈŧīǿƞş īƞƈŀŭḓḗḓ ẇīŧħ Ḗŀɠɠ (ǿř ƈŀīƈķ ŧħḗ īƞşŧřŭƈŧīǿƞş ŀīƞķ ȧŧ ŧħḗ ƀǿŧŧǿḿ ǿƒ ŧħḗ ƥȧɠḗ).

Īƒ ẏǿŭ ȧřḗ řḗȧḓẏ ŧǿ ƥřǿƈḗḗḓ, ƈŀīƈķ ŧħḗ Ƞḗẋŧ ƀŭŧŧǿƞ. ϱǋ鶱ϱſϵϕςǅſ ΐΰϰǲ ǋıϐ ϖ ϵııϵǲϐ ǈϕǲΐǋ ϰǈς 衋ΰ靐ſſ鶱ſ ϖ靐ϰı]",
	'install:requirements:instructions:success' => "[Ẏǿŭř şḗřṽḗř ƥȧşşḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧ ƈħḗƈķş. ẛϐǋǈ ǈẛǈſ鶱]",
	'install:requirements:instructions:failure' => "[Ẏǿŭř şḗřṽḗř ƒȧīŀḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ. Ȧƒŧḗř ẏǿŭ ħȧṽḗ ƒīẋḗḓ ŧħḗ ƀḗŀǿẇ īşşŭḗş, řḗƒřḗşħ ŧħīş ƥȧɠḗ. Ƈħḗƈķ ŧħḗ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķş ȧŧ ŧħḗ ƀǿŧŧǿḿ ǿƒ ŧħīş ƥȧɠḗ īƒ ẏǿŭ ƞḗḗḓ ƒŭřŧħḗř ȧşşīşŧȧƞƈḗ. ſſΐẛ ϵςΐǈ鶱ϕ ϑ靐ſ鶱鶱ΐ ǲϖı ϕϕǋǈϖϕ鶱衋ǲΰ靐ΰ]",
	'install:requirements:instructions:warning' => "[Ẏǿŭř şḗřṽḗř ƥȧşşḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ, ƀŭŧ ŧħḗřḗ īş ȧŧ ŀḗȧşŧ ǿƞḗ ẇȧřƞīƞɠ. Ẇḗ řḗƈǿḿḿḗƞḓ ŧħȧŧ ẏǿŭ ƈħḗƈķ ŧħḗ īƞşŧȧŀŀ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ƥȧɠḗ ƒǿř ḿǿřḗ ḓḗŧȧīŀş. ẛ衋ΐǋ ΐΰǋǲςϱ ϐΐıΰϱǋ ΐϐϕ ςϵſϕǋ]",

	'install:require:php' => '[ƤĦƤ ǲǅǈ]',
	'install:require:rewrite' => '[Ẇḗƀ şḗřṽḗř ǲ衋ǅ ϱǅϕϵϱǋ]',
	'install:require:settings' => '[Şḗŧŧīƞɠş ƒīŀḗ ϱſǅϖϵςϖϱ 衋ς]',
	'install:require:database' => '[Ḓȧŧȧƀȧşḗ 鶱ϵϖϱſ鶱ẛϑ]',

	'install:check:root' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ ŧħḗ řǿǿŧ ḓīřḗƈŧǿřẏ ǿƒ Ḗŀɠɠ. Ẏǿŭ ħȧṽḗ ŧẇǿ ƈħǿīƈḗş:

		1. Ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ řǿǿŧ ḓīřḗƈŧǿřẏ

		2. Ƈǿƥẏ ŧħḗ ƒīŀḗ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş 鶱ϖ衋ϑ ǋ衋ς ſ靐靐ǅẛǈ ςǈǋǈ ǅıϖ ıϱϐΐ ςǅǈϖſıϱ鶱ıǅ]',

	'install:check:php:version' => '[Ḗŀɠɠ řḗɋŭīřḗş ƤĦƤ %s ǿř ȧƀǿṽḗ. Ŧħīş şḗřṽḗř īş ŭşīƞɠ ṽḗřşīǿƞ %s. ϱǲϰǲ ϑ鶱靐ϑ]',
	'install:check:php:extension' => '[Ḗŀɠɠ řḗɋŭīřḗş ŧħḗ ƤĦƤ ḗẋŧḗƞşīǿƞ %s. ǈϵǈϕ ϰϐıǅẛϖ]',
	'install:check:php:extension:recommend' => '[Īŧ īş řḗƈǿḿḿḗƞḓḗḓ ŧħȧŧ ŧħḗ ƤĦƤ ḗẋŧḗƞşīǿƞ %s īş īƞşŧȧŀŀḗḓ. ΐǅ ǋϖ ϰΐ]',
	'install:check:php:open_basedir' => '[Ŧħḗ ǿƥḗƞ_ƀȧşḗḓīř ƤĦƤ ḓīřḗƈŧīṽḗ ḿȧẏ ƥřḗṽḗƞŧ Ḗŀɠɠ ƒřǿḿ şȧṽīƞɠ ƒīŀḗş ŧǿ īŧş ḓȧŧȧ ḓīřḗƈŧǿřẏ. 靐ſǅ ſǲΰΐ鶱ſϕǲ衋ſ]',
	'install:check:php:safe_mode' => '[Řŭƞƞīƞɠ ƤĦƤ īƞ şȧƒḗ ḿǿḓḗ īş ƞǿŧ řḗƈǿḿḿḗƞḗḓ ȧƞḓ ḿȧẏ ƈȧŭşḗ ƥřǿƀŀḗḿş ẇīŧħ Ḗŀɠɠ. ϱΰǈςϱΰ鶱 ϐϕς]',
	'install:check:php:arg_separator' => '[ȧřɠ_şḗƥȧřȧŧǿř.ǿŭŧƥŭŧ ḿŭşŧ ƀḗ & ƒǿř Ḗŀɠɠ ŧǿ ẇǿřķ ȧƞḓ ẏǿŭř şḗřṽḗř\'ş ṽȧŀŭḗ īş %s ϕ靐ϵǈϵϰ靐ǋΰϐϵǅ]',
	'install:check:php:register_globals' => '[Řḗɠīşŧḗř ɠŀǿƀȧŀş ḿŭşŧ ƀḗ ŧŭřƞḗḓ ǿƒƒ. ǅ鶱靐鶱ΐǈϕǅ ϱ]',
	'install:check:php:session.auto_start' => "[şḗşşīǿƞ.ȧŭŧǿ_şŧȧřŧ ḿŭşŧ ƀḗ ǿƒƒ ƒǿř Ḗŀɠɠ ŧǿ ẇǿřķ. Ḗīŧħḗř ƈħȧƞɠḗ ŧħḗ ƈǿƞƒīɠŭřȧŧīǿƞ ǿƒ ẏǿŭř şḗřṽḗř ǿř ȧḓḓ ŧħīş ḓīřḗƈŧīṽḗ ŧǿ Ḗŀɠɠ'ş .ħŧȧƈƈḗşş ƒīŀḗ. ǅ衋ǅſϰΐǋϖςǋ鶱ǋϰǋǈϑΐϐ ϵΐǋǲ ı]",

	'install:check:enginedir' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ŧħḗ şḗŧŧīƞɠş.ƥħƥ ƒīŀḗ īƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ. Ẏǿŭ ħȧṽḗ ŧẇǿ ƈħǿīƈḗş:

		1. Ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ

		2. Ƈǿƥẏ ŧħḗ ƒīŀḗ şḗŧŧīƞɠş.ḗẋȧḿƥŀḗ.ƥħƥ ŧǿ şḗŧŧīƞɠş.ƥħƥ ȧƞḓ ƒǿŀŀǿẇ ŧħḗ īƞşŧřŭƈŧīǿƞş īƞ īŧ ƒǿř şḗŧŧīƞɠ ẏǿŭř ḓȧŧȧƀȧşḗ ƥȧřȧḿḗŧḗřş. ϕϑΰſ 衋ϑ鶱 ΰǋΐϐǋΐ 鶱ſϵϰ ϰǋϑ ϐ衋ϕ衋 ǅϵϱſϑΰſϱıΰ 衋ϐ 靐ϑϵ鶱ıǈ ΰ衋ϑ ǋı]',
	'install:check:readsettings' => '[Ȧ şḗŧŧīƞɠş ƒīŀḗ ḗẋīşŧş īƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ, ƀŭŧ ŧħḗ ẇḗƀ şḗřṽḗř ƈȧƞƞǿŧ řḗȧḓ īŧ. Ẏǿŭ ƈȧƞ ḓḗŀḗŧḗ ŧħḗ ƒīŀḗ ǿř ƈħȧƞɠḗ ŧħḗ řḗȧḓ ƥḗřḿīşşīǿƞş ǿƞ īŧ. ϑ ϰϕẛϰǲıǲǅ ϰ衋ſϕ 靐ϵΰẛ衋ẛ ϑ衋]',

	'install:check:php:success' => "[Ẏǿŭř şḗřṽḗř'ş ƤĦƤ şȧŧīşƒīḗş ȧŀŀ ǿƒ Ḗŀɠɠ'ş řḗɋŭīřḗḿḗƞŧş. ϰςǲǋ ϖςϵ]",
	'install:check:rewrite:success' => '[Ŧħḗ ŧḗşŧ ǿƒ ŧħḗ řḗẇřīŧḗ řŭŀḗş ẇȧş şŭƈƈḗşşƒŭŀ. ϑẛ鶱 ϐ鶱ΰǅ 靐]',
	'install:check:database' => '[Ŧħḗ ḓȧŧȧƀȧşḗ řḗɋŭīřḗḿḗƞŧş ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ Ḗŀɠɠ ŀǿȧḓş īŧş ḓȧŧȧƀȧşḗ. 衋ϰϱ ſϱϕ衋ϕ衋]',

	'install:database:instructions' => "[Īƒ ẏǿŭ ħȧṽḗƞ'ŧ ȧŀřḗȧḓẏ ƈřḗȧŧḗḓ ȧ ḓȧŧȧƀȧşḗ ƒǿř Ḗŀɠɠ, ḓǿ ŧħȧŧ ƞǿẇ. Ŧħḗƞ ƒīŀŀ īƞ ŧħḗ ṽȧŀŭḗş ƀḗŀǿẇ ŧǿ īƞīŧīȧŀīzḗ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ. ςϵ ǋϵϵ ϐϑǲ鶱ǲϵ靐 ϑ衋ǋϖϐϰǲ]",
	'install:database:error' => '[Ŧħḗřḗ ẇȧş ȧƞ ḗřřǿř ƈřḗȧŧīƞɠ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ ȧƞḓ īƞşŧȧŀŀȧŧīǿƞ ƈȧƞƞǿŧ ƈǿƞŧīƞŭḗ. Řḗṽīḗẇ ŧħḗ ḿḗşşȧɠḗ ȧƀǿṽḗ ȧƞḓ ƈǿřřḗƈŧ ȧƞẏ ƥřǿƀŀḗḿş. Īƒ ẏǿŭ ƞḗḗḓ ḿǿřḗ ħḗŀƥ, ṽīşīŧ ŧħḗ Īƞşŧȧŀŀ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķ ƀḗŀǿẇ ǿř ƥǿşŧ ŧǿ ŧħḗ Ḗŀɠɠ ƈǿḿḿŭƞīŧẏ ƒǿřŭḿş. ẛſΐΐΐ ǅıǈ ϖϐ ΰ靐ϱϕ衋 ςϐϑϑϰǋϑϰ 鶱ΐς ẛϵſϕ ǈϖſıǈı鶱]',

	'install:database:label:dbuser' =>  '[Ḓȧŧȧƀȧşḗ Ŭşḗřƞȧḿḗ ςςǅϱϵϵϑΰ 靐衋ς]',
	'install:database:label:dbpassword' => '[Ḓȧŧȧƀȧşḗ Ƥȧşşẇǿřḓ ıϕǲϖΰϑǅǈ ϕϵϰ]',
	'install:database:label:dbname' => '[Ḓȧŧȧƀȧşḗ Ƞȧḿḗ ςǅϐ靐ΐ衋ſǈ ϑϕ]',
	'install:database:label:dbhost' => '[Ḓȧŧȧƀȧşḗ Ħǿşŧ 靐ϰǈ衋ſϑϐΐ ϵΰ]',
	'install:database:label:dbprefix' => '[Ḓȧŧȧƀȧşḗ Ŧȧƀŀḗ Ƥřḗƒīẋ ǲ靐ẛǅϵǲΰϰ ϵ]',

	'install:database:help:dbuser' => '[Ŭşḗř ŧħȧŧ ħȧş ƒŭŀŀ ƥřīṽīŀḗɠḗş ŧǿ ŧħḗ ḾẏŞɊĿ ḓȧŧȧƀȧşḗ ŧħȧŧ ẏǿŭ ƈřḗȧŧḗḓ ƒǿř Ḗŀɠɠ ſϵϵϰ ϐıϕϵ ǈǋ]',
	'install:database:help:dbpassword' => '[Ƥȧşşẇǿřḓ ƒǿř ŧħḗ ȧƀǿṽḗ ḓȧŧȧƀȧşḗ ŭşḗř ȧƈƈǿŭƞŧ ǈϵ鶱ΐ衋ǲǈǲ ǈ鶱]',
	'install:database:help:dbname' => '[Ƞȧḿḗ ǿƒ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ 衋ΐΐς ϑϐ ϖ靐靐]',
	'install:database:help:dbhost' => '[Ħǿşŧƞȧḿḗ ǿƒ ŧħḗ ḾẏŞɊĿ şḗřṽḗř (ŭşŭȧŀŀẏ ŀǿƈȧŀħǿşŧ) ſẛıǋϐſǈſ ı]',
	'install:database:help:dbprefix' => "[Ŧħḗ ƥřḗƒīẋ ɠīṽḗƞ ŧǿ ȧŀŀ ǿƒ Ḗŀɠɠ'ş ŧȧƀŀḗş (ŭşŭȧŀŀẏ ḗŀɠɠ_) ΐ衋ς ǲǅ衋ϱ]",

	'install:settings:instructions' => '[Ẇḗ ƞḗḗḓ şǿḿḗ īƞƒǿřḿȧŧīǿƞ ȧƀǿŭŧ ŧħḗ şīŧḗ ȧş ẇḗ ƈǿƞƒīɠŭřḗ Ḗŀɠɠ. Īƒ ẏǿŭ ħȧṽḗƞ\'ŧ <a href="http://docs.elgg.org/wiki/Data_directory" target="_blank">ƈřḗȧŧḗḓ ȧ ḓȧŧȧ ḓīřḗƈŧǿřẏ</a> ƒǿř Ḗŀɠɠ, ẏǿŭ ƞḗḗḓ ŧǿ ḓǿ şǿ ƞǿẇ. ϵϵ 靐ςǅǈ ſ鶱ǅϰ ςǲϕΐΐϖı靐ΰϰſ ϖΐϑς衋 鶱靐衋 ϰϖϐ]',

	'install:settings:label:sitename' => '[Şīŧḗ Ƞȧḿḗ 衋ϑ靐ǋ ϱ鶱ıΐ]',
	'install:settings:label:siteemail' => '[Şīŧḗ Ḗḿȧīŀ Ȧḓḓřḗşş ϐ靐ϐϐ ǲΐϵϑ衋]',
	'install:settings:label:wwwroot' => '[Şīŧḗ ŬŘĿ ǈϱΰϰ ϐς衋]',
	'install:settings:label:path' => '[Ḗŀɠɠ Īƞşŧȧŀŀ Ḓīřḗƈŧǿřẏ ſϖΐ鶱 ſǋẛ衋ϰϐ]',
	'install:settings:label:dataroot' => '[Ḓȧŧȧ Ḓīřḗƈŧǿřẏ ϐıϰϖ ıϐǈſϑϐſ]',
	'install:settings:label:language' => '[Şīŧḗ Ŀȧƞɠŭȧɠḗ ϕ衋靐ΐ ǋſΰΐϰς]',
	'install:settings:label:siteaccess' => '[Ḓḗƒȧŭŀŧ Şīŧḗ Ȧƈƈḗşş ςǋǈ靐鶱ϖǲ ΐ靐ΐ]',
	'install:label:combo:dataroot' => '[Ḗŀɠɠ ƈřḗȧŧḗş ḓȧŧȧ ḓīřḗƈŧǿřẏ ǲıϰſ ϱıſςẛ]',

	'install:settings:help:sitename' => '[Ŧħḗ ƞȧḿḗ ǿƒ ẏǿŭř ƞḗẇ Ḗŀɠɠ şīŧḗ ϑǅς ϕΰẛ鶱 ı]',
	'install:settings:help:siteemail' => '[Ḗḿȧīŀ ȧḓḓřḗşş ŭşḗḓ ƀẏ Ḗŀɠɠ ƒǿř ƈǿḿḿŭƞīƈȧŧīǿƞ ẇīŧħ ŭşḗřş 衋ςϰǲϑ ϑϖ]',
	'install:settings:help:wwwroot' => '[Ŧħḗ ȧḓḓřḗşş ǿƒ ŧħḗ şīŧḗ (Ḗŀɠɠ ŭşŭȧŀŀẏ ɠŭḗşşḗş ŧħīş ƈǿřřḗƈŧŀẏ) ϰϖΐ ϑςǈϐſ]',
	'install:settings:help:path' => '[Ŧħḗ ḓīřḗƈŧǿřẏ ẇħḗřḗ ẏǿŭ ƥŭŧ ŧħḗ Ḗŀɠɠ ƈǿḓḗ (Ḗŀɠɠ ŭşŭȧŀŀẏ ɠŭḗşşḗş ŧħīş ƈǿřřḗƈŧŀẏ) ııς ǋ鶱ϕıΰ鶱ǲϰ]',
	'install:settings:help:dataroot' => '[Ŧħḗ ḓīřḗƈŧǿřẏ ŧħȧŧ ẏǿŭ ƈřḗȧŧḗḓ ƒǿř Ḗŀɠɠ ŧǿ şȧṽḗ ƒīŀḗş (ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħīş ḓīřḗƈŧǿřẏ ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ ẏǿŭ ƈŀīƈķ Ƞḗẋŧ). Īŧ ḿŭşŧ ƀḗ ȧƞ ȧƀşǿŀŭŧḗ ƥȧŧħ. 鶱ΰς 衋ẛϰ鶱ϕǅϖϰǲ ϐſ鶱ΐ ǲıϱ ϵ衋ϕς]',
	'install:settings:help:dataroot:apache' => '[Ẏǿŭ ħȧṽḗ ŧħḗ ǿƥŧīǿƞ ǿƒ Ḗŀɠɠ ƈřḗȧŧīƞɠ ŧħḗ ḓȧŧȧ ḓīřḗƈŧǿřẏ ǿř ḗƞŧḗřīƞɠ ŧħḗ ḓīřḗƈŧǿřẏ ŧħȧŧ ẏǿŭ ȧŀřḗȧḓẏ ƈřḗȧŧḗḓ ƒǿř şŧǿřīƞɠ ŭşḗř ƒīŀḗş (ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħīş ḓīřḗƈŧǿřẏ ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ ẏǿŭ ƈŀīƈķ Ƞḗẋŧ) ϰΰϖ ϕϖẛϵ ǈſϰ ǲϑǅΰΰϕ ϑǲ 衋ſıϑ ϖϑϐϵςϐϖǋ]',
	'install:settings:help:language' => '[Ŧħḗ ḓḗƒȧŭŀŧ ŀȧƞɠŭȧɠḗ ƒǿř ŧħḗ şīŧḗ ϖǲϰ ϐϑϵſϐǅ]',
	'install:settings:help:siteaccess' => '[Ŧħḗ ḓḗƒȧŭŀŧ ȧƈƈḗşş ŀḗṽḗŀ ƒǿř ƞḗẇ ŭşḗř ƈřḗȧŧḗḓ ƈǿƞŧḗƞŧ ΰΐϖ 鶱ϱǋ]',

	'install:admin:instructions' => "[Īŧ īş ƞǿẇ ŧīḿḗ ŧǿ ƈřḗȧŧḗ ȧƞ ȧḓḿīƞīşŧřȧŧǿř'ş ȧƈƈǿŭƞŧ. 鶱ǲ ſϑ ǈ]",

	'install:admin:label:displayname' => '[Ḓīşƥŀȧẏ Ƞȧḿḗ ϖςſϰǈǲϰ ϑ鶱]',
	'install:admin:label:email' => '[Ḗḿȧīŀ Ȧḓḓřḗşş ϑΐǲẛΐ ǅϰΰıǲ]',
	'install:admin:label:username' => '[Ŭşḗřƞȧḿḗ ǈϐẛſǲϖǲϰ]',
	'install:admin:label:password1' => '[Ƥȧşşẇǿřḓ ϖϱϑϰǈϱ鶱鶱]',
	'install:admin:label:password2' => '[Ƥȧşşẇǿřḓ Ȧɠȧīƞ 衋ϰϱϑΰ衋ϵϵ 靐ẛ鶱]',

	'install:admin:help:displayname' => '[Ŧħḗ ƞȧḿḗ ŧħȧŧ īş ḓīşƥŀȧẏḗḓ ǿƞ ŧħḗ şīŧḗ ƒǿř ŧħīş ȧƈƈǿŭƞŧ ǅẛı ıΐϕǈ]',
	'install:admin:help:email' => '',
	'install:admin:help:username' => '[Ȧƈƈǿŭƞŧ ŭşḗřƞȧḿḗ ŭşḗḓ ƒǿř ŀǿɠɠīƞɠ īƞ ǅϑ靐ǲſϑǲ ϱΰ]',
	'install:admin:help:password1' => "[Ȧƈƈǿŭƞŧ ƥȧşşẇǿřḓ ḿŭşŧ ƀḗ ȧŧ ŀḗȧşŧ %u ƈħȧřȧƈŧḗřş ŀǿƞɠ ϵ靐ϵϰ衋ǋǅ]",
	'install:admin:help:password2' => '[Řḗŧẏƥḗ ƥȧşşẇǿřḓ ŧǿ ƈǿƞƒīřḿ ıǅϱıǈϱ ςΰϖϑ]',

	'install:admin:password:mismatch' => '[Ƥȧşşẇǿřḓ ḿŭşŧ ḿȧŧƈħ. ϱıςǲǲϖıǲ ΐϱϵ]',
	'install:admin:password:empty' => '[Ƥȧşşẇǿřḓ ƈȧƞƞǿŧ ƀḗ ḗḿƥŧẏ. ẛΐ衋ıǈϰΐϕ ΐϑ]',
	'install:admin:password:tooshort' => '[Ẏǿŭř ƥȧşşẇǿřḓ ẇȧş ŧǿǿ şħǿřŧ ſΐϑǈ ς靐ϱΰı]',
	'install:admin:cannot_create' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ȧƞ ȧḓḿīƞ ȧƈƈǿŭƞŧ. ǈϖΐǅϖ衋 ΐϐ]',

	'install:complete:instructions' => '[Ẏǿŭř Ḗŀɠɠ şīŧḗ īş ƞǿẇ řḗȧḓẏ ŧǿ ƀḗ ŭşḗḓ. Ƈŀīƈķ ŧħḗ ƀŭŧŧǿƞ ƀḗŀǿẇ ŧǿ ƀḗ ŧȧķḗƞ ŧǿ ẏǿŭř şīŧḗ. ǈǲẛ靐 ϵϐϵſ ǅϐıǋ]',
	'install:complete:gotosite' => '[Ɠǿ ŧǿ şīŧḗ 鶱ſ ϰǋ ΐϱϖǈ]',

	'InstallationException:UnknownStep' => '[%s īş ȧƞ ŭƞķƞǿẇƞ īƞşŧȧŀŀȧŧīǿƞ şŧḗƥ. ϕϕ ϐǲ ǈ靐 ϖ鶱]',
	'InstallationException:MissingLibrary' => '[Ƈǿŭŀḓ ƞǿŧ ŀǿȧḓ %s ſǲϕϱϕ ϰ衋ς ΰı]',
	'InstallationException:CannotLoadSettings' => '[Ḗŀɠɠ ƈǿŭŀḓ ƞǿŧ ŀǿȧḓ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ. Īŧ ḓǿḗş ƞǿŧ ḗẋīşŧ ǿř ŧħḗřḗ īş ȧ ƒīŀḗ ƥḗřḿīşşīǿƞş īşşŭḗ. ǅǲϵΐ ǲϑǈϰς ſΐϑ]',

	'install:success:database' => '[Ḓȧŧȧƀȧşḗ ħȧş ƀḗḗƞ īƞşŧȧŀŀḗḓ. ϕ鶱ϑϑǋϕΐϑ 鶱ı]',
	'install:success:settings' => '[Şīŧḗ şḗŧŧīƞɠş ħȧṽḗ ƀḗḗƞ şȧṽḗḓ. ǲ衋ΐſ ςϕϵǋ鶱]',
	'install:success:admin' => '[Ȧḓḿīƞ ȧƈƈǿŭƞŧ ħȧş ƀḗḗƞ ƈřḗȧŧḗḓ. ΰϑ衋鶱鶱 ΰϵ靐ǋẛ]',

	'install:error:htaccess' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ȧƞ .ħŧȧƈƈḗşş ϵϑςςϰı ǈϵ ϱ]',
	'install:error:settings' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ ΐϖ靐衋ΐſ ϑϱ]',
	'install:error:databasesettings' => '[Ŭƞȧƀŀḗ ŧǿ ƈǿƞƞḗƈŧ ŧǿ ŧħḗ ḓȧŧȧƀȧşḗ ẇīŧħ ŧħḗşḗ şḗŧŧīƞɠş. ΐſǋϕϰı]',
	'install:error:database_prefix' => '[Īƞṽȧŀīḓ ƈħȧřȧƈŧḗřş īƞ ḓȧŧȧƀȧşḗ ƥřḗƒīẋ ςſϰϰ衋ϖǅ ǋϱ]',
	'install:error:oldmysql' => '[ḾẏŞɊĿ ḿŭşŧ ƀḗ ṽḗřşīǿƞ 5.0 ǿř ȧƀǿṽḗ. Ẏǿŭř şḗřṽḗř īş ŭşīƞɠ %s. ıςǈǈǋ 靐ǲẛ]',
	'install:error:nodatabase' => '[Ŭƞȧƀŀḗ ŧǿ ŭşḗ ḓȧŧȧƀȧşḗ %s. Īŧ ḿȧẏ ƞǿŧ ḗẋīşŧ. ǋı鶱衋ϖς ϑϑ ǋ]',
	'install:error:cannotloadtables' => '[Ƈȧƞƞǿŧ ŀǿȧḓ ŧħḗ ḓȧŧȧƀȧşḗ ŧȧƀŀḗş ſſϑǋǅǋ ΰ靐ϐſ]',
	'install:error:tables_exist' => '[Ŧħḗřḗ ȧřḗ ȧŀřḗȧḓẏ Ḗŀɠɠ ŧȧƀŀḗş īƞ ŧħḗ ḓȧŧȧƀȧşḗ. Ẏǿŭ ƞḗḗḓ ŧǿ ḗīŧħḗř ḓřǿƥ ŧħǿşḗ ŧȧƀŀḗş ǿř řḗşŧȧřŧ ŧħḗ īƞşŧȧŀŀḗř ȧƞḓ ẇḗ ẇīŀŀ ȧŧŧḗḿƥŧ ŧǿ ŭşḗ ŧħḗḿ. Ŧǿ řḗşŧȧřŧ ŧħḗ īƞşŧȧŀŀḗř, řḗḿǿṽḗ \'?şŧḗƥ=ḓȧŧȧƀȧşḗ\' ƒřǿḿ ŧħḗ ŬŘĿ īƞ ẏǿŭř ƀřǿẇşḗř\'ş ȧḓḓřḗşş ƀȧř ȧƞḓ ƥřḗşş Ḗƞŧḗř. ǲϱϰϐǅ ΰıΐ ǲϕẛıΐıς ǲǲǈǈ 衋ϖϱϵϖϱ ǅϱ 靐ǈϱ 靐ϕϐǅıϕϵϱ鶱]',
	'install:error:readsettingsphp' => '[Ŭƞȧƀŀḗ ŧǿ řḗȧḓ ḗƞɠīƞḗ/şḗŧŧīƞɠş.ḗẋȧḿƥŀḗ.ƥħƥ ϰϰǲΰǈΐ ςϰ]',
	'install:error:writesettingphp' => '[Ŭƞȧƀŀḗ ŧǿ ẇřīŧḗ ḗƞɠīƞḗ/şḗŧŧīƞɠş.ƥħƥ ΰẛǈϕǅ靐 ϱı ſ]',
	'install:error:requiredfield' => '[%s īş řḗɋŭīřḗḓ 衋ǅ ẛǈ ǲς靐ẛ鶱ẛ]',
	'install:error:relative_path' => '[Ẇḗ ḓǿƞ\'ŧ ŧħīƞķ "%s" īş ȧƞ ȧƀşǿŀŭŧḗ ƥȧŧħ ƒǿř ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ ϕΰ ϐı鶱ſſ]',
	'install:error:datadirectoryexists' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s ḓǿḗş ƞǿŧ ḗẋīşŧ. 衋ǈſϱ ǲϵΰϕ ϰ]',
	'install:error:writedatadirectory' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s īş ƞǿŧ ẇřīŧȧƀŀḗ ƀẏ ŧħḗ ẇḗƀ şḗřṽḗř. ϖϰ靐ϖ ςǈϵ]',
	'install:error:locationdatadirectory' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s ḿŭşŧ ƀḗ ǿŭŧşīḓḗ ǿƒ ẏǿŭř īƞşŧȧŀŀ ƥȧŧħ ƒǿř şḗƈŭřīŧẏ. ςϑıϱ ẛǈϱǋ ϰ]',
	'install:error:emailaddress' => '[%s īş ƞǿŧ ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ϵϑ ϱΐ ϰϖϰ 靐]',
	'install:error:createsite' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ŧħḗ şīŧḗ. ſıϐϰϰ鶱 ſϰ ǈ]',
	'install:error:savesitesettings' => '[Ŭƞȧƀŀḗ ŧǿ şȧṽḗ şīŧḗ şḗŧŧīƞɠş ϵΐΐϐǈǈ ıϑ ǈ]',
	'install:error:loadadmin' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿȧḓ ȧḓḿīƞ ŭşḗř. ϵ鶱ǲ鶱衋ΰ ǲΐ ǲ]',
	'install:error:adminaccess' => '[Ŭƞȧƀŀḗ ŧǿ ɠīṽḗ ƞḗẇ ŭşḗř ȧƈƈǿŭƞŧ ȧḓḿīƞ ƥřīṽīŀḗɠḗş. ǋϰϖǈϰǅ ſϐ]',
	'install:error:adminlogin' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿɠīƞ ŧħḗ ƞḗẇ ȧḓḿīƞ ŭşḗř ȧŭŧǿḿȧŧīƈȧŀŀẏ. ǅẛΐςϑı ſς]',
	'install:error:rewrite:apache' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ȧƥȧƈħḗ ẇḗƀ şḗřṽḗř. ΰǋ 靐ϰϰǈ]',
	'install:error:rewrite:nginx' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ƞɠīƞẋ ẇḗƀ şḗřṽḗř. ϑΐ ϖǈıǋ]',
	'install:error:rewrite:lighttpd' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ŀīɠħŧŧƥḓ ẇḗƀ şḗřṽḗř. ǅϕ ςΐϰϵı]',
	'install:error:rewrite:iis' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ ĪĪŞ ẇḗƀ şḗřṽḗř. 鶱ΐ ΐǲϰϰ]',
	'install:error:rewrite:allowoverride' => "[Ŧħḗ řḗẇřīŧḗ ŧḗşŧ ƒȧīŀḗḓ ȧƞḓ ŧħḗ ḿǿşŧ ŀīķḗŀẏ ƈȧŭşḗ īş ŧħȧŧ ȦŀŀǿẇǾṽḗřřīḓḗ īş ƞǿŧ şḗŧ ŧǿ Ȧŀŀ ƒǿř Ḗŀɠɠ'ş ḓīřḗƈŧǿřẏ. Ŧħīş ƥřḗṽḗƞŧş Ȧƥȧƈħḗ ƒřǿḿ ƥřǿƈḗşşīƞɠ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ ẇħīƈħ ƈǿƞŧȧīƞş ŧħḗ řḗẇřīŧḗ řŭŀḗş.
				\n\nȦ ŀḗşş ŀīķḗŀẏ ƈȧŭşḗ īş Ȧƥȧƈħḗ īş ƈǿƞƒīɠŭřḗḓ ẇīŧħ ȧƞ ȧŀīȧş ƒǿř ẏǿŭř Ḗŀɠɠ ḓīřḗƈŧǿřẏ ȧƞḓ ẏǿŭ ƞḗḗḓ ŧǿ şḗŧ ŧħḗ ŘḗẇřīŧḗƁȧşḗ īƞ ẏǿŭř .ħŧȧƈƈḗşş. Ŧħḗřḗ ȧřḗ ƒŭřŧħḗř īƞşŧřŭƈŧīǿƞş īƞ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ īƞ ẏǿŭř Ḗŀɠɠ ḓīřḗƈŧǿřẏ. ϰϰǋ ϰςϕϰıϐ鶱 ǲϵǋǈ ϵǲ靐ϱϰΐ ϰϖı ǲǋǅ ςϰΰſ ſ靐ϕıϕǅ ϑẛϱϖı ϖϑ ǈϐ衋靐 ẛϖϖǋſǅǈϖςϕςϐϰ ǋẛ ǅΰǲ ΐẛ]",
	'install:error:rewrite:htaccess:write_permission' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. Ẏǿŭ ƞḗḗḓ ŧǿ ḿȧƞŭȧŀŀẏ ƈǿƥẏ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş ǿř ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ ḓīřḗƈŧǿřẏ. ıǲϱſ ϐϵΐ ϱϖϖΰǲǈ ſ鶱衋ϖ ϱϰı ǋı鶱ϐ ǅϐϑϰ]',
	'install:error:rewrite:htaccess:read_permission' => '[Ŧħḗřḗ īş ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ, ƀŭŧ ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ řḗȧḓ īŧ. 鶱ΐı靐ǈ ǋϐ 鶱鶱 衋靐ıϕϱ]',
	'install:error:rewrite:htaccess:non_elgg_htaccess' => '[Ŧħḗřḗ īş ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ ŧħȧŧ ẇȧş ƞǿŧ ƞǿŧ ƈřḗȧŧḗḓ ƀẏ Ḗŀɠɠ. Ƥŀḗȧşḗ řḗḿǿṽḗ īŧ. ǋϰϐϕϑ ΰǋ 衋ϰ ϱϐǈẛ]',
	'install:error:rewrite:htaccess:old_elgg_htaccess' => '[Ŧħḗřḗ ȧƥƥḗȧřş ŧǿ ƀḗ ȧƞ ǿŀḓ Ḗŀɠɠ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. Īŧ ḓǿḗş ƞǿŧ ƈǿƞŧȧīƞ ŧħḗ řḗẇřīŧḗ řŭŀḗ ƒǿř ŧḗşŧīƞɠ ŧħḗ ẇḗƀ şḗřṽḗř. ǈΐſǅǲ ǅ靐鶱ΐϰϱϖ 靐ǅ ϵǋ ϑϵ]',
	'install:error:rewrite:htaccess:cannot_copy' => '[Ȧ ŭƞķƞǿẇƞ ḗřřǿř ǿƈƈŭřřḗḓ ẇħīŀḗ ƈřḗȧŧīƞɠ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ. Ẏǿŭ ƞḗḗḓ ŧǿ ḿȧƞŭȧŀŀẏ ƈǿƥẏ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. ϐ ıΰϑϵϐſΰ ϖǅ鶱ϖǈ ϐſǅϱıǲϱ]',
	'install:error:rewrite:altserver' => '[Ŧħḗ řḗẇřīŧḗ řŭŀḗş ŧḗşŧ ƒȧīŀḗḓ. Ẏǿŭ ƞḗḗḓ ŧǿ ƈǿƞƒīɠŭřḗ ẏǿŭř ẇḗƀ şḗřṽḗř ẇīŧħ Ḗŀɠɠ\'ş řḗẇřīŧḗ řŭŀḗş ȧƞḓ ŧřẏ ȧɠȧīƞ. 靐ıǋ 鶱ΐϐ鶱靐衋ı ςẛϐΰϖ]',
	'install:error:rewrite:unknown' => '[Ǿǿƒ. Ẇḗ ƈǿŭŀḓƞ\'ŧ ƒīɠŭřḗ ǿŭŧ ẇħȧŧ ķīƞḓ ǿƒ ẇḗƀ şḗřṽḗř īş řŭƞƞīƞɠ ǿƞ ẏǿŭř şḗřṽḗř ȧƞḓ īŧ ƒȧīŀḗḓ ŧħḗ řḗẇřīŧḗ řŭŀḗş. Ẇḗ ƈȧƞƞǿŧ ǿƒƒḗř ȧƞẏ şƥḗƈīƒīƈ ȧḓṽīƈḗ. Ƥŀḗȧşḗ ƈħḗƈķ ŧħḗ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķ. ΰı鶱ϑ ϑ靐 衋ϕΰẛǋǲǈς ſς鶱ǲϐϕ ϑΰϑ ϕΐϑϕ ϖ]',
	'install:warning:rewrite:unknown' => '[Ẏǿŭř şḗřṽḗř ḓǿḗş ƞǿŧ şŭƥƥǿřŧ ȧŭŧǿḿȧŧīƈ ŧḗşŧīƞɠ ǿƒ ŧħḗ řḗẇřīŧḗ řŭŀḗş ȧƞḓ ẏǿŭř ƀřǿẇşḗř ḓǿḗş ƞǿŧ şŭƥƥǿřŧ ƈħḗƈķīƞɠ ṽīȧ ĴȧṽȧŞƈřīƥŧ. Ẏǿŭ ƈȧƞ ƈǿƞŧīƞŭḗ ŧħḗ īƞşŧȧŀŀȧŧīǿƞ, ƀŭŧ ẏǿŭ ḿȧẏ ḗẋƥḗřīḗƞƈḗ ƥřǿƀŀḗḿş ẇīŧħ ẏǿŭř şīŧḗ. Ẏǿŭ ƈȧƞ ḿȧƞŭȧŀŀẏ ŧḗşŧ ŧħḗ řḗẇřīŧḗ řŭŀḗş ƀẏ ƈŀīƈķīƞɠ ŧħīş ŀīƞķ: <a href="%s" target="_blank">ŧḗşŧ</a>. Ẏǿŭ ẇīŀŀ şḗḗ ŧħḗ ẇǿřḓ şŭƈƈḗşş īƒ ŧħḗ řŭŀḗş ȧřḗ ẇǿřķīƞɠ. ϐıẛϑ ΰ鶱ΐϰΐϑ ΰ衋ẛΐ 衋衋靐 ǈΰΐ鶱ǋ鶱ϵ ϕΰẛϵǅ靐ϰΰſ 靐ςϐΰ靐靐ẛ 靐鶱 ǈǋΐ ẛ鶱ϐ衋ςϐǅ ϐǲ靐ǲ衋 ϱǋ]',
    
	// Bring over some error messages you might see in setup
	'exception:contact_admin' => '[Ȧƞ ŭƞřḗƈǿṽḗřȧƀŀḗ ḗřřǿř ħȧş ǿƈƈŭřřḗḓ ȧƞḓ ħȧş ƀḗḗƞ ŀǿɠɠḗḓ. Īƒ ẏǿŭ ȧřḗ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ƈħḗƈķ ẏǿŭř şḗŧŧīƞɠş ƒīŀḗ, ǿŧħḗřẇīşḗ ƈǿƞŧȧƈŧ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ẇīŧħ ŧħḗ ƒǿŀŀǿẇīƞɠ īƞƒǿřḿȧŧīǿƞ: ϰ靐 ςϐϰϐſϑϕı鶱ϵſϐ衋 ΐſııΰ ſϰϵ ϑǋ靐ΰϵϑϐ]',
	'DatabaseException:WrongCredentials' => "[Ḗŀɠɠ ƈǿŭŀḓƞ'ŧ ƈǿƞƞḗƈŧ ŧǿ ŧħḗ ḓȧŧȧƀȧşḗ ŭşīƞɠ ŧħḗ ɠīṽḗƞ ƈřḗḓḗƞŧīȧŀş. Ƈħḗƈķ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ. ΐǈΐϑ ϱǲϑϑϐϰΐſ ϱ]",
);
