<?php
return array(
	'install:title' => '[Ḗŀɠɠ Īƞşŧȧŀŀ ǋΰ衋ϖ ςϱςϰϱ]',
	'install:welcome' => '[Ẇḗŀƈǿḿḗ ΰϕ靐ſϵſſ]',
	'install:requirements' => '[Řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ ϵ靐靐ıΐǲǲ鶱ςǋ]',
	'install:database' => '[Ḓȧŧȧƀȧşḗ īƞşŧȧŀŀȧŧīǿƞ 靐ςϰǋϑΰϱ靐 ſ]',
	'install:settings' => '[Ƈǿƞƒīɠŭřḗ şīŧḗ ςΐϑϵϐ衋鶱ǲϱ 衋ϱ]',
	'install:admin' => '[Ƈřḗȧŧḗ ȧḓḿīƞ ȧƈƈǿŭƞŧ ϰϰſϵϱ靐 ςΐϱϱ鶱]',
	'install:complete' => '[Ƒīƞīşħḗḓ 衋ϱϕıϕ衋ǲ衋]',

	'install:next' => '[Ƞḗẋŧ ϵǋ靐ϖ]',
	'install:refresh' => '[Řḗƒřḗşħ ϰϕϱΰǈϐ靐]',

	'install:welcome:instructions' => "[Īƞşŧȧŀŀīƞɠ Ḗŀɠɠ ħȧş 6 şīḿƥŀḗ şŧḗƥş ȧƞḓ řḗȧḓīƞɠ ŧħīş ẇḗŀƈǿḿḗ īş ŧħḗ ƒīřşŧ ǿƞḗ!

Īƒ ẏǿŭ ħȧṽḗƞ'ŧ ȧŀřḗȧḓẏ, řḗȧḓ ŧħřǿŭɠħ ŧħḗ īƞşŧȧŀŀȧŧīǿƞ īƞşŧřŭƈŧīǿƞş īƞƈŀŭḓḗḓ ẇīŧħ Ḗŀɠɠ (ǿř ƈŀīƈķ ŧħḗ īƞşŧřŭƈŧīǿƞş ŀīƞķ ȧŧ ŧħḗ ƀǿŧŧǿḿ ǿƒ ŧħḗ ƥȧɠḗ).

Īƒ ẏǿŭ ȧřḗ řḗȧḓẏ ŧǿ ƥřǿƈḗḗḓ, ƈŀīƈķ ŧħḗ Ƞḗẋŧ ƀŭŧŧǿƞ. ςǲϖϑϕ衋ıϱǅϱ ϵẛıǋ ıςϑ ϕ ϕ衋ǲ鶱ſ衋 ıǅǲς鶱 ϰϐı ǋϖςϑǅΐς ϕϐ衋ΰ]",
	'install:requirements:instructions:success' => "[Ẏǿŭř şḗřṽḗř ƥȧşşḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧ ƈħḗƈķş. ſϖ鶱靐 ΰǈǈϖϕ]",
	'install:requirements:instructions:failure' => "[Ẏǿŭř şḗřṽḗř ƒȧīŀḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ. Ȧƒŧḗř ẏǿŭ ħȧṽḗ ƒīẋḗḓ ŧħḗ ƀḗŀǿẇ īşşŭḗş, řḗƒřḗşħ ŧħīş ƥȧɠḗ. Ƈħḗƈķ ŧħḗ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķş ȧŧ ŧħḗ ƀǿŧŧǿḿ ǿƒ ŧħīş ƥȧɠḗ īƒ ẏǿŭ ƞḗḗḓ ƒŭřŧħḗř ȧşşīşŧȧƞƈḗ. ϕǲẛϵ ϐΐϰǋϱǋ ſǅǲΐϐ鶱 衋ς衋 ǋϕ鶱ΰϕϰΰϰẛϱẛı]",
	'install:requirements:instructions:warning' => "[Ẏǿŭř şḗřṽḗř ƥȧşşḗḓ ŧħḗ řḗɋŭīřḗḿḗƞŧş ƈħḗƈķ, ƀŭŧ ŧħḗřḗ īş ȧŧ ŀḗȧşŧ ǿƞḗ ẇȧřƞīƞɠ. Ẇḗ řḗƈǿḿḿḗƞḓ ŧħȧŧ ẏǿŭ ƈħḗƈķ ŧħḗ īƞşŧȧŀŀ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ƥȧɠḗ ƒǿř ḿǿřḗ ḓḗŧȧīŀş. ςǋϐ靐 ẛſ衋ϕıſ 靐靐ςϰ衋ΐ ǋıϰ ϐς鶱靐ϖ]",

	'install:require:php' => '[ƤĦƤ ϕǈ衋]',
	'install:require:rewrite' => '[Ẇḗƀ şḗřṽḗř ſϖΐ 衋ΐϵΰϵϵ]',
	'install:require:settings' => '[Şḗŧŧīƞɠş ƒīŀḗ 鶱ϖΐǈıẛϐϑ ǋΰ]',
	'install:require:database' => '[Ḓȧŧȧƀȧşḗ ϱ衋ǅ鶱ϰſϕǅ]',

	'install:check:root' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ ŧħḗ řǿǿŧ ḓīřḗƈŧǿřẏ ǿƒ Ḗŀɠɠ. Ẏǿŭ ħȧṽḗ ŧẇǿ ƈħǿīƈḗş:

		1. Ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ řǿǿŧ ḓīřḗƈŧǿřẏ

		2. Ƈǿƥẏ ŧħḗ ƒīŀḗ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş 衋ϱſǅ ΐϕϵ ς衋ΐϰ鶱ſ ςϰ鶱ϕ ǈϖǅ ϑςϕ鶱 ǋǈǅſǈϖ鶱ǲϕẛ]',

	'install:check:php:version' => '[Ḗŀɠɠ řḗɋŭīřḗş ƤĦƤ %s ǿř ȧƀǿṽḗ. Ŧħīş şḗřṽḗř īş ŭşīƞɠ ṽḗřşīǿƞ %s. 鶱ϑǲ鶱 ǈ鶱ıς]',
	'install:check:php:extension' => '[Ḗŀɠɠ řḗɋŭīřḗş ŧħḗ ƤĦƤ ḗẋŧḗƞşīǿƞ %s. ςǅ靐衋 ϐΰ靐ǈϕΰ]',
	'install:check:php:extension:recommend' => '[Īŧ īş řḗƈǿḿḿḗƞḓḗḓ ŧħȧŧ ŧħḗ ƤĦƤ ḗẋŧḗƞşīǿƞ %s īş īƞşŧȧŀŀḗḓ. ǋϖ 靐ϖ ẛϰ]',
	'install:check:php:open_basedir' => '[Ŧħḗ ǿƥḗƞ_ƀȧşḗḓīř ƤĦƤ ḓīřḗƈŧīṽḗ ḿȧẏ ƥřḗṽḗƞŧ Ḗŀɠɠ ƒřǿḿ şȧṽīƞɠ ƒīŀḗş ŧǿ īŧş ḓȧŧȧ ḓīřḗƈŧǿřẏ. ϑ衋ϑ 鶱靐ϑϑǲϐϵϰϱǅ]',
	'install:check:php:safe_mode' => '[Řŭƞƞīƞɠ ƤĦƤ īƞ şȧƒḗ ḿǿḓḗ īş ƞǿŧ řḗƈǿḿḿḗƞḗḓ ȧƞḓ ḿȧẏ ƈȧŭşḗ ƥřǿƀŀḗḿş ẇīŧħ Ḗŀɠɠ. ẛϕϵǈΰϐǋ ΰ靐ϵ]',
	'install:check:php:arg_separator' => '[ȧřɠ_şḗƥȧřȧŧǿř.ǿŭŧƥŭŧ ḿŭşŧ ƀḗ & ƒǿř Ḗŀɠɠ ŧǿ ẇǿřķ ȧƞḓ ẏǿŭř şḗřṽḗř\'ş ṽȧŀŭḗ īş %s ϖϑςſΐǋſϐϖϱϱϐ]',
	'install:check:php:register_globals' => '[Řḗɠīşŧḗř ɠŀǿƀȧŀş ḿŭşŧ ƀḗ ŧŭřƞḗḓ ǿƒƒ. ǋϐςΐϱϰΐϑ ΐ]',
	'install:check:php:session.auto_start' => "[şḗşşīǿƞ.ȧŭŧǿ_şŧȧřŧ ḿŭşŧ ƀḗ ǿƒƒ ƒǿř Ḗŀɠɠ ŧǿ ẇǿřķ. Ḗīŧħḗř ƈħȧƞɠḗ ŧħḗ ƈǿƞƒīɠŭřȧŧīǿƞ ǿƒ ẏǿŭř şḗřṽḗř ǿř ȧḓḓ ŧħīş ḓīřḗƈŧīṽḗ ŧǿ Ḗŀɠɠ'ş .ħŧȧƈƈḗşş ƒīŀḗ. ϵſϑςǅΰΰϕǋϑϵϰ衋ςſϑϰǅ 鶱衋ǲı ǲ]",

	'install:check:enginedir' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ŧħḗ şḗŧŧīƞɠş.ƥħƥ ƒīŀḗ īƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ. Ẏǿŭ ħȧṽḗ ŧẇǿ ƈħǿīƈḗş:

		1. Ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ

		2. Ƈǿƥẏ ŧħḗ ƒīŀḗ şḗŧŧīƞɠş.ḗẋȧḿƥŀḗ.ƥħƥ ŧǿ şḗŧŧīƞɠş.ƥħƥ ȧƞḓ ƒǿŀŀǿẇ ŧħḗ īƞşŧřŭƈŧīǿƞş īƞ īŧ ƒǿř şḗŧŧīƞɠ ẏǿŭř ḓȧŧȧƀȧşḗ ƥȧřȧḿḗŧḗřş. 鶱ǅıǲ 衋靐ı ıϐϑϖǅϵ ǋϕǈı ǅϰϑ ϖϑ靐ϵ ϕ衋ϖϱǅǈ衋ǲς鶱 ϱΰ ϐẛ靐ẛ鶱ϱ ẛϖϵ ſǲ]',
	'install:check:readsettings' => '[Ȧ şḗŧŧīƞɠş ƒīŀḗ ḗẋīşŧş īƞ ŧħḗ ḗƞɠīƞḗ ḓīřḗƈŧǿřẏ, ƀŭŧ ŧħḗ ẇḗƀ şḗřṽḗř ƈȧƞƞǿŧ řḗȧḓ īŧ. Ẏǿŭ ƈȧƞ ḓḗŀḗŧḗ ŧħḗ ƒīŀḗ ǿř ƈħȧƞɠḗ ŧħḗ řḗȧḓ ƥḗřḿīşşīǿƞş ǿƞ īŧ. 鶱 ǋΐϑϐ衋ΰϖǅ ẛ靐ϕΰ ǅςϰϑϱı ϱϖ]',

	'install:check:php:success' => "[Ẏǿŭř şḗřṽḗř'ş ƤĦƤ şȧŧīşƒīḗş ȧŀŀ ǿƒ Ḗŀɠɠ'ş řḗɋŭīřḗḿḗƞŧş. ſς衋ϐ ΐıẛ]",
	'install:check:rewrite:success' => '[Ŧħḗ ŧḗşŧ ǿƒ ŧħḗ řḗẇřīŧḗ řŭŀḗş ẇȧş şŭƈƈḗşşƒŭŀ. ıϵǈ ſϵ鶱ς ϱ]',
	'install:check:database' => '[Ŧħḗ ḓȧŧȧƀȧşḗ řḗɋŭīřḗḿḗƞŧş ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ Ḗŀɠɠ ŀǿȧḓş īŧş ḓȧŧȧƀȧşḗ. ǅϑǲ ǅΐϵϵϕǅ]',

	'install:database:instructions' => "[Īƒ ẏǿŭ ħȧṽḗƞ'ŧ ȧŀřḗȧḓẏ ƈřḗȧŧḗḓ ȧ ḓȧŧȧƀȧşḗ ƒǿř Ḗŀɠɠ, ḓǿ ŧħȧŧ ƞǿẇ. Ŧħḗƞ ƒīŀŀ īƞ ŧħḗ ṽȧŀŭḗş ƀḗŀǿẇ ŧǿ īƞīŧīȧŀīzḗ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ. ẛſ ſı鶱 ıϑςſſ靐ΐ ς靐ϖϵǈ鶱ǅ]",
	'install:database:error' => '[Ŧħḗřḗ ẇȧş ȧƞ ḗřřǿř ƈřḗȧŧīƞɠ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ ȧƞḓ īƞşŧȧŀŀȧŧīǿƞ ƈȧƞƞǿŧ ƈǿƞŧīƞŭḗ. Řḗṽīḗẇ ŧħḗ ḿḗşşȧɠḗ ȧƀǿṽḗ ȧƞḓ ƈǿřřḗƈŧ ȧƞẏ ƥřǿƀŀḗḿş. Īƒ ẏǿŭ ƞḗḗḓ ḿǿřḗ ħḗŀƥ, ṽīşīŧ ŧħḗ Īƞşŧȧŀŀ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķ ƀḗŀǿẇ ǿř ƥǿşŧ ŧǿ ŧħḗ Ḗŀɠɠ ƈǿḿḿŭƞīŧẏ ƒǿřŭḿş. ϰςΐıǈ 靐ẛΰ ſϕ ǈϑΰϵϱ ϰϐ衋ǋ鶱靐ϰς ſϖ鶱 ΰϰϰϑ ẛſ靐ϐϑǅı]',

	'install:database:label:dbuser' =>  '[Ḓȧŧȧƀȧşḗ Ŭşḗřƞȧḿḗ ϐϵǲΐϱ鶱ϐǋ ǋϕς]',
	'install:database:label:dbpassword' => '[Ḓȧŧȧƀȧşḗ Ƥȧşşẇǿřḓ ϑǋςϰϑςΰϵ ΐ鶱ǋ]',
	'install:database:label:dbname' => '[Ḓȧŧȧƀȧşḗ Ƞȧḿḗ ẛǈǋǋ衋ǲǈϑ ϖǋ]',
	'install:database:label:dbhost' => '[Ḓȧŧȧƀȧşḗ Ħǿşŧ ϰǋϱϵſǈϐſ ǋϕ]',
	'install:database:label:dbprefix' => '[Ḓȧŧȧƀȧşḗ Ŧȧƀŀḗ Ƥřḗƒīẋ ϕϵϰϑΰǋϑ靐 ϑ]',

	'install:database:help:dbuser' => '[Ŭşḗř ŧħȧŧ ħȧş ƒŭŀŀ ƥřīṽīŀḗɠḗş ŧǿ ŧħḗ ḾẏŞɊĿ ḓȧŧȧƀȧşḗ ŧħȧŧ ẏǿŭ ƈřḗȧŧḗḓ ƒǿř Ḗŀɠɠ 衋ϕΐϐ 鶱鶱ǋϖ 衋ΐ]',
	'install:database:help:dbpassword' => '[Ƥȧşşẇǿřḓ ƒǿř ŧħḗ ȧƀǿṽḗ ḓȧŧȧƀȧşḗ ŭşḗř ȧƈƈǿŭƞŧ ıſϱϕϕ鶱ẛϖ ſǋ]',
	'install:database:help:dbname' => '[Ƞȧḿḗ ǿƒ ŧħḗ Ḗŀɠɠ ḓȧŧȧƀȧşḗ ǋǲẛΰ ϵǈ ϱǅΰ]',
	'install:database:help:dbhost' => '[Ħǿşŧƞȧḿḗ ǿƒ ŧħḗ ḾẏŞɊĿ şḗřṽḗř (ŭşŭȧŀŀẏ ŀǿƈȧŀħǿşŧ) ıϖ靐ϰ衋ςςϑ 鶱]',
	'install:database:help:dbprefix' => "[Ŧħḗ ƥřḗƒīẋ ɠīṽḗƞ ŧǿ ȧŀŀ ǿƒ Ḗŀɠɠ'ş ŧȧƀŀḗş (ŭşŭȧŀŀẏ ḗŀɠɠ_) ẛ鶱ϰ ſϱıϱ]",

	'install:settings:instructions' => '[Ẇḗ ƞḗḗḓ şǿḿḗ īƞƒǿřḿȧŧīǿƞ ȧƀǿŭŧ ŧħḗ şīŧḗ ȧş ẇḗ ƈǿƞƒīɠŭřḗ Ḗŀɠɠ. Īƒ ẏǿŭ ħȧṽḗƞ\'ŧ <a href="http://docs.elgg.org/wiki/Data_directory" target="_blank">ƈřḗȧŧḗḓ ȧ ḓȧŧȧ ḓīřḗƈŧǿřẏ</a> ƒǿř Ḗŀɠɠ, ẏǿŭ ƞḗḗḓ ŧǿ ḓǿ şǿ ƞǿẇ. ΐϰ ϵϵǈẛ ΐıϖϖ ςſſǋ衋ΐΰ衋ςϰΐ ϕΐǋǈς ǈǈǈ ſςǋ]',

	'install:settings:label:sitename' => '[Şīŧḗ Ƞȧḿḗ ǋ鶱ǋſ ϱ鶱ϵı]',
	'install:settings:label:siteemail' => '[Şīŧḗ Ḗḿȧīŀ Ȧḓḓřḗşş ϵ靐ϐ鶱 ϖΐſΐϐ]',
	'install:settings:label:wwwroot' => '[Şīŧḗ ŬŘĿ ǈΐıϖ ſΐẛ]',
	'install:settings:label:path' => '[Ḗŀɠɠ Īƞşŧȧŀŀ Ḓīřḗƈŧǿřẏ ςıϵǋ ǈǋϱſ衋ǈ]',
	'install:settings:label:dataroot' => '[Ḓȧŧȧ Ḓīřḗƈŧǿřẏ ǲϰ鶱鶱 ϵϖıẛǈϐſ]',
	'install:settings:label:language' => '[Şīŧḗ Ŀȧƞɠŭȧɠḗ ΰϱǋϖ ϑΐϖϖ鶱ϵ]',
	'install:settings:label:siteaccess' => '[Ḓḗƒȧŭŀŧ Şīŧḗ Ȧƈƈḗşş ϐςϖΰϱΰΰ ϖſϵ]',
	'install:label:combo:dataroot' => '[Ḗŀɠɠ ƈřḗȧŧḗş ḓȧŧȧ ḓīřḗƈŧǿřẏ ǅǅ衋鶱 ſςſϐẛ]',

	'install:settings:help:sitename' => '[Ŧħḗ ƞȧḿḗ ǿƒ ẏǿŭř ƞḗẇ Ḗŀɠɠ şīŧḗ ϖΰǈ ϑǈϐς ǅ]',
	'install:settings:help:siteemail' => '[Ḗḿȧīŀ ȧḓḓřḗşş ŭşḗḓ ƀẏ Ḗŀɠɠ ƒǿř ƈǿḿḿŭƞīƈȧŧīǿƞ ẇīŧħ ŭşḗřş ǅǲǲΐς ϱϱ]',
	'install:settings:help:wwwroot' => '[Ŧħḗ ȧḓḓřḗşş ǿƒ ŧħḗ şīŧḗ (Ḗŀɠɠ ŭşŭȧŀŀẏ ɠŭḗşşḗş ŧħīş ƈǿřřḗƈŧŀẏ) ΰǋ靐 ϱſǈǈϖ]',
	'install:settings:help:path' => '[Ŧħḗ ḓīřḗƈŧǿřẏ ẇħḗřḗ ẏǿŭ ƥŭŧ ŧħḗ Ḗŀɠɠ ƈǿḓḗ (Ḗŀɠɠ ŭşŭȧŀŀẏ ɠŭḗşşḗş ŧħīş ƈǿřřḗƈŧŀẏ) 靐ıǈ ǲϱ衋鶱ςΐϱϑ]',
	'install:settings:help:dataroot' => '[Ŧħḗ ḓīřḗƈŧǿřẏ ŧħȧŧ ẏǿŭ ƈřḗȧŧḗḓ ƒǿř Ḗŀɠɠ ŧǿ şȧṽḗ ƒīŀḗş (ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħīş ḓīřḗƈŧǿřẏ ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ ẏǿŭ ƈŀīƈķ Ƞḗẋŧ). Īŧ ḿŭşŧ ƀḗ ȧƞ ȧƀşǿŀŭŧḗ ƥȧŧħ. ςϖΰ ǅẛẛϐ鶱衋ǲϵẛ ςſΰẛ ǈςǋ ςǲǈǈ]',
	'install:settings:help:dataroot:apache' => '[Ẏǿŭ ħȧṽḗ ŧħḗ ǿƥŧīǿƞ ǿƒ Ḗŀɠɠ ƈřḗȧŧīƞɠ ŧħḗ ḓȧŧȧ ḓīřḗƈŧǿřẏ ǿř ḗƞŧḗřīƞɠ ŧħḗ ḓīřḗƈŧǿřẏ ŧħȧŧ ẏǿŭ ȧŀřḗȧḓẏ ƈřḗȧŧḗḓ ƒǿř şŧǿřīƞɠ ŭşḗř ƒīŀḗş (ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħīş ḓīřḗƈŧǿřẏ ȧřḗ ƈħḗƈķḗḓ ẇħḗƞ ẏǿŭ ƈŀīƈķ Ƞḗẋŧ) ςϱϱ ϵϖϱϱ 鶱鶱ς ϰϖǋẛẛ衋 ϑſ ǲϖǅϰ ΰϐǈǋ靐ıǲς]',
	'install:settings:help:language' => '[Ŧħḗ ḓḗƒȧŭŀŧ ŀȧƞɠŭȧɠḗ ƒǿř ŧħḗ şīŧḗ ǲ鶱ǅ ϐǲǈǈſϱ]',
	'install:settings:help:siteaccess' => '[Ŧħḗ ḓḗƒȧŭŀŧ ȧƈƈḗşş ŀḗṽḗŀ ƒǿř ƞḗẇ ŭşḗř ƈřḗȧŧḗḓ ƈǿƞŧḗƞŧ ẛϖǈ 靐ǲǲ]',

	'install:admin:instructions' => "[Īŧ īş ƞǿẇ ŧīḿḗ ŧǿ ƈřḗȧŧḗ ȧƞ ȧḓḿīƞīşŧřȧŧǿř'ş ȧƈƈǿŭƞŧ. ẛΐ ǋẛ ſ]",

	'install:admin:label:displayname' => '[Ḓīşƥŀȧẏ Ƞȧḿḗ ΰıǋϕıǲϱ ϐẛ]',
	'install:admin:label:email' => '[Ḗḿȧīŀ Ȧḓḓřḗşş ıǈǲẛ鶱 ẛſϱǲǋ]',
	'install:admin:label:username' => '[Ŭşḗřƞȧḿḗ ǲϑςϰςςǈſ]',
	'install:admin:label:password1' => '[Ƥȧşşẇǿřḓ ϕſ靐ǈǈẛǈϐ]',
	'install:admin:label:password2' => '[Ƥȧşşẇǿřḓ Ȧɠȧīƞ ϐǋϵϵςϕϵΰ 靐ẛǋ]',

	'install:admin:help:displayname' => '[Ŧħḗ ƞȧḿḗ ŧħȧŧ īş ḓīşƥŀȧẏḗḓ ǿƞ ŧħḗ şīŧḗ ƒǿř ŧħīş ȧƈƈǿŭƞŧ ǅǈΐ ϵς靐ϱ]',
	'install:admin:help:email' => '',
	'install:admin:help:username' => '[Ȧƈƈǿŭƞŧ ŭşḗřƞȧḿḗ ŭşḗḓ ƒǿř ŀǿɠɠīƞɠ īƞ ǅǈΐςǋǈϰ ϖ靐]',
	'install:admin:help:password1' => "[Ȧƈƈǿŭƞŧ ƥȧşşẇǿřḓ ḿŭşŧ ƀḗ ȧŧ ŀḗȧşŧ %u ƈħȧřȧƈŧḗřş ŀǿƞɠ ΐǲϐϰǅϱϱ]",
	'install:admin:help:password2' => '[Řḗŧẏƥḗ ƥȧşşẇǿřḓ ŧǿ ƈǿƞƒīřḿ ΐǲϵς衋ϱ ǈ衋ǋ鶱]',

	'install:admin:password:mismatch' => '[Ƥȧşşẇǿřḓ ḿŭşŧ ḿȧŧƈħ. ϵſΐ衋ẛϕΐϱ ǋıϰ]',
	'install:admin:password:empty' => '[Ƥȧşşẇǿřḓ ƈȧƞƞǿŧ ƀḗ ḗḿƥŧẏ. ϱǲ鶱ϖϑΰϱẛ ϑϐ]',
	'install:admin:password:tooshort' => '[Ẏǿŭř ƥȧşşẇǿřḓ ẇȧş ŧǿǿ şħǿřŧ 鶱ǋıı ẛǅǅſẛ]',
	'install:admin:cannot_create' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ȧƞ ȧḓḿīƞ ȧƈƈǿŭƞŧ. ϱıςΰıϕ ǈϖ]',

	'install:complete:instructions' => '[Ẏǿŭř Ḗŀɠɠ şīŧḗ īş ƞǿẇ řḗȧḓẏ ŧǿ ƀḗ ŭşḗḓ. Ƈŀīƈķ ŧħḗ ƀŭŧŧǿƞ ƀḗŀǿẇ ŧǿ ƀḗ ŧȧķḗƞ ŧǿ ẏǿŭř şīŧḗ. ΰſϱΐ ẛϑıΰ ǲǈ鶱ϐ]',
	'install:complete:gotosite' => '[Ɠǿ ŧǿ şīŧḗ ϖǈ ς靐 ıϵΐΰ]',

	'InstallationException:UnknownStep' => '[%s īş ȧƞ ŭƞķƞǿẇƞ īƞşŧȧŀŀȧŧīǿƞ şŧḗƥ. ǋǈ ǈς ϱſ ϕ鶱]',
	'InstallationException:MissingLibrary' => '[Ƈǿŭŀḓ ƞǿŧ ŀǿȧḓ %s 衋ıϰϰϵ ϖΐϰ ǅς]',
	'InstallationException:CannotLoadSettings' => '[Ḗŀɠɠ ƈǿŭŀḓ ƞǿŧ ŀǿȧḓ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ. Īŧ ḓǿḗş ƞǿŧ ḗẋīşŧ ǿř ŧħḗřḗ īş ȧ ƒīŀḗ ƥḗřḿīşşīǿƞş īşşŭḗ. ſſϰϐ ΐ衋ǈ鶱ǅ ǅ鶱ϵ]',

	'install:success:database' => '[Ḓȧŧȧƀȧşḗ ħȧş ƀḗḗƞ īƞşŧȧŀŀḗḓ. ǈ鶱ııϕẛǅẛ ǋϐ]',
	'install:success:settings' => '[Şīŧḗ şḗŧŧīƞɠş ħȧṽḗ ƀḗḗƞ şȧṽḗḓ. ϖ衋ϑǈ ϖΐ鶱鶱ς]',
	'install:success:admin' => '[Ȧḓḿīƞ ȧƈƈǿŭƞŧ ħȧş ƀḗḗƞ ƈřḗȧŧḗḓ. ſ靐ǅςϐ ıϰẛıϕ]',

	'install:error:htaccess' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ȧƞ .ħŧȧƈƈḗşş ϕ靐ϑϕ鶱ı ΰΐ ϱ]',
	'install:error:settings' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ ϕǲϕϰ鶱鶱 ſǅ]',
	'install:error:databasesettings' => '[Ŭƞȧƀŀḗ ŧǿ ƈǿƞƞḗƈŧ ŧǿ ŧħḗ ḓȧŧȧƀȧşḗ ẇīŧħ ŧħḗşḗ şḗŧŧīƞɠş. ΰϵϐΐſϖ]',
	'install:error:database_prefix' => '[Īƞṽȧŀīḓ ƈħȧřȧƈŧḗřş īƞ ḓȧŧȧƀȧşḗ ƥřḗƒīẋ ıǅϰǅϐǅΐ ǈı]',
	'install:error:oldmysql' => '[ḾẏŞɊĿ ḿŭşŧ ƀḗ ṽḗřşīǿƞ 5.0 ǿř ȧƀǿṽḗ. Ẏǿŭř şḗřṽḗř īş ŭşīƞɠ %s. 衋ϐǲΰẛ ſϕı]',
	'install:error:nodatabase' => '[Ŭƞȧƀŀḗ ŧǿ ŭşḗ ḓȧŧȧƀȧşḗ %s. Īŧ ḿȧẏ ƞǿŧ ḗẋīşŧ. ǲ衋ϕϵϰǈ ΐı ǈ]',
	'install:error:cannotloadtables' => '[Ƈȧƞƞǿŧ ŀǿȧḓ ŧħḗ ḓȧŧȧƀȧşḗ ŧȧƀŀḗş ſǋϑϐ衋ǈ ǋǈ衋ǲ]',
	'install:error:tables_exist' => '[Ŧħḗřḗ ȧřḗ ȧŀřḗȧḓẏ Ḗŀɠɠ ŧȧƀŀḗş īƞ ŧħḗ ḓȧŧȧƀȧşḗ. Ẏǿŭ ƞḗḗḓ ŧǿ ḗīŧħḗř ḓřǿƥ ŧħǿşḗ ŧȧƀŀḗş ǿř řḗşŧȧřŧ ŧħḗ īƞşŧȧŀŀḗř ȧƞḓ ẇḗ ẇīŀŀ ȧŧŧḗḿƥŧ ŧǿ ŭşḗ ŧħḗḿ. Ŧǿ řḗşŧȧřŧ ŧħḗ īƞşŧȧŀŀḗř, řḗḿǿṽḗ \'?şŧḗƥ=ḓȧŧȧƀȧşḗ\' ƒřǿḿ ŧħḗ ŬŘĿ īƞ ẏǿŭř ƀřǿẇşḗř\'ş ȧḓḓřḗşş ƀȧř ȧƞḓ ƥřḗşş Ḗƞŧḗř. 鶱靐ϱ鶱ΰ ςΐς 衋ǋǈϵıϐǈ ΐΐϑϕ ϕ鶱靐ϐϑı ϕǈ ǅϕϵ ẛſǲϑς鶱ſſϐ]',
	'install:error:readsettingsphp' => '[Ŭƞȧƀŀḗ ŧǿ řḗȧḓ ḗƞɠīƞḗ/şḗŧŧīƞɠş.ḗẋȧḿƥŀḗ.ƥħƥ ΐ鶱ıǈıı ΰǋ]',
	'install:error:writesettingphp' => '[Ŭƞȧƀŀḗ ŧǿ ẇřīŧḗ ḗƞɠīƞḗ/şḗŧŧīƞɠş.ƥħƥ ǈϖ靐ϖǈϰ ǈẛ ϕ]',
	'install:error:requiredfield' => '[%s īş řḗɋŭīřḗḓ ϑϵ ıǅ ϕ鶱ϑǋϕς]',
	'install:error:relative_path' => '[Ẇḗ ḓǿƞ\'ŧ ŧħīƞķ "%s" īş ȧƞ ȧƀşǿŀŭŧḗ ƥȧŧħ ƒǿř ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ ϱΐ ϕϰϐıǈ]',
	'install:error:datadirectoryexists' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s ḓǿḗş ƞǿŧ ḗẋīşŧ. ΰΐϑΐ ϰſϐϑ ϑ]',
	'install:error:writedatadirectory' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s īş ƞǿŧ ẇřīŧȧƀŀḗ ƀẏ ŧħḗ ẇḗƀ şḗřṽḗř. ϐϰϑǈ ǅϕς]',
	'install:error:locationdatadirectory' => '[Ẏǿŭř ḓȧŧȧ ḓīřḗƈŧǿřẏ %s ḿŭşŧ ƀḗ ǿŭŧşīḓḗ ǿƒ ẏǿŭř īƞşŧȧŀŀ ƥȧŧħ ƒǿř şḗƈŭřīŧẏ. ϑǲϕϵ ǈϰ衋ϱ ǈ]',
	'install:error:emailaddress' => '[%s īş ƞǿŧ ȧ ṽȧŀīḓ ḗḿȧīŀ ȧḓḓřḗşş ǋ鶱 ΐϕ ϕıϕ ǋ]',
	'install:error:createsite' => '[Ŭƞȧƀŀḗ ŧǿ ƈřḗȧŧḗ ŧħḗ şīŧḗ. ǅϕẛſϵſ 靐ΰ ϐ]',
	'install:error:savesitesettings' => '[Ŭƞȧƀŀḗ ŧǿ şȧṽḗ şīŧḗ şḗŧŧīƞɠş ςϰ衋ΰϐ靐 ΐſ ẛ]',
	'install:error:loadadmin' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿȧḓ ȧḓḿīƞ ŭşḗř. ϰǈǅϱϑſ ΐſ ϐ]',
	'install:error:adminaccess' => '[Ŭƞȧƀŀḗ ŧǿ ɠīṽḗ ƞḗẇ ŭşḗř ȧƈƈǿŭƞŧ ȧḓḿīƞ ƥřīṽīŀḗɠḗş. ſς靐ϐϐ靐 ϵ衋]',
	'install:error:adminlogin' => '[Ŭƞȧƀŀḗ ŧǿ ŀǿɠīƞ ŧħḗ ƞḗẇ ȧḓḿīƞ ŭşḗř ȧŭŧǿḿȧŧīƈȧŀŀẏ. ǋǲςΰϰϐ ϵϵ]',
	'install:error:rewrite:apache' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ȧƥȧƈħḗ ẇḗƀ şḗřṽḗř. ϵ鶱 ϱẛϵϰ]',
	'install:error:rewrite:nginx' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ƞɠīƞẋ ẇḗƀ şḗřṽḗř. ϑǅ ϑΐϐ鶱]',
	'install:error:rewrite:lighttpd' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ Ŀīɠħŧŧƥḓ ẇḗƀ şḗřṽḗř. ϖſ 衋ϖıſǅ]',
	'install:error:rewrite:iis' => '[Ẇḗ ŧħīƞķ ẏǿŭř şḗřṽḗř īş řŭƞƞīƞɠ ŧħḗ ĪĪŞ ẇḗƀ şḗřṽḗř. ǈẛ ϰǈẛϰ]',
	'install:error:rewrite:allowoverride' => "[Ŧħḗ řḗẇřīŧḗ ŧḗşŧ ƒȧīŀḗḓ ȧƞḓ ŧħḗ ḿǿşŧ ŀīķḗŀẏ ƈȧŭşḗ īş ŧħȧŧ ȦŀŀǿẇǾṽḗřřīḓḗ īş ƞǿŧ şḗŧ ŧǿ Ȧŀŀ ƒǿř Ḗŀɠɠ'ş ḓīřḗƈŧǿřẏ. Ŧħīş ƥřḗṽḗƞŧş Ȧƥȧƈħḗ ƒřǿḿ ƥřǿƈḗşşīƞɠ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ ẇħīƈħ ƈǿƞŧȧīƞş ŧħḗ řḗẇřīŧḗ řŭŀḗş.
				\n\nȦ ŀḗşş ŀīķḗŀẏ ƈȧŭşḗ īş Ȧƥȧƈħḗ īş ƈǿƞƒīɠŭřḗḓ ẇīŧħ ȧƞ ȧŀīȧş ƒǿř ẏǿŭř Ḗŀɠɠ ḓīřḗƈŧǿřẏ ȧƞḓ ẏǿŭ ƞḗḗḓ ŧǿ şḗŧ ŧħḗ ŘḗẇřīŧḗƁȧşḗ īƞ ẏǿŭř .ħŧȧƈƈḗşş. Ŧħḗřḗ ȧřḗ ƒŭřŧħḗř īƞşŧřŭƈŧīǿƞş īƞ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ īƞ ẏǿŭř Ḗŀɠɠ ḓīřḗƈŧǿřẏ. ϵſϱ ϖϖϰϕǲςı ϰϑẛϐ ϰ靐ǅϱΰ靐 ıϑǋ ϐıı ϑϑẛ靐 ǋſϑϕϐϐ ϖǲẛ靐ϐ ΰϰ 衋ϖϐϐ ϱϖǅϵ鶱ıſǲẛǈΐǲı ϱΰ ǋϰǅ ΰẛ]",
	'install:error:rewrite:htaccess:write_permission' => '[Ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ ƈřḗȧŧḗ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. Ẏǿŭ ƞḗḗḓ ŧǿ ḿȧƞŭȧŀŀẏ ƈǿƥẏ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş ǿř ƈħȧƞɠḗ ŧħḗ ƥḗřḿīşşīǿƞş ǿƞ ŧħḗ ḓīřḗƈŧǿřẏ. ſ靐ϐı ǲϵı ϕ鶱ϕ靐ſǲ ǈǲϐǈ ϵıϕ ǈǅſſ ΰ靐ǋϐ]',
	'install:error:rewrite:htaccess:read_permission' => '[Ŧħḗřḗ īş ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ, ƀŭŧ ẏǿŭř ẇḗƀ şḗřṽḗř ḓǿḗş ƞǿŧ ħȧṽḗ ƥḗřḿīşşīǿƞ ŧǿ řḗȧḓ īŧ. ıẛ鶱ςϱ ıϰ ΰΰ 鶱ǲϱǈΐ]',
	'install:error:rewrite:htaccess:non_elgg_htaccess' => '[Ŧħḗřḗ īş ȧƞ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ ŧħȧŧ ẇȧş ƞǿŧ ƞǿŧ ƈřḗȧŧḗḓ ƀẏ Ḗŀɠɠ. Ƥŀḗȧşḗ řḗḿǿṽḗ īŧ. ϐΰǅϕς ſϐ 靐ς ẛ鶱ΐς]',
	'install:error:rewrite:htaccess:old_elgg_htaccess' => '[Ŧħḗřḗ ȧƥƥḗȧřş ŧǿ ƀḗ ȧƞ ǿŀḓ Ḗŀɠɠ .ħŧȧƈƈḗşş ƒīŀḗ īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. Īŧ ḓǿḗş ƞǿŧ ƈǿƞŧȧīƞ ŧħḗ řḗẇřīŧḗ řŭŀḗ ƒǿř ŧḗşŧīƞɠ ŧħḗ ẇḗƀ şḗřṽḗř. ǋϵϰǅı ǲϱϖǲϱǅǅ ΐϕ ſ靐 ςẛ]',
	'install:error:rewrite:htaccess:cannot_copy' => '[Ȧ ŭƞķƞǿẇƞ ḗřřǿř ǿƈƈŭřřḗḓ ẇħīŀḗ ƈřḗȧŧīƞɠ ŧħḗ .ħŧȧƈƈḗşş ƒīŀḗ. Ẏǿŭ ƞḗḗḓ ŧǿ ḿȧƞŭȧŀŀẏ ƈǿƥẏ ħŧȧƈƈḗşş_ḓīşŧ ŧǿ .ħŧȧƈƈḗşş īƞ Ḗŀɠɠ\'ş ḓīřḗƈŧǿřẏ. ϕ ǅǲǈǅǅςς ǈϱϑ鶱ϱ ıϐ鶱ϕϕǈẛ]',
	'install:error:rewrite:altserver' => '[Ŧħḗ řḗẇřīŧḗ řŭŀḗş ŧḗşŧ ƒȧīŀḗḓ. Ẏǿŭ ƞḗḗḓ ŧǿ ƈǿƞƒīɠŭřḗ ẏǿŭř ẇḗƀ şḗřṽḗř ẇīŧħ Ḗŀɠɠ\'ş řḗẇřīŧḗ řŭŀḗş ȧƞḓ ŧřẏ ȧɠȧīƞ. 靐ſ鶱 ΐϑǈſϵǲ靐 衋ϖΰΰǅ]',
	'install:error:rewrite:unknown' => '[Ǿǿƒ. Ẇḗ ƈǿŭŀḓƞ\'ŧ ƒīɠŭřḗ ǿŭŧ ẇħȧŧ ķīƞḓ ǿƒ ẇḗƀ şḗřṽḗř īş řŭƞƞīƞɠ ǿƞ ẏǿŭř şḗřṽḗř ȧƞḓ īŧ ƒȧīŀḗḓ ŧħḗ řḗẇřīŧḗ řŭŀḗş. Ẇḗ ƈȧƞƞǿŧ ǿƒƒḗř ȧƞẏ şƥḗƈīƒīƈ ȧḓṽīƈḗ. Ƥŀḗȧşḗ ƈħḗƈķ ŧħḗ ŧřǿŭƀŀḗşħǿǿŧīƞɠ ŀīƞķ. ǅςǅϖ 鶱ẛ 靐ı鶱ϖǅǅǲϵ ǲϕΰϵ鶱ǲ ẛϖ靐 衋ϖǲẛ ΐ]',
	'install:warning:rewrite:unknown' => '[Ẏǿŭř şḗřṽḗř ḓǿḗş ƞǿŧ şŭƥƥǿřŧ ȧŭŧǿḿȧŧīƈ ŧḗşŧīƞɠ ǿƒ ŧħḗ řḗẇřīŧḗ řŭŀḗş ȧƞḓ ẏǿŭř ƀřǿẇşḗř ḓǿḗş ƞǿŧ şŭƥƥǿřŧ ƈħḗƈķīƞɠ ṽīȧ ĴȧṽȧŞƈřīƥŧ. Ẏǿŭ ƈȧƞ ƈǿƞŧīƞŭḗ ŧħḗ īƞşŧȧŀŀȧŧīǿƞ, ƀŭŧ ẏǿŭ ḿȧẏ ḗẋƥḗřīḗƞƈḗ ƥřǿƀŀḗḿş ẇīŧħ ẏǿŭř şīŧḗ. Ẏǿŭ ƈȧƞ ḿȧƞŭȧŀŀẏ ŧḗşŧ ŧħḗ řḗẇřīŧḗ řŭŀḗş ƀẏ ƈŀīƈķīƞɠ ŧħīş ŀīƞķ: <a href="%s" target="_blank">ŧḗşŧ</a>. Ẏǿŭ ẇīŀŀ şḗḗ ŧħḗ ẇǿřḓ şŭƈƈḗşş īƒ ŧħḗ řŭŀḗş ȧřḗ ẇǿřķīƞɠ. ϱẛϖı ǈıΰϰǅϵ ǋ鶱ϑı ςΰϱ ΐϕϱϱϐΐẛ ΐϰΰǲǅϱςϱǋ ϱ鶱ẛϑϱẛı 靐ϑ ϖǲϵ ϱϑϰǋΰǲΐ ϰǲϱΐı ǋ衋]',
    
	// Bring over some error messages you might see in setup
	'exception:contact_admin' => '[Ȧƞ ŭƞřḗƈǿṽḗřȧƀŀḗ ḗřřǿř ħȧş ǿƈƈŭřřḗḓ ȧƞḓ ħȧş ƀḗḗƞ ŀǿɠɠḗḓ. Īƒ ẏǿŭ ȧřḗ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ƈħḗƈķ ẏǿŭř şḗŧŧīƞɠş ƒīŀḗ, ǿŧħḗřẇīşḗ ƈǿƞŧȧƈŧ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ẇīŧħ ŧħḗ ƒǿŀŀǿẇīƞɠ īƞƒǿřḿȧŧīǿƞ: ǅΰ ΰΐ衋ſϕϕϰǋ鶱ϰ衋鶱ſ 鶱ΰϐϐẛ ϐǅ靐 ϐ鶱ı鶱ſ鶱ı]',
	'DatabaseException:WrongCredentials' => "[Ḗŀɠɠ ƈǿŭŀḓƞ'ŧ ƈǿƞƞḗƈŧ ŧǿ ŧħḗ ḓȧŧȧƀȧşḗ ŭşīƞɠ ŧħḗ ɠīṽḗƞ ƈřḗḓḗƞŧīȧŀş. Ƈħḗƈķ ŧħḗ şḗŧŧīƞɠş ƒīŀḗ. ϱϑǅϐ ΰǈΐϐϰϐςǋ ϱ]",
);
