Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/admin.po
Languages: fr

source: Entity icons can be session bound by default. This means the URLs generated also contain information about the current session. Having icons session bound makes icon urls not shareable between sessions. The side effect is that caching of these urls will only help the active session.
fr: Les icônes d’entité peuvent être liées par défaut à une session. Cela signifie que les URL générées contiennent également des informations sur la session en cours. Le fait d’avoir des icônes liées à la session rend les URLs des icônes non partageables entre les sessions. L’effet secondaire est que la mise en cache de ces URL ne bénéficiera qu'à la session active.

source: Notification to site administrators
fr: Notification aux administrateurs du site

source: When a new site administrator is added or when a site administrator is removed all the site administrators get a notification about this action.
fr: Quand un nouvel administrateur de site est ajouté ou quand un administrateur du site est retiré tous les administrateurs du site reçoivent une notification à ce sujet.

source: Notifications to user
fr: Notifications à l'utilisateur

source: Site administrator
fr: Administrateur du site

source: When the site administrator role is added to or removed from the account, send a notification to the user whos account this is affecting.
fr: Quand le rôle d'administrateur du site est ajouté ou retiré à un compte, envoie une notification à l'utilisateur dont le compte est concerné.

source: (Un)ban
fr: Bannir (ou réintégrer)

source: When the account of a user gets banned or unbanned, let the affected user know about this action.
fr: Quand le compte d'un utilisateur est banni ou réintégré, permet à l'utilisateur concerné d'être informé de cette action.

source: Minimal username length
fr: Longueur minimale de l'identifiant

source: You can configure the minimal length the username should have upon registration of a user.
fr: Vous pouvez configurer la longueur minimale de l'identifiant lors de l’inscription d’un utilisateur.

source: Minimal password requirements
fr: Exigences minimales en matière de mot de passe

source: You can configure several requirements for new passwords of the users
fr: Vous pouvez configurer plusieurs exigences pour les nouveaux mots de passe des utilisateurs

source: **length**: the password should be at least x characters long
fr: **longueur** : le mot de passe doit comporter au moins x caractères

source: **lower case**: minimal number of lower case (a-z) characters in the password
fr: **minuscule** : nombre minimal de caractères minuscules (a-z) dans le mot de passe

source: **upper case**: minimal number of upper case (A-Z) characters in the password
fr: **majuscule** : nombre minimal de caractères majuscules (A-Z) dans le mot de passe

source: **numbers**: minimal number of numbers (0-9) characters in the password
fr: **nombres** : nombre minimal de nombres (0-9) dans le mot de passe

source: **specials**: minimal number of special (like !@#$%^&*(), etc.) characters in the password
fr: **specials** : nombre minimal de caractères spéciaux (comme !@#$%^&*(), etc.) dans le mot de passe

source: .htaccess file access hardening
fr: Sécurisation de l’accès aux fichiers via .htaccess

source: In the .htaccess file a set of file access hardening rules have been added to prevent direct access to files in certain folders. Enabling these rules `shouldn't` cause any issues when all the plugins you use follow the Elgg coding guidelines.
fr: Dans le fichier .htaccess, un ensemble de règles de durcissement de l’accès aux fichiers a été ajouté pour empêcher l’accès direct aux fichiers dans certains dossiers. L’activation de ces règles `ne devrait pas` causer des problèmes lorsque tous les plugins que vous utilisez suivent les directives de codage Elgg.

source: Examples of the rules are:
fr: Voici quelques exemples de règles :

source: the ``vendor`` folder. This folder only contains helper libraries that Elgg uses and there is no need for direct access to this folder. All required dependecies are loaded from within Elgg
fr: le dossier ``vendor``. Ce dossier contient uniquement des bibliothèques que Elgg utilise et il n’est pas nécessaire d’accéder directement à ce dossier. Toutes les dépendances requises sont chargées depuis Elgg

source: the ``languages`` folder. This folder contains the main Elgg language files. These files are loaded from within Elgg
fr: le dossier ``languages``. Ce dossier contient les principaux fichiers linguistiques de Elgg. Ces fichiers sont chargés à partir de Elgg

source: Keep spam under control.
fr: Gardez le spam sous contrôle.

source: Spam is a very common problem that admins need to deal with and which we aim to improve in core, but there are some actions site admins can take to mitigate the problem.
fr: Le spam est un problème très commun que les administrateurs doivent traiter et que nous visons à améliorer dans le noyau, mais il existe quelques mesures que les administrateurs de site peuvent prendre pour atténuer le problème.

source: Install an anti-spam plugin
fr: Installez un plugin anti-spam

source: There are several available on the community
fr: Il y en a plusieurs disponibles dans la communauté

source: Change the registration url
fr: Modifier l’url d’inscription

source: Some have said they have good success changing the registration URL, since the spammers are naive bots and can no longer find where to create the fake accounts.
fr: Certaines personnes ont dit avoir obtenu de bons résultats en changeant l’URL d’inscription, puisque les spammeurs sont des bots naïfs qui ne peuvent plus trouver où créer les faux comptes.

source: Disable open registration
fr: Désactiver l’inscription libre

source: If the flow of registrations is low enough, you can vet all users that come in to keep the quality of interaction high.
fr: Si le flux d’inscriptions est assez faible, vous pouvez vérifier tous les utilisateurs qui s'inscrivent pour conserver une qualité d’interaction élevée.

source: Contribute to anti-spam measures in core
fr: Contribuer aux mesures anti-spam dans le noyau

source: Upgrading Elgg
fr: Mettre à niveau Elgg

source: This document will guide you through steps necessary to upgrade your Elgg installation to the latest version.
fr: Ce document va vous guider à travers les étapes nécessaires pour mettre à niveau votre installation Elgg vers la dernière version.

source: If you've written custom plugins, you should also read the developer guides for :doc:`information on upgrading plugin code </appendix/upgrade-notes>` for the latest version of Elgg.
fr: Si vous avez écrit des plugins personnalisés, vous devriez également lire les guides de développement pour les :doc:`informations sur la mise à jour du code des plugins </appendix/upgrade-notes>` pour la dernière version de Elgg.

source: Advice
fr: Conseil

source: **Back up your database, data directory and code**
fr: **Sauvegardez votre base de données, votre répertoire de données et le code source**

source: Mind any version-specific comments below
fr: Faites attention aux commentaires spécifiques pour certaines versions ci-dessous

source: Version below 2.0 are advised to only upgrade **one minor version at a time**
fr: Il est conseillé pour les versions inférieures à 2.0 de n'appliquer qu'**une seule mise à niveau mineure à la fois**

source: You can upgrade from any minor version to any higher minor version in the same major (2.0 -> 2.1 or 2.0 -> 2.3)
fr: Vous pouvez mettre à niveau depuis n'importe quelle version mineure vers n'importe quelle version mineure supérieure au sein de la même version majeure (2.0 -> 2.1 ou 2.0 -> 2.3)

source: You can only upgrade the latest minor version in the previous major version to any minor version in the next version (2.3 -> 3.0 or 2.3 -> 3.2, but not 2.2 -> 3.x).
fr: Vous pouvez mettre à niveau uniquement la dernière version mineure de la version majeure précédente vers n'importe quelle version mineure de la version majeure suivante (2.3 -> 3.0 ou 2.3 -> 3.2, mais pas 2.2 -> 3.x).

source: From Elgg 2.3.* you can upgrade to any future version of Elgg without having to go through each minor version (e.g. you can upgrade directly from 2.3.8 to 3.2.5, without having to upgrade to 3.0 and 3.1)
fr: A partir de Elgg 2.3.* vous pouvez mettre à niveau vers n'importe quelle version ultérieure de Elgg sans devoir passer par chacune des versions mineures (par ex. vous pouvez mettre à niveau directement de la 2.3.8 vers la 3.2.5, sans devoir mettre à niveau vers les versions 3.0 et 3.1)

source: Try out the new version on a test site before doing an upgrade
fr: Essayez la nouvelle version sur un site de test avant d'effectuer une mise à niveau

source: Report any problems in plugins to the plugin authors
fr: Signalez tout problème dans les plugins aux auteurs de plugins

source: If you are a plugin author you can `report any backwards-compatibility issues to GitHub <issues_>`_
fr: Si vous êtes auteur de plugins, vous pouvez `signaler tout problème de rétro-compatibilité sur GitHub <issues_>`_

source: From 2.3 to 3.0
fr: De 2.3 à 3.0

source: 1. Update ``composer.json``
fr: 1. Mettez à niveau ``composer.json``

source: If you have used Elgg's starter project to install Elgg 2.3, you may need to update your ``composer.json``:
fr: Si vous avez utilisé le projet de démarrage Elgg pour installer Elgg 2.3, vous pouvez avoir besoin de mettre à niveau votre ``composer.json`` :

source: change platform requirements to PHP >= 7.0
fr: modifiez les pré-requis de la plateforme vers PHP >= 7.0

source: optionally, set autoloader optimization parameters
fr: facultativement, définissez les paramètres d'optimisation de l'autoloader

source: optionally, disable fxp-asset plugin in favor of asset-packagist
fr: facultativement, désactivez le plugin fxp-asset au bénéfice de asset-packagist

source: Your ``composer.json`` would look something like this (depending what changes you may have introduced yourself):
fr: Votre ``composer.json`` devrait ressembler à quelque chose comme ceci (en fonction des changements que vous avez vous-même introduits) :

source: 2. Update ``.htaccess``
fr: 2. Mettez à jour le ``.htaccess``

source: Find the line:
fr: Trouvez la ligne :

source: And replace it with:
fr: Et remplacez-la par :

source: 3a. Composer Upgrade (recommended)
fr: 3a. Mise à niveau via Composer (recommandé)

source: If you had your Elgg 2.3 project installed using composer, you can follow this sequence:
fr: Si vous aviez installé votre projet 2.3 avec composer, vous pouvez suivre la séquence suivante :

source: **Back up your database, data directory, and code**
fr: **Sauvegardez votre base de données, votre répertoire de données, et le code**

source: In some cases the command line upgrade will fail because some database schema changes need to be applied first. In that case you need to execute the :ref:`Phinx migrations <contribute/database#execute-migration>` manually
fr: Dans certains cas, la mise à niveau via la ligne de commande échoue car certaines modifications de schéma de base de données doivent d’abord être appliquées. Dans ce cas, vous devez exécuter les migrations :ref:`Phinx migrations <contribute/database#execute-migration>` manuellement

source: 3b. Manual Upgrade (legacy approach)
fr: 3b. Mise à niveau manuelle (approche traditionnelle)

source: Manual upgrades are a major undertaking for site admins. We discourage you from maintaining an Elgg installation using ZIP dist packages. Save yourself some time by learning how to use ``composer`` and version control systems, such as ``git``. This task will also be complicated if you have third-party plugins and/or have made any modifications to core files!
fr: Les mises à niveau manuelles sont une opération pénible pour les administrateurs de sites. Nous vous déconseillons de maintenir un site Elgg en utilisant des archives ZIP. Économisez-vous du temps en apprenant comment utiliser ``composer`` et les systèmes de contrôle de version, tels que ``git``. Cette tâche sera également plus complexe si vous utilisez des plugins tierce-partie et/ou si vous avez modifié les fichiers du noyau !

source: Log in as an admin to your site
fr: Identifiez-vous sur votre site en tant qu'administrateur

source: Download the new version of Elgg from http://elgg.org
fr: Téléchargez la nouvelle version de Elgg depuis http://elgg.org

source: Update the files
fr: Mettez à jour les fichiers

source: If upgrading to a major version, you need to overwrite all core files and remove any files that were removed from Elgg core, as they may interfere with proper functioning of your site.
fr: Si vous mettez à niveau vers une version majeure, vous devrez replacer tous les fichiers du noyau et supprimer tous les fichiers qui ont été retirés du noyau de Elgg, car ils peuvent interférer avec le bon fonctionnement de votre site.

source: If upgrading to a minor version or patching, you need to overwrite all core files.
fr: Si vous mettez à jour vers une version mineure ou un patch, vous devez remplacer tous les fichiers du noyau.

source: Merge any new changes to the rewrite rules
fr: Fusionnez tous les nouveaux changements des règles de réécriture "rewrite rules"

source: For Apache from ``install/config/htaccess.dist`` into ``.htaccess``
fr: Pour Apache depuis ``install/config/htaccess.dist`` vers ``.htaccess``

source: For Nginx from ``install/config/nginx.dist`` into your server configuration (usually inside ``/etc/nginx/sites-enabled``)
fr: Pour Nginx depuis ``install/config/nginx.dist`` vers la configuration de votre serveur (habituellement dans ``/etc/nginx/sites-enabled``)

source: Visit http://your-elgg-site.com/upgrade.php
fr: Visitez http://your-elgg-site.com/upgrade.php

source: Execute asynchronous upgrades at http://your-elgg-site.com/admin/upgrades
fr: Exécutez les mises à niveau asynchrones via http://your-elgg-site.com/admin/upgrades

source: Any modifications should have been written within plugins, so that they are not lost on overwriting. If this is not the case, take care to maintain your modifications.
fr: Toutes les modifications devraient avoir été faites au sein de plugins, de sorte qu'elles ne sont pas perdues lors de l'écrasement des fichiers. Si ce n'est pas le cas, prenez soin de maintenir vos modifications.

source: If you are unable to access ``upgrade.php`` script and receive an error, add ``$CONFIG->security_protect_upgrade = false;`` to your ``settings.php`` and remove it after you have completed all of the upgrade steps.
fr: Si vous n'arrivez pas à accéder au script ``upgrade.php`` et recevez une erreur, ajoutez la ligne ``$CONFIG->security_protect_upgrade = false;`` à votre ficher ``settings.php``, puis supprimez-le après avoir terminé toutes les étapes de l'installation.

source: If you encounter issues with plugins during the upgrade, add an empty file called ``disabled`` in your ``/mod/`` directory. This will disable the plugins, so that you can finish the core upgrade. You can then deal with issues on per-plugin basis.
fr: Si vous rencontrez des soucis avec des plugins lors du processus de mise à niveau, ajoutez un fichier nommé ``disabled`` dans votre dossier ``/mod/``. Ceci va désactiver tous les plugins, de sorte que vous puissiez terminer la mise à niveau du noyau. Vous pouvez ensuite gérer les mises à niveau de chacun des plugins l'un après l'autre.

source: If you have installed Elgg using a dist package but would now like to switch to composer:
fr: Si vous avez installé Elgg en utilisant une archive d'installation mais souhaitez maintenant basculer vers composer :

source: Upgrade your current installation using Manual Upgrade method
fr: Mettez à niveau votre installation en utilisant la méthode manuelle

source: Move your codebase to a temporary location
fr: Déplacez votre code vers un emplacement provisoire

source: Create a new composer project using Elgg's starter project following :doc:`installation instructions </intro/install>` in the root directory of your current installation
fr: Créez un nouveau projet composer en utilisant le projet Elgg de démarrage en suivant les :doc:`instructions d'installation </intro/install>` dans le répertoire racine de votre installation actuelle

source: Copy third-party plugins from your old installation into ``/mod`` directory
fr: Copiez les plugins tierce-partie depuis votre ancienne installation vers le répertoire ``/mod``

source: Run Elgg's installer using your browser or ``elgg-cli`` tool
fr: Exécutez l'installateur de Elgg en utilisant votre navigateur ou l'outil en ligne de commande ``elgg-cli``

source: When you reach the database step, provide the same credentials you have used for manual installation, Elgg will understand that is's an existing installation and will not override any database values
fr: Quand vous arrivez à l'étape de la base de données, indiquez les mêmes accès que vous avez utilisés pour l'installation manuelle, Elgg va comprendre qu'il y a une installation existante et ne remplacera aucune valeur de la base de données

source: Optionally commit your new project to version control
fr: Facultativement, commitez votre nouveau projet vers un suivi de version

source: Applying a patch using Composer
fr: Application d’un correctif à l’aide de Composer

source: The definition of a patch can be found in the :doc:`Release policy </appendix/releases>`.
fr: La définition d’un correctif se trouve dans la documentation :doc:`Release policy </appendix/releases>`.

source: Your ``composer.json`` requirement for Elgg should be ``~3.y.0`` (where ``y`` is the minor version ``0``, ``1``, etc. you wish to have installed). This will make sure you can easily install patches without the risk of installing the next minor release.
fr: Les pré-requis de votre ``composer.json`` pour Elgg doivent être ``~3.y.0`` (où ``y`` est la version mineure ``0``, ``1``, etc. que vous souhaitez installer). Cela vous permettra d’installer facilement des correctifs sans risque d’installer la prochaine version mineure.

source: Just to be sure you can first verify what will be installed / upgraded by executing the folowing command
fr: Juste pour vous en assurer vous pouvez d’abord vérifier ce qui sera installé / mis à niveau en exécutant la commande suivante

source: To upgrade Elgg simply execute
fr: Pour mettre à niveau Elgg, exécutez simplement

source: Earlier versions
fr: Versions précédentes

source: Check Elgg documentation that corresponds to the Elgg version you want to upgrade to, by switching the documentation version in the lower left corner of :doc:`Upgrading docs <upgrading>`
fr: Vérifiez la documentation Elgg qui correspond à la version Elgg vers laquelle vous souhaitez mettre à niveau, en changeant la version de documentation dans le coin inférieur gauche de :doc:`Upgrading docs <upgrading>`

source: User validation
fr: Validation des utilisateurs

source: Plugins can influence how users are validated before they can use the website.
fr: Les plugins peuvent influencer la manière dont les utilisateurs sont validés avant de pouvoir utiliser le site.

source: Listing of unvalidated users
fr: Liste des utilisateurs non validés

source: In the Admin section of the website is a list of all unvalidated users. Some actions can be taken on the users, like delete them from the system or validate them.
fr: Dans la section Admin du site vous trouverez une liste des utilisateurs non validés. Plusieurs actions peuvent être effectuées sur les utilisateurs, telles que les supprimer du système ou les valider.

source: Plugins have the option to add additional features to this list.
fr: Les plugins ont la possibilité d'ajouter de nouvelles fonctionnalités à cette liste.

source: An example of this is the :doc:`/plugins/uservalidationbyemail` plugin which doesn't allow users onto the website until their e-mail address is validated.
fr: Un exemple de ceci est le plugin :doc:`/plugins/uservalidationbyemail` qui ne permet pas aux utilisateurs de se connecter sur le site tant que leur adresse e-mail n'est pas validée.

source: Require admin validation
fr: Exiger la validation de l’administrateur

source: In the Site settings under the Users section there is a setting which can be enabled to require admin validation of a new user account before the user can use their account. After registration the user gets notified that their account is awaiting validation by an administrator.
fr: Dans les paramètres du site sous la section Utilisateurs, il existe un paramètre qui peut être activé pour exiger la validation par l’administrateur d’un nouveau compte utilisateur avant que celui-ci puisse utiliser son compte. Après l’inscription, l’utilisateur est informé que son compte est en attente de validation par un administrateur.

source: Site administrators can receive an e-mail notification that there are users awaiting validation.
fr: Les administrateurs de site peuvent recevoir une notification par e-mail indiquant qu’il y a des utilisateurs en attente de validation.

source: After validation the user is notified that they can use their account.
fr: Après validation, l’utilisateur est notifié qu'il peut utiliser son compte.
