Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/admin.po
Languages: fr

source: Backup and Restore
fr: Sauvegarde et Restauration

source: Contents
fr: Contenu

source: Why
fr: Pourquoi

source: Shared hosting providers typically don't provide an automated way to backup your Elgg installation. This article will address a method of accomplishing this task.
fr: Les fournisseurs d'hébergements mutualisés ne fournissent généralement pas de moyen automatisé de sauvegarder votre installation Elgg. Cet article propose une méthode permettant d'accomplir cette tâche.

source: In IT there are often many ways to accomplish the same thing. Keep that in mind. This article will explain one method to backup and restore your Elgg installation on a shared hosting provider that uses the CPanel application. However, the ideas presented here can be tailored to other applications as well. The following are typical situations that might require a procedure such as this:
fr: Dans l'IT il existe souvent de nombreuses manières d'accomplir la même chose. Gardez cela à l'esprit. Cet article va expliquer une méthode pour sauvegarder et restaurer votre installation Elgg sur un hébergement mutualisé qui utilise l'application CPanel. Cependant, les idées présentées ici peuvent être ajustées pour d'autres applications également. Ce qui suit sont des situations typiques qui peuvent exiger une procédure telle que celle-ci :

source: Disaster Recovery
fr: Récupération après une catastrophe

source: Moving your Elgg site to a new host
fr: Déplacer votre site Elgg vers un nouvel hôte

source: Duplicating an installation
fr: Dupliquer une installation

source: What
fr: Quoi

source: Topics covered:
fr: Sujets couverts :

source: Full backups of the Elgg directories and MySQL databases are performed daily (automated)
fr: Des backups complets des répertoires de Elgg et des bases de données MySQL sont effectués tous les jours (automatisé)

source: The backups are sent to an off-site location via FTP (automated)
fr: Les backups sont envoyés sur autre emplacement hors-site via FTP (automatisé)

source: The local backups are deleted after successful transfer to the off-site location (automatic)
fr: Les backups locaux sont supprimés après un transfert réussi vers le site distant (automatisé)

source: Five days of backups will be maintained (automated)
fr: Cinq jours de backups seront conservés (automatisé)

source: Restoration of data to the new host (manual)
fr: Restauration des données sur le nouvel hôte (manuel)

source: This process was composed with assistance from previous articles in the Elgg documentation wiki.
fr: Ce processus a été composé à partir d'articles d'assistance précédemment publiés dans le wiki de documentation de Elgg.

source: Assumptions
fr: Hypothèses

source: The following assumptions have been made:
fr: Les hypothèses suivantes ont été faites :

source: The Elgg program directory is ``/home/userx/public_html``
fr: Le répertoire du programme Elgg est ``/home/userx/public_html``

source: The Elgg data directory is ``/home/userx/elggdata``
fr: Le répertoire de données Elgg est ``/home/userx/elggdata``

source: You've created a local directory for your backups at ``/home/userx/sitebackups``
fr: Vous avez créé un répertoire local pour vos backups à ``/home/userx/sitebackups``

source: You have an off-site FTP server to send the backup files to
fr: Vous disposez d'un server FTP distant auquel envoyer les fichiers de backup

source: The directory that you will be saving the off-site backups to is ``/home/usery/sitebackups/``
fr: Le répertoire dans lequel vous allez enregistrer les backups distants est ``/home/usery/sitebackups/``

source: You will be restoring the site to a second shared hosting provider in the ``/home/usery/public_html`` directory
fr: Vous allez restaurer le site chez un deuxième fournisseur d'hébergement mutualisé dans le répertoire ``/home/usery/public_html``

source: Be sure to replace ``userx``, ``usery``, ``http://mynewdomain.com`` and all passwords with values that reflect your actual installation!
fr: Assurez-vous de remplacer ``userx``, ``usery``, ``http://mynewdomain.com`` et tous les mots de passe par des valeurs qui correspondent à votre propre installation !

source: Creating a usable backup - automatically
fr: Créer un backup utilisable - automatiquement

source: Customize the backup script
fr: Personnalisez le script de backup - sauvegarde automatique

source: The script that you will use can be found :doc:`here <backup/ftp-backup-script>` .
fr: Le script que vous allez utiliser peut être trouvé :doc:`ici <backup/ftp-backup-script>` .

source: Just copy the script to a text file and name the file with a .pl extension. You can use any text editor to update the file.
fr: Copiez simplement le script dans un fichier texte et renommez le fichier avec une extension .pl. Vous pouvez utiliser n'importe quel éditeur de texte pour modifier le fichier.

source: Change the following to reflect your directory structure:
fr: Modifiez les valeurs suivantes pour qu'elles correspondent à votre structure de répertoires :

source: Change the following to reflect your database parameters:
fr: Modifiez les valeurs suivantes pour qu'elles correspondent à vos paramètres de base de données :

source: Change the following to reflect your off-site FTP server parameters:
fr: Modifiez les valeurs suivantes pour qu'elles correspondent aux paramètres de votre serveur FTP distant :

source: Save the file with the ``.pl`` extension (for the purposes of this article we will name the file: ``elgg-ftp-backup-script.pl``) and upload it to the following directory ``/home/userx/sitebackups``
fr: Enregistrez le fichier avec l'extension ``.pl`` (dans le cadre de cet article nous appellerons ce fichier : ``elgg-ftp-backup-script.pl``) et chargez-le dans le répertoire ``/home/userx/sitebackups``

source: Be aware that you can turn off FTP and flip a bit in the script so that it does not delete the local backup file in the event that you don't want to use off-site storage for your backups.
fr: Ayez conscience que vous pouvez désactiver le FTP et modifier un peu le script de sorte qu'il ne supprime pas le fichier de backup local dans le cas où vous ne voulez pas utiliser de stockage distant pour vos backups.

source: Configure the backup Cron job
fr: Configurez la tâche périodique cron de backup

source: Login to your CPanel application and click on the "Cron Jobs" link. In the Common Settings dropdown choose "Once a day" and type the following in the command field ``/usr/bin/perl /home/userx/sitebackups/elgg-ftp-backup-script.pl``
fr: Connectez-vous à votre application CPanel et cliquez sur le lien "Cron Jobs". Dans le menu déroulant Paramètres communs - "Common Settings", choisissez une fois par jour - "Once a day" - et tapez ce qui suit dans le champ de commande ``/usr/bin/perl /home/userx/sitebackups/elgg-ftp-backup-script.pl``

source: Click on the "Add New Cron Job" button. Daily full backups are now scheduled and will be transferred off-site.
fr: Cliquez sur le bouton d'ajout d'une nouvelle tâche cron "Add New Cron Job". Des sauvegardes quotidiennes complètes sont désormais planifiées et seront transférées hors du site.

source: Configure the cleanup Cron job
fr: Configurez la tâche périodique Cron de nettoyage

source: If you are sending your backups, via FTP, to another shared hosting provider that uses the CPanel application or you've turned off FTP altogether you can configure your data retention as follows.
fr: Si vous envoyez vos sauvegardes, via FTP, à un autre hébergeur mutualisé qui utilise l'application CPanel ou si vous avez totalement désactivé FTP, vous pouvez configurer votre conservation des données comme suit.

source: Login to your CPanel application for your FTP site, or locally if you're not using FTP, and click on the "Cron Jobs" link. In the Common Settings dropdown choose "Once a day" and type the following in the command field ``find /home/usery/sitebackups/full_* -mtime +4 -exec rm {} \;``
fr: Connectez-vous à votre application CPanel pour votre site FTP, ou localement si vous n'utilisez pas FTP, et cliquez sur le lien "Cron Jobs". Dans le menu déroulant Paramètres communs - "Common Settings" choisissez une fois par jour - "Once a day" - et saisissez ce qui suit dans le champ de commande ``find /home/usery/sitebackups/full_* -mtime +4 -exec rm {} \;``

source: The ``-mtime X`` parameter will set the number of days to retain backups. All files older than ``x`` number of days will be deleted. Click on the "Add New Cron Job" button. You have now configured your backup retention time.
fr: Le paramètre ``-mtime X`` va définir le nombre de jours de rétention des sauvegardes. Tous les fichiers plus anciens que le nombre de jour ``x`` sera supprimé. Cliquez sur le bouton d'ajout d'une nouvelle tâche cron "Add New Cron Job". Vous avez maintenant configuré la durée de rétention de vos sauvegardes.

source: Restoring from backup
fr: Restauration depuis un backup

source: Prepare your backup files
fr: Préparez vos fichiers de backup

source: The assumption is that you're restoring your site to another shared hosting provider with CPanel.
fr: L'hypothèse est que vous restaurez votre site vers un autre prestataire d'hébergement mutualisé avec CPanel.

source: When the script backed the files up the original directory structure was maintained in the zip file. We need to do a little cleanup. Perform the following:
fr: Lorsque le script a sauvegardé les fichiers, la structure originelle des répertoires est conservée dans le fichier zip. Nous devons faire un petit nettoyage. Effectuez ce qui suit :

source: Download the backup file that you wish to restore from
fr: Téléchargez le fichier de backup à partir duquel vous souhaitez effectuer la restauration

source: Extract the contents of the backup file
fr: Décompressez le contenu du fichier de backup

source: Drill down and you will find your site backup and SQL backup. Extract both of these. You will then have:
fr: Naviguez pour trouver la sauvegarde de votre site et la sauvegarde SQL. Extrayez les deux archives. Vous aurez alors :

source: a MySQL dump file with a ``.sql`` extension
fr: un fichier de dump MySQL avec une extension ".sql"

source: another directory structure with the contents of:
fr: une autre structure de répertoire avec pour contenu :

source: Repackage the contents of the ``/home/userx/public_html`` directory as a zip file so that the files are in the root of the zip file
fr: Compressez le contenu du répertoire ``/home/userx/public_html`` sous forme de fichier zip de sorte que les fichiers soient à la racine du fichier zip

source: The reason for doing this is simple. It's much more efficient to upload one zip file than it is to ftp the contents of the ``/home/userx/public_html`` directory to your new host.
fr: La raison de cette démarche est simple. Il est beaucoup plus efficace de télécharger un seul fichier zip que d'envoyer par FTP sur votre nouvel hôte tout le contenu du répertoire ``/ home/userx/public_html``.

source: Repackage the contents of the /home/userx/elggdata directory as a zip file so that the files are in the root of the zip file
fr: Compressez le contenu du répertoire /home/userx/elggdata sous forme de fichier zip de sorte que les fichiers soient à la racine du fichier zip

source: You should now have the following files:
fr: Vous devriez maintenant avoir les fichiers suivants :

source: the ``.sql`` file
fr: le fichier ``.sql``

source: the zip file with the contents of ``/home/userx/public_html`` in the root
fr: le fichier zip avec le contenu de ``/home/userx/public_html`` à la racine

source: the zip file with the contents of ``/home/userx/elggdata`` in the root
fr: le fichier zip avec le contenu de `/home/userx/elggdata`` à la racine

source: Restore the files
fr: Restaurez les fichiers

source: This is written with the assumption that you're restoring to a different host but maintaining the original directory structure. Perform the following:
fr: Ceci est écrit dans l'hypothèse que vous restaurez vers un hébergement différent mais conservez la même structure de répertoires. Faites comme suit :

source: Login to the CPanel application on the host that you wish to restore the site to and open the File Manager.
fr: Connectez-vous à l'application CPanel de l'hébergement sur lequel vous souhaitez restaurer le site et ouvrez le gestionnaire de fichiers - "File Manager".

source: Navigate to ``/home/usery/public_html``
fr: Naviguez vers ``/home/usery/public_html``

source: Upload the zip file that contains the ``/home/userx/public_html`` files
fr: Chargez le fichier zip qui contient les fichiers de ``/home/userx/public_html``

source: Extract the zip file
fr: Décompressez le fichier zip

source: You should now see all of the files in ``/home/usery/public_html``
fr: Vous devriez maintenant voir tous les fichiers dans ``/home/usery/public_html``

source: Delete the zip file
fr: Supprimez le fichier zip

source: Navigate to ``/home/usery/elggdata``
fr: Naviguez vers ``/home/usery/elggdata``

source: Upload the zip file that contains the ``/home/userx/elggdata`` files
fr: Chargez le fichier zip qui contient les fichiers de ``/home/userx/elggdata``

source: You should now see all of the files in /home/usery/elggdata
fr: Vous devriez maintenant voir tous les fichiers dans /home/usery/elggdata

source: Program and data file restoration is complete
fr: La restauration des fichiers du programme et des données est terminée

source: Restore the MySQL Database
fr: Restaurez la base de données MySQL

source: Again, the assumption here is that you're restoring your Elgg installation to a second shared hosting provider. Each shared hosting provider prepends the account holder's name to the databases associated with that account. For example, the username for our primary host is ``userx`` so the host will prepend ``userx_`` to give us a database name of ``userx_elgg``. When we restore to our second shared hosting provider we're doing so with a username of ``usery`` so our database name will be ``usery_elgg``. The hosting providers don't allow you to modify this behavior. So the process here isn't as simple as just restoring the database from backup to the usery account. However, having said that, it's not terribly difficult either.
fr: A nouveau, l'hypothèse ici est que vous restaurez votre installation Elgg vers un second fournisseur d'hébergement mutualisé. Chaque fournisseur d'hébergement mutualisé préfixe avec le nom du compte du détenteur les bases de données associées à ce compte. Par exemple, l'identifiant de notre premier hébergement est ``userx`` de sorte que l'hébergeur va ajouter le préfixe ``userx_`` pour nous donner un nom de base de données de ``userx_elgg``. Quand nous restaurons vers notre second fournisseur d'hébergement mutualisé nous le faisons avec un identfiant de ``usery`` de sorte que le nom de notre base de données sera ``usery_elgg``. Les fournisseurs d'hébergement ne vous permettent pas de modifier ce comportement. De sorte que le processus ici n'est pas aussi simple que simplement restaurer la base de données depuis le backup vers le compte usery. Néanmoins, une fois ceci dit, ce n'est pas si difficile non plus.

source: Edit the MySQL backup
fr: Modifiez le backup MySQL

source: Open the ``.sql`` file that you extracted from your backup in your favorite text editor. Comment out the following lines with a hash mark:
fr: Ouvrez le fichier``.sql`` que vous avez extrait de votre backup dans votre éditeur de texte favori. Commentez les lignes suivantes avec un dièse :

source: Save the file.
fr: Enregistrez le fichier.

source: Create the new database
fr: Créez la nouvelle base de données

source: Perform the following:
fr: Effectuez les actions suivantes :

source: Login to the CPanel application on the new host and click on the "MySQL Databases" icon
fr: Connectez-vous à l'application CPanel du nouvel hôte et cliquez sur l'icône "Bases de données MySQL - "MySQL Databases"

source: Fill in the database name and click the "create" button. For our example we are going to stick with ``elgg`` which will give us a database name of ``usery_elgg``
fr: Renseignez le nom de la base de données et cliquez sur le bouton créer - "create". Pour notre exemple, nous allons conserver ``elgg`` ce qui nous donne pour nom de base de données ``usery_elgg``

source: You can associate an existing user with the new database, but to create a new user you will need to:
fr: Vous pouvez associer un utilisateur existant à la nouvelle base de données, ou pour créer un nouvel utilisateur vous aurez besoin de :

source: Go to the "Add New User" section of the "MySQL Databases" page
fr: Allez dans la section "Ajouter Nouvel utilisateur" de la page "Bases de données MySQL"

source: Enter the username and password. For our example we're going to keep it simple and use ``elgg`` once again. This will give us a username of ``usery_elgg``
fr: Saisissez l'identifiant et le mot de passe. Pour notre exemple nous allons rester simples et utiliser à nouveau ``elgg``. Ce qui va nous donner un identifiant ``usery_elgg``

source: Associate the new user with the new database
fr: Associez le nouvel utilisateur avec la nouvelle base de données

source: Go to the "Add User To Database" section of the "MySQL Databases" page. Add the ``usery_elgg`` user to the ``usery_elgg`` database
fr: Allez dans la section Ajouter un nouvel utilisateur à la base de données - "Add User To Database" - de la page des Bases de données MySQL - "MySQL Databases". Ajoutez l'utilisateur ``usery_elgg`` à la base de données ``usery_elgg``

source: Select "All Privileges" and click the "Make Changes" button
fr: Sélectionnez "Tous les Privilèges" - "All Privileges" - et cliquez sur le bouton "Effectuer les changements" - "Make Changes"

source: Restore the production database
fr: Restaurez la base de données de production

source: Now it's time to restore the MySQL backup file by importing it into our new database named "usery_elgg".
fr: Maintenant il est temps de restaurer le fichier de backup MySQL en l'important dans notre nouvelle base de données nommée "usery_elgg".

source: Login to the CPanel application on the new host and click on the "phpMyAdmin icon
fr: Connectez-vous à l'application CPanel du nouvel hôte et cliquez sur l'"icône phpMyAdmin

source: Choose the ``usery_elgg`` database in the left hand column
fr: Choisissez la base de données ``usery_elgg`` dans la colonne de gauche

source: Click on the "import" tab at the top of the page
fr: Cliquez sur l'onglet "import" en haut de la page

source: Browse to the ``.sql`` backup on your local computer and select it
fr: Naviguez jusqu'au backup ``.sql`` dans votre arborescence locale et sélectionnez-le

source: Click the "Go" button on the bottom right side of the page
fr: Cliquez sur le bouton "Go" en bas à droite de la page

source: You should now see a message stating that the operation was successful
fr: Vous devriez maintenant voir un message indiquant que l'opération a réussi

source: Bringing it all together
fr: Combiner le tout

source: The restored elgg installation knows **nothing** about the new database name, database username, directory structure, etc. That's what we're going to address here.
fr: L'installation elgg restaurée ne connaît **rien** du nom de la nouvelle base de données, de l'identifiant, de la structure des répertoires, etc. C'est ce que nous allons aborder ici.

source: Edit ``/public_html/elgg-config/settings.php`` on the new hosting provider to reflect the database information for the database that you just created.
fr: Modifiez ``/public_html/elgg-config/settings.php`` sur le nouvel hébergement pour reproduire les informations de la base de données que vous venez de créer.

source: Upload the ``settings.php`` file back to the new host - overwriting the existing file.
fr: Téléchargez le fichier ``settings.php`` vers le nouvel hôte - en remplaçant le fichier existant.

source: Open the phpMyAdmin tool on the new host from the CPanel. Select the ``usery_elgg`` database on the left and click the SQL tab on the top of the page. Run the following SQL queries against the ``usery_elgg`` database:
fr: Ouvrez l'outil phpMyAdmin sur le nouvel hôte depuis CPanel. Sélectionnez la base de données ``usery_elgg`` sur la gauche, et cliquez sur l'onglet SQL en haut de la page. Exécutez les requêtes SQL suivantes sur la base de données ``usery_elgg`` :

source: Change the installation path
fr: Modifiez le chemin d'installation

source: Change the data directory
fr: Modifiez le répertoire de données

source: Change the filestore data directory
fr: Modifiez le répertoire de données de stockage des fichiers

source: Finalizing the new installation
fr: Finaliser la nouvelle installation

source: Run the upgrade script by visiting the following URL: ``http://mynewdomain.com/upgrade.php`` . Do this step twice - back to back.
fr: Exécutez le script de mise à niveau en visitant l'URL suivante : ``http://mynewdomain.com/upgrade.php`` . Effectuez cette étape deux fois - depuis le début.

source: Update your DNS records so that your host name resolves to the new host's IP address if this is a permanent move.
fr: Mettez à jour vos enregistrements DNS de sorte que votre nom d'hôte se résolve toujours vers l'adresse IP du nouvel hôte si c'est un déplacement permanent.

source: Congratulations!
fr: Félicitations !

source: If you followed the steps outlined here you should now have a fully functional copy of your primary Elgg installation.
fr: Si vous avez suivi les étapes soulignées ici vous devriez maintenant avoir une copie totalement fonctionnelle de votre installation Elgg d'origine.

source: Related
fr: Connexe

source: FTP backup script
fr: Script de backup FTP

source: Here is an automated script for backing up an Elgg installation.
fr: Voici un script automatisé pour sauvegarder une installation Elgg.

source: Composer installation
fr: Installation avec Composer

source: The easiest way to keep your Elgg site up-to-date is by using `Composer`_. Composer will take care of installing all the required dependencies of all plugins and Elgg, while also keeping those depencies up-to-date without having conflicts.
fr: Le moyen le plus simple pour garder votre site Elgg à jour est d'utiliser `Composer`_. Composer va s'occuper d'installer toutes les dépendances requises pour tous les plugins et pour Elgg, tout en conservant également ces dépendances à jour sans avoir de conflit.

source: Install Composer
fr: Installer Composer

source: Install Elgg as a Composer Project
fr: Installer Elgg en tant que projet Composer

source: This will create a composer.json file based of the `Elgg starter project`_ which has the basics of installing Elgg.
fr: Ceci va créer un fichier composer.json sur la base du projet de démarrage Elgg `Elgg starter project`_ qui a les bases pour installer Elgg.

source: Open your browser
fr: Ouvrez votre navigateur

source: Go to your browser and install Elgg via the installation interface
fr: Allez sur votre navigateur et installez Elgg via l'interface d'installation

source: Setup version controls
fr: Mettre en place un contrôle de version

source: This step is optional but highly recommended. It'll allow you to easily manage the installation of the same plugin versions between environments (development/testing/production).
fr: Cette étape est optionnelle mais vivement recommandée. Elle vous permettra de gérer simplement l'installation du même plugin entre différents environnements (développement/tests/production).

source: Install plugins
fr: Installer les plugins

source: Install plugins as Composer depencies. This assumes that a plugin has been registered on `Packagist`_
fr: Installez les plugins sous forme de dépendances Composer. Ceci suppose qu'un plugin a été enregistré sur `Packagist`_

source: Commit
fr: Commitez
