Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/admin.po
Languages: fr

source: Make sure ``composer.lock`` is not ignored in ``.gitignore``
fr: Assurez-vous que ``composer.lock`` n'est pas ignoré dans ``.gitignore``

source: Deploy to production
fr: Déployer en production

source: Initial Deploy
fr: Déploiement initial

source: Subsequent Deploys
fr: Déploiements subséquents

source: What does it do?
fr: Qu'est-ce que ça fait ?

source: `Cron`_ is a program available on Unix-based operating systems that enables users to run commands and scripts at set intervals or at specific times.
fr: `Cron`__ est un programme disponible sur les systèmes d'exploitation basés sur Unix qui permet aux utilisateurs d'exécuter des commandes et des scripts à des intervalles définis ou à des heures précises.

source: Elgg's cron handler allows administrators and plugin developers to setup jobs that need to be executed at set intervals.
fr: Le gestionnaire de cron de Elgg permet aux administrateurs et aux développeurs de plugins de mettre en place des tâches qui ont besoin d'être exécutées à des intervalles définis.

source: Most common examples of cron jobs in Elgg include:
fr: Les exemples les plus courants de tâches cron dans Elgg incluent :

source: sending out queued notifications
fr: l'envoi des notifications en file d'attente

source: rotating the system log in the database
fr: la rotation des journaux système dans la base de données

source: collecting garbage in the database (compacting the database by removing entries that are no longer required)
fr: le nettoyage des déchets - garbage collector - dans la base de données (compactage de la base de données par la suppression des entrées qui ne sont plus requises)

source: Plugins can add jobs by registering a plugin hook handler for one of the following cron intervals:
fr: Les plugins peuvent ajouter des tâches en enregistrant un gestionnaire de hook plugin pour l'un des intervalles de cron suivants :

source: ``minute`` - Run every minute
fr: ``minute`` - Exécuté toutes les minutes

source: ``fiveminute`` - Run every 5 minutes
fr: ``fiveminute`` - Exécuté toutes les 5 minutes

source: ``fifteenmin`` - Run every 15 minutes
fr: ``fifteenmin`` - Exécuté toutes les 15 minutes

source: ``halfhour`` - Run every 30 minutes
fr: ``halfhour`` - Exécuté toutes les 30 minutes

source: ``hourly`` - Run every hour
fr: ``hourly`` - Exécuté toutes les heures

source: ``daily`` - Run every day
fr: ``daily`` - Exécuté tous les jours

source: ``weekly`` - Run every week
fr: ``weekly`` - Exécuté toutes les semaines

source: ``monthly`` - Run every month
fr: ``monthly`` - Exécuté tous les mois

source: ``yearly`` - Run every year
fr: ``yearly`` - Exécuté tous les ans

source: How does it work?
fr: Comment ça marche ?

source: ``crontab`` must be setup in such a way as to activate Elgg cron handler every minute, or at a specific interval. Once cron tab activates the cron job, Elgg executes all hook handlers attached to that interval.
fr: ``crontab`` doit être configuré de telle manière qu'il active le gestionnaire de cron de Elgg chaque minute, ou à un intervalle spécifique. Une fois que l'entrée du cron active la tâche du cron, Elgg exécute chaque gestionnaire de hook attaché à cet intervalle.

source: If you have SSH access to your Linux servers, type ``crontab -e`` and add your crontab configuration.
fr: Si vous avez un accès SSH à vos serveurs Linux, tapez ``crontab -e`` et ajoutez votre configuration crontab.

source: The above command will run every minute and activate all due cron jobs.
fr: La commande suivante va s'exécuter chaque minute et activer toutes les tâches du cron attendues.

source: Optionally you can activate handlers for a specific interval:
fr: Facultativement, vous pouvez activer les gestionnaire pour un intervalle spécifique :

source: More information about cron can be found at:
fr: Vous pouvez trouver plus d'informations sur cron sur :

source: Duplicate Installation
fr: Dupliquer une installation

source: Why Duplicate an Elgg Installation?
fr: Pourquoi dupliquer une installation Elgg ?

source: There are many reasons you may want to duplicate an Elgg installation: moving the site to another server, creating a test or development server, and creating functional backups are the most common. To create a successful duplicate of an Elgg site, 3 things need to be copied:
fr: Il existe beaucoup de raisons pour lesquelles vous pouvez vouloir dupliquer une installation Elgg : déplacer le site vers un autre serveur, créer un serveur de test ou de développement, et créer des backups fonctionnels sont les plus habituelles. Pour créer un double fonctionnel d'un site Elgg, 3 choses doivent être copiées :

source: Database
fr: Base de données

source: Data from the data directory
fr: Données du répertoire de données

source: Also at least 5 pieces of information must be changed from the copied installation:
fr: Il faut modifier au moins 5 éléments d'information pour une installation copiée :

source: ``elgg-config/settings.php`` file which could also be in the pre 2.0 location ``engine/settings.php``
fr: le fichier ``elgg-config/settings.php`` qui peut aussi se trouver à l'emplacement ``engine/settings.php`` pour les versions pré-2.0

source: ``.htaccess`` file (Apache) or Nginx configuration depending on server used
fr: le fichier ``.htaccess`` (Apache) ou la configuration de Nginx en fonction du serveur utilisé

source: database entry for your site entity
fr: l'entrée de la base de donnée pour l'entité de votre site

source: database entry for the installation path
fr: l'entrée de la base de donnée pour le chemin d'installation

source: database entry for the data path
fr: l'entrée de la base de donnée pour le chemin du répertoire des données

source: What Is Not Covered in This Tutorial
fr: Ce qui n'est pas traité dans ce tutoriel

source: This tutorial expects a basic knowledge of Apache, MySQL, and Linux commands. As such, a few things will not be covered in this tutorial. These include:
fr: Ce tutoriel nécessite une connaissance minimale d'Apache, MySQL, et des commandes Linux. A ce titre, certaines choses ne seront pas couvertes dans ce tutoriel. Ceci comprend :

source: How to backup and restore MySQL databases
fr: Comment faire un backup - sauvegarder et restaurer des bases de données MySQL

source: How to configure Apache to work with Elgg
fr: Comment configurer Apache pour fonctionner avec Elgg

source: How to transfer files to and from your production server
fr: Comment transférer des fichiers vers et depuis votre serveur de production

source: Before You Start
fr: Avant de commencer

source: Before you start, make sure the Elgg installation you want to duplicate is fully functional. You will also need the following items:
fr: Avant de commencer, assurez-vous que votre installation Elgg est pleinement fonctionnelle. Vous aurez aussi besoin des éléments suivants :

source: A backup of the live Elgg database
fr: Un backup de la base de données de votre site Elgg actif

source: A place to copy the live database
fr: Un emplacement pour copier la base de données active

source: A server suitable for installing duplicate Elgg site
fr: Un serveur qui convienne pour installer le site Elgg dupliqué

source: (This can be the same server as your production Elgg installation.)
fr: (Qui peut être le même serveur que celui de votre installation Elgg en production)

source: Backups of the database can be obtained various ways, including phpMyAdmin, the MySQL official GUI, and the command line. Talk to your host for information on how to backup and restore databases or use Google to find information on this.
fr: Les backups de la base de données peuvent être obtenus de diverses manières, y compris via phpMyAdmin, l'interface graphique de MySQL, et la ligne de commande. Contactez votre hébergeur pour des informations sur comment sauvegarder et restaurer des bases de données, ou utilisez un moteur de recherche pour trouver de l'information à ce sujet.

source: During this tutorial, we will make these assumptions about the production Elgg site:
fr: Au cours de ce tutoriel, nous allons faire les hypothèses suivantes à propos du site Elgg en production :

source: The URL is ``http://www.myelgg.org/``
fr: L'URL est ``http://www.myelgg.org/``

source: The installation path is ``/var/www/elgg/``
fr: Le chemin d'installation est ``/var/www/elgg/``

source: The data directory is ``/var/data/elgg/``
fr: Le chemin du répertoire de données est ``/var/data/elgg/``

source: The database host is ``localhost``
fr: L'hôte de la base de données est ``localhost``

source: The database name is ``production_elgg``
fr: Le nom de la base de données est ``production_elgg``

source: The database user is ``db_user``
fr: L'utilisateur de la base de données est ``db_user``

source: The database password is ``db_password``
fr: Le mot de passe de la base de données est ``db_password``

source: The database prefix is ``elgg``
fr: Le préfixe des tables de la base de données est ``elgg``

source: At the end of the tutorial, our test Elgg installation details will be:
fr: A la fin du tutoriel, les renseignements de notre installation Elgg de test seront :

source: The URL is ``http://test.myelgg.org/``
fr: L'URL est ``http://test.myelgg.org/``

source: The installation path is ``/var/www/elgg_test/``
fr: Le chemin d'installation est ``/var/www/elgg_test/``

source: The data directory is ``/var/data/elgg_test/``
fr: Le répertoire de données est ``/var/data/elgg_test/``

source: The database name is ``test_elgg``
fr: Le nom de la base de données est ``test_elgg``

source: Copy Elgg Code to the Test Server
fr: Copiez le code de Elgg vers le serveur de test

source: The very first step is to duplicate the production Elgg code. In our example, this is as simple as copying ``/var/www/elgg/`` to ``/var/www/elgg_test/``.
fr: La toute première étape est de dupliquer le code du site Elgg de production. Dans notre exemple, c'est aussi simple que de copier ``/var/www/elgg/`` vers ``/var/www/elgg_test/``.

source: Copy Data to the Test Server
fr: Copiez les données de Elgg vers le serveur de test

source: In this example, this is as simple as copying ``/var/data/elgg/`` to ``/var/data/elgg_test/``.
fr: Dans cet exemple, c'est aussi simple que copier ``/var/data/elgg/`` vers ``/var/data/elgg_test/``.

source: If you don't have shell access to your server and have to ftp the data, you may need to change ownership and permissions on the files.
fr: Si vous n'avez pas d'accès console - shell - à votre serveur et devez transférer les données par FTP, vous pouvez avoir besoin de modifier le propriétaire et les permissions des fichiers.

source: You also need to delete cache directories from your disk. These correspond to ``cacheroot`` and ``assetroot`` directories in your config.
fr: Vous devez aussi supprimer les dossiers de cache du disque. Ceux-ci correspondent aux dossiers ``cacheroot`` et ``assetroot`` dans votre configuration.

source: Edit settings.php
fr: Editez settings.php

source: The ``elgg-config/settings.php`` file contains the database configuration details. These need to be adjusted for your new test Elgg installation. In our example, we'll look in ``/var/www/elgg_test/elgg-config/settings.php`` and find the lines that look like this:
fr: Le fichier ``elgg-config/settings.php`` contient les renseignement de configuration de la base de données. Ceux-ci doivent être ajustés pour votre nouvelle installation Elgg de test. Dans notre exemple, nous allons regarder dans ``/var/www/elgg_test/elgg-config/settings.php`` et trouver les lignes qui ressemblent à ceci :

source: We need to change these lines to match our new installation:
fr: Nous devons modifier ces lignes pour qu'elles correspondent à notre nouvelle installation :

source: Notice the ``$CONFIG->dbname`` has changed to reflect our new database.
fr: Notez que ``$CONFIG->dbname`` a changé pour correspondre à notre nouvelle base de données.

source: Copy Elgg Database
fr: Copier la base de données de Elgg

source: Now the database must be copied from ``elgg_production`` to ``elgg_test``. See your favorite MySQL manager's documentation for how to make a duplicate database. You will generally export the current database tables to a file, create the new database, and then import the tables that you previously exported.
fr: Maintenant la base de données doit être copiée depuis ``elgg_production`` vers ``elgg_test``. Voyez la documentation de votre gestionnaire MySQL préféré pour savoir comment dupliquer une base de données. Vous allez généralement exporter les tables de la base de donnée actuelle vers un fichier, créer la nouvelle base de données, puis importer les tables que vous avez précédemment exportées.

source: You have two options on updating the values in the database. You could change the values in the export file or you could import the file and change the values with database queries. One advantage of modifying the dump file is that you can also change links that people have created to content within your site. For example, if people have bookmarked pages using the bookmark plugin, the bookmarks will point to the old site unless your update their URLs.
fr: Vous avez deux possibilités pour mettre à jour les valeurs dans la base de données. Vous pourriez changer les valeurs dans le fichier exporté, ou vous pourriez modifier ces valeurs par des requêtes sur la base de données. Un avantage de modifier directement le fichier exporté est que vous pouvez aussi modifier les liens que les utilisateurs ont créé vers du contenu au sein de votre site. Par exemple, si des personnes ont mis en marque-page des pages avec le plugin bookmarks, les marque-pages vont pointer vers l'ancien site tant que vous n'aurez pas mis à jour leurs URLs.

source: Database Entries
fr: Entrées de la base de données

source: We must now change 4 entries in the database. This is easily accomplished with 4 simple SQL commands:
fr: Nous devons maintenant modifier 4 entrées dans la base de données. Ceci peut être fait aisément en exécutant 4 commandes SQL simples :

source: Check .htaccess
fr: Vérifiez le fichier .htaccess

source: If you have made changes to .htaccess that modify any paths, make sure you update them in the test installation.
fr: Si vous aviez apporté des modifications au fichier .htaccess qui modifient des chemins, assurez-vous que vous les mettez à jour dans l'installation de test.

source: Update Webserver Config
fr: Mettez à jour la configuration du serveur web

source: For this example, you must edit the Apache config to enable a subdomain with a document root of ``/var/www/elgg_test/``. If you plan to install into a subdirectory of your document root, this step is unnecessary.
fr: Pour cet exemple, vous devez modifier la config Apache pour activer un sous-domaine avec pour racine des documents - document root ``/var/www/elgg_test/``. Si vous prévoyez d'installer dans un sous-répertoire de votre racine des documents, cette étape n'est pas nécessaire.

source: If you're using Nginx, you need to update server config to match new paths based on ``install/config/nginx.dist``.
fr: Si vous utilisez Nginx, vous aurez besoin de mettre à jour la configuration du serveur pour correspondre aux nouveaux chemins basés sur ``install/config/nginx.dist``.

source: Run upgrade.php
fr: Exécutez upgrade.php

source: To regenerate cached data, make sure to run ``http://test.myelgg.org/upgrade.php``
fr: Pour régénérer les données mises en cache, assurez-vous d'exécuter ``http://test.myelgg.org/upgrade.php``

source: Tips
fr: Astuces

source: It is a good idea to keep a test server around to experiment with installing new mods and doing development work. If you automate restorations to the ``elgg_test`` database, changing the ``$CONFIG`` values and adding the follow lines to the end of the ``elgg_test/elgg-config/settings.php`` file will allow seamless re-writing of the MySQL database entries.
fr: C'est une bonne idée de garder un serveur de test à portée de main pour expérimenter l'installation de nouveaux plugins et faire du développement. Si vous automatisez les restaurations de la base de données ``elgg_test``, modifier les valeurs de ``$CONFIG`` et ajouter les lignes suivantes à la fin du fichier ``elgg_test/elgg-config/settings.php`` va permettre de réécrire sans couture les entrées de la base de données MySQL.

source: Getting Help
fr: Trouver de l'aide

source: Having a problem with Elgg? The best way to get help is to ask at the `Community Site`_. This site is community supported by a large group of volunteers. Here are a few tips to help you get the help you need.
fr: Vous avez un problème avec Elgg ? Le meilleur moyen d'obtenir de l'aide est de demander sur le `Site de la Communité`_. Ce site communautaire est animé par un grand nombre de volontaires. Voici quelques astuces pour vous aider à trouver l'aide dont vous avez besoin.

source: Getting help
fr: Trouver de l'aide

source: Don't be a `Help Vampire`_
fr: Ne soyez pas un `Vampire de l'Aide`_

source: We were all newbies at one time, but we can all learn. Not showing that you are making attempts to learn on your own or do your own research is off putting for those helping. Also, very generic questions like "How do I build a forum?" are almost impossible to answer.
fr: Nous avons tous été des débutants à un moment, mais nous pouvons tous apprendre. Le fait de ne pas montrer que vous faites des tentatives pour apprendre par vous-même ou faites vos propres recherches est décourageant pour ceux qui aident. De plus, il est quasiment impossible de répondre à des questions très génériques comme "Comment je construis un forum ?".

source: Search first
fr: Faites d'abord des recherches

source: Be sure to search the documentation (this site), the `Community Site`_, and Google before asking a question. New users to Elgg frequently have the same questions, so please search. People are less inclined to reply to a post that has been answered many other times or that can be answered easily by Googling.
fr: Assurez-vous de faire des recherches dans la documentation (ce site), sur le `Site de la Communauté`_, et dans un moteur de recherche avant de poser une question. Les nouveaux utilisateurs de Elgg se posent souvent les mêmes questions, aussi merci de faire des recherches. Les membres sont moins enclins à répondre à une demande à laquelle il a déjà été répondu maintes fois ou à laquelle on peut facilement trouver une réponse via un moteur de recherche.

source: Ask once
fr: Demandez une seule fois

source: Posting the same questions in multiple places makes it hard to answer you. Ask your question in one place only. Duplicate questions may be moderated.
fr: Poser les mêmes questions à plusieurs endroits rend plus difficile le fait de vous répondre. Posez votre questions à un seul endroit. Les questions dupliquées peuvent être modérées.

source: Include Elgg Version
fr: Indiquez la version de Elgg

source: Different versions of Elgg have different features (and different bugs). Including the version of Elgg that you are using will help those helping you.
fr: Les différentes versions de Elgg ont différentes fonctionnalités (et différents bugs). Préciser la version de Elgg que vous utilisez va aider les personnes qui aident.

source: Have a reasonable profile
fr: Ayez un profil raisonnable

source: Profiles that look like spam or have silly names will often be ignored. Joviality is fine, but people are more likely to help Michael than 1337elggHax0r.
fr: Les profils qui ressemblent à du spam ou ont des noms loufoques seront souvent ignorés. La jovialité est bienvenue, mais les membres ont plus de chance d'aider Michael que 1337elggHax0r.

source: Post in the appropriate forum
fr: Publiez dans le forum approprié

source: Check to make sure you're posting in the right forum. If you have a question about creating a plugin, don't post to the Elgg Feedback forum. If you need help installing Elgg, post to Technical Support instead of the Theming group.
fr: Assurez-vous de publier dans le bon forum. Si vous avez une question sur comment créer un plugin, n'écrivez pas dans le forum "Elgg Feedback". Si vous avez besoin d'aide pour installer Elgg, écrivez dans le groupe de support technique "Technical Support" et pas dans le groupe des thèmes "Theming".

source: Use a descriptive topic title
fr: Utilisez un titre de sujet descriptif

source: Good topic titles concisely describe your problem or question. Bad topic titles are vague, contain all capital letters, and excessive punctuation.
fr: De bons titres de sujets décrivent de manière concise votre problème ou question. De mauvais titres sont vagues, ne contiennent que les lettres capitales, et une ponctuation excessive.

source: Good title: "White screen after upgrading to 1.7.4."
fr: Bon titre : "Écran blanc après la mise à niveau vers 1.7.4"

source: Bad title: "URGENT!!!!! site broke ;-( losing money help!!!!!!!!!!!"
fr: Mauvais titre : "URGENT!!!! site cassé ;-( je perds de l'argent à l'aide!!!!!!!!!!"

source: Be detailed
fr: Donnez des détails

source: Include as many details about your problem as possible. If you have a live site, include a link. Be forthcoming if community members might ask for more information. We can't help you if you won't give any details!
fr: Ajoutez autant de détails que possible à propos de votre problème. Si vous avez un site en ligne, incluez un lien. Soyez accueillant si des membres de la communauté vous demandent plus d'informations. Nous ne pouvons pas vous aider si vous ne donnez pas de détails !

source: Keep it public
fr: Gardez cela public

source: This is a public forum for the good of the Elgg project. Keep posts public. There's no reason for anyone to ask you to send a private message or email. Likewise, there's no reason to ask anyone to send a private email to you. Post in the public.
fr: C'est un forum public pour le bien du projet Elgg. Gardez les messages publics. Il n'y a aucune raison pour qui que ce soit de vous envoyer des messages privés ou des e-mails. De même, il n'y a aucune raison de demander à qui que ce soit de vous envoyer un e-mail privé. Publiez en public.

source: Guidelines
fr: Recommandations

source: In addition to the `site-wide Terms and Policies`_, following these guidelines keeps our community site useful and safe for everyone.
fr: En plus des `mentions légales et des conditions d'utilisation du site`_, suivre ces recommandations aide à garder notre site communautaire utile et sûr pour tout le monde.

source: Content
fr: Contenu

source: All content must be safe for work: PG in the US and UK. If your Elgg site has adult content and you have been asked to post a link, please mark it NSFW (Not Safe For Work) so people know.
fr: Tous les contenus doivent être tous publics : "PG" ou Parental Guidance - classification des contenus adultes aux USA et au Royaume-Uni. Si votre site Elgg a du contenu adulte et qu'on vous a demandé de publier un lien, veuillez le marquer "NSFW" (Not Safe For Work) de sorte que les personnes le sachent.

source: Excessive swearing in any language will not be tolerated.
fr: L'utilisation excessive de jurons dans n'importe quelle langue ne sera pas tolérée.

source: Mood
fr: Humeur
