Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/admin.po
Languages: fr

source: You may experience memory problems if you use the Elgg framework as a library in a PHP CLI script. This can be disabled by setting ``$CONFIG->db_disable_query_cache = true;``
fr: Vous pouvez rencontrer des problèmes de mémoire si vous utilisez le framework Elgg comme bibliothèque dans un script PHP CLI. Ceci peut être désactivé en définissant ``$CONFIG->db_disable_query_cache = true;``

source: Etags and Expires headers
fr: Etags et headers Expires

source: These technologies tell your users' browsers to cache static assets (CSS, JS, images) locally. Having these enabled greatly reduces server load and improves user-perceived performance.
fr: Ces technologies indiquent aux navigateurs de vos utilisateurs de mettre en cache des actifs statiques (CSS, JS, images) localement. Avoir ceci activé réduit fortement la charge du serveur et améliore la performance perçue par les utilisateurs.

source: Use the `Firefox yslow plugin`__ or Chrome DevTools Audits to confirm which technologies are currently running on your site.
fr: Utilisez le `plugin Firefox yslow`__ ou les Outils de Développement de Chrome DevTools Audits pour confirmer quelles technologies sont utilisées actuellement sur votre serveur.

source: If the static assets aren't being cached:
fr: Si les actifs statiques ne sont pas mis en cache :

source: Verify that you have these extensions installed and enabled on your host
fr: Vérifiez que vous avez ces extensions et qu'elles sont activées sur votre hébergement

source: Update your .htaccess file, if you are upgrading from a previous version of Elgg
fr: Mettez à jour votre fichier .htaccess, si vous faites une mise à niveau depuis une version précédente de Elgg

source: Enable Simplecache_, which turns select views into browser-cacheable assets
fr: Activez Simplecache_, qui transforme les vues sélectionnées en actifs pouvant être mis en cache par le navigateur

source: Libmemcached was created by Brian Aker and was designed from day one to give the best performance available to users of Memcached.
fr: Libmemcached a été créé par Brian Aker et a été conçu dès le départ pour offrir la meilleure performance possible aux utilisateurs de Memcached.

source: http://libmemcached.org/About.html and https://secure.php.net/manual/en/book.memcached.php
fr: http://libmemcached.org/About.html et https://secure.php.net/manual/en/book.memcached.php

source: Installation requirements:
fr: Pré-requis pour l'installation :

source: Uncomment and populate the following sections in ``settings.php``
fr: Dé-commentez et renseignez les sections suivantes dans le fichier ``settings.php``

source: Optionaly if you run multiple Elgg installations but use ony one Memcache server, you may want to add a namespace prefix. In order to do this, uncomment the following line
fr: De manière optionnelle, si vous avez plusieurs installations Elgg mais n'utilisez qu'un seul serveur Memcache, vous pouvez vouloir ajouter un préfixe d'espace de nom. Afin de faire cela, dé-commentez la ligne suivante

source: We have had good results by using `Squid`_ to cache images for us.
fr: Nous avons obtenu de bons résultats en utilisant `Squid`_ pour mettre en cache les images.

source: Bytecode caching
fr: Mise en cache du code exécutable - "bytecode"

source: There are numerous PHP code caches available on the market. These speed up your site by caching the compiled byte code from your script meaning that your server doesn't have to compile the PHP code each time it is executed.
fr: Il existe de nombreux caches de code disponibles sur le marché. Ceux-ci accélèrent votre site en mettant en cache le code compilé depuis votre script, ce qui signifie que votre serveur n'a pas à compiler le code PHP à chaque fois qu'il est exécuté.

source: Direct file serving
fr: Servir directement les fichiers

source: If your server can be configured to support the X-Sendfile or X-Accel headers, you can configure it to be used in ``settings.php``. This allows your web server to directly stream files to the client instead of using PHP's ``readfile()``.
fr: Si votre serveur peut être configuré pour supporter les headers X-Sendfile ou X-Accel, vous pouvez configurer leur utilisation dans ``settings.php``. Ceci permet à votre serveur web de diffuser directement les fichiers au client au lieu d'utiliser la fonction PHP ``readfile()``.

source: Composer Autoloader Optimization
fr: Optimisation de l'Autoloader de Composer

source: The Composer autoloader is responsible for loading classes provided by dependencies of Elgg. The way the autoloader works is it searches for a classname in the installed dependencies. While this is mostly a fast process it can be optimized.
fr: Le chargeur automatique Composer est responsable du chargement des classes fournies par les dépendances de Elgg. La façon dont le chargeur automatique fonctionne est qu’il recherche un nom de classe dans les dépendances installées. Bien qu’il s’agisse principalement d’un processus rapide, il peut être optimisé.

source: You can optimize the autoloader 2 different ways. The first is in the commandline, the other is in the ``composer.json`` of your project.
fr: Vous pouvez optimiser l’autoloader de 2 façons différentes. La première est via la ligne de commande, l’autre est d'utiliser le fichier ``composer.json`` de votre projet.

source: If you want to optimize the autoloader using the commandline use the ``-o`` flag. The disadvantage is you have to add the ``-o`` flag every time you run Composer.
fr: Si vous souhaitez optimiser le chargeur automatique à l’aide de la ligne de commande, utilisez le drapeau ``-o``. L’inconvénient est que vous devez ajouter le drapeau ``-o`` à chaque fois que vous exécutez Composer.

source: The second option is to add the optimization to your ``composer.json`` file, that way you never forget it.
fr: La deuxième option consiste à ajouter l’optimisation à votre fichier ``composer.json``, de cette façon vous ne l’oubliez jamais.

source: Check out the `Autoloader Optimization`__ page for more information about how to optimize the Composer autoloader.
fr: Consultez la page d'optimisaiton de l'auto-chargement `Autoloader Optimization`__ pour plus d’informations sur l’optimisation du chargeur automatique Composer.

source: As of Elgg 3.0 all the `downloads`__ of Elgg from the website have the optimized autoloader.
fr: À partir de Elgg 3.0 tous les `téléchargements` de Elgg à partir du site disposent du chargeur automatique optimisé.

source: Hosting
fr: Hébergement

source: Don't expect to run a site catering for millions of users on a cheap shared host. You will need to have your own host hardware and access over the configuration, as well as lots of bandwidth and memory available.
fr: N'espérez pas faire tourner un site avec des millions d'utilisateurs sur un hébergement mutualisé à bas prix. Vous aurez besoin de votre propre serveur d'hébergement et d'avoir la main sur la configuration, ainsi que de beaucoup de bande passante et de mémoire disponibles.

source: Memory, CPU and bandwidth
fr: Mémoire, CPU et bande passante

source: Due to the nature of caching, all caching solutions will require memory. It is a fairly cheap return to throw memory and CPU at the problem.
fr: De par la nature de la mise en cache, toutes les solutions de mise en cache auront besoin de mémoire. C'est un investissement plutôt économique d'augmenter la mémoire et le CPU.

source: On advanced hardware it is likely that bandwidth is going to be your bottleneck before the server itself. Ensure that your host can support the load you are suggesting.
fr: Au sujet d'un matériel puissant il est probable que la bande passante soit le goulet d'étranglement - "bottleneck" - avant le serveur lui-même. Assurez-vous que votre hébergement peut supporter le trafic que vous attendez.

source: Lastly, take a look at your configuration as there are a few gotchas that can catch people.
fr: Enfin, jetez un coup d’œil à votre configuration car il y a quelques points d'attention qui peuvent surprendre les gens.

source: For example, out of the box, Apache can handle quite a high load. However, most distros of Linux come with mysql configured for small sites. This can result in Apache processes getting stalled waiting to talk to one very overloaded MySQL process.
fr: Par exemple, Apache peut d'emblée gérer une charge plutôt élevée. Cependant, la majorité des distributions Linux sont livrées avec mysql configuré pour de petits sites. Ceci peut peut donner lieu à des processus Apache bloqués qui attendent de pouvoir parler à un processus MySQL très surchargé.

source: Check for poorly-behaved plugins
fr: Vérifiez les plugins ayant un mauvais comportement

source: Plugins can be programmed in a very naive way and this can cause your whole site to feel slow.
fr: Des plugins peuvent être développés d'une manière très naïve et ceci peut ralentir l'ensemble du site.

source: Try disabling some plugins to see if that noticeably improves performance. Once you've found a likely offender, go to the original plugin author and report your findings.
fr: Essayez de désactiver quelques plugins pour voir si cela améliore notablement les performances. Une fois que vous avez trouvé un responsable potentiel, rendez-vous sur la page de l'auteur du plugin et signalez vos résultats.

source: Use client-rendered HTML
fr: Utilisez du HTML rendu côté client

source: We've found that at a certain point, much of the time spent on the server is simply building the HTML of the page with Elgg's views system.
fr: Nous avons constaté qu'à un certain niveau, une bonne partie du temps passé sur le serveur est simplement le temps de construction du HTML de la page avec le système de vues de Elgg.

source: It's very difficult to cache the output of templates since they can generally take arbitrary inputs. Instead of trying to cache the HTML output of certain pages or views, the suggestion is to switch to an HTML-based templating system so that the user's browser can cache the templates themselves. Then have the user's computer do the work of generating the output by applying JSON data to those templates.
fr: Il est très difficile de mettre en cache les sorties templates - des modèles de mise en page - dans la mesure où ils prennent généralement des entrées arbitraires. Au lieu d'essayer de mettre en cache la sortie de certaines pages ou vues, la suggestion est de basculer vers un système de modèles basé sur HTML de sorte que le navigateur de l'utilisateur puisse lui-même mettre en cache les modèles. Puis demandez à l'ordinateur de l'utilisateur de faire le travail de générer le résultat en appliquant des données JSON à ces modèles.

source: This can be very effective, but has the downside of being significant extra development cost. The Elgg team is looking to integrate this strategy into Elgg directly, since it is so effective especially on pages with repeated or hidden content.
fr: Ceci peut être très efficace, mais présente l'inconvénient de demander un travail de développement supplémentaire significatif. L'équipe de Elgg envisage d'intégrer cette stratégie directement dans Elgg, dans la mesure où c'est aussi efficace, tout particulièrement pour les pages avec du contenu répété ou masqué.

source: Plugins can modify the behavior of and add new features to Elgg.
fr: Les plugins peuvent modifier le comportement de Elgg et ajouter de nouvelles fonctionnalités.

source: Where to get plugins
fr: Où trouver des plugins

source: Plugins can be obtained from:
fr: Des plugins peuvent être obtenus depuis :

source: `The Elgg Community`_
fr: `La Communauté Elgg`_

source: Third-party sites (typically for a price)
fr: Sites tierce-partie (généralement pour un certain prix)

source: If no existing plugins meet your needs, you can `hire a developer`_ or :doc:`create your own </guides/index>`.
fr: Si aucun plugin existant ne correspond à vos besoins, vous pouvez solliciter un développeur `hire a developer`_ ou créer le vôtre :doc:`create your own </guides/index>`.

source: The Elgg Community
fr: La Communauté Elgg

source: Finding Plugins
fr: Trouver des plugins

source: Sort based on most popular
fr: Ordre de tri basé sur la popularité

source: On the community plugin page, you can sort by date uploaded (Filter: Newest) or number of downloads (Filter: Most downloads). Sorting by the number of downloads is a good idea if you are new to Elgg and want to see which plugins are frequently used by other administrators. These will often (but not always) be higher quality plugins that provide significant capabilities.
fr: Sur la page des plugins de la communauté, vous pouvez trier par date de mise en ligne (Filtre par date "Newest") ou par nombre de téléchargements (Filtre par nombre de téléchargement "Most downloads"). Trier par nombre de téléchargement est une bonne idée si vous débutez avec Elgg et voulez voir quels plugins sont fréquemment utilisés par d'autres administrateurs. Ceux-ci sont souvent (mais pas toujours) des plugins de meilleure qualité qui offrent des possibilités significatives.

source: Use the plugin tag search
fr: Utilisez la recherche de plugin par tag

source: Next to the filtering control on the plugin page is a search box. It enables you to search by tags. Plugins authors choose the tags.
fr: Une boite de recherche se trouve à côté des options de filtrage de la page des plugins. Elle vous permet de rechercher des plugins par tags. Les auteurs des plugins définissent les tags.

source: Look for particular plugin authors
fr: Identifiez les auteurs de plugins particuliers

source: The quality of plugins varies substantially. If you find a plugin that works well on your site, you can check what else that plugin author has developed by clicking on their name when viewing a plugin.
fr: La qualité des plugins varie de manière substantielle. Si vous trouvez un plugin qui fonctionne bien sur votre site, vous pouvez regarder les autres réalisations que l'auteur du plugin a développées en cliquant sur son nom lorsque vous êtes sur la page d'un plugin.

source: Evaluating Plugins
fr: Évaluer les Plugins

source: Look at the comments and ratings
fr: Regardez les commentaires et les notations

source: Before downloading and using a plugin, it is always a good idea to read through the comments that others have left. If you see people complaining that the plugin does not work or makes their site unstable, you probably want to stay away from that plugin. The caveat to that is that sometimes users ignore installation instructions or incorrectly install a plugin and then leave negative feedback. Further, some plugin authors have chosen to not allow comments.
fr: Avant de télécharger et d'utiliser un plugin, c'est toujours une bonne idée de lire les commentaires que les autres ont laissé. Si vous voyez des personnes qui se plaignent que le plugin ne fonctionne pas ou qu'il rend leur site instable, vous devriez probablement éviter ce plugin. Néanmoins, certains utilisateurs ignorent les instructions d'installation ou installent un plugin de manière incorrecte puis laissent un feedback négatif. De plus, certains auteurs de plugins choisissent de ne pas autoriser les commentaires.

source: Install on a test site
fr: Installer sur une site de test

source: If you are trying out a plugin for the first time, it is a bad idea to install it on your production site. You should maintain a separate test site for evaluating plugins. It is a good idea to slowly roll out new plugins to your production site even after they pass your evaluation on your test site. This enables you to isolate problems introduced by a new plugin.
fr: Si vous essayez un plugin pour la première fois, c'est une mauvaise idée de l'installer sur un site de production. Vous devriez maintenir un site de test séparé pour évaluer les plugins. C'est une bonne idée de mettre en place progressivement les plugins sur votre site de production même après qu'ils aient passé l'évaluation sur un site de test. Ceci vous permet d'isoler les problèmes potentiels introduits par un nouveau plugin.

source: Types of plugins
fr: Types de plugins

source: Themes
fr: Thèmes

source: Themes are plugins that modify the look-and-feel of your site. They generally include stylesheets, client-side scripts and views that alter the default presentation and behavior of Elgg.
fr: Les thèmes sont des plugins qui modifient l'apparence et le comportement de votre site. Ils comprennent généralement des feuilles de styles, des scripts côté client et des vues qui modifient la présentation et le comportement par défaut de Elgg.

source: Language Packs
fr: Packs de langues

source: Language packs are plugins that provide support for other languages.
fr: Les packs de langue sont des plugins qui fournissent le support d'autres langues.

source: Language packs can extend and include translations for language strings found in the core, core plugins and/or third-party plugins.
fr: Les packs de traduction peuvent étendre et inclure des traductions pour les chaînes de traduction du noyau, des plugins du noyau et/ou de plugins tierces-parties.

source: Some of the language packs are already included in the core, and can be found in ``languages`` directory in Elgg's root directory. Individual plugins tend to include their translations under the ``languages`` directory within the plugin's root.
fr: Quelques packs de langues sont déjà inclus dans le noyau, et se trouvent dans le dossier ``languages`` du répertoire racine de Elgg. Les plugins individuels incluent leurs traductions dans le répertoire ``languages`` de la racine du plugin.

source: This structure makes it easy to create new language packs that supercede existing language strings or add support for new languages.
fr: Cette structure facilite la création de nouveaux packs de langues qui remplacent les chaînes de traduction existantes ou ajoutent le support de nouvelles langues.

source: All plugins reside in the ``mod`` directory of your Elgg installation.
fr: Tous les plugins sont dans le dossier ``mod`` de votre installation Elgg.

source: To install a new plugin:
fr: Pour installer un nouveau plugin :

source: extract (unzip) contents of the plugin distribution package
fr: décompresser (unzip) le contenu du package de distribution du plugin

source: copy/FTP the extracted folder into the ``mod`` directory of your Elgg installation
fr: copier/FTP le dossier extrait dans le répertoire ``mod`` de votre installation Elgg

source: activate the plugin from your admin panel
fr: activez le plugin depuis votre panneau d'administration

source: To activate a plugin:
fr: Pour activer un plugin :

source: Log in to your Elgg site with your administrator account
fr: Connectez-vous à votre site Elgg avec votre compte administrateur

source: Go to Administration -> Configure -> Plugins
fr: Allez dans Administration -> Configurer -> Plugins

source: Find your plugin in the list of installed plugins and click on the 'enable' button.
fr: Trouvez votre plugin dans la liste des plugins installés et cliquez sur le bouton 'activer'.

source: Plugin order
fr: Ordre des plugins

source: Plugins are loaded according to the order they are listed on the Plugins page. The initial ordering after an install is more or less random. As more plugins are added by an administrator, they are placed at the bottom of the list.
fr: Les plugins sont chargés selon l'ordre dans lequel ils sont listés sur la page Plugins. L'ordre initial après une installation est plus ou moins aléatoire. Au fur et à mesure que de nouveaux plugins sont ajoutés par un administrateur, ils sont placés en fin de liste.

source: Some general rules for ordering plugins:
fr: Quelques règles générales pour l'ordre des plugins :

source: A theme plugin should be last or at least near the bottom
fr: Un plugin de thème devrait être placé en dernier ou au moins proche du bas de la liste

source: A plugin that modifies the behavior of another plugin should be lower in the plugin list
fr: Un plugin qui modifie le comportement d'un autre plugin devrait être placé plus bas dans la liste des plugins

source: Security
fr: Sécurité

source: As of Elgg 3.0 several hardening settings have been added to Elgg. You can enable/disable these settings as you like.
fr: A partir de Elgg 3.0 plusieurs paramètres de sécurisation ont été ajoutés à Elgg. Vous pouvez activer/désactiver ces paramètres comme vous le souhaitez.

source: Upgrade protection
fr: Protection des mises à niveau

source: The URL of http://your-elgg-site.com/upgrade.php can be protected by a unique token. This will prevent random users from being able to run this file. The token is not needed for logged in site administrators.
fr: L'URL de mise à niveau http://your-elgg-site.com/upgrade.php peut être protégée par un jeton unique. Ceci évite que des utilisateurs aléatoires aient la possibilité d'exécuter ce fichier. Le jeton n'est pas nécessaire pour les administrateurs du site connectés.

source: Cron protection
fr: Protection du Cron

source: The URLs of the :doc:`cron </admin/cron>` can be protected by a unique token. This will prevent random users from being able to run the cron. The token is not needed when running the cron from the commandline of the server.
fr: Les URLs du :doc:`cron </admin/cron>` peuvent être protégées par un jeton unique. Ceci évite que des utilisateurs aléatoires puissent exécuter le cron. Le jeton n'est pas nécessaire quand le cron est lancé depuis la ligne de commande du serveur.

source: Disable password autocomplete
fr: Désactiver l'autocomplétion du mot de passe

source: Data entered in these fields will be cached by the browser. An attacker who can access the victim's browser could steal this information. This is especially important if the application is commonly used in shared computers such as cyber cafes or airport terminals. If you disable this, password management tools can no longer autofill these fields. The support for the autocomplete attribute can be browser specific.
fr: Les données saisies dans ces champs seront mises en cache par le navigateur. Un attaquant qui a accès au navigateur de la victime pourrait subtiliser ces informations. Ceci est particulièrement important si l'application est utilisée habituellement depuis des ordinateurs partagés tels que des cybercafés ou des terminaux d'aéroports. Si vous désactivez ceci, les outils de gestion des mots de passe ne pourront plus renseigner automatiquement ces champs. Le support pour l'attribut "autocomplete" peut dépendre des navigateurs.

source: Email address change requires password
fr: Le changement d'adresse e-mail requiert le mot de passe

source: When a user wishes to change their email address associated with their account, they need to also supply their current password.
fr: Quand un utilisateur souhaite changer l'adresse e-mail associée à son compte, il doit également donner son mot de passe actuel.

source: Email address change requires confirmation
fr: Le changement d’adresse e-mail nécessite une confirmation

source: When a user wishes to change their email address associated with their account, they need to confirm the new email address. This is done by sending an email to the new address with a validation link. After clicking this link the new email address will be used.
fr: Lorsqu’un utilisateur souhaite modifier l'adresse e-mail associée à son compte, il doit confirmer la nouvelle adresse e-mail. Cela se fait en envoyant un e-mail à la nouvelle adresse avec un lien de validation. Après avoir cliqué sur ce lien, la nouvelle adresse e-mail sera utilisée.

source: Session bound icons
fr: Icônes liées à la session
