Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/admin.po
Languages: fr

source: Working with technical problems can be frustrating. Please keep the community site free of frustration. If you're feeling anxious, take a step away and do something else. Threatening or attacking community members, core developers, or plugin developers will not help solve your problem and will likely get you banned.
fr: Travailler avec des problèmes techniques peut être frustrant. Veuillez laisser le site de la communauté libre de frustration. Si vous ressentez de l'anxiété, passez le cap et faites autre chose. Menacer ou attaquer des membres de la communauté, des développeurs du noyau, ou des développeurs de plugins n'aidera pas à résoudre votre problème et risque très probablement de vous faire bannir.

source: Advertising
fr: Publicité

source: Advertising is not allowed. Posts with any sort of advertising will be moderated.
fr: Les annonces publicitaires ne sont pas autorisées. La publication de tout type d'annonce sera modérée.

source: Asking for money / Offering to pay
fr: Demander de l'argent / Offrir de payer

source: Don't ask for money on the community site. Likewise, don't offer to pay for answers. If you are looking for custom development, post to the Professional Services group. Posts asking for money or recommending a commercial plugin may be moderated.
fr: Ne demandez pas d'argent sur le site de la communauté. De même, ne proposez pas de payer pour des réponses. Si vous recherchez des développements sur mesure, publiez dans le groupe des services professionnels "Professional Services". Les publications qui demandent de l'argent ou recommandent un plugin commercial peuvent être modérées.

source: Links
fr: Liens

source: If you're having a problem with a live site, please provide a link to it.
fr: Si vous avez un problème avec un site en ligne, merci de fournir un lien vers ce site.

source: That said, the community site is not a back linking service or SEO tool. Excessive linking will be moderated and your account may be banned.
fr: Ceci dit, la communauté n'est pas un service de backlinks ni un outil SEO. Un excès de liens sera modéré et votre compte peut être banni.

source: There's a reason Elgg doesn't have an option for signatures: they cause clutter and distract from the conversation. Users are discouraged from using signatures on the community site, and signatures with links or advertising will be removed.
fr: Il y a une raison pour laquelle Elgg n'a pas d'option pour les signatures : elles causent du désordre et détournent l'attention de la conversation. Il est recommandé aux utilisateurs de ne pas utiliser de signature sur le site communautaire, et les signatures avec des liens ou de la publicité seront retirées.

source: Bumping, +1, me too
fr: Relancer, +1, moi aussi

source: Don't do it. If your question hasn't been answered, see the top of this document for tips. These types of post add nothing to the conversation and may be moderated.
fr: Ne faites pas cela. Si votre question n'a pas reçu de réponse, voyez le début de ce document pour des astuces. Ces types de réponses n'ajoutent rien à la conversation et peuvent être modérées.

source: Posting Code
fr: Publier du Code

source: Long bits of code are confusing to read through in a forums context. Please use http://elgg.pastebin.com to post long bits of code and provide the Paste Bin link instead of directly posting the code.
fr: De longs extraits de code rendent la lecture confuse dans le cadre d'un forum. Veuillez utiliser http://elgg.pastebin.com pour publier de longs extraits de code et donnez le lien PasteBin au lieu de publier directement le code.

source: Good Ideas
fr: Bonnes idées

source: Not policies, but good ideas.
fr: Pas de règles strictes, mais des bonnes idées.

source: Say thanks
fr: Dites merci

source: Did someone help you? Be sure to thank them! The community site is run by volunteers. No one has to help you with your problem. Be sure to show your appreciation!
fr: Est-ce que quelqu'un vous a aidé ? Assurez-vous de remercier cette personne : le site de la communauté est animé par des volontaires. Personne n'a la devoir de vous aider avec votre problème. Assurez-vous de montrer votre reconnaissance !

source: Give back
fr: Donnez en retour

source: Have a tip for Elgg? See someone with a similar problem you had? You've been there and can help them out, so give them a hand!
fr: Vous avez une astuce pour Elgg ? Vous voyez quelqu'un qui a le même problème que vous aviez eu ? Vous êtes passé par là et pouvez les aider, alors donnez-leur un coup de main !

source: Getting Started
fr: Prise en main

source: You have installed Elgg and worked through any potential initial issues. What now? Here are some suggestions on how to to familiarize yourself with Elgg.
fr: Vous avez installé Elgg et réglé toutes les potentiels problèmes initiaux. Et maintenant ? Voici quelques suggestions pour vous aider à vous familiariser avec Elgg.

source: Focus first on core functionality
fr: Concentrez-vous d'abord sur les fonctionnalités principales

source: When you're new to Elgg, it's best to explore the stock features in core and its bundled plugins before installing any third party plugins. It's tempting install every interesting plugin from the community site, but exploring the core features builds a familiarity with Elgg's expected behavior, and prevents introducing any confusing bugs from third party plugin into your new Elgg network.
fr: Quand vous commencez avec Elgg, le mieux est de commencer par explorer les fonctionnalités de base du noyau et des plugins livrés conjointement avant d'installer des plugins tierce-partie. Il est tentant d'installer chaque plugin intéressant du site communautaire, mais explorer les fonctionnalités du noyau vous permet de vous familiariser avec le comportement habituel de Elgg, et évite d'introduire des bugs ou de la confusion dans votre nouveau réseau Elgg.

source: Elgg installs with a basic set of social network plugins activated: blogs, social bookmarking, files, groups, likes, message boards, wiki-like pages, user profiles, and microblogging. To change the plugins that are activated, log in as an admin user, then use the topbar to browse to Administration, then to Plugins on the right sidebar.
fr: Elgg s'installe avec un jeu de plugins de réseau social activés : des blogs, des marque-pages partagés, des fichiers, des groupes, des "likes", des messages, des pages de type wiki, des profils utilisateurs, et du microblogging. Pour changer les plugins activés, connectez-vous avec un compte administrateur, puis utilisez le menu supérieur pour accéder à Administration, puis à Plugins dans la barre latérale droite.

source: The user you create during installation is an admin user.
fr: L'utilisateur que vous créez pendant l'installation est un utilisateur admin.

source: Create test users
fr: Créez des utilisateurs de test

source: Users can be created two ways in stock Elgg:
fr: Les utilisateurs peuvent être créés de deux manières dans un Elgg standard :

source: Complete the signup process using a different email address and username. (Logout first or use a different browser!)
fr: Terminez le processus d'inscription en utilisant une autre adresse e-mail et un autre identifiant. (Déconnectez-vous d'abord ou utilisez un autre navigateur !)

source: Add a user through the Admin section by browsing to Administration -> Users -> Add New User.
fr: Ajoutez un utilisateur dans la section Admin en naviguant vers Administration -> Utilisateurs -> Ajouter un nouvel utilisateur.

source: Users that self-register must validate their account through email before they can log in. Users that an admin creates are already validated.
fr: Les utilisateurs qui s'inscrivent eux-même doivent valider leur compte avant de pouvoir se connecter. Les utilisateurs qu'un administrateur crée sont déjà validés.

source: Explore user functionality
fr: Explorez les fonctionnalités de l'utilisateur

source: Use your test users to create blogs, add widgets to your profile or dashboard, post to the Wire (microblogging), and create pages (wiki-like page creation). Investigate the Settings on the topbar. This is where a user sets notification settings and configures tools (which will be blank because none of the default plugins add controls here).
fr: Utilisez vos utilisateurs de test pour créer des articles de blog, ajouter des widgets à votre profil ou à votre tableau de bord, publier sur le Fil ("The Wire", microblogging) et créer des pages (création de pages de type wiki). Examinez les Paramètres - "Settings" - dans la barre de menu supérieure. C'est à cet endroit qu'un utilisateur définit ses préférences et configure ses outils (qui peuvent être vides parce qu'aucun des plugins par défaut n'ajoute de contrôle à cet endroit).

source: Explore admin functionality
fr: Explorez les fonctionnalités de l'administration

source: All of the admin controls are found by clicking Administration in the topbar. The has a dashboard with a widget that explains the various sections. Change options in the Configure menu to change how Elgg looks and acts.
fr: Tous les outils d'administration sont accessibles en cliquant sur Administration dans le menu supérieur. L'administrateur a un tableau de bord avec un widget qui explique les diverses sections. Changez les options dans le menu Configurer pour changer l'apparence et le comportement de Elgg.

source: Extending Elgg
fr: Étendre les fonctionnalités de Elgg

source: After exploring what Elgg can do out of the box, install some themes and plugins. You can find many plugins and themes at the community site that have been developed by third parties. These plugins do everything from changing language strings, to adding chat, to completely redesigning Elgg's interface. Because these plugins are not official, be certain to check the comments to make sure you only install well-written plugins by high quality developers.
fr: Après avoir exploré ce que Elgg peut faire d'emblée, installez quelques thèmes et plugins. Vous pouvez trouver de nombreux plugins et thèmes sur le site de la communauté Elgg qui ont été développés par d'autres personnes. Ces plugins font tout, de la modification de chaînes de traductions à un re-design complet de l'interface de Elgg, en passant par l'ajout d'un chat, etc. Puisque ces plugins ne sont pas officiels, assurez-vous de vérifier les commentaires pour vous assurer que vous installez des plugins bien écrits par des développeurs de qualité.

source: Administrator Guides
fr: Guides pour les administrateurs

source: Best practices for effectively managing an Elgg-based site.
fr: Bonnes pratiques pour gérer efficacement un site construit avec Elgg.

source: Make your site run as smoothly and responsively as possible.
fr: Faites que votre site fonctionne sans heurt et de manière aussi réactive que possible.

source: Can Elgg scale to X million users?
fr: Est-ce que Elgg peut passer à l'échelle de X millions d'utilisateurs ?

source: People often ask whether Elgg can scale to large installations.
fr: Les gens demandent souvent si Elgg convient pour de grands sites.

source: First, we might stop and ask, "where are you planning to get all those users?" Seriously, though, this is a really interesting problem. Making Elgg scale is, if anything, an issue of technical engineering. It's interesting but more or less a solved problem. Computer science doesn't work differently for Elgg than for Google, for example. Getting millions of users? That's like the Holy Grail of the entire tech industry.
fr: Tout d'abord, nous pourrions nous arrêter et demander: "où et comment prévoyez-vous d'obtenir tous ces utilisateurs ?" Sérieusement, c'est un problème très intéressant. Faire évoluer Elgg est avant tout une question d'ingénierie technique. C'est intéressant mais plus ou moins un problème résolu. L'informatique ne fonctionne pas différemment pour Elgg que pour Google, par exemple. Obtenir des millions d'utilisateurs? C'est comme le Saint Graal de toute l'industrie de la technologie.

source: Second, as with most things in life, the answer is "it depends":
fr: Deuxièmement, comme pour la plupart des choses dans la vie, la réponse est « ça dépend » :

source: How active are your users?
fr: Que font vos utilisateurs ?

source: What hardware is Elgg running on?
fr: Sur quelle machine et avec quelle configuration fonctionne Elgg ?

source: Are your plugins behaving well?
fr: Est-ce que vos plugins se comportent bien ?

source: `Improving the efficiency of the Elgg engine`__ is an ongoing project, although there are limits to the amount that any script can do.
fr: `Améliorer l'efficacité du moteur Elgg`__ est un projet en cours, bien qu'il y ait des limites à la quantité de choses que n'importe quel script peut faire.

source: If you are serious about scalability you will probably want to look at a number of things yourself.
fr: Si vous prenez au sérieux le sujet de la scalabilité, vous aurez probablement envie de considérer un certain nombre de choses vous-même.

source: Measure first
fr: Mesurez d'abord

source: There is no point in throwing resources at a problem if you don't know:
fr: Il ne sert à rien de dépenser des ressources sur un problème si vous ne connaissez pas :

source: what the problem is
fr: quel est le problème

source: what resources the problem needs
fr: de quelles ressources ce problème a besoin

source: where those resources are needed
fr: où ces ressources sont nécessaires

source: Invest in some kind of profiling to tell you where your bottleneck is, especially if you're considering throwing significant money at a problem.
fr: Investissez dans un outil de profilage afin de pouvoir identifier où votre goulot d'étranglement se situe, surtout si vous envisagez de dépenser de l'argent sur ce problème.

source: Tune MySQL
fr: Régler MySQL

source: Elgg makes extensive use of the back end database, making many trips on each pageload. This is perfectly normal and a well configured database server will be able to cope with thousands of requests per second.
fr: Elgg fait un usage intensif de la base de données en back-end, faisant, à chaque chargement de page, de nombreux appels et allers et retours entre le serveur web et la base de données. Ceci est parfaitement normal et un serveur de base de données bien configuré sera capable de faire face à des milliers de requêtes par seconde.

source: Here are some configuration tips that might help:
fr: Voici quelques astuces de configuration qui pourraient aider :

source: Make sure that MySQL is configured to use an appropriate my.cnf for the size of your website.
fr: Assurez-vous que MySQL utilise un fichier de configuration my.cnf adapté à la taille de votre site web.

source: Increase the amount of memory available to PHP and MySQL (you will have to increase the amount of memory available to the php process in any case)
fr: Augmentez la quantité de mémoire disponible pour PHP et de même pour MySQL (vous aurez dans tous les cas à augmenter la quantité de mémoire disponible pour le processus de php)

source: Enable caching
fr: Activer la mise en cache

source: Generally, if a program is slow, that is because it is repeatedly performing an expensive computation or operation. Caching allows the system to avoid doing that work over and over again by using memory to store the results so that you can skip all the work on subsequent requests. Below we discuss several generally-available caching solutions relevant to Elgg.
fr: En règle générale, si un programme est lent, c'est parce qu'il effectue à plusieurs reprises un calcul ou une opération coûteuse. La mise en cache permet au système d'éviter de faire ce travail encore et encore à chaque requête grâce à la mise en cache des résultats précédents. En utilisant la mémoire pour stocker les résultats, il est alors facile de récupérer en mémoire le résultat de la requête et de le passer aux requêtes suivantes, économisant ainsi à chaque requête tout le travail de calcul. Nous discutons ci-dessous de plusieurs solutions de mise en cache généralement disponibles et pertinentes pour Elgg.

source: Simplecache
fr: Cache simple - Simplecache

source: By default, views are cached in the Elgg data directory for a given period of time. This removes the need for a view to be regenerated on every page load.
fr: Par défaut, les vues sont mises en cache dans le répertoire de données de Elgg pour une période de temps donnée. Cela supprime la nécessité de régénérer chaque vue à chaque chargement de la page.

source: This can be disabled by setting ``$CONFIG->simplecache_enabled = false;`` For best performance, make sure this value is set to ``true``.
fr: Ceci peut être désactivé en définissant ``$CONFIG->simplecache_enabled = false;`` Pour de meilleures performances, assurez-vous que cette valeur est bien définie sur ``true``.

source: This does lead to artifacts during development if you are editing themes in your plugin as the cached version will be used in preference to the one provided by your plugin.
fr: Cela conduit à des artefacts pendant le développement/la programmation, si par exemple vous modifiez un thème dans votre plugin, puisque la version mise en cache sera utilisée au lieu de la nouvelle version fournie par votre plugin.

source: The simple cache can be disabled via the administration menu. It is recommended that you do this on your development platform if you are writing Elgg plugins.
fr: Le cache simple peut être désactivée via le menu d'administration. Il est recommandé de le faire sur votre plate-forme de développement si vous écrivez des plugins Elgg.

source: This cache is automatically flushed when a plugin is enabled, disabled or reordered, or when upgrade.php is executed.
fr: Ce cache est automatiquement vidé à chaque fois qu'un plugin est activé, désactivé ou réorganisé, ou quand le script upgrade.php est exécuté.

source: For best performance, you can also create a symlink from ``/cache/`` in your www root dir to the ``assetroot`` directory specified in your config (by default it's located under ``/path/to/dataroot/caches/views_simplecache/``:
fr: Pour de meilleures performances, vous pouvez également créer un lien symbolique depuis ``/cache/`` dans votre répertoire racine web vers le répertoire ``assetroot`` spécifié dans votre configuration (par défaut il est situé dans ``/path/to/dataroot/caches/views_simplecache/`` :

source: If your webserver supports following symlinks, this will serve files straight off disk without booting up PHP each time.
fr: Si votre serveur web supporte les liens symboliques "symlinks", ceci va servir les fichiers directement depuis le disque sans démarrer PHP à chaque fois.

source: For security reasons, some webservers (e.g. Apache in version 2.4) might follow the symlinks by default only if the owner of the symlink source and target match. If the cache symlink fails to work on your server, you can change the owner of the cache symlink itself (and not the ``/views_simplecache/`` directory) with
fr: Pour des raisons de sécurité, quelques serveurs web (par ex. Apache dans la version 2.4) pourraient par défaut ne suivre les liens symboliques que si le propriétaire de la source et de la cible du lien correspondent. Si le lien symbolique du cache ne fonctionne pas sur votre serveur web, vous pouvez changer le propriétaire du lien symbolique du cache lui-même (et non du répertoire ``/views_simplecache/``) avec

source: In this example it's assumed that the ``/views_simplecache/`` directory in the data directory is owned by the wwwrun account that belongs to the www group. If this is not the case on your server, you have to modify the chown command accordingly.
fr: Dans cet exemple on prend l'hypothèse que le répertoire ``/views_simplecache/`` du répertoire de données appartient au compte wwwrun qui fait partie du groupe www. Si ce n'est pas le cas sur votre serveur, vous devez modifier la commande chown en conséquence.

source: System cache
fr: Cache système - System cache

source: The location of views are cached so that they do not have to be discovered (profiling indicated that page load took a non-linear amount of time the more plugins were enabled due to view discovery). Elgg also caches information like the language mapping and class map.
fr: L'emplacement des vues est mis en cache afin de retrouver rapidement les vues (en effet, le profilage a indiqué que le temps de chargement d'une page prend une quantité non-linéaire du temps plus il y a de plugins activés, ceci en raison de la recherche des vues). Elgg met également en cache des informations telles que la cartographie de la langue et de la carte des classes.

source: This can be disabled by setting ``$CONFIG->system_cache_enabled = false;`` For best performance, make sure this value is set to ``true``.
fr: Ceci peut être désactivé en définissant ``$CONFIG->system_cache_enabled = false;`` Pour de meilleures performances, assurez-vous que cette valeur est bien définie sur ``true``.

source: This is currently stored in files in your dataroot (although later versions of Elgg may use memcache). As with the simple cache it is flushed when a plugin is enabled, disabled or reordered, or when upgrade.php is executed.
fr: Les emplacements des vues sont actuellement stockés dans des fichiers placés dans votre dossier de données (toutefois des versions ultérieures de Elgg peuvent utiliser memcache). Comme avec le cache simple, le cache système est automatiquement vidé chaque fois qu'un plugin est activé, désactivé ou réorganisé, ou quand le script upgrade.php est exécuté.

source: The system cache can be disabled via the administration menu, and it is recommended that you do this on your development platform if you are writing Elgg plugins.
fr: Le cache du système peut être désactivé via le menu d'administration, et il est recommandé de le faire sur votre plate-forme de développement si vous écrivez des plugins Elgg.

source: Boot cache
fr: Cache de démarrage

source: Elgg has the ability to cache numerous resources created and fetched during the boot process. To configure how long this cache is valid you must set a TTL in your ``settings.php`` file: ``$CONFIG->boot_cache_ttl = 3600;``
fr: Elgg a la capacité de mettre en cache de nombreuses ressources créées et récupérées pendant le processus de démarrage. Pour configurer la durée de validité de ce cache vous devez définir la valeur du TTL dans votre fichier ``settings.php`` : ``$CONFIG->boot_cache_ttl = 3600;``

source: Look at the `Stash <http://www.stashphp.com/index.html>`_ documentation for more info about the TTL.
fr: Regardez la documentation de `Stash <http://www.stashphp.com/index.html>`_ pour plus d'informations sur le TTL.

source: Database query cache
fr: Cache des requêtes de base de données

source: For the lifetime of a given page's execution, a cache of all ``SELECT`` queries is kept. This means that for a given page load a given select query will only ever go out to the database once, even if it is executed multiple times. Any write to the database will flush this cache. This cache will be automatically cleared at the end of a page load.
fr: Pour la durée de vie de l’exécution d’une page donnée, un cache de toutes les requêtes ``SELECT`` est conservé. Cela signifie que pour le chargement d'une page donnée, une requête sélectionnée donnée ne sortira dans la base de données qu’une seule fois, même si elle est exécutée plusieurs fois. Toute écriture dans la base de données videra ce cache. Ce cache sera automatiquement effacé à la fin du chargement d’une page.
