Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``elgg_error_response()`` now requires a ``string`` or ``array`` for ``$message`` and a ``string`` for ``$forward_url``
fr: ``elgg_error_response()`` requiert désormais un ``string`` ou un ``array`` pour ``$message`` et un ``string`` pour ``$forward_url``

source: ``elgg_extend_view()`` now requires a ``string`` for ``$view`` and ``$view_extension``
fr: ``elgg_extend_view()`` requiert désormais un ``string`` pour ``$view`` et ``$view_extension``

source: ``elgg_extract()`` now requires a ``bool`` for ``$strict``
fr: ``elgg_extract()`` requiert désormais un ``bool`` pour ``$strict``

source: ``elgg_format_bytes()`` now requires an ``int`` for ``$size`` and ``$precision``
fr: ``elgg_format_bytes()`` requiert désormais un ``int`` pour ``$size`` et ``$precision``

source: ``elgg_format_element()`` now requires a ``string`` for ``$tag_name`` and a ``string`` for ``$text``
fr: ``elgg_format_element()`` requiert désormais un ``string`` pour ``$tag_name`` et un ``string`` pour ``$text``

source: ``elgg_format_html()`` now requires a ``string`` for ``$html``
fr: ``elgg_format_html()`` requiert désormais un ``string`` pour ``$html``

source: ``elgg_generate_action_url()`` now requires a ``string`` for ``$action`` and a boolean for ``$add_csrf_tokens``
fr: ``elgg_generate_action_url()`` requiert désormais un ``string`` pour ``$action`` et un booléen pour ``$add_csrf_tokens``

source: ``elgg_generate_entity_url()`` now requires a ``string`` for ``$resource`` and ``$subresource``
fr: ``elgg_generate_entity_url()`` requiert désormais un ``string`` pour ``$resource`` et ``$subresource``

source: ``elgg_generate_url()`` now requires a ``string`` for ``$name``
fr: ``elgg_generate_url()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_get_config()`` now requires a ``string`` for ``$name``
fr: ``elgg_get_config()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_get_download_url()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``elgg_get_download_url()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``elgg_get_embed_url()`` now requires a ``string`` for ``$size``
fr: ``elgg_get_embed_url()`` requiert désormais un ``string`` pour ``$size``

source: ``elgg_get_entity_class()`` now requires a ``string`` for ``$type`` and a ``string`` for ``$subtype``
fr: ``elgg_get_entity_class()`` requiert désormais un ``string`` pour ``$type`` et un ``string`` pour ``$subtype``

source: ``elgg_get_excerpt()`` now requires a ``string`` for ``$text`` and an ``int`` for ``$num_chars``
fr: ``elgg_get_excerpt()`` requiert désormais un ``string`` pour ``$text`` et un ``int`` pour ``$num_chars``

source: ``elgg_get_friendly_upload_error()`` now requires an ``int`` for ``$error_code``
fr: ``elgg_get_friendly_upload_error()`` requiert désormais un ``int`` pour ``$error_code``

source: ``elgg_get_friendly_time()`` now requires an ``int`` for ``$time`` and ``$current_time``
fr: ``elgg_get_friendly_time()`` requiert désormais un ``int`` pour ``$time`` et ``$current_time``

source: ``elgg_get_friendly_title()`` now requires a ``string`` for ``$title``
fr: ``elgg_get_friendly_title()`` requiert désormais un ``string`` pour ``$title``

source: ``elgg_get_icon_sizes()`` now requires a ``string`` for ``$entity_type`` and ``$entity_subtype``
fr: ``elgg_get_icon_sizes()`` requiert désormais un ``string`` pour ``$entity_type`` et ``$entity_subtype``

source: ``elgg_get_ini_setting_in_bytes()`` now requires a ``string`` for ``$setting``
fr: ``elgg_get_ini_setting_in_bytes()`` requiert désormais un ``string`` pour ``$setting``

source: ``elgg_get_inline_url()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``elgg_get_inline_url()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``elgg_get_login_url()`` now requires a ``string`` for ``$fragment``
fr: ``elgg_get_login_url()`` requiert désormais un ``string`` pour ``$fragment``

source: ``elgg_get_metadata_from_id()`` now requires an ``int`` for ``$id``
fr: ``elgg_get_metadata_from_id()`` requiert désormais un ``int`` pour ``$id``

source: ``elgg_get_registration_url()`` now requires a ``string`` for ``$fragment``
fr: ``elgg_get_registration_url()`` requiert désormais un ``string`` pour ``$fragment``

source: ``elgg_get_request_data()`` now requires a ``bool`` for ``$filter_result``
fr: ``elgg_get_request_data()`` requiert désormais un ``bool`` pour ``$filter_result``

source: ``elgg_get_simplecache_url()`` now requires a ``string`` for ``$view`` and ``$sub_view``
fr: ``elgg_get_simplecache_url()`` requiert désormais un ``string`` pour ``$view`` et ``$sub_view``

source: ``elgg_get_sticky_value()`` now requires a ``string`` for ``$form_name`` and a string for ``$variable`` and a ``bool`` for ``$filter_result``
fr: ``elgg_get_sticky_value()`` requiert désormais un ``string`` pour ``$form_name`` et une chaine de caractères pour ``$variable`` et un a ``bool`` pour ``$filter_result``

source: ``elgg_get_sticky_values()`` now requires a ``string`` for ``$form_name`` and a ``bool`` for ``$filter_result``
fr: ``elgg_get_sticky_values()`` requiert désormais un ``string`` pour ``$form_name`` et un ``bool`` pour ``$filter_result``

source: ``elgg_get_title_input()`` now requires a ``string`` for ``$variable`` and a string for ``$default``
fr: ``elgg_get_title_input()`` requiert désormais un ``string`` pour ``$variable`` et une chaîne de caractères pour ``$default``

source: ``elgg_get_uploaded_file()`` now requires a ``string`` for ``$input_name`` and a ``bool`` for ``$check_for_validity``
fr: ``elgg_get_uploaded_file()`` requiert désormais un ``string`` pour ``$input_name`` et un ``bool`` pour ``$check_for_validity``

source: ``elgg_get_uploaded_files()`` now requires a ``string`` for ``$input_name``
fr: ``elgg_get_uploaded_files()`` requiert désormais un ``string`` pour ``$input_name``

source: ``elgg_get_view_extensions()`` now requires a ``string`` for ``$view``
fr: ``elgg_get_view_extensions()`` requiert désormais un ``string`` pour ``$view``

source: ``elgg_get_widget_types()`` now requires a ``string`` or ``array`` for ``$context``
fr: ``elgg_get_widget_types()`` requiert désormais un ``string`` ou un ``array`` pour ``$context``

source: ``elgg_get_widgets()`` now requires a ``int`` for ``$owner_guid`` and ``string`` for ``$context``
fr: ``elgg_get_widgets()`` requiert désormais un ``int`` pour ``$owner_guid`` et un ``string`` pour ``$context``

source: ``elgg_group_tool_gatekeeper()`` now requires a ``string`` for ``$tool_name`` and an ``int`` for ``$group_guid``
fr: ``elgg_group_tool_gatekeeper()`` requiert désormais un ``string`` pour ``$tool_name`` et un ``int`` pour ``$group_guid``

source: ``elgg_html_decode()`` now requires a ``string`` for ``$string``
fr: ``elgg_html_decode()`` requiert désormais un ``string`` pour ``$string``

source: ``elgg_http_add_url_query_elements()`` now requires a ``string`` for ``$url``
fr: ``elgg_http_add_url_query_elements()`` requiert désormais un ``string`` pour ``$url``

source: ``elgg_http_build_url()`` now requires a ``bool`` for ``$html_encode``
fr: ``elgg_http_build_url()`` requiert désormais un ``bool`` pour ``$html_encode``

source: ``elgg_http_get_signed_url()`` now requires a ``string`` for ``$url`` and ``$expires``
fr: ``elgg_http_get_signed_url()`` requiert désormais un ``string`` pour ``$url`` et ``$expires``

source: ``elgg_http_remove_url_query_element()`` now requires a ``string`` for ``$url`` and a ``string`` for ``$element``
fr: ``elgg_http_remove_url_query_element()`` requiert désormais un ``string`` pour ``$url`` et un ``string`` pour ``$element``

source: ``elgg_http_url_is_identical()`` now requires a ``string`` for ``$url1`` and ``$url2`` and an ``array`` for ``$ignore_params``
fr: ``elgg_http_url_is_identical()`` requiert désormais un ``string`` pour ``$url1`` et ``$url2`` et un ``array`` pour ``$ignore_params``

source: ``elgg_http_validate_signed_url()`` now requires a ``string`` for ``$url``
fr: ``elgg_http_validate_signed_url()`` requiert désormais un ``string`` pour ``$url``

source: ``elgg_in_context()`` now requires a ``string`` for ``$context``
fr: ``elgg_in_context()`` requiert désormais un ``string`` pour ``$context``

source: ``elgg_is_sticky_form()`` now requires a ``string`` for ``$form_name``
fr: ``elgg_is_sticky_form()`` requiert désormais un ``string`` pour ``$form_name``

source: ``elgg_is_widget_type()`` now requires a ``string`` for ``$handler`` and ``$context``
fr: ``elgg_is_widget_type()`` requiert désormais un ``string`` pour ``$handler`` et ``$context``

source: ``elgg_language_key_exists()`` now requires a ``string`` for ``$key`` and a ``string`` for ``$language``
fr: ``elgg_language_key_exists()`` requiert désormais un ``string`` pour ``$key`` et un ``string`` pour ``$language``

source: ``elgg_list_entities()`` now requires a ``callable`` for ``$getter`` and a ``callable`` for ``$viewer``
fr: ``elgg_list_entities()`` requiert désormais un ``callable`` pour ``$getter`` et un ``callable`` pour ``$viewer``

source: ``elgg_list_entities_from_relationship_count()`` now requires an ``array`` for ``$options``
fr: ``elgg_list_entities_from_relationship_count()`` requiert désormais un ``array`` pour ``$options``

source: ``elgg_list_relationships()`` now requires an ``array`` for ``$options``
fr: ``elgg_list_relationships()`` requiert désormais un ``array`` pour ``$options``

source: ``elgg_load_system_cache()`` now requires a ``string`` for ``$type``
fr: ``elgg_load_system_cache()`` requiert désormais un ``string`` pour ``$type``

source: ``elgg_make_sticky_form()`` now requires a ``string`` for ``$form_name``
fr: ``elgg_make_sticky_form()`` requiert désormais un ``string`` pour ``$form_name``

source: ``elgg_normalize_site_url()`` now requires a ``string`` for ``$unsafe_url``
fr: ``elgg_normalize_site_url()`` requiert désormais un ``string`` pour ``$unsafe_url``

source: ``elgg_normalize_url()`` now requires a ``string`` for ``$url``
fr: ``elgg_normalize_url()`` requiert désormais un ``string`` pour ``$url``

source: ``elgg_ok_response()`` now requires a ``string`` or ``array`` for ``$message`` and a ``string`` for ``$forward_url``
fr: ``elgg_ok_response()`` requiert désormais un ``string`` ou un ``array`` pour ``$message`` et un ``string`` pour ``$forward_url``

source: ``elgg_parse_emails()`` now requires a ``string`` for ``$text``
fr: ``elgg_parse_emails()`` requiert désormais un ``string`` pour ``$text``

source: ``elgg_push_context()`` now requires a ``string`` for ``$context``
fr: ``elgg_push_context()`` requiert désormais un ``string`` pour ``$context``

source: ``elgg_redirect_response()`` now requires a ``string`` for ``$forward_url``
fr: ``elgg_redirect_response()`` requiert désormais un ``string`` pour ``$forward_url``

source: ``elgg_register_action()`` now requires a ``string`` for ``$filename``
fr: ``elgg_register_action()`` requiert désormais un ``string`` pour ``$filename``

source: ``elgg_register_ajax_view()`` now requires a ``string`` for ``$view``
fr: ``elgg_register_ajax_view()`` requiert désormais un ``string`` pour ``$view``

source: ``elgg_register_error_message()`` now requires a ``string|array`` for ``$message``
fr: ``elgg_register_error_message()`` requiert désormais un ``string|array`` pour ``$message``

source: ``elgg_register_event_handler()`` now requires a ``string`` for ``$event`` and ``$type`` and an ``int`` for ``$priority`` and a ``callable|string`` for ``$callable``
fr: ``elgg_register_event_handler()`` requiert désormais un ``string`` pour ``$event`` et ``$type`` et un ``int`` pour ``$priority`` et un ``callable|string`` pour ``$callable``

source: ``elgg_register_menu_item()`` now requires a ``string`` for ``$menu_name`` and a ``array|\ElggMenuItem`` for ``$menu_item``
fr: ``elgg_register_menu_item()`` requiert désormais un ``string`` pour ``$menu_name`` et un ``array|\ElggMenuItem`` pour ``$menu_item``

source: ``elgg_register_notification_event()`` now requires a ``string`` for ``$object_type`` and ``$object_subtype``
fr: ``elgg_register_notification_event()`` requiert désormais un ``string`` pour ``$object_type`` et ``$object_subtype``

source: ``elgg_register_notification_method()`` now requires a ``string`` for ``$name``
fr: ``elgg_register_notification_method()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_register_route()`` now requires a ``string`` for ``$name``
fr: ``elgg_register_route()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_register_simplecache_view()`` now requires a ``string`` for ``$view_name``
fr: ``elgg_register_simplecache_view()`` requiert désormais un ``string`` pour ``$view_name``

source: ``elgg_register_success_message()`` now requires a ``string|array`` for ``$message``
fr: ``elgg_register_success_message()`` requiert désormais un ``string|array`` pour ``$message``

source: ``elgg_register_title_button()`` has the first argument (``$handler``) removed and requires a ``string`` for ``$name``, ``$entity_type`` and ``$entity_subtype``
fr: Le premier argument (``$handler``) de ``elgg_register_title_button()`` a été supprimé et requiert un ``string`` pour ``$name``, ``$entity_type`` et ``$entity_subtype``

source: ``elgg_register_viewtype_fallback()`` now requires a ``string`` for ``$viewtype``
fr: ``elgg_register_viewtype_fallback()`` requiert désormais un ``string`` pour ``$viewtype``

source: ``elgg_register_widget_type()`` now only supports an ``array`` suitable for ``\Elgg\WidgetDefinition::factory()`` for ``$options``
fr: ``elgg_register_widget_type()`` ne supporte plus pour ``$options`` qu'un ``array`` adapté pour ``\Elgg\WidgetDefinition::factory()``

source: ``elgg_remove_config()`` now requires a ``string`` for ``$name``
fr: ``elgg_remove_config()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_require_js()`` now requires a ``string`` for ``$name``
fr: ``elgg_require_js()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_save_config()`` now requires a ``string`` for ``$name``
fr: ``elgg_save_config()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_save_resized_image()`` now requires a ``string`` for ``$source`` and a ``string`` for ``$destination``
fr: ``elgg_save_resized_image()`` requiert désormais un ``string`` pour ``$source`` et un ``string`` pour ``$destination``

source: ``elgg_save_system_cache()`` now requires a ``string`` for ``$type``
fr: ``elgg_save_system_cache()`` requiert désormais un ``string`` pour ``$type``

source: ``elgg_set_config()`` now requires a ``string`` for ``$name``
fr: ``elgg_set_config()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_set_context()`` now requires a ``string`` for ``$context``
fr: ``elgg_set_context()`` requiert désormais un ``string`` pour ``$context``

source: ``elgg_set_entity_class()`` now requires a ``string`` for ``$type`` and a ``string`` for ``$subtype`` and a ``string`` for ``$class``
fr: ``elgg_set_entity_class()`` requiert désormais un ``string`` pour ``$type`` et un ``string`` pour ``$subtype`` et un ``string`` pour ``$class``

source: ``elgg_set_form_footer()`` now requires a ``string`` for ``$footer``
fr: ``elgg_set_form_footer()`` requiert désormais un ``string`` pour ``$footer``

source: ``elgg_set_http_header()`` now requires a ``string`` for ``$header`` and a ``bool`` for ``$replace``
fr: ``elgg_set_http_header()`` requiert désormais un ``string`` pour ``$header`` et un ``bool`` pour ``$replace``

source: ``elgg_set_page_owner_guid()`` now requires a ``int`` for ``$guid``
fr: ``elgg_set_page_owner_guid()`` requiert désormais un ``int`` pour ``$guid``

source: ``elgg_set_view_location()`` now requires a ``string`` for ``$view``, ``$location`` and ``$viewtype``
fr: ``elgg_set_view_location()`` requiert désormais un ``string`` pour ``$view``, ``$location`` et ``$viewtype``

source: ``elgg_set_viewtype()`` now requires a ``string`` for ``$viewtype``
fr: ``elgg_set_viewtype()`` requiert désormais un ``string`` pour ``$viewtype``

source: ``elgg_strip_tags()`` now requires a ``string`` for ``$string`` and ``$allowable_tags``
fr: ``elgg_strip_tags()`` requiert désormais un ``string`` pour ``$string`` et ``$allowable_tags``

source: ``elgg_trigger_after_event()`` now requires a ``string`` for ``$event`` and ``$type``
fr: ``elgg_trigger_after_event()`` requiert désormais un ``string`` pour ``$event`` et ``$type``

source: ``elgg_trigger_before_event()`` now requires a ``string`` for ``$event`` and ``$type``
fr: ``elgg_trigger_before_event()`` requiert désormais un ``string`` pour ``$event`` et ``$type``

source: ``elgg_trigger_deprecated_event()`` now requires a ``string`` for ``$event``, ``$type``, ``$message`` and ``$version``
fr: ``elgg_trigger_deprecated_event()`` requiert désormais un ``string`` pour ``$event``, ``$type``, ``$message`` et ``$version``

source: ``elgg_trigger_event()`` now requires a ``string`` for ``$event`` and ``$type``
fr: ``elgg_trigger_event()`` requiert désormais un ``string`` pour ``$event`` et ``$type``

source: ``elgg_unregister_ajax_view()`` now requires a ``string`` for ``$view``
fr: ``elgg_unregister_ajax_view()`` requiert désormais un ``string`` pour ``$view``

source: ``elgg_register_event_handler()`` now requires a ``string`` for ``$event`` and ``$type`` and a ``callable|string`` for ``$callable``
fr: ``elgg_register_event_handler()`` requiert désormais un ``string`` pour ``$event`` et ``$type`` et un ``callable|string`` pour ``$callable``

source: ``elgg_unregister_menu_item()`` now requires a ``string`` for ``$menu_name`` and ``$item_name``
fr: ``elgg_unregister_menu_item()`` requiert désormais un ``string`` pour ``$menu_name`` et ``$item_name``

source: ``elgg_unregister_notification_event()`` now requires a ``string`` for ``$object_type`` and ``$object_subtype``
fr: ``elgg_unregister_notification_event()`` requiert désormais un ``string`` pour ``$object_type`` et ``$object_subtype``

source: ``elgg_unregister_notification_method()`` now requires a ``string`` for ``$name``
fr: ``elgg_unregister_notification_method()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_unregister_route()`` now requires a ``string`` for ``$name``
fr: ``elgg_unregister_route()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_unregister_widget_type()`` now requires a ``string`` for ``$handler``
fr: ``elgg_unregister_widget_type()`` requiert désormais un ``string`` pour ``$handler``

source: ``elgg_unrequire_js()`` now requires a ``string`` for ``$name``
fr: ``elgg_unrequire_js()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_validate_invite_code()`` now requires a ``string`` for ``$username`` and ``$code``
fr: ``elgg_validate_invite_code()`` requiert désormais un ``string`` pour ``$username`` et ``$code``

source: ``elgg_validate_registration_data()`` now requires a ``string`` for ``$username``, ``$name`` and ``$email``, a ``bool`` for ``$multiple`` and a ``string|array`` for ``$password``
fr: ``elgg_validate_registration_data()`` requiert désormais un ``string`` pour ``$username``, ``$name`` et ``$email``, un ``bool`` pour ``$multiple`` et un ``string|array`` pour ``$password``

source: ``elgg_view()`` now requires a ``string`` for ``$view`` and ``$viewtype`` and a ``bool`` for ``$recurse``
fr: ``elgg_view()`` requiert désormais un ``string`` pour ``$view`` et ``$viewtype`` et un ``bool`` pour ``$recurse``

source: ``elgg_view_annotation_list()`` now requires an ``array`` for ``$annotations``
fr: ``elgg_view_annotation_list()`` requiert désormais un ``array`` pour ``$annotations``

source: ``elgg_view_deprecated()`` now requires a ``string`` for ``$view``, ``$message`` and ``$version``
fr: ``elgg_view_deprecated()`` requiert désormais un ``string`` pour ``$view``, ``$message`` et ``$version``

source: ``elgg_view_comments()`` now requires an ``ElggEntity`` for ``$entity`` and a ``bool`` for ``$add_comment``
fr: ``elgg_view_comments()`` requiert désormais un ``ElggEntity`` pour ``$entity`` et un ``bool`` pour ``$add_comment``

source: ``elgg_view_entity_icon()`` now requires a ``string`` for ``$size`` and an ``array`` for ``$vars``
fr: ``elgg_view_entity_icon()`` requiert désormais un ``string`` pour ``$size`` et un ``array`` pour ``$vars``

source: ``elgg_view_entity_list()`` now requires an ``array`` for ``$entities``
fr: ``elgg_view_entity_list()`` requiert désormais un ``array`` pour ``$entities``

source: ``elgg_view_exists()`` now requires a ``string`` for ``$view`` and ``$viewtype`` and an ``array`` for ``$vars``
fr: ``elgg_view_exists()`` requiert désormais un ``string`` pour ``$view`` et ``$viewtype`` et un ``array`` pour ``$vars``

source: ``elgg_view_form()`` now requires a ``string`` for ``$action`` and an ``array`` for ``$form_vars`` and ``$body_vars``
fr: ``elgg_view_form()`` requiert désormais un ``string`` pour ``$action`` et un ``array`` pour ``$form_vars`` et ``$body_vars``

source: ``elgg_view_icon()`` now requires a ``string`` for ``$name`` and an ``array`` for ``$vars``
fr: ``elgg_view_icon()`` requiert désormais un ``string`` pour ``$name`` et un ``array`` pour ``$vars``

source: ``elgg_view_image_block()`` now requires a ``string`` for ``$type``, ``$title`` and ``$body``
fr: ``elgg_view_image_block()`` requiert désormais un ``string`` pour ``$type``, ``$title`` et ``$body``

source: ``elgg_view_layout()`` now requires a ``string`` for ``$layout_name`` and an ``array`` for ``$vars``
fr: ``elgg_view_layout()`` requiert désormais un ``string`` pour ``$layout_name`` et un ``array`` pour ``$vars``

source: ``elgg_view_message()`` now requires a ``string`` for ``$type`` and ``$body``
fr: ``elgg_view_message()`` requiert désormais un ``string`` pour ``$type`` et ``$body``

source: ``elgg_view_page()`` now requires a ``string`` for ``$title`` and ``$page_shell``, an ``array`` for ``$vars`` and a ``string|array`` for ``$body``
fr: ``elgg_view_page()`` requiert désormais un ``string`` pour ``$title`` et ``$page_shell``, un ``array`` pour ``$vars`` et un ``string|array`` pour ``$body``

source: ``elgg_view_relationship_list()`` now requires an ``array`` for ``$relationships``
fr: ``elgg_view_relationship_list()`` requiert désormais un ``array`` pour ``$relationships``

source: ``elgg_view_river_item()`` now requires an ``ElggRiverItem`` for ``$item``
fr: ``elgg_view_river_item()`` requiert désormais un ``ElggRiverItem`` pour ``$item``

source: ``elgg_view_resource()`` now requires a ``string`` for ``$name``
fr: ``elgg_view_resource()`` requiert désormais un ``string`` pour ``$name``

source: ``elgg_view_title()`` now requires a ``string`` for ``$title``
fr: ``elgg_view_title()`` requiert désormais un ``string`` pour ``$title``

source: ``embed_get_list_options()`` now requires an ``array`` for ``$options``
fr: ``embed_get_list_options()`` requiert désormais un ``array`` pour ``$options``

source: ``embed_list_items()`` now requires an ``array`` for ``$entities`` and ``$vars``
fr: ``embed_list_items()`` requiert désormais un ``array`` pour ``$entities`` et ``$vars``

source: ``file_prepare_form_vars()`` now requires an ``ElggFile`` for ``$file``
fr: ``file_prepare_form_vars()`` requiert désormais un ``ElggFile`` pour ``$file``

source: ``get_entity()`` now requires a ``int`` for ``$guid``
fr: ``get_entity()`` requiert désormais un ``int`` pour ``$guid``

source: ``get_input()`` now requires a ``string`` for ``$variable`` and a ``bool`` for ``$filter_result``
fr: ``get_input()`` requiert désormais un ``string`` pour ``$variable`` et un ``bool`` pour ``$filter_result``

source: ``get_user()`` now requires a ``int`` for ``$guid``
fr: ``get_user()`` requiert désormais un ``int`` pour ``$guid``
