Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: FAQs and Other Troubleshooting
fr: FAQs et autres Aides au dépannage

source: Below are some commonly asked questions about Elgg.
fr: Ci-dessous quelques questions fréquemment posées à propos de Elgg.

source: Contents
fr: Contenu

source: General
fr: Généralités

source: "Plugin cannot start and has been deactivated" or "This plugin is invalid"
fr: "Le plugin ne peut pas démarrer et a été désactivé" - "Plugin cannot start and has been deactivated" ou "Ce plugin est invalide" - "This plugin is invalid"

source: This error is usually accompanied by more details explaining why the plugin is invalid. This is usually caused by an incorrectly installed plugin.
fr: Cette erreur est habituellement accompagnée par plus de détails qui expliquent pourquoi le plugin est invalide. Elle est généralement causée par un plugin mal installé.

source: If you are installing a plugin called "test", there will be a test directory under mod. In that test directory there needs to be a ``composer.json`` file ``/mod/test/composer.json``.
fr: Si vous installez un plugin appelé "test", il y aura un répertoire test dans le dossier mod. Dans ce dossier test il doit y avoir un fichier ``composer.json`` : ``/mod/test/manifest.xml``.

source: If this file does not exist, it could be caused by:
fr: Si ce fichier n'existe pas, cela peut être causé par :

source: installing a plugin to the wrong directory
fr: l'installation d'un plugin dans le mauvais répertoire

source: creating a directory under /mod that does not contain a plugin
fr: la création d'un répertoire dans /mod qui ne contient pas un plugin

source: a bad ftp transfer
fr: un mauvais transfert FTP

source: unzipping a plugin into an extra directory (myplugin.zip unzips to ``myplugin/myplugin``)
fr: l'extraction d'un plugin dans un niveau de répertoire supplémentaire (myplugin.zip est extrait dans ``myplugin/myplugin``)

source: incompatible plugin
fr: plugin incompatible

source: If you are on a Unix-based host and the files exist in the correct directory, check the permissions. Elgg must have read access to the files and read + execute access on the directories.
fr: Si vous utilisez un hôte de type Unix et que les fichiers existent dans le bon répertoire, vérifiez les permissions. Elgg doit avoir accès en lecture + exécution sur les répertoires.

source: White Page (WSOD)
fr: Page Blanche (WSOD)

source: A blank, white page (often called a "white screen of death") means there is a PHP syntax error. There are a few possible causes of this:
fr: Une page vide, blanche (souvent appelé "écran blanc de la mort" - "white screen of death" ou WSOD) signifie qu'il y a une erreur de syntaxe PHP. Il existe un certain nombre de causes possibles à cela :

source: corrupted file - try transfering the code again to your server
fr: fichier corrompu - essayez de transférer à nouveau le code vers votre serveur

source: a call to a php module that was not loaded - this can happen after you install a plugin that requires a specific module.
fr: un appel à un module php qui n'a pas été chargé - ceci peut se produire après que vous ayez installé un plugin qui requiert un module spécifique.

source: bad plugin - not all plugins have been written to the same quality so you should be careful which ones you install.
fr: mauvais plugin - tous les plugins n'ont pas été écrits avec le même niveau de qualité aussi vous devriez faire attention à ceux que vous installez.

source: To find where the error is occurring, change the .htaccess file to display errors to the browser. Set display_errors to 1 and load the same page again. You should see a PHP error in your browser. Change the setting back once you've resolved the problem.
fr: Pour trouver l'origine de l'erreur, modifiez le fichier .htaccess pour afficher les erreurs dans le navigateur. Définissez display_errors à 1 et chargez la même page à nouveau. Vous devriez voir les erreurs PHP dans votre navigateur. Modifiez à nouveau ce paramètre une fois que vous avez résolu le problème.

source: If you are using the Developer's Tools plugin, go to its settings page and make sure you have "Display fatal PHP errors" enabled.
fr: Si vous utilisez le plugin Developer's Tools, allez dans sa page de configuration et assurez-vous que l'option "Afficher les erreurs PHP fatales" - "Display fatal PHP errors" - est bien activée.

source: If the white screen is due to a bad plugin, remove the latest plugins that you have installed by deleting their directories and then reload the page.
fr: Si l'écran blanc est dû à un mauvais plugin, retirez les derniers plugins que vous avez installé en supprimant leurs répertoires puis rechargez la page.

source: You can temporarily disable all plugins by creating an empty file at ``mod/disabled``. You can then disable the offending module via the administrator tools panel.
fr: Vous pouvez désactiver temporairement tous les plugins en créant un fichier vide dans ``mod/disabled``. Vous pouvez ensuite désactiver le plugin responsable via les outils du panneau d'administration.

source: If you are getting a WSOD when performing an action, like logging in or posting a blog, but there are no error messages, it's most likely caused by non-printable characters in plugin code. Check the plugin for white spaces/new lines characters after finishing php tag (``?>``) and remove them.
fr: Si vous avez un WSOD quand vous effectuez une action, comme vous identifier ou publier un article de blog, mais qu'il n'y a pas de message d'erreur, le plus probable est que ce soit causé par des caractères non-imprimables dans le code du plugin. Vérifiez le plugin et supprimez les espaces vides et les nouvelles lignes situés après le tag de fin php (``?>``).

source: Page not found
fr: Page non trouvée

source: If you have recently installed your Elgg site, the most likely cause for a page not found error is that ``mod_rewrite`` is not setup correctly on your server. There is information in the :doc:`Install Troubleshooting </intro/install>` page on fixing this. The second most likely cause is that your site url in your database is incorrect.
fr: Si vous avez récemment installé votre site Elgg, la cause la plus probable d’une erreur de page non trouvée est que ``mod_rewrite`` n’est pas configuré correctement sur votre serveur. Il y a des informations dans la page :doc:`Installation - Dépannage </intro/install>` sur la manière de résoudre cela. La deuxième cause la plus probable est que l’URL de votre site dans votre base de données est incorrecte.

source: If you've been running your site for a while and suddenly start getting page not found errors, you need to ask yourself what has changed. Have you added any plugins? Did you change your server configuration?
fr: Si vous exécutez votre site depuis un certain temps et commencez soudainement à obtenir des erreurs de page non trouvées, vous devez vous demander ce qui a changé. Avez-vous ajouté des plugins ? Avez-vous modifié la configuration de votre serveur ?

source: To debug a page not found error:
fr: Pour déboguer une erreur de page non trouvée "page not found" :

source: Confirm that the link leading to the missing page is correct. If not, how is that link being generated?
fr: Confirmez que le lien qui a mené à la page manquante est correct. S'il ne l'est pas, comment ce lien a-t-il été généré ?

source: Confirm that the ``.htaccess`` rewrite rules are being picked up.
fr: Confirmez que les règles de réécriture du ``.htaccess`` sont bien prises en compte.

source: Login token mismatch
fr: Erreur de correspondance des jetons de connexion

source: If you have to log in twice to your site and the error message after the first attempt says there was a token mismatch error, the URL in Elgg's settings does not match the URL used to access it. The most common cause for this is adding or removing the "www" when accessing the site. For example, www.elgg.org vs elgg.org. This causes a problem with session handling because of the way that web browsers save cookies.
fr: Si vous devez vous connecter deux fois à votre site et que le message d’erreur après la première tentative indique qu’il y a eu une erreur de décalage de jeton, l’URL dans les paramètres de Elgg ne correspond pas à l’URL utilisée pour y accéder. La cause la plus fréquente est d’ajouter ou de supprimer le "www" lors de l’accès au site. Par exemple, www.elgg.org vs elgg.org. Cela pose un problème avec la gestion des sessions en raison de la façon dont les navigateurs Web enregistrent les cookies.

source: To fix this, you can add rewrite rules. To redirect from www.elgg.org to elgg.org in Apache, the rules might look like:
fr: Pour résoudre ce problème, vous pouvez ajouter des règles de réécriture. Pour rediriger de www.elgg.org vers elgg.org dans Apache, les règles peuvent ressembler à :

source: Redirecting from non-www to www could look like this:
fr: La redirection de non-www vers www pourrait ressembler à ceci :

source: If you don't know how to configure rewrite rules, ask your host for more information.
fr: Si vous ne savez pas comment configurer les règles de réécriture, demandez à votre hébergeur pour plus d'informations.

source: Form is missing __token or __ts fields
fr: Il manque les champs __token ou __ts dans le formulaire. Veuillez recharger la page pour continuer

source: All Elgg actions require a security token, and this error occurs when that token is missing. This is either a problem with your server configuration or with a 3rd party plugin.
fr: Toutes les actions Elgg requièrent un jeton de sécurité, et cette erreur se produit quand ce jeton est manquant. C'est un problème soit avec la configuration de votre serveur, soit avec un plugin tierce-partie.

source: If you experience this on a new installation, make sure that your server is properly configured and your rewrite rules are correct. If you experience this on an upgrade, make sure you have updated your rewrite rules either in .htaccess (Apache) or in the server configuration.
fr: Si vous rencontrez ce cas lors d’une nouvelle installation, assurez-vous que votre serveur est correctement configuré et que vos règles de réécriture sont correctes. Si vous en faites l’expérience sur une mise à niveau, assurez-vous d’avoir mis à jour vos règles de réécriture dans .htaccess (Apache) ou dans la configuration du serveur.

source: If you are experiencing this, disable all 3rd party plugins and try again. Very old plugins for Elgg don't use security tokens. If the problem goes away when plugins are disabled, it's due to a plugin that should be updated by its author.
fr: Si vous rencontrez ce cas, désactivez tous les plugins tiers et réessayez. Les très vieux plugins pour Elgg n’utilisent pas de jeton de sécurité. Si le problème disparaît lorsque les plugins sont désactivés, c’est dû à un plugin qui devrait être mis à jour par son auteur.

source: Maintenance mode
fr: Mode de maintenance

source: To take your site temporarily offline, go to Administration -> Utilities -> Maintenance Mode. Complete the form and hit save to disable your site for everyone except admin users.
fr: Pour mettre temporairement votre site hors-ligne, allez dans Administration -> Utilitaires -> Mode de Maintenance. Complétez le formulaire et cliquez sur Enregistrer pour désactiver votre site pour tout le monde à l'exception des administrateurs.

source: Missing email
fr: E-mail manquant

source: If your users are reporting that validation emails are not showing up, have them check their spam folder. It is possible that the emails coming from your server are being marked as spam. This depends on many factors such as whether your hosting provider has a problem with spammers, how your PHP mail configuration is set up, what mail transport agent your server is using, or your host limiting the number of email that you can send in an hour.
fr: Si vos utilisateurs signalent que les e-mails de validation ne s’affichent pas, demandez-leur de vérifier leur dossier de spam. Il est possible que les e-mails provenant de votre serveur sont marqués comme spam. Cela dépend de nombreux facteurs : si votre fournisseur d’hébergement a un problème avec les spammeurs, la manière dont est faite votre configuration e-mail de PHP, quel agent de transport de messagerie votre serveur utilise, ou encore si votre hébergement limite le nombre d'e-mails que vous pouvez envoyer en une heure.

source: If no one gets email at all, it is quite likely your server is not configured properly for email. Your server needs a program to send email (called a Mail Transfer Agent - MTA) and PHP must be configured to use the MTA.
fr: Si personne ne reçoit d'e-mail du tout, il est très probable que votre serveur n’est pas configuré correctement pour le courrier électronique. Votre serveur a besoin d’un programme pour envoyer un e-mail (appelé agent de transfert de messagerie - MTA) et PHP doit être configuré pour utiliser le MTA.

source: To quickly check if PHP and an MTA are correctly configured, create a file on your server with the following content:
fr: Pour vérifier rapidement si PHP et un agent de transfert de mail - MTA "Mail Transfer Agent" - sont correctement configurés, créez un fichier sur votre serveur avec le contenu suivant :

source: Be sure to replace "your_email@your_host.com" with your actual email address. Take care to keep quotes around it! When you access this page through your web browser, it will attempt to send a test email. This test will let you know that PHP and your MTA are correctly configured. If it fails--either you get an error or you never receive the email--you will need to do more investigating and possibly contact your service provider.
fr: Assurez-vous de remplacer "your_email@your_host.com" par votre adresse e-mail réelle. Prenez soin de garder des guillemets autour d’elle ! Lorsque vous accédez à cette page via votre navigateur Web, cela va tenter d’envoyer un e-mail de test. Ce test vous permettra de savoir si PHP et votre MTA sont correctement configurés. Si le test échoue - soit vous obtenez une erreur, soit vous ne recevez jamais l’e-mail - vous aurez besoin de faire plus de recherches et éventuellement de contacter votre fournisseur de services.

source: Fully configuring an MTA and PHP's email functionality is beyond the scope of this FAQ and you should search the Internet for more resources on this. Some basic information on php parameters can be found on `PHP's site`__
fr: La configuration complète des fonctionnalités de messagerie d’un MTA et de PHP dépasse le cadre de cette FAQ, et vous devez rechercher plus de ressources sur Internet à ce sujet. Quelques informations de base sur les paramètres php peuvent être trouvées sur le `site de PHP`__

source: Server logs
fr: Journaux du serveur

source: Most likely you are using Apache as your web server. Warnings and errors are written to a log by the web server and can be useful for debugging problems. You will commonly see two types of log files: access logs and error logs. Information from PHP and Elgg is written to the server error log.
fr: Il est probable que vous utilisiez Apache comme serveur Web. Les avertissements et les erreurs sont écrits dans un journal par le serveur Web et peuvent être utiles pour les problèmes de débogage. Vous verrez généralement deux types de fichiers journaux : les journaux d’accès et les journaux d’erreurs. Les informations de PHP et de Elgg sont inscrites dans le journal des erreurs du serveur.

source: Linux -- The error log is probably in /var/log/httpd or /var/log/apache2.
fr: Linux -- Le journal d'erreur est probablement dans /var/log/httpd ou /var/log/apache2.

source: Windows - It is probably inside your Apache directory.
fr: Windows - Il est probablement dans votre répertoire Apache.

source: Mac OS - The error log is probably in /var/log/apache2/error_log
fr: Mac OS - Le journal d'erreur est probablement dans /var/log/apache2/error_log

source: If you are using shared hosting without ssh access, your hosting provider may provide a mechanism for obtaining access to your server logs. You will need to ask them about this.
fr: Si vous utilisez un hébergement partagé sans accès ssh, votre fournisseur d’hébergement peut fournir un mécanisme pour obtenir l’accès à vos journaux de serveur. Vous devrez leur poser vos questions à ce sujet.

source: How does registration work?
fr: Comment fonctionne l'inscription ?

source: With a default setup, this is how registration works:
fr: Avec une installation par défaut, voici comment fonctionne l'inscription :

source: User fills out registration form and submits it
fr: L'utilisateur renseigne le formulaire d'inscription et l'envoie

source: User account is created and disabled until validated
fr: Le compte utilisateur est créé et désactivé jusqu'à sa validation

source: Email is sent to user with a link to validate the account
fr: Un e-mail est envoyé à l'utilisateur afin de valider son compte

source: When a user clicks on the link, the account is validated
fr: Quand l'utilisateur clique sur le lien, le compte est validé

source: The user can now log in
fr: L'utilisateur peut maintenant s'identifier

source: Failures during this process include the user entering an incorrect email address, the validation email being marked as spam, or a user never bothering to validate the account.
fr: Les échecs durant ce processus comprennent l’utilisateur qui entre une adresse e-mail incorrecte, l’e-mail de validation marqué comme spam, ou un utilisateur qui ne prend jamais la peine de valider le compte.

source: User validation
fr: Validation de l'utilisateur

source: By default, all users who self-register must validate their accounts through email. If a user has problems validating an account, you can validate users manually by going to Administration -> Users -> Unvalidated.
fr: Par défaut, tous les utilisateurs qui s’inscrivent doivent valider leur compte par e-mail. Si un utilisateur a des difficultés pour valider son compte, vous pouvez valider manuellement les utilisateurs en allant dans Administration -> Utilisateurs -> Non validés.

source: You can remove this requirement by deactivating the User Validation by Email plugin.
fr: Vous pouvez supprimer cette exigence en désactivant le plugin User Validation by Email.

source: Removing validation has some consequences: There is no way to know that a user registered with a working email address, and it may leave you system open to spammers.
fr: La suppression de la validation a certaines conséquences : il n’y a aucun moyen de savoir si un utilisateur inscrit dispose d'une adresse e-mail fonctionnelle, et cela peut laisser votre système ouvert aux spammeurs.

source: Manually add user
fr: Ajouter manuellement un utilisateur

source: To manually add a user, under the Administer controls go to Users. There you will see a link title "Add new User". After you fill out the information and submit the form, the new user will receive an email with username and password and a reminder to change the password.
fr: Pour ajouter manuellement un utilisateur, dans la partie Administrer, accédez aux Utilisateurs. Là, vous verrez un lien "Ajouter un nouvel utilisateur". Après avoir rempli les informations et soumis le formulaire, le nouvel utilisateur recevra un e-mail avec son nom d’utilisateur et son mot de passe, et un rappel pour changer le mot de passe.

source: Elgg does not force the user to change the password.
fr: Elgg ne force pas l'utilisateur à changer le mot de passe.

source: I'm making or just installed a new theme, but graphics or other elements aren't working
fr: Je suis en train de créer ou viens d'installer un nouveau thème, mais les images ou d'autres éléments ne fonctionnent pas

source: Make sure the theme is at the bottom of the plugin list.
fr: Assurez-vous que le thème est placé tout en bas de la liste des plugins.

source: Clear your browser cache and reload the page. To lighten the load on the server, Elgg instructs the browser to rarely load the CSS file. A new theme will completely change the CSS file and a refresh should cause the browser to request the CSS file again.
fr: Effacez le cache de votre navigateur et rechargez la page. Pour alléger la charge sur le serveur, Elgg demande rarement au navigateur de charger le fichier CSS. Un nouveau thème modifiera complètement le fichier CSS et un rafraîchissement devrait inciter le navigateur à demander à nouveau le fichier CSS.

source: If you're building or modifying a theme, make sure you have disabled the simple and system caches. This can be done by enabling the Developer Tools plugin, then browsing to Administration -> Develop -> Settings. Once you're satisfied with the changes, enable the caches or performance will suffer.
fr: Si vous créez ou modifiez un thème, assurez-vous d’avoir désactivé les caches simples et système. Cela peut être fait en activant le plugin Developer Tools, puis en naviguant vers Administration -> Outils de développement -> Paramètres. Une fois que les modifications vous conviennent, réactivez les caches ou les performances en souffriront.

source: Changing profile fields
fr: Modification des champs du profil

source: Within the Administration settings of Elgg is a page for replacing the default profile fields. Elgg by default gives the administrator two choices:
fr: Dans les paramètres d’administration de Elgg se trouve une page pour remplacer les champs de profil par défaut. Par défaut, Elgg propose deux choix à l’administrateur :

source: Use the default profile fields
fr: Utilisez les champs de profil par défaut

source: Replace the default with a set of custom profile fields
fr: Remplacez les champs par défaut par un jeu de champs de profil personnalisés

source: You cannot add new profile fields to the default ones. Adding a new profile field through the replace profile fields option clears the default ones. Before letting in users, it is best to determine what profile fields you want, what field types they should be, and the order they should appear. You cannot change the field type or order or delete fields after they have been created without wiping the entire profile blank.
fr: Vous ne pouvez pas ajouter de nouveaux champs de profil aux champs par défaut. L’ajout d’un nouveau champ de profil via l’option de remplacement des champs de profil efface ceux par défaut. Avant de laisser les utilisateurs s'inscrire, il est préférable de déterminer quels champs de profil vous voulez, quels types de champ ils devraient être, et l’ordre dans lequel ils devraient apparaître. Vous ne pouvez pas modifier le type de champ ou réordonner ou supprimer les champs après leur création sans effacer l’intégralité du profil.

source: More flexibility can be gained through plugins. There is at least two plugins on the community site that enable you to have more control over profile fields. The `Profile Manager`_ plugin has become quite popular in the Elgg community. It lets you add new profile fields whenever you want, change the order, group profile fields, and add them to registration.
fr: Plus de flexibilité peut être obtenue grâce à des plugins. Il y a au moins deux plugins sur le site communautaire qui vous permettent d’avoir plus de contrôle sur les champs de profil. Le plugin `Profile Manager`_ est devenu très populaire dans la communauté Elgg. Il vous permet d’ajouter de nouveaux champs de profil quand vous le souhaitez, de modifier leur ordre, de regrouper les champs de profil et de les ajouter au formulaire d’inscription.

source: Changing registration
fr: Modification de l'inscription
