Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``groups_get_group_join_menu_item()`` now requires an ``ElggUser`` for ``$user``
fr: ``groups_get_group_join_menu_item()`` requiert désormais un ``ElggUser`` pour ``$user``

source: ``groups_get_group_leave_menu_item()`` now requires an ``ElggUser`` for ``$user``
fr: ``groups_get_group_leave_menu_item()`` requiert désormais un ``ElggUser`` pour ``$user``

source: ``groups_get_invited_groups()`` now requires an ``int`` for ``$user_guid``, a ``bool`` for ``$return_guids`` and an ``array`` for ``$options``
fr: ``groups_get_invited_groups()`` requiert désormais un ``int`` pour ``$user_guid``, un ``bool`` pour ``$return_guids`` et un ``array`` pour ``$options``

source: ``notify_user()`` now requires an ``int|array`` for ``$to`` and a ``int`` for ``$from`` and a ``string`` for ``$subject`` and ``$message``
fr: ``notify_user()`` requiert désormais un ``int|array`` pour ``$to`` et un ``int`` pour ``$from`` et un ``string`` pour ``$subject`` et ``$message``

source: ``pages_get_navigation_tree()`` now requires a ``ElggEntity`` for ``$container``
fr: ``pages_get_navigation_tree()`` requiert désormais un ``ElggEntity`` pour ``$container``

source: ``pages_prepare_form_vars()`` now requires a ``ElggPage`` for ``$page``, an ``int`` for ``$parent_guid`` and a ``ElggAnnotation`` for ``$revision``
fr: ``pages_prepare_form_vars()`` requiert désormais un ``ElggPage`` pour ``$page``, un ``int`` pour ``$parent_guid`` et un ``ElggAnnotation`` pour ``$revision``

source: ``pages_prepare_parent_breadcrumbs()`` now requires a ``ElggPage`` for ``$page``
fr: ``pages_prepare_parent_breadcrumbs()`` requiert désormais un ``ElggPage`` pour ``$page``

source: ``set_input()`` now requires a ``string`` for ``$variable``
fr: ``set_input()`` requiert désormais un ``string`` pour ``$variable``

source: ``thewire_filter()`` now requires a ``string`` for ``$text``
fr: ``thewire_filter()`` requiert désormais un ``string`` pour ``$text``

source: ``thewire_get_hashtags()`` now requires a ``string`` for ``$text``
fr: ``thewire_get_hashtags()`` requiert désormais un ``string`` pour ``$text``

source: ``thewire_save_post()`` now requires a ``string`` for ``$text`` and ``$method`` and an ``int`` for ``$userid`` and ``$access_id`` and ``$parent_guid``
fr: ``thewire_save_post()`` requiert désormais un ``string`` pour ``$text`` et ``$method`` et un ``int`` pour ``$userid``, ``$access_id`` et ``$parent_guid``

source: ``uservalidationbyemail_request_validation()`` now requires an ``int`` for ``$user_guid``
fr: ``uservalidationbyemail_request_validation()`` requiert désormais un ``int`` pour ``$user_guid``

source: ``elgg_ws_expose_function()`` now requires a ``string`` for ``$method`` and ``$description`` and ``$call_method``, an ``array`` for ``$parameters`` and a ``bool`` for ``$require_api_auth`` and ``$require_user_auth`` and ``$assoc``
fr: ``elgg_ws_expose_function()`` requiert désormais un ``string`` pour ``$method``, ``$description`` et ``$call_method``, un ``array`` pour ``$parameters`` et un ``bool`` pour ``$require_api_auth``, ``$require_user_auth`` et ``$assoc``

source: ``elgg_ws_register_service_handler()`` now requires a ``string`` for ``$handler``
fr: ``elgg_ws_register_service_handler()`` requiert désormais un ``string`` pour ``$handler``

source: ``elgg_ws_unexpose_function()`` now requires a ``string`` for ``$method`` and a ``string`` for ``$http_request_method``
fr: ``elgg_ws_unexpose_function()`` requiert désormais un ``string`` pour ``$method`` et un ``string`` pour ``$http_request_method``

source: ``elgg_ws_unregister_service_handler()`` now requires a ``string`` for ``$handler``
fr: ``elgg_ws_unregister_service_handler()`` requiert désormais un ``string`` pour ``$handler``

source: Class function return types
fr: Types de retour des fonctions de classes

source: ``\ElggEntity::deleteMetadata()`` no longer returns ``null``
fr: ``\ElggEntity::deleteMetadata()`` ne renvoie plus ``null``

source: ``\ElggEntity::getOwnedAccessCollection()`` no longer returns ``false`` but ``null`` when no access collection is found
fr: ``\ElggEntity::getOwnedAccessCollection()`` ne renvoie plus ``false`` mais ``null`` quand aucune collection d'accès n'a été trouvée

source: ``\ElggEntity::setContainerGUID()`` no longer returns ``int``
fr: ``\ElggEntity::setContainerGUID()`` ne renvoie plus un ``int``

source: ``\ElggFile::getDownloadURL()`` now returns ``null`` if there is an error
fr: ``\ElggFile::getDownloadURL()`` renvoie maintenant ``null`` en cas d'erreur

source: ``\ElggFile::getInlineURL()`` now returns ``null`` if there is an error
fr: ``\ElggFile::getInlineURL()`` renvoie maintenant ``null`` en cas d'erreur

source: ``\ElggMenuItem::factory()`` no longer returns ``null`` if there is an error
fr: ``\ElggMenuItem::factory()`` ne renvoie plus ``null`` en cas d'erreur

source: ``\Elgg\Page::getParentEntity()`` no longer returns ``false`` but ``null`` if there is no parent entity found
fr: ``\Elgg\Page::getParentEntity()`` ne renvoie plus ``false`` mais ``null`` si aucune entité parente n'a été trouvée

source: ``\ElggAccessCollection::getObjectFromID()`` now requires a ``int`` for ``$id``
fr: ``\ElggAccessCollection::getObjectFromID()`` requiert désormais un ``int`` pour ``$id``

source: ``\ElggAnnotation::getObjectFromID()`` now requires a ``int`` for ``$id``
fr: ``\ElggAnnotation::getObjectFromID()`` requiert désormais un ``int`` pour ``$id``

source: ``\ElggEntity::addRelationship()`` now requires an ``int`` for ``$guid_two`` and a ``string`` for ``$relationship``
fr: ``\ElggEntity::addRelationship()`` requiert désormais un ``int`` pour ``$guid_two`` et un ``string`` pour ``$relationship``

source: ``\ElggEntity::cache()`` now requires a ``bool`` for ``$persist``
fr: ``\ElggEntity::cache()`` requiert désormais un ``bool`` pour ``$persist``

source: ``\ElggEntity::canAnnotate()`` now requires an ``int`` for ``$user_guid`` and a ``string`` for ``$annotation_name``
fr: ``\ElggEntity::canAnnotate()`` requiert désormais un ``int`` pour ``$user_guid`` et un ``string`` pour ``$annotation_name``

source: ``\ElggEntity::canComment()`` now requires an ``int`` for ``$user_guid``
fr: ``\ElggEntity::canComment()`` requiert désormais un ``int`` pour ``$user_guid``

source: ``\ElggEntity::canDelete()`` now requires an ``int`` for ``$user_guid``
fr: ``\ElggEntity::canDelete()`` requiert désormais un ``int`` pour ``$user_guid``

source: ``\ElggEntity::canEdit()`` now requires an ``int`` for ``$user_guid``
fr: ``\ElggEntity::canEdit()`` requiert désormais un ``int`` pour ``$user_guid``

source: ``\ElggEntity::canWriteToContainer()`` now requires an ``int`` for ``$user_guid`` and a ``string`` for ``$type`` and ``$subtype``
fr: ``\ElggEntity::canWriteToContainer()`` requiert désormais un ``int`` pour ``$user_guid`` et un ``string`` pour ``$type`` et ``$subtype``

source: ``\ElggEntity::countAnnotations()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::countAnnotations()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::countEntitiesFromRelationship()`` now requires a ``string`` for ``$relationship`` and a ``bool`` for ``$inverse_relationship``
fr: ``\ElggEntity::countEntitiesFromRelationship()`` requiert désormais un ``string`` pour ``$relationship`` et un ``bool`` pour ``$inverse_relationship``

source: ``\ElggEntity::delete()`` now requires a ``bool`` for ``$recursive``
fr: ``\ElggEntity::delete()`` requiert désormais un ``bool`` pour ``$recursive``

source: ``\ElggEntity::deleteAnnotations()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::deleteAnnotations()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::deleteIcon()`` now requires a ``string`` for ``$type``
fr: ``\ElggEntity::deleteIcon()`` requiert désormais un ``string`` pour ``$type``

source: ``\ElggEntity::deleteMetadata()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::deleteMetadata()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::deleteOwnedAnnotations()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::deleteOwnedAnnotations()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::disable()`` now requires a ``string`` for ``$reason`` and a ``bool`` for ``$recursive``
fr: ``\ElggEntity::disable()`` requiert désormais un ``string`` pour ``$reason`` et un ``bool`` pour ``$recursive``

source: ``\ElggEntity::disableAnnotations()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::disableAnnotations()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::enable()`` now requires a ``bool`` for ``$recursive``
fr: ``\ElggEntity::enable()`` requiert désormais un ``bool`` pour ``$recursive``

source: ``\ElggEntity::enableAnnotations()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::enableAnnotations()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::getAnnotationsAvg()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::getAnnotationsAvg()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::getAnnotationsMax()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::getAnnotationsMax()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::getAnnotationsSum()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::getAnnotationsSum()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::getIcon()`` now requires a ``string`` for ``$size`` and ``$type``
fr: ``\ElggEntity::getIcon()`` requiert désormais un ``string`` pour ``$size`` et ``$type``

source: ``\ElggEntity::getIconLastChange()`` now requires a ``string`` for ``$size`` and ``$type``
fr: ``\ElggEntity::getIconLastChange()`` requiert désormais un ``string`` pour ``$size`` et ``$type``

source: ``\ElggEntity::getIconURL()`` now requires a ``string`` or ``array`` for ``$params``
fr: ``\ElggEntity::getIconURL()`` requiert désormais un ``string`` ou un ``array`` pour ``$params``

source: ``\ElggEntity::getObjectFromID()`` now requires an ``int`` for ``$id``
fr: ``\ElggEntity::getObjectFromID()`` requiert désormais un ``int`` pour ``$id``

source: ``\ElggEntity::getOwnedAccessCollections()`` now requires an ``array`` for ``$options``
fr: ``\ElggEntity::getOwnedAccessCollections()`` requiert désormais un ``array`` pour ``$options``

source: ``\ElggEntity::getOwnedAccessCollection()`` now requires a ``string`` for ``$subtype``
fr: ``\ElggEntity::getOwnedAccessCollection()`` requiert désormais un ``string`` pour ``$subtype``

source: ``\ElggEntity::getMetadata()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::getMetadata()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::getVolatileData()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::getVolatileData()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::hasIcon()`` now requires a ``string`` for ``$size`` and ``$type``
fr: ``\ElggEntity::hasIcon()`` requiert désormais un ``string`` pour ``$size`` et ``$type``

source: ``\ElggEntity::removeAllRelationships()`` no longer allows ``null`` to be passed to ``$relationship``
fr: ``\ElggEntity::removeAllRelationships()`` ne permet plus de transmettre ``null`` à ``$relationship``

source: ``\ElggEntity::removeRelationship()`` now requires an ``int`` for ``$guid_two`` and a ``string`` for ``$relationship``
fr: ``\ElggEntity::removeRelationship()`` requiert désormais un ``int`` pour ``$guid_two`` et un ``string`` pour ``$relationship``

source: ``\ElggEntity::saveIconFromElggFile()`` now requires a ``string`` for ``$type``
fr: ``\ElggEntity::saveIconFromElggFile()`` requiert désormais un ``string`` pour ``$type``

source: ``\ElggEntity::saveIconFromLocalFile()`` now requires a ``string`` for ``$input_name`` and ``$type``
fr: ``\ElggEntity::saveIconFromLocalFile()`` requiert désormais un ``string`` pour ``$input_name`` et ``$type``

source: ``\ElggEntity::saveIconFromUploadedFile()`` now requires a ``string`` for ``$input_name`` and ``$type``
fr: ``\ElggEntity::saveIconFromUploadedFile()`` requiert désormais un ``string`` pour ``$input_name`` et ``$type``

source: ``\ElggEntity::setContainerGUID()`` now requires an ``int`` for ``$container_guid``
fr: ``\ElggEntity::setContainerGUID()`` requiert désormais un ``int`` pour ``$container_guid``

source: ``\ElggEntity::setDisplayName()`` now requires a ``string`` for ``$display_name``
fr: ``\ElggEntity::setDisplayName()`` requiert désormais un ``string`` pour ``$display_name``

source: ``\ElggEntity::setMetadata()`` now requires a ``string`` for ``$name`` and ``$value_type`` and a ``bool`` for ``$multiple``
fr: ``\ElggEntity::setMetadata()`` requiert désormais un ``string`` pour ``$name`` et ``$value_type`` et un ``bool`` pour ``$multiple``

source: ``\ElggEntity::setTempMetadata()`` now requires a ``string`` for ``$name`` and a ``bool`` for ``$multiple``
fr: ``\ElggEntity::setTempMetadata()`` requiert désormais un ``string`` pour ``$name`` et un ``bool`` pour ``$multiple``

source: ``\ElggEntity::setVolatileData()`` now requires a ``string`` for ``$name``
fr: ``\ElggEntity::setVolatileData()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggEntity::updateLastAction()`` now requires an ``int`` for ``$posted``
fr: ``\ElggEntity::updateLastAction()`` requiert désormais un ``int`` pour ``$posted``

source: ``\ElggMetadata::getObjectFromID()`` now requires a ``int`` for ``$id``
fr: ``\ElggMetadata::getObjectFromID()`` requiert désormais un ``int`` pour ``$id``

source: ``\ElggRelationship::getObjectFromID()`` now requires a ``int`` for ``$id``
fr: ``\ElggRelationship::getObjectFromID()`` requiert désormais un ``int`` pour ``$id``

source: ``\ElggFile::getDownloadURL()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``\ElggFile::getDownloadURL()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``\ElggFile::getInlineURL()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``\ElggFile::getInlineURL()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``\ElggGroup::isToolEnabled()`` now requires a ``string`` for ``$name``
fr: ``\ElggGroup::isToolEnabled()`` requiert désormais un ``string`` pour ``$name``

source: ``\ElggMenuItem::factory()`` now requires an ``array`` for ``$options``
fr: ``\ElggMenuItem::factory()`` requiert désormais un ``array`` pour ``$options``

source: ``\ElggTempFile::getDownloadURL()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``\ElggTempFile::getDownloadURL()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``\ElggTempFile::getInlineURL()`` now requires a ``bool`` for ``$use_cookie`` and a ``string`` for ``$expires``
fr: ``\ElggTempFile::getInlineURL()`` requiert désormais un ``bool`` pour ``$use_cookie`` et un ``string`` pour ``$expires``

source: ``\Elgg\WebServices\Di\ApiRegistrationService::registerApiMethod()`` now requires a ``\Elgg\WebServices\ApiMethod`` as the only parameter
fr: ``\Elgg\WebServices\Di\ApiRegistrationService::registerApiMethod()`` requiert désormais un ``\Elgg\WebServices\ApiMethod`` comme unique paramètre

source: Moved classes
fr: Classes déplacées

source: ``\ElggAutoP`` has been moved to ``\Elgg\Views\AutoParagraph``
fr: ``\ElggAutoP`` a été déplacé vers ``\Elgg\Views\AutoParagraph``

source: ``\ElggCache`` has been moved to ``\Elgg\Cache\BaseCache``
fr: ``\ElggCache`` a été déplacé vers ``\Elgg\Cache\BaseCache``

source: ``\ElggDiskFilestore`` has been moved to ``\Elgg\Filesystem\Filestore\DiskFilestore``
fr: ``\ElggDiskFilestore`` a été déplacé vers ``\Elgg\Filesystem\Filestore\DiskFilestore``

source: ``\ElggFilestore`` has been moved to ``\Elgg\Filesystem\Filestore``
fr: ``\ElggFilestore`` a été déplacé vers ``\Elgg\Filesystem\Filestore``

source: ``\ElggRewriteTester`` has been moved to ``\Elgg\Router\RewriteTester``
fr: ``\ElggRewriteTester`` a été déplacé vers ``\Elgg\Router\RewriteTester``

source: ``\ElggTempDiskFilestore`` has been moved to ``\Elgg\Filesystem\Filestore\TempDiskFilestore``
fr: ``\ElggTempDiskFilestore`` a été déplacé vers ``\Elgg\Filesystem\Filestore\TempDiskFilestore``

source: ``\Elgg\Database\SiteSecret`` has been moved to ``\Elgg\Security\SiteSecret``
fr: ``\Elgg\Database\SiteSecret`` a été déplacé vers ``\Elgg\Security\SiteSecret``

source: ``elgg_clear_plugin_hook_handlers`` use ``elgg_clear_event_handlers``
fr: ``elgg_clear_plugin_hook_handlers`` utilisez ``elgg_clear_event_handlers``

source: ``elgg_register_plugin_hook_handler`` use ``elgg_register_event_handler``
fr: ``elgg_register_plugin_hook_handler`` utilisez ``elgg_register_event_handler``

source: ``elgg_trigger_plugin_hook`` use ``elgg_trigger_event_results``
fr: ``elgg_trigger_plugin_hook`` utilisez ``elgg_trigger_event_results``

source: ``elgg_unregister_plugin_hook_handler`` use ``elgg_unregister_event_handler``
fr: ``elgg_unregister_plugin_hook_handler`` utilisez ``elgg_unregister_event_handler``

source: ``get_user_by_email`` use ``elgg_get_user_by_email``
fr: ``get_user_by_email`` utilisez ``elgg_get_user_by_email``

source: ``get_user_by_username`` use ``elgg_get_user_by_username``
fr: ``get_user_by_username`` utilisez ``elgg_get_user_by_username``

source: ``Loggable`` this interface has been merged into the ``ElggData`` class
fr: ``Loggable`` cette interface a été fusionnée dans la classe ``ElggData``

source: ``elgg_set_email_transport`` use ``_elgg_services()->set('mailer', ...)``
fr: ``elgg_set_email_transport`` utilisez ``_elgg_services()->set('mailer', ...)``

source: ``elgg_ws_expose_function`` use ``elgg-plugin.php`` or ``'register', 'api_methods'`` event
fr: ``elgg_ws_expose_function`` utilisez ``elgg-plugin.php`` ou l'événement ``'register', 'api_methods'``

source: Removed class functions
fr: Fonctions de classe supprimées

source: Removed events
fr: Événements supprimés

source: ``access:collections:addcollection, collection`` use the ``create, access_collection`` sequence
fr: ``access:collections:addcollection, collection`` utilisez la séquence ``create, access_collection``

source: ``access:collections:deletecollection, collection`` use the ``delete, access_collection`` sequence
fr: ``access:collections:deletecollection, collection`` utilisez la séquence ``delete, access_collection``

source: ``prepare, breadcrumbs`` use ``register, menu:breadcrumbs``
fr: ``prepare, breadcrumbs`` utilisez ``register, menu:breadcrumbs``

source: Constants
fr: Constantes

source: The misspelled ``REFERER`` constant has been removed. Use ``REFERRER`` instead.
fr: La constante ``REFERER`` mal orthographiée a été supprimée. Utilisez plutôt ``REFERRER``.

source: The ``REFERRER`` constant has been changed to a string with the value ``__elgg_referrer``
fr: La constante ``REFERRER`` a été remplacée par une chaîne de caractères avec la valeur ``__elgg_referrer``

source: From 5.0 to 5.1
fr: De 5.0 à 5.1

source: Changes in the DOM structure
fr: Changements dans la structure DOM

source: In order to improve accessibility the HTML DOM structure has been changed slightly. Some sections of the page have been changed from a ``div`` to ``header``, ``main`` or ``footer``. The classes or place in the DOM has not been changed.
fr: Afin d'améliorer l'accessibilité, la structure DOM HTML a été légèrement modifiée. Certaines sections de la page ont été modifiées de ``div`` à ``header``, ``main`` ou ``footer``. Les classes ou la position dans le DOM n'ont pas été modifiées.

source: ``page/elements/<section>/after`` is deprecated: Extend the correct ``page/elements/<section>``
fr: ``page/elements/<section>/after`` est obsolète : étendez le bon ``page/elements/<section>``

source: ``page/elements/<section>/before`` is deprecated: Prepend the correct ``page/elements/<section>``
fr: ``page/elements/<section>/before`` est obsolète : ajoutez le bon préfixe ``page/elements/<section>``

source: ``resources/comments/edit`` is deprecated: This resource is no longer in use
fr: ``resources/comments/edit`` est obsolète : cette ressource n'est plus utilisée

source: ``edit:object:comment`` is deprecated: Editing comments uses an inline form
fr: ``edit:object:comment`` est obsolète : la modification des commentaires utilise un formulaire en ligne

source: From 5.x to 6.0
fr: De 5.x vers 6.0

source: Databases
fr: Bases de données

source: DB Requirements
fr: Pré-requis de la base de données

source: The minimal MySQL version is now 8.0
fr: La version minimale de MySQL est maintenant la 8.0.

source: The minimal MariaDB version is now 10.6
fr: La version minimale de MariaDB est maintenant la 10.6.

source: Deleted state
fr: État supprimé

source: ES Modules
fr: Modules ES

source: ``elgg_unrequire_js()`` this function has been removed
fr: ``elgg_unrequire_js()`` cette fonction a été retirée

source: Entity Icons
fr: Icônes des entités

source: Cropping coordinates
fr: Coordonnées de découpe

source: Headings
fr: Titres

source: Most notable changes are the following:
fr: Les changements les plus importants sont les suivants :

source: CSS and HTML structure changes
fr: Modifications de structure CSS et HTML

source: Removed lib functions
fr: Fonctions de bibliothèque supprimées

source: ``elgg_disable_annotations()`` has been removed
fr: ``elgg_disable_annotations()`` a été retiré

source: ``elgg_enable_annotations()`` has been removed
fr: ``elgg_enable_annotations()`` a été retiré

source: ``elgg_set_view_location()`` has been removed
fr: ``elgg_set_view_location()`` a été retiré

source: ``elgg_strrchr()`` has been removed
fr: ``elgg_strrchr()`` a été retiré

source: ``elgg_strripos()`` has been removed
fr: ``elgg_strripos()`` a été retiré

source: ``elgg_unrequire_css()`` has been removed. Use ``elgg_unregister_external_file('css', $view)`` as replacement.
fr: ``elgg_unrequire_css()`` a été retirée. Utilisez ``elgg_unregister_external_file('css', $view)`` en remplacement.

source: ``\ElggEntity->getTags()`` use ``elgg_get_metadata()`` as an alternative.
fr: ``\ElggEntity->getTags()`` utilisez ``elgg_get_metadata()`` comme alternative.

source: Removed Config values
fr: Valeurs de configuration retirées

source: Elgg's initial funding was by a company called Curverider Ltd, which was started by David Tosh and Ben Werdmuller. In 2010, Curverider was acquired by Thematic Networks and control of the open-source project was turned over to `The Elgg Foundation`_. Today, Elgg is a community-driven open source project and has a variety of contributors and sponsors.
es: Elgg fue fundado por una empresa, «Curverider Ltd.», que iniciaron David Tosh y Ben Werdmuller. En 2010, Thematic Networks compró la empresa y el control del proyecto de software libre se cedió a la `Elgg Foundation`_. A día de hoy, Elgg es un proyecto de software libre desarrollado por la comunidad, y cuenta con diversos colaboradores y patrocinadores.

source: In general, we adhere to `semantic versioning`_.
es: En general, apostamos por las `versiones semánticas`_.

source: Bugfix Releases (1.9.x)
es: Versiones de corrección de errores (1.9.x)

source: Every few weeks.
es: Cada pocas semanas.
