Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Groups icon files have been moved from ``groups/<guid><size>.jpg`` relative to group owner's directory on filestore to a location prescribed by the entity icon service. Plugins should stop accessing files on the filestore directly and use the entity icon API. Upgrade script is available via admin interface.
fr: Les fichiers d’icônes des groupes ont été déplacés de ``groups/<guid><size>.jpg`` relativement au répertoire du propriétaire du groupe dans le répertoire de fichiers, vers un emplacement indiqué par le service d’icône d’entité. Les plugins doivent cesser d’accéder directement aux fichiers du répertoire de fichiers et utiliser l’API de l’icône de l’entité. Le script de mise à niveau est disponible via l’interface d’administration.

source: The generation of entity icons has ben changed. No longer will all the configured sizes be generated when calling one of the entity icon functions (``ElggEntity::saveIconFromUploadedFile``, ``ElggEntity::saveIconFromLocalFile`` or ``ElggEntity::saveIconFromElggFile``), but only the `master` size. The other configured sizes will be generated when requesting that size based of the `master` icon.
fr: La génération d’icônes des entités a été modifiée. Toutes les dimensions configurées ne seront plus générées lors de l’appel de l’une des fonctions de l’icône de l’entité (``ElggEntity::saveIconFromUploadedFile``, ``ElggEntity:::saveIconFromLocalFile`` ou ``ElggEntity::saveIconFromElggFile``), mais seulement la taille `master`. Les autres dimensions configurées seront générées à partir de l’icône `master` lorsque cette dimension est demandée.

source: Icon glyphs
fr: Glyphes d'icône

source: FontAwesome has been upgraded to version 5.0+. There were certain changes to how FontAwesome glyphs are rendered. The core will take care of most changes (e.g. mapping old icon names to new ones, and using the correct prefix for brand and solid icons).
fr: FontAwesome a été mis à niveau vers la version 5.0+. Il y a eu certains changements dans la façon dont les glyphes FontAwesome sont rendus. Le noyau s’occupera de la plupart des changements (par ex. mappage des anciens noms d’icônes à de nouveaux, et en utilisant le préfixe correct pour les icônes de marques et les icônes solides).

source: Autocomplete (user and friends pickers)
fr: Auto-complétion / saisie automatique (sélecteurs d’utilisateurs et de contacts)

source: Friends Picker input is now rendered using ``input/userpicker``.
fr: Le sélecteur de contacts "Friends Picker" est désormais affiché en utilisant ``input/userpicker``.

source: Plugins should:
fr: Les plugins devraient :

source: Update overriden ``input/userpicker`` to support new ``only_friends`` parameter
fr: Mettre à jour le paramètre ``input/userpicker`` pour prendre en charge le nouveau paramètre ``only_friends``

source: Remove friends picker CSS from their stylesheets
fr: Supprimer le CSS du sélecteur de contacts - "friends picker" - de leurs feuilles de style

source: Friends collections
fr: Collections de Contacts

source: Friends collections UI has been moved to its own plugins - ``friends_collections``.
fr: L'UI des collections de contacts a été déplacée vers son propre plugin - ``friends_collections``.

source: Layout of ``.elgg-body`` elements
fr: Mise en page des éléments ``.elgg-body``

source: In 3.0, these elements by default no longer stretch to fill available space in a block context. They still clear floats and allow breaking words to wrap text.
fr: Dans 3.0, ces éléments par défaut ne s’étirent plus pour remplir l’espace disponible dans un contexte de bloc. Ils continuent de supprimer les floats et permettent la césure des mots pour envelopper le texte.

source: Core modules and layouts that relied on space-filling have been reworked for Flexbox and we encourage devs to do the same, rather than use the problematic ``overflow: hidden``.
fr: Les modules du noyau et les mises en page qui reposaient sur le remplissage de l’espace ont été retravaillés pour Flexbox, et nous encourageons les développeurs à faire de même, plutôt que d’utiliser la technique problématique ``overflow:hidden``.

source: Delete river items
fr: Supprimer des éléments de la rivière

source: The function ``elgg_delete_river()`` which was deprecated in 2.3, has been reinstated. Notable changes between the internals of this function are;
fr: La fonction ``elgg_delete_river()``, qui avait été dépréciée dans la version 2.3, a été rétablie. Des changements notables internes à cette fonction sont ;

source: It accepts all ``$options`` from ``elgg_get_river()`` but requires at least one of the following params to be set id(s), annotation_id(s), subject_guid(s), object_guid(s), target_guid(s) or view(s)
fr: Elle accepte toutes les ``$options`` de ``elgg_get_river()``, mais exige qu’au moins l’un des paramètres suivants soit défini : id(s), annotation_id(s), subject_guid(s), object_guid(s), target_guid(s) ou view(s)

source: Since ``elgg_get_river`` by default has a limit on the number of river items it fetches, if you wish to remove all river items you need to set ``limit`` to ``false``
fr: Étant donné que ``elgg_get_river`` a par défaut une limite sur le nombre d’éléments de la rivière qu’elle récupère, si vous souhaitez supprimer tous les éléments de la rivière, vous devez définir ``limit`` à ``false``

source: Access is ignored when deleting river items
fr: L’accès est ignoré lors de la suppression d’éléments de la rivière

source: Events are fired just before and after a river item has been deleted
fr: Les événements sont déclenchés juste avant et après qu'un élément de la rivière a été effacé

source: Discussion replies moved to comments
fr: Les réponses aux discussions ont été converties en commentaires

source: Since discussion replies where mostly a carbon copy of comments, all discussion replies have been migrated to comments. All related action, hooks, event, language keys etc. have been removed.
fr: Dans la mesure où les réponses aux discussion étaient quasiment une copie des commentaires, toutes les réponses aux discussions ont été migrées vers les commentaires. Toutes les actions, hooks, événements et clefs de traduction associés ont été supprimés.

source: Discussion comments will now show up in the Comments section of Search, no longer under the Discussion section.
fr: Les commentaires des discussions apparaîtront désormais dans la section Commentaires de la recherche, et plus dans la section Discussion.

source: Translations cleanup
fr: Nettoyage des traductions

source: All plugins have been scanned for unused translation keys. The unused keys have been removed. If there was a generic translation available for the custom translation key, these have also been updated.
fr: Tous les plugins ont été scannés pour des clefs de traduction inutilisées. Les clefs inutilisées ont été supprimées. S’il existait une traduction générique disponible pour la clef de traduction personnalisée, celles-ci ont également été mises à jour.

source: System Log
fr: Journal système

source: System log API has been moved out of core into a ``system_log`` plugin. ``logbrowser`` and ``logrotate`` plugins have been merged into the ``system_log`` plugin.
fr: L’API du journal système a été déplacée hors du noyau dans un plugin ``system_log``. Les plugins ``logbrowser`` et ``logrotate`` ont été fusionnés dans le plugin ``system_log``.

source: Error logging
fr: Journalisation des erreurs

source: Sending ``elgg_log()`` and PHP error messages to page output is now only possible via the developers plugin "Log to the screen" setting. See the ``settings.example.php`` file for more information on using ``$CONFIG->debug`` in your ``settings.php`` file. Debugging should generally be done via the ``xdebug`` extension or ``tail -f /path/to/error.log`` on your server.
fr: L’affichage des messages d’erreur de ``elgg_log()`` et de PHP n’est plus désormais possible que via le paramètre "Afficher à l'écran" du plugin des développeurs. Consultez le fichier ``settings.example.php`` pour plus d’informations sur l’utilisation de ``$CONFIG->debug`` dans votre fichier ``settings.php``. Le débogage doit généralement se faire via l’extension ``xdebug`` ou via ``tail -f /chemin/du/fichier/error.log`` sur votre serveur.

source: Composer asset plugin no longer required
fr: Le plugin des actifs de composer n’est plus requis

source: Assets are now loaded from https://asset-packagist.org. FXP composer asset plugin is no longer required when installing Elgg or updating composer dependencies.
fr: Les actifs sont maintenant chargés à partir de https://asset-packagist.org. Le plugin FXP composer n’est plus nécessaire lors de l’installation de Elgg ni lors de la mise à jour des dépendances de composer.

source: Cron logs
fr: Journaux du Cron

source: The cron logs are no longer stored in the database, but on the filesystem (in dataroot). This will allow longer output to be stored. A migration script was added to migrate the old database settings to the new location and remove the old values from the database.
fr: Les journaux du Cron ne sont plus conservés dans la base de données, mais sur le système de fichiers (dans la racine du répertoire des données). Ceci va permettre de conserver des sorties plus longues. Un script de migration a été ajouté pour migrer les anciens paramètres de la base de données vers le nouvel emplacement et supprimer les anciennes valeurs de la base de données.

source: Removed / changed language keys
fr: Clefs de traduction supprimées / modifiées

source: New MySQL schema features are not applied
fr: Les nouvelles fonctionnalités du schéma MySQL ne sont pas appliquées

source: New 3.0 installations require MySQL 5.5.3 (or higher) and use the utf8mb4 character set and LONGTEXT content columns (notably allowing storing longer content and extended characters like emoji).
fr: Les nouvelles installations 3.0 nécessitent MySQL 5.5.3 (ou plus) et utilisent le jeu de caractères utf8mb4 et les colonnes de contenu LONGTEXT (ce qui permet notamment le stockage d'un contenu plus long et des caractères étendus comme les emoji).

source: Miscellaneous changes
fr: Changements divers

source: The settings "Allow visitors to register" and "Restrict pages to logged-in users" now appear on the Basic Settings admin page.
fr: Les paramètres "Permettre aux visiteurs de s'inscrire" et "Restreindre les pages aux utilisateurs connectés" apparaissent désormais sur la page admin des paramètres de base - "Basic Settings".

source: The ``twitter_api`` plugin no longer comes bundled with Elgg.
fr: Le plugin ``twitter_api`` n'est plus distribué avec Elgg.

source: Unit and Integration Testing
fr: Tests Unitaires et d'Intégration

source: Elgg's PHPUnit bootstrap can now handle both unit and integration tests. Please note that **you shouldn't run tests on a production site**, as it may damage data integrity. To prevent data loss, you need to specify database settings via environment variables. You can do so via the phpunit.xml bootstrap.
fr: L'amorçage du PHPUnit de Elgg peut désormais gérer à la fois les tests unitaires et d'intégration. Veuillez noter que **vous ne devriez pas exécuter de test sur un site de production**, car cela peut endommager l'intégrité des données. Pour éviter les pertes de données, vous devez spécifier les paramètres de la base de données via les variables d'environnement. Vous pouvez faire cela via le fichier d'amorçage phpunit.xml.

source: Plugins can now implement their own PHPUnit tests by extending ``\Elgg\UnitTestCase`` and ``\Elgg\IntegrationTestCase`` classes. ``plugins`` test suite will automatically autoload PHPUnit tests from ``mod/<plugin_id>/tests/phpunit/unit`` and ``mod/<plugin_id>/tests/phpunit/integration``.
fr: Les plugins peuvent désormais implémenter leurs propres tests PHPUnit en étendant les classes ``\Elgg\UnitTestCase`` et ``\Elgg\IntegrationTestCase``. La suite de test ``plugins`` va automatiquement charger les tests PHPUnit depuis ``mod/<plugin_id>/tests/phpunit/unit`` et ``mod/<plugin_id>/tests/phpunit/integration``.

source: Prior to running integration tests, you need to enable the plugins that you wish to test alongside core API.
fr: Avant d'exécuter des tests d'intégration, vous devez activer les plugins que vous souhaitez tester en même temps que l'API du noyau.

source: ``\Elgg\IntegrationTestCase`` uses ``\Elgg\Seeding`` trait, which can be used to conveniently build new entities and write them to the database.
fr: ``\Elgg\IntegrationTestCase`` utilise le trait ``\Elgg\Seeding``, qui peut être utilisé pour construire aisément de nouvelles entités et les enregistrer dans la base de données.

source: ``\Elgg\UnitTestCase`` does not use the database, but provides a database mocking interface, which allows tests to define query specs with predefined returns.
fr: ``\Elgg\UnitTestCase`` n'utilise pas la base de données, mais fournit une interface de base de données factice, qui permet aux tests de définir des spécifications de requête avec des retours prédéfinis.

source: By default, both unit and integration tests will be run whenever ``phpunit`` is called. You can use ``--testsuite`` flag to only run a specific suite: ``phpunit --testsuite unit`` or ``phpunit --testsuite integration`` or ``phpunit --testsuite plugins``.
fr: Par défaut, les tests unitaires et d'intégration seront exécutés à chaque fois que ``phpunit`` est appelé. Vous pouvez utiliser le drapeau ``--testsuite`` pour n'exécuter qu'une suite de tests spécifique : ``phpunit --testsuite unit`` ou ``phpunit --testsuite integration`` ou ``phpunit --testsuite plugins``.

source: For integration testing to run properly, plugins are advised to not put any logic into the root of ``start.php``, and instead return a Closure. This allows the testsuite to build a new Application instance without loosing plugin initialization logic.
fr: Pour que les tests d'intégration s'exécutent correctement, il est recommandé que les plugins ne placent aucune logique de fonctionnement dans la racine de ``start.php``, et renvoient plutôt une Closure à la place. Ceci permet à la suite de test de construire une nouvelle instance Application sans perdre la logique d'initialisation du plugin.

source: Plugins with simpletests will continue working as perviously. However, method signatures in the ``ElggCoreUnitTest`` abstract class have changed and you will need to update your tests accordingly. Namely, it's discouraged to use ``__construct`` and ``__desctruct`` methods. ``setUp`` and ``tearDown`` have been marked as private and are used for consistent test boostrapping and asserting pre and post conditions, your test case should use ``up`` and ``down`` methods instead.
fr: Les plugins avec simpletests vont continuer à fonctionner comme précédemment. Cependant, les méthodes de signature dans la classe abstraite ``ElggCoreUnitTest`` ont changé et vous allez avoir besoin de mettre à jour vos tests en conséquence. En particulier, il est déconseillé d'utiliser des méthodes ``__construct`` et ``__destruct``. ``setUp`` et ``tearDown`` ont été marquées comme privées et sont utilisées pour amorcer des tests cohérents et pour déclarer des conditions pre et post ; votre cas de test devrait utiliser les méthodes ``up`` et ``down`` à leur place.

source: Simpletests can no longer be executed from the admin interface of the developers plugin. Use Elgg cli command: ``elgg-cli simpletest``
fr: Simpletests ne peut plus être exécuté depuis l'interface admin du plugin developers. Utilisez la commande Elgg cli : ``elgg-cli simpletest``

source: From 3.0 to 3.1
fr: De 3.0 à 3.1

source: PHP 7.0 has reached end of life in January 2019. To ensure that Elgg sites are secure, we now require PHP 7.1 for new installations.
fr: PHP 7.0 a atteint sa fin de vie en janvier 2019. Pour assurer la sécurité des sites Elgg, nous exigeons maintenant au moins PHP 7.1 pour les nouvelles installations.

source: If upgrading from a previous Elgg installation make sure you have the correct PHP version installed.
fr: Si vous faites une mise à niveau depuis une installation de Elgg précédente, assurez-vous que vous avez la bonne version de PHP installée.

source: Plugin screenshots
fr: Captures d’écran du plugin

source: Screenshots added to plugins are no longer supported and will no longer be shown in the plugin details.
fr: Les captures d’écran ajoutées aux plugins ne sont plus prises en charge et ne seront plus affichées dans les détails du plugin.

source: Loading external files
fr: Chargement des fichiers externes

source: The usage of ``elgg_register_js``, ``elgg_unregister_js`` and ``elgg_load_js`` is discouraged. Make sure your javascript is an AMD module and use ``elgg_require_js`` to include it.
fr: L’utilisation de ``elgg_register_js``, de ``elgg_unregister_js`` et de ``elgg_load_js`` est déconseillée. Assurez-vous que votre javascript est un module AMD et utilisez ``elgg_require_js`` pour l’inclure.

source: The usage of ``elgg_register_css``, ``elgg_unregister_css`` and ``elgg_load_css`` is discouraged. You can register and include css with the new ``elgg_require_css`` function.
fr: L’utilisation de ``elgg_register_css``, de ``elgg_unregister_css`` et de ``elgg_load_css`` est déconseillée. Vous pouvez enregistrer et inclure les css avec la nouvelle fonction ``elgg_require_css``.

source: Setting page owner
fr: Définition du propriétaire de la page

source: Setting the page owner via the ``elgg_get_page_owner_guid`` function parameter is deprecated. Use ``elgg_set_page_owner_guid``.
fr: La définition du propriétaire de la page via un paramètre de la fonction ``elgg_get_page_owner_guid`` est obsolète. Utilisez ``elgg_set_page_owner_guid``.

source: The core simpletests have been removed from the system. They are all replaced by PHP unit tests or integration tests. The simpletest cli command has been deprecated.
fr: Les tests simples du noyau ont été supprimés du système. Ils sont tous remplacés par des tests unitaires PHP ou des tests d’intégration. La commande cli simpletest est devenue obsolète.

source: Hook and event callbacks
fr: Fonctions de rappel - callbacks - de hook et d’événement

source: The legacy style hook and event callback arguments are deprecated. You should switch to the new style as soon as possible.
fr: Les arguments des hooks et des fonctions de rappel historiques sont déconseillés. Vous devez passer au nouveau style d'arguments dès que possible.

source: Deprecated Routes
fr: Routes obsolètes

source: ``previous:object:thewire`` This route was not in use. It now has been marked as deprecated.
fr: ``previous:object:thewire`` Cette route n’était pas utilisée. Elle a maintenant été marquée comme obsolète.

source: Deprecated CSS libraries
fr: Bibliothèques CSS obsolètes

source: ``jquery.imgareaselect`` Do not use this external css file.
fr: ``jquery.imgareaselect`` N’utilisez pas ce fichier css externe.

source: ``jquery.treeview`` Do not use this external css file.
fr: ``jquery.treeview`` N’utilisez pas ce fichier css externe.

source: Deprecated JS libraries
fr: Bibliothèques JS obsolètes

source: ``elgg.avatar_cropper`` Do not depend on this external javascript library.
fr: ``elgg.avatar_cropper`` Évitez de dépendre de cette bibliothèque javascript externe.

source: ``jquery.imgareaselect`` Do not depend on this external javascript library.
fr: ``jquery.imgareaselect`` Évitez de dépendre de cette bibliothèque javascript externe.

source: ``jquery.treeview`` Do not depend on this external javascript library.
fr: ``jquery.treeview`` Évitez de dépendre de cette bibliothèque javascript externe.

source: ``access_show_hidden_entities()`` Use ``elgg_call()`` with ``ELGG_SHOW_DISABLED_ENTITIES`` flag.
fr: ``access_show_hidden_entities()`` Utilisez ``elgg_call()`` avec le drapeau ``ELGG_SHOW_DISABLED_ENTITIES``.

source: ``count_messages()`` Use ``elgg()->system_messages->count()``.
fr: ``count_messages()`` Utilisez ``elgg()->system_messages->count()``.

source: ``elgg_enable_entity()`` Use ``ElggEntity::enable()``.
fr: ``elgg_enable_entity()`` Utilisez ``ElggEntity::enable()``.

source: ``elgg_get_file_list()`` Use a PHP directory iterator.
fr: ``elgg_get_file_list()`` Utilisez un itérateur de répertoire PHP.

source: ``elgg_instanceof()`` Use PHP instanceof type operator.
fr: ``elgg_instanceof()`` Utilisez l'opérateur de type instanceof de PHP.

source: ``elgg_is_admin_user()`` Use ``ElggUser::isAdmin()``.
fr: ``elgg_is_admin_user()`` Utilisez ``ElggUser::isAdmin()``.

source: ``elgg_set_ignore_access()`` Use ``elgg_call()`` with ``ELGG_IGNORE_ACCESS`` flag.
fr: ``elgg_set_ignore_access()`` Utilisez ``elgg_call()`` avec le drapeau ``ELGG_IGNORE_ACCESS``.

source: ``get_access_list()`` Use ``get_access_array()``.
fr: ``get_access_list()`` Utilisez ``get_access_array()``.

source: ``get_language()`` Use ``get_current_language()``.
fr: ``get_language()`` Utilisez ``get_current_language()``.

source: ``get_number_users()`` Use ``elgg_count_entities()``.
fr: ``get_number_users()`` Utilisez ``elgg_count_entities()``.

source: Deprecated actions
fr: Actions obsolètes

source: ``admin/delete_admin_notice`` Replaced by generic entity/delete action.
fr: ``admin/delete_admin_notice`` Remplacé par une action générique entity/delete.

source: ``avatar/crop`` Handled in avatar/upload action.
fr: ``avatar/crop`` Géré dans l'action avatar/upload.

source: ``avatar/remove`` Handled in avatar/upload action.
fr: ``avatar/remove`` Géré dans l’action avatar/upload.

source: ``blog/delete`` Replaced by generic entity/delete action.
fr: ``blog/delete`` Remplacé par l’action générique entity/delete.

source: ``messages/delete`` Replaced by generic entity/delete action.
fr: ``messages/delete`` Remplacé par l'action générique entity/delete.

source: ``site_notifications/delete`` Replaced by generic entity/delete action.
fr: ``site_notifications/delete`` Remplacé par l'action générique entity/delete.

source: From 3.1 to 3.2
fr: De 3.1 à 3.2

source: User write access
fr: Accès en écriture d'un utilisateur

source: To fix an issue where user owned access collections like `Friends` or `Friend Collections` would still show in the access drop down when creating content, even if related plugins are disabled, we needed to change some internal logic. If you want to have an access collection subtype available in the write access you now need to register the subtype with a plugin hook. See :ref:`the plugin hook reference for 'access:collections:write:subtypes' <guides/events-list#access-events>` for more details.
fr: Pour résoudre un problème où les collections d'accès appartenant à l'utilisateur telles que `Friends` ou `Friend Collections` s'affichaient toujours dans la liste déroulante d'accès lors de la création de contenu, même si les plugins associés sont désactivés, nous avons dû modifier une certaine logique interne. Si vous souhaitez qu'un sous-type de collection d'accès soit disponible dans l'accès en écriture, vous devez maintenant enregistrer le sous-type avec un hook de plugin. Voir :ref:`la référence du hook du plugin pour 'access:collections:write:subtypes' <guides/events-list#access-events>` pour plus de détails.

source: River items enabled state
fr: État activé des éléments de la rivière

source: The `enabled` state of river items has been deprecated. You should no longer use this property when working with river items.
fr: L’état activé - `enabled` - des éléments de la rivière a été déprécié. Vous ne devez plus utiliser cette propriété lorsque vous travaillez avec des éléments de la rivière.

source: From 3.2 to 3.3
fr: De 3.2 à 3.3
