Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: To change the ``banned`` state use the functions ``ban()`` and ``unban()``
fr: Pour changer l'état de bannissement ``banned``, utilisez les fonctions ``ban()`` et ``unban()``

source: Plugin development
fr: Développement de plugin

source: Plugin bootstrapping
fr: Initialisation du plugin

source: The following files are no longer included during bootstrapping of a plugin:
fr: Les fichiers suivants ne sont plus inclus lors de l'amorçage d'un plugin :

source: ``activate.php`` use ``PluginBootstrap->activate()``
fr: ``activate.php`` utilisez ``PluginBootstrap->activate()``

source: ``deactivate.php`` use ``PluginBootstrap->deactivate()``
fr: ``deactivate.php`` utilisez ``PluginBootstrap->deactivate()``

source: ``views.php`` use ``elgg-plugin.php``
fr: ``views.php`` utilisez ``elgg-plugin.php``

source: ``start.php`` use ``elgg-plugin.php`` and/or ``PluginBootstrap``
fr: ``start.php`` utilisez ``elgg-plugin.php`` et/ou ``PluginBootstrap``

source: Plugin Manifest
fr: Manifeste du plugin

source: The plugin manifest file is no longer used. Features of the manifest have been removed or moved to different locations.
fr: Le fichier manifeste du plugin n'est plus utilisé. Des éléments du manifeste ont été supprimés ou déplacés vers différents emplacements.

source: It is no longer possible to require a specific php ini setting.
fr: Il n'est plus possible d'exiger un paramètre php ini spécifique.

source: php version requirement -> composer require
fr: pré-requis de version de php -> composer require

source: php extension requirement -> composer require
fr: pré-requis d'extension php -> composer require

source: plugin conflicts -> composer conflicts
fr: conflits du plugin -> conflits composer

source: plugin requirement -> elgg-plugin
fr: pré-requis du plugin -> elgg-plugin

source: plugin position requirement -> elgg-plugin
fr: pré-requis de position du plugin -> elgg-plugin

source: plugin version -> elgg-plugin
fr: version du plugin -> elgg-plugin

source: plugin activate on install -> elgg-plugin
fr: activation du plugin lors de l'installation -> elgg-plugin

source: plugin name -> elgg-plugin
fr: nom du plugin -> elgg-plugin

source: plugin description -> composer.json
fr: description du plugin -> composer.json

source: plugin categories -> composer.json
fr: catégories du plugin -> composer.json

source: plugin license -> composer.json
fr: licence du plugin -> composer.json

source: plugin repo link -> composer.json
fr: lien vers le repo du plugin -> composer.json

source: plugin issues link -> composer.json
fr: lien de publication du plugin -> composer.json

source: plugin homepage link -> composer.json
fr: lien vers la page d'accueil du plugin -> composer.json

source: plugin authors/contributors -> composer.json
fr: auteurs/contributeurs du plugin -> composer.json

source: Hookable field configurations
fr: Champs de configuration hookables

source: Some plugins had the option to configure entity fields in config. These features have been replaced by a central service that provides a mechanisme to request a hookable field config for a certain type/subtype.
fr: Certains plugins avaient la possibilité de configurer les champs des entités dans leur configuration. Ces fonctionnalités ont été remplacées par un service central qui fournit un mécanisme pour demander une configuration de champ hookable pour un certain type/sous-type.

source: You can request these configuration using the following code:
fr: Vous pouvez demander ces configurations à l'aide du code suivant :

source: The results will be an array with field configurations usable in ``elgg_view_field($field)``
fr: Les résultats seront un tableau avec des configurations de champs utilisables dans ``elgg_view_field($field)``

source: The following related functionality has been replaced by this new way:
fr: La fonctionnalité associée suivante a été remplacée par cette nouvelle méthode :

source: The config for ``pages`` is no longer available in ``elgg_get_config('pages')`` use ``elgg()->fields->get('object', 'page')``
fr: La configuration pour ``pages`` n'est plus disponible dans ``elgg_get_config('pages')`` utilisez ``elgg()->fields->get('object', 'page')``

source: The config for ``group`` is no longer available in ``elgg_get_config('group')`` use ``elgg()->fields->get('group', 'group')``
fr: La configuration pour ``group`` n'est plus disponible dans ``elgg_get_config('group')`` utilisez ``elgg()->fields->get('group', 'group')``

source: The config for ``profile_fields`` is no longer available in ``elgg_get_config('profile_fields')`` use ``elgg()->fields->get('user', 'user')``
fr: La configuration de ``profile_fields`` n'est plus disponible dans ``elgg_get_config('profile_fields')`` utilisez ``elgg()->fields->get('user', 'user')``

source: Setting the config for ``pages``, ``group`` and ``user:profile`` via ``elgg_set_config`` is no longer possible. Use a hook callback for ``fields, <entity_type>:<entity_subtype>``.
fr: La configuration de ``pages``, ``group`` et ``user:profile`` via ``elgg_set_config`` n'est plus possible. Utilisez une fonction de rappel sur le hook ``fields, <entity_type>:<entity_subtype>``.

source: The hook ``profile:fields, group`` has been replaced by the new hook ``fields, group:group``
fr: Le hook ``profile:fields, group`` a été remplacé par le nouveau hook ``fields, group:group``

source: The hook ``profile:fields, user`` has been replaced by the new hook ``fields, user:user``
fr: Le hook ``profile:fields, user`` a été remplacé par le nouveau hook ``fields, user:user``

source: Instead of registering the ``_elgg_setup_vertical_menu`` and ``_elgg_menu_transform_to_dropdown`` for menus, this is replaced by using the menu vars ``prepare_vertical`` and ``prepare_dropdown``. Setting them to ``true`` will give you the same effect. This allows for individual control in views when this is required.
fr: Au lieu d'enregistrer ``_elgg_setup_vertical_menu`` et ``_elgg_menu_transform_to_dropdown`` pour les menus, ceci est remplacé par l'utilisation des variables de menu ``prepare_vertical`` et ``prepare_dropdown``. Les régler sur ``true`` vous donnera le même effet. Cela permet un contrôle individuel dans les vues lorsque cela est nécessaire.

source: The automatic marking as 'selected' of parent menu items of the selected menu item will now always happen for every menu.
fr: Le marquage automatique comme sélectionné 'selected' des éléments de menu parent de l'élément de menu sélectionné se produira désormais toujours pour chaque menu.

source: Filter tabs
fr: Onglets de filtre

source: The preparation of tabs for the filter menu by using the ``elgg_get_filter_tabs()`` function and the ``'filter_tabs', '<context>'`` hook has been removed. You can now use the ``'register', 'menu:filter:filter'`` hook to add/remove items from the same place.
fr: La préparation des onglets pour le menu de filtrage en utilisant la fonction ``elgg_get_filter_tabs()`` et le hook ``'filter_tabs', '<context>'`` a été supprimée. Vous pouvez maintenant utiliser le hook ``'register', 'menu:filter:filter'`` pour ajouter/supprimer des éléments depuis le même endroit.

source: The ``all``, ``mine`` and ``friends`` tabs will automaticly generate if routes are available for pages similar to the current route. For example if the current route is ``collection:object:blog:all`` the tabs will be generated for the route ``collection:object:blog:owner`` and ``collection:object:blog:friends``.
fr: Les onglets ``all``, ``mine`` et ``friends`` seront générés automatiquement si des routes sont disponibles pour des pages similaires à la route actuelle. Par exemple si la route actuelle est ``collection:object:blog:all`` les onglets seront générés pour la route ``collection:object:blog:owner`` et ``collection:object:blog:friends``.

source: Title menu
fr: Menu du titre

source: The ``title`` menu will now be populated with the ``entity`` menu if the ``entity`` is provided to the layout. This is mostly useful on the detail page of an entity (eg. ``blog/view``). Most of the entries for the ``entity`` menu will be added to a dropdown menu, except the ``edit`` menu item (when available) this item will be presented next to the dropdown menu.
fr: Le menu ``title`` sera désormais rempli avec le menu ``entity`` si l'entité ``entity`` est fournie à la mise en page. C'est surtout utile sur la page d'informations d'une entité (par exemple ``blog/view``). La plupart des entrées du menu ``entity`` seront ajoutées à un menu déroulant - à l'exception de l'élément de menu ``edit`` (si disponible) : cet élément sera présenté à côté du menu déroulant.

source: Registering tag metadatanames
fr: Enregistrement des noms de métadonnées de balise

source: Because of various limitations of this implementation it has been removed from the system. The following related API functions have been removed:
fr: En raison de diverses limitations de cette implémentation, elle a été supprimée du système. Les fonctions d'API associées suivantes ont été supprimées :

source: If you need specific fields to be searchable you need to register them with the related ``search:fields`` hooks. The related ``tagnames:xxx`` tag language keys are no longer registered in the system.
fr: Si vous avez besoin que des champs spécifiques puissent être recherchés, vous devez les enregistrer avec les crochets ``search:fields`` associés. Les clés de langue des balises ``tagnames:xxx`` associées ne sont plus enregistrées dans le système.

source: The function ``ElggEntity::getTags()`` will now return only tag metadata with the name ``tags`` by default. If you want to check extra fields containing tags, you need to request this specifically.
fr: La fonction ``ElggEntity::getTags()`` renverra désormais uniquement les métadonnées de balise avec le nom ``tags`` par défaut. Si vous souhaitez vérifier des champs supplémentaires contenant des balises, vous devez le demander spécifiquement.

source: Default widgets
fr: Widgets par défaut

source: The magic handling the creation of default widgets has been reduced. You now need to register the ``Elgg\Widgets\CreateDefaultWidgetsHandler`` callback to the event when you want default widgets to be created. The configuration ``default_widget_info`` is no longer present in the system. Use the ``get_list``, ``default_widgets`` hook to get the value.
fr: La gestion magique de la création de widgets par défaut a été réduite. Vous devez maintenant enregistrer le rappel ``Elgg\Widgets\CreateDefaultWidgetsHandler`` dans l'événement lorsque vous souhaitez que les widgets par défaut soient créés. La configuration ``default_widget_info`` n'est plus présente dans le système. Utilisez le hook ``get_list``, ``default_widgets`` pour obtenir la valeur.

source: You also need to update the data in your ``get_list``, ``default_widgets`` hook handler to return ``event_name`` (previously ``event``) and ``event_type``.
fr: Vous devez également mettre à jour les données de votre gestionnaire de hook ``get_list``, ``default_widgets`` pour renvoyer ``event_name`` (anciennement ``event``) et ``event_type``.

source: Container permissions
fr: Permissions du conteneur

source: The function parameters for ``ElggEntity::canWriteToContainer()`` now require a ``$type`` and ``$subtype`` to be passed. This is to give more information to the resulting hook in order to be able to determine if a user is allowed write access to the container.
fr: Les paramètres de fonction pour ``ElggEntity::canWriteToContainer()`` nécessitent maintenant un ``$type`` et un ``$subtype`` à transmettre. Il s'agit de donner plus d'informations au hook résultant afin de pouvoir déterminer si un utilisateur est autorisé à accéder en écriture au conteneur.

source: Activity plugin
fr: Plugin Activity

source: This plugin received a much needed rewrite. The different pages (all/owner/friends) now have their own resource and listing views.
fr: Ce plugin a reçu une réécriture bien nécessaire. Les différentes pages (all/owner/friends) ont maintenant leurs propres vues de ressources et de listes.

source: Diagnostics Plugin
fr: Plugin Diagnostics

source: This plugin has been removed, but the action to generate a report is still available. You can find it on the ``Information/Server`` admin page.
fr: Ce plugin a été supprimé, mais l'action pour générer un rapport est toujours disponible. Vous pouvez le trouver sur la page d'administration ``Information/Server``.

source: Discussions Plugin
fr: Plugin Discussions

source: This plugin no longer adds a tab to the filter menu on the groups pages
fr: Ce plugin n'ajoute plus d'onglet au menu des filtres sur les pages des groupes

source: The ``discussions`` site menu item is now always present
fr: L'élément de menu du site ``discussions`` est maintenant toujours présent

source: Search Plugin
fr: Plugin Search

source: The output of search results no longer uses the helper class ``Elgg\Search\Formatter`` for the preparation of the result contents. This logic has been moved entirely into views.
fr: La sortie des résultats de la recherche n'utilise plus la classe d'assistance ``Elgg\Search\Formatter`` pour la préparation du contenu du résultat. Cette logique a été entièrement déplacée dans les vues.

source: The related functions ``prepareEntity`` and ``getSearchView`` in the ``Elgg\Search\Service`` class have been removed.
fr: Les fonctions associées ``prepareEntity`` et ``getSearchView`` dans la classe ``Elgg\Search\Service`` ont été supprimées.

source: The hook ``search:format, entity`` has been removed.
fr: Le hook ``search:format, entity`` a été retiré.

source: Web services Plugin
fr: Plugin Web services

source: The Web Services plugin received a complete rewrite, this is mostly related to the internals of the plugin.
fr: Le plugin Web Services a reçu une réécriture complète, ceci est principalement lié au fonctionnement interne du plugin.

source: Removed classes
fr: Classes retirées

source: ``ElggHMACCache`` has been replaced by ``_elgg_services()->hmacCacheTable`` (for internal use only)
fr: ``ElggHMACCache`` a été remplacé par ``_elgg_services()->hmacCacheTable`` (pour un usage interne uniquement)

source: ``Elgg\Notifications\Event`` has been replaced by ``Elgg\Notifications\SubscriptionNotificationEvent``
fr: ``Elgg\Notifications\Event`` a été remplacé par ``Elgg\Notifications\SubscriptionNotificationEvent``

source: Removed functions
fr: Fonctions supprimées

source: ``create_api_user()`` has been replaced by ``_elgg_services()->apiUsersTable->createApiUser()``
fr: ``create_api_user()`` a été remplacé par ``_elgg_services()->apiUsersTable->createApiUser()``

source: ``create_user_token()`` has been replaced by ``_elgg_services()->usersApiSessions->createToken()``
fr: ``create_user_token()`` a été remplacé par ``_elgg_services()->usersApiSessions->createToken()``

source: ``get_api_user()`` has been replaced by ``_elgg_services()->apiUsersTable->getApiUser()``
fr: ``get_api_user()`` a été remplacé par ``_elgg_services()->apiUsersTable->getApiUser()``

source: ``get_standard_api_key_array()`` use ``\Elgg\WebServices\ElggApiClient::setApiKeys()``
fr: ``get_standard_api_key_array()`` utilisez ``\Elgg\WebServices\ElggApiClient::setApiKeys()``

source: ``get_user_tokens()`` has been replaced by ``_elgg_services()->usersApiSessions->getUserTokens()``
fr: ``get_user_tokens()`` a été remplacé par ``_elgg_services()->usersApiSessions->getUserTokens()``

source: ``remove_api_user()`` has been replaced by ``_elgg_services()->apiUsersTable->removeApiUser()``
fr: ``remove_api_user()`` a été remplacé par ``_elgg_services()->apiUsersTable->removeApiUser()``

source: ``remove_expired_user_tokens()`` has been replaced by ``_elgg_services()->usersApiSessions->removeExpiresTokens()``
fr: ``remove_expired_user_tokens()`` a été remplacé par ``_elgg_services()->usersApiSessions->removeExpiresTokens()``

source: ``remove_user_token()`` has been replaced by ``_elgg_services()->usersApiSessions->removeToken()``
fr: ``remove_user_token()`` a été remplacé par ``_elgg_services()->usersApiSessions->removeToken()``

source: ``send_api_call()`` use ``\Elgg\WebServices\ElggApiClient``
fr: ``send_api_call()`` utilisez ``\Elgg\WebServices\ElggApiClient``

source: ``send_api_get_call()`` use ``\Elgg\WebServices\ElggApiClient``
fr: ``send_api_get_call()`` utilisez ``\Elgg\WebServices\ElggApiClient``

source: ``send_api_post_call()`` use ``\Elgg\WebServices\ElggApiClient``
fr: ``send_api_post_call()`` utilisez ``\Elgg\WebServices\ElggApiClient``

source: ``validate_user_token()`` has been replaced by ``_elgg_services()->usersApiSessions->validateToken()``
fr: ``validate_user_token()`` a été remplacé par ``_elgg_services()->usersApiSessions->validateToken()``

source: ``ws_rest_handler()`` has been replaced by ``\Elgg\WebServices\RestServiceController``
fr: ``ws_rest_handler()`` a été remplacé par ``\Elgg\WebServices\RestServiceController``

source: The config value for ``servicehandler`` has been removed
fr: La valeur de configuration pour ``servicehandler`` a été supprimée

source: In certain edge cases the default value of an API parameter will not be applied
fr: Dans certains cas extrêmes, la valeur par défaut d'un paramètre API ne sera pas appliquée

source: Type hinted functions
fr: Fonctions typées

source: The following functions now have their arguments type-hinted, this can cause ``TypeError`` errors. Also some class functions have their return value type hinted and you should update your function definition.
fr: Les fonctions suivantes ont maintenant leurs arguments typés, cela peut provoquer des erreurs ``TypeError``. De plus, certaines fonctions de classe ont une valeur de retour typée, et vous devriez mettre à jour votre définition de fonction.

source: Class function parameters
fr: Paramètres de la fonction de classe

source: ``ElggEntity::setLatLong()`` now requires a ``float`` for ``$lat`` and ``$long``
fr: ``ElggEntity::setLatLong()`` requiert maintenant un nombre à virgule flottante ``float`` pour ``$lat`` et ``$long``

source: ``ElggUser::setNotificationSetting()`` now requires a ``string`` for ``$method`` and a ``bool`` for ``$enabled``
fr: ``ElggUser::setNotificationSetting()`` requiert maintenant une chaîne de caractères ``string`` pour ``$method`` et un booléen ``bool`` pour ``$enabled``

source: ``Elgg\Database\Seeds\Seed::__construct()`` now requires an ``int`` for ``$limit``
fr: ``Elgg\Database\Seeds\Seed::__construct()`` requiert maintenant un entier ``int`` pour ``$limit``

source: ``Elgg\Http\ErrorResponse::__construct()`` now requires an ``int`` for ``$status_code``
fr: ``Elgg\Http\ErrorResponse::__construct()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``Elgg\Http\OkResponse::__construct()`` now requires an ``int`` for ``$status_code``
fr: ``Elgg\Http\OkResponse::__construct()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``Elgg\Http\RedirectResponse::__construct()`` now requires an ``int`` for ``$status_code``
fr: ``Elgg\Http\RedirectResponse::__construct()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``Elgg\I18n\Translator::getInstalledTranslations()`` now requires a ``bool`` for ``$calculate_completeness``
fr: ``Elgg\I18n\Translator::getInstalledTranslations()`` requiert maintenant un booléen ``bool`` pour ``$calculate_completeness``

source: ``SiteNotification::setActor()`` now requires an ``ElggEntity`` for ``$entity``
fr: ``SiteNotification::setActor()`` requiert maintenant une chaîne ``ElggEntity`` pour ``$entity``

source: ``SiteNotification::setURL()`` now requires a ``string`` for ``$url``
fr: ``SiteNotification::setURL()`` requiert maintenant une chaîne de caractères ``string`` pour ``$url``

source: ``SiteNotification::setRead()`` now requires a ``bool`` for ``$read``
fr: ``SiteNotification::setRead()`` requiert maintenant un booléen ``bool`` pour ``$read``

source: Class function return type
fr: Type de retour d'une fonction de classe

source: ``Elgg\Upgrade\Batch::getVersion()`` now requires an ``int`` return value
fr: ``Elgg\Upgrade\Batch::getVersion()`` requiert maintenant une valeur de retour entière ``int``

source: ``Elgg\Upgrade\Batch::shouldBeSkipped()`` now requires an ``bool`` return value
fr: ``Elgg\Upgrade\Batch::shouldBeSkipped()`` requiert maintenant une valeur de retour booléenne ``bool``

source: ``Elgg\Upgrade\Batch::needsIncrementOffset()`` now requires an ``bool`` return value
fr: ``Elgg\Upgrade\Batch::needsIncrementOffset()`` requiert maintenant une valeur de retour booléenne ``bool``

source: ``Elgg\Upgrade\Batch::countItems()`` now requires an ``int`` return value
fr: ``Elgg\Upgrade\Batch::countItems()`` requiert maintenant un entier ``int`` comme valeur de retour

source: ``Elgg\Upgrade\Batch::run()`` now requires an ``Elgg\Upgrade\Result`` return value
fr: ``Elgg\Upgrade\Batch::run()`` requiert maintenant une valeur de retour ``Elgg\Upgrade\Result``

source: Lib function parameters
fr: Paramètres de la fonction de bibliothèque

source: ``add_user_to_access_collection()`` now requires an ``int`` for ``$user_guid`` and ``$collection_id``
fr: ``add_user_to_access_collection()`` requiert maintenant un entier ``int`` pour ``$user_guid`` et ``$collection_id``

source: ``can_edit_access_collection()`` now requires an ``int`` for ``$collection_id`` and ``$user_guid``
fr: ``can_edit_access_collection()`` requiert maintenant un entier ``int`` pour ``$collection_id`` et ``$user_guid``

source: ``create_access_collection()`` now requires an ``string`` for ``$name`` and ``int`` for ``$owner_guid``
fr: ``create_access_collection()`` requiert maintenant une chaîne de caractères ``string`` pour ``$name`` et un entier ``int`` pour ``$owner_guid``

source: ``delete_access_collection()`` now requires an ``int`` for ``$collection_id``
fr: ``delete_access_collection()`` requiert maintenant un entier ``int`` pour ``$collection_id``

source: ``elgg_action_exists()`` now requires a ``string`` for ``$action``
fr: ``elgg_action_exists()`` exige maintenant une chaîne de caractères ``string`` pour ``$action``

source: ``elgg_add_admin_notice()`` now requires a ``string`` for ``$id`` and ``$message``
fr: ``elgg_add_admin_notice()`` requiert maintenant une chaîne de caractères ``string`` pour ``$id`` et ``$message``

source: ``elgg_admin_notice_exists()`` now requires a ``string`` for ``$id``
fr: ``elgg_admin_notice_exists()`` requiert maintenant une chaîne de caractères ``string`` pour ``$id``

source: ``elgg_annotation_exists()`` now requires a ``int`` for ``$entity_guid``, a ``string`` for ``$name`` and ``int`` for ``$owner_guid``
fr: ``elgg_annotation_exists()`` requiert maintenant un entier ``int`` pour ``$entity_guid``, une chaîne de caractères ``string`` pour ``$name`` et un entier ``int`` pour ``$owner_guid``

source: ``elgg_delete_admin_notice()`` now requires a ``string`` for ``$id``
fr: ``elgg_delete_admin_notice()`` requiert maintenant une chaîne de caractères ``string`` pour ``$id``

source: ``elgg_delete_annotation_by_id()`` now requires a ``int`` for ``$id``
fr: ``elgg_delete_annotation_by_id()`` requiert maintenant un entier ``int`` pour ``$id``

source: ``elgg_deprecated_notice()`` now requires a ``string`` for ``$msg`` and ``$dep_version``
fr: ``elgg_deprecated_notice()`` requiert maintenant une chaîne de caractères ``string`` pour ``$msg`` et ``$dep_version``

source: ``elgg_error_response()`` now requires an ``int`` for ``$status_code``
fr: ``elgg_error_response()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``elgg_get_access_collections()`` now requires an ``array`` for ``$options``
fr: ``elgg_get_access_collections()`` requiert maintenant un tableau ``array`` pour ``$options``
