Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Bugfix releases are made regularly to make sure Elgg stays stable, secure, and bug-free. The higher the third digit, the more tested and stable the release is. Since bugfix release focus on fixing bugs and not making major changes, themes and plugins should work from bugfix release to bugfix release.
es: Las versiones de corrección de errores se hacen de manera regular para asegurarnos de que Elgg permanezca estable, seguro, y libre de errores. Cuando mayor sea el tercero de los números, mejor se habrá probado y más estable será la versión. Dado que estas versiones se centran en solucionar errores y no en hacer cambios importantes, los temas y los complementos deberían funcionar de una de estas versiones a la siguiente.

source: Feature Releases (1.x.0)
es: Versiones de nuevas funcionalidades (1.x.0)

source: Every few months.
es: Cada pocos meses.

source: New features are introduced in Elgg every few months in minor new feature releases. These versions are identified by the second digit (1.**8**.0). These releases aren't as mature as bugfix release, but are considered stable and useable. Though these releases try to be backward compatible, features are added, unused code removed, and overall improvements are made, so plugins and themes might need to be updated to make use of the new and improved features.
es: Cada pocos meses se introducen en Elgg nuevas funcionalidades en las llamadas «versiones de nuevas funcionalidades». Estas versiones se identifican por el segundo de los números (1.**8**.0). Estas versiones no son tan maduras como las de corrección de errores, pero se consideran estables y listas para utilizarse. Si bien procuramos que estas versiones sean compatibles con versiones anteriores, se añaden funcionalidades, se elimina código que ya no es necesario, y se hacen mejoras en general, por lo que es posible que algunos complementos y temas haya que actualizarlos para hacer uso de estas nuevas funcionalidades y mejoras.

source: Major Releases (x.0.0)
es: Versiones principales (x.0.0)

source: Every few years.
es: Cada pocos años.

source: Elgg, as all software, inevitably undergoes serious changes and a major new feature release is made. These releases are opportunities for the core team to make dramatic improvements to the underlying platform. Themes and plugins from older versions are not expected to work without modification on different major releases.
es: Elgg, como todo software, recibe inevitablemente cambios a gran escala que hacen necesario publicar una nueva versión con nuevas funcionalidades. Estas versiones le dan la oportunidad al equipo principal de desarrollo de llevar a cabo mejoras drásticas en la infraestructura del proyecto. No se cuenta con que los temas y complementos de versiones anteriores funcionen sin antes adaptarse para estas nuevas versiones principales.

source: Release Candidates/Betas
es: Versiones de prueba

source: Before feature releases and major releases, the core team will typically offer a release candidate or beta. These are meant for testing only and should not be considered production quality. The core team makes these releases available to get some real-world testing and feedback on the release. That said, the API in release candidates is considered stable, so once a release candidate is made available, you should feel comfortable writing plugins against any new APIs.
es: Antes de publicar versiones principales o versiones con nuevas funcionalidades, el equipo principal de desarrollo suele ofrecer una versión candidata (a versión final) o una beta. Estas versiones son sólo para pruebas, e no están pensadas para usarse en entornos de producción. El equipo de desarrollo publica estas versiones para que la gente las pruebe en entornos reales y le proporcione al equipo información que ayude a preparar la versión final. Dicho esto, la API de las candidatas a versión final se considera estable, así que en cuanto se publica esta versión ya se puede empezar a escribir complementos para las nuevas API o adaptar complementos existentes.

source: FAQ
es: Preguntas frecuentes

source: The best way to ensure a feature gets implemented is to discuss it with the core team and implement it yourself. See our :doc:`/about/contributing` guide if you're interested. We love new contributors!
es: La mejor forma de asegurarse de que una funcionalidad se introduce en Elgg es discutirla con el equipo principal de desarrollo y desarrollarla usted mismo. Si le interesa, échele una ojeada a nuestra guía «:doc:`/about/contributing`». ¡Todos los nuevos colaboradores son bienvenidos!
