Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``_elgg_user_settings_menu_register()`` changed to ``Elgg\Menus\Page::registerUserSettings()`` and ``Elgg\Menus\Page::registerUserSettingsPlugins()``
fr: ``_elgg_user_settings_menu_register()`` changé pour ``Elgg\Menus\Page::registerUserSettings()`` et ``Elgg\Menus\Page::registerUserSettingsPlugins()``

source: ``_elgg_user_settings_menu_prepare()`` changed to ``Elgg\Menus\Page::cleanupUserSettingsPlugins()``
fr: ``_elgg_user_settings_menu_prepare()`` changé pour ``Elgg\Menus\Page::cleanupUserSettingsPlugins()``

source: ``elgg_user_hover_menu()`` changed to ``Elgg\Menus\UserHover::registerAvatarEdit()`` and ``Elgg\Menus\UserHover::registerAdminActions()``
fr: ``elgg_user_hover_menu()`` changé pour ``Elgg\Menus\UserHover::registerAvatarEdit()`` et ``Elgg\Menus\UserHover::registerAdminActions()``

source: ``_elgg_user_set_icon_file()`` changed to ``Elgg\Icons\SetUserIconFileHandler::class``
fr: ``_elgg_user_set_icon_file()`` changé pour ``Elgg\Icons\SetUserIconFileHandler::class``

source: ``_elgg_user_title_menu()`` changed to ``Elgg\Menus\Title::registerAvatarEdit()``
fr: ``_elgg_user_title_menu()`` changé pour ``Elgg\Menus\Title::registerAvatarEdit()``

source: ``_elgg_user_page_menu()`` changed to ``Elgg\Menus\Page::registerAvatarEdit()``
fr: ``_elgg_user_page_menu()`` changé pour ``Elgg\Menus\Page::registerAvatarEdit()``

source: ``_elgg_user_topbar_menu()`` changed to ``Elgg\Menus\Topbar::registerUserLinks()``
fr: ``_elgg_user_topbar_menu()`` changé pour ``Elgg\Menus\Topbar::registerUserLinks()``

source: ``_elgg_user_unvalidated_menu()`` changed to ``Elgg\Menus\UserUnvalidated::register()``
fr: ``_elgg_user_unvalidated_menu()`` changé pour ``Elgg\Menus\UserUnvalidated::register()``

source: ``_elgg_views_amd()`` changed to ``Elgg\Views\AddAmdModuleNameHandler::class``
fr: ``_elgg_views_amd()`` changé pour ``Elgg\Views\AddAmdModuleNameHandler::class``

source: ``_elgg_views_file_help_upload_limit()`` changed to ``Elgg\Input\AddFileHelpTextHandler::class``
fr: ``_elgg_views_file_help_upload_limit()`` changé pour ``Elgg\Input\AddFileHelpTextHandler::class``

source: ``_elgg_views_init()`` combined into ``Elgg\Application\SystemEventHandlers::init()``
fr: ``_elgg_views_init()`` a été combiné dans ``Elgg\Application\SystemEventHandlers::init()``

source: ``_elgg_views_minify()`` changed to ``Elgg\Views\MinifyHandler::class``
fr: ``_elgg_views_minify()`` changé pour ``Elgg\Views\MinifyHandler::class``

source: ``_elgg_views_prepare_favicon_links()`` changed to ``Elgg\Page\AddFaviconLinksHandler::class``
fr: ``_elgg_views_prepare_favicon_links()`` changé pour ``Elgg\Page\AddFaviconLinksHandler::class``

source: ``_elgg_views_preprocess_css()`` changed to ``Elgg\Views\PreProcessCssHandler::class``
fr: ``_elgg_views_preprocess_css()`` changé pour ``Elgg\Views\PreProcessCssHandler::class``

source: ``_elgg_views_send_header_x_frame_options()`` changed to ``Elgg\Page\SetXFrameOptionsHeaderHandler::class``
fr: ``_elgg_views_send_header_x_frame_options()`` changé pour ``Elgg\Page\SetXFrameOptionsHeaderHandler::class``

source: ``_elgg_walled_garden_init()`` merged into ``Elgg\Application\SystemEventHandlers::initLate()``
fr: ``_elgg_walled_garden_init()`` fusionné dans ``Elgg\Application\SystemEventHandlers::initLate()``

source: ``_elgg_walled_garden_remove_public_access()`` changed to ``Elgg\WalledGarden\RemovePublicAccessHandler::class``
fr: ``_elgg_walled_garden_remove_public_access()`` changé pour ``Elgg\WalledGarden\RemovePublicAccessHandler::class``

source: ``_elgg_widgets_widget_urls()`` changed to ``Elgg\Widgets\EntityUrlHandler::class``
fr: ``_elgg_widgets_widget_urls()`` changé pour ``Elgg\Widgets\EntityUrlHandler::class``

source: ``elgg_prepare_breadcrumbs()`` changed to ``Elgg\Page\PrepareBreadcrumbsHandler::class``
fr: ``elgg_prepare_breadcrumbs()`` changé pour ``Elgg\Page\PrepareBreadcrumbsHandler::class``

source: ``Elgg\Profiler::handleOutput`` changed to ``Elgg\Debug\Profiler::class``
fr: ``Elgg\Profiler::handleOutput`` changé pour ``Elgg\Debug\Profiler::class``

source: ``users_init`` combined into ``Elgg\Application\SystemEventHandlers::initLate()``
fr: ``users_init`` combiné dans ``Elgg\Application\SystemEventHandlers::initLate()``

source: ``_developers_entity_menu`` changed to ``Elgg\Developers\Menus\Entity::registerEntityExplorer``
fr: ``_developers_entity_menu`` changé pour ``Elgg\Developers\Menus\Entity::registerEntityExplorer``

source: ``_developers_page_menu`` changed to ``Elgg\Developers\Menus\Page::register``
fr: ``_developers_page_menu`` changé pour ``Elgg\Developers\Menus\Page::register``

source: ``_elgg_activity_owner_block_menu`` changed to ``Elgg\Activity\Menus\OwnerBlock::registerUserItem`` and ``Elgg\Activity\Menus\OwnerBlock::registerGroupItem``
fr: ``_elgg_activity_owner_block_menu`` changé pour ``Elgg\Activity\Menus\OwnerBlock::registerUserItem`` et ``Elgg\Activity\Menus\OwnerBlock::registerGroupItem``

source: ``blog_archive_menu_setup`` changed to ``Elgg\Blog\Menus\BlogArchive::register``
fr: ``blog_archive_menu_setup`` changé pour ``Elgg\Blog\Menus\BlogArchive::register``

source: ``blog_owner_block_menu`` changed to ``Elgg\Blog\Menus\OwnerBlock::registerUserItem`` and ``Elgg\Blog\Menus\OwnerBlock::registerGroupItem``
fr: ``blog_owner_block_menu`` changé pour ``Elgg\Blog\Menus\OwnerBlock::registerUserItem`` et ``Elgg\Blog\Menus\OwnerBlock::registerGroupItem``

source: ``blog_prepare_notification`` changed to ``Elgg\Blog\Notifications\PublishBlogEventHandler``
fr: ``blog_prepare_notification`` changé pour ``Elgg\Blog\Notifications\PublishBlogEventHandler``

source: ``blog_register_db_seeds`` changed to ``Elgg\Blog\Database::registerSeeds``
fr: ``blog_register_db_seeds`` changé pour ``Elgg\Blog\Database::registerSeeds``

source: ``bookmarks_footer_menu`` changed to ``Elgg\Bookmarks\Menus\Footer::register``
fr: ``bookmarks_footer_menu`` changé pour ``Elgg\Bookmarks\Menus\Footer::register``

source: ``bookmarks_owner_block_menu`` changed to ``Elgg\Bookmarks\Menus\OwnerBlock::registerUserItem`` and ``Elgg\Bookmarks\Menus\OwnerBlock::registerGroupItem``
fr: ``bookmarks_owner_block_menu`` changé pour ``Elgg\Bookmarks\Menus\OwnerBlock::registerUserItem`` et ``Elgg\Bookmarks\Menus\OwnerBlock::registerGroupItem``

source: ``bookmarks_page_menu`` changed to ``Elgg\Bookmarks\Menus\Page::register``
fr: ``bookmarks_page_menu`` changé pour ``Elgg\Bookmarks\Menus\Page::register``

source: ``bookmarks_prepare_notification`` changed to ``Elgg\Bookmarks\Notifications\CreateBookmarksEventHandler``
fr: ``bookmarks_prepare_notification`` changé pour ``Elgg\Bookmarks\Notifications\CreateBookmarksEventHandler``

source: ``bookmarks_register_db_seeds`` changed to ``Elgg\Bookmarks\Database::registerSeeds``
fr: ``bookmarks_register_db_seeds`` changé pour ``Elgg\Bookmarks\Database::registerSeeds``

source: ``ckeditor_longtext_id`` changed to ``Elgg\CKEditor\Views::setInputLongTextIDViewVar``
fr: ``ckeditor_longtext_id`` changé pour ``Elgg\CKEditor\Views::setInputLongTextIDViewVar``

source: ``ckeditor_longtext_menu`` changed to ``Elgg\CKEditor\Menus\LongText::registerToggler``
fr: ``ckeditor_longtext_menu`` changé pour ``Elgg\CKEditor\Menus\LongText::registerToggler``

source: ``dashboard_default_widgets`` changed to ``Elgg\Dashboard\Widgets::extendDefaultWidgetsList``
fr: ``dashboard_default_widgets`` changé pour ``Elgg\Dashboard\Widgets::extendDefaultWidgetsList``

source: ``developers_log_events`` changed to ``Elgg\Developers\HandlerLogger::trackEvent`` and ``Elgg\Developers\HandlerLogger::trackHook``
fr: ``developers_log_events`` changé pour ``Elgg\Developers\HandlerLogger::trackEvent`` et ``Elgg\Developers\HandlerLogger::trackHook``

source: ``diagnostics_basic_hook`` changed to ``Elgg\Diagnostics\Reports::getBasic``
fr: ``diagnostics_basic_hook`` changé pour ``Elgg\Diagnostics\Reports::getBasic``

source: ``diagnostics_globals_hook`` changed to ``Elgg\Diagnostics\Reports::getGlobals``
fr: ``diagnostics_globals_hook`` changé pour ``Elgg\Diagnostics\Reports::getGlobals``

source: ``diagnostics_phpinfo_hook`` changed to ``Elgg\Diagnostics\Reports::getPHPInfo``
fr: ``diagnostics_phpinfo_hook`` changé pour ``Elgg\Diagnostics\Reports::getPHPInfo``

source: ``diagnostics_sigs_hook`` changed to ``Elgg\Diagnostics\Reports::getSigs``
fr: ``diagnostics_sigs_hook`` changé pour ``Elgg\Diagnostics\Reports::getSigs``

source: ``discussion_comment_permissions`` changed to ``Elgg\Discussions\Permissions::preventCommentOnClosedDiscussion``
fr: ``discussion_comment_permissions`` changé pour ``Elgg\Discussions\Permissions::preventCommentOnClosedDiscussion``

source: ``discussion_get_subscriptions`` changed to ``Elgg\Discussions\Notifications::addGroupSubscribersToCommentOnDiscussionSubscriptions``
fr: ``discussion_get_subscriptions`` changé pour ``Elgg\Discussions\Notifications::addGroupSubscribersToCommentOnDiscussionSubscriptions``

source: ``discussion_owner_block_menu`` changed to ``Elgg\Discussions\Menus\OwnerBlock::registerGroupItem``
fr: ``discussion_owner_block_menu`` changé pour ``Elgg\Discussions\Menus\OwnerBlock::registerGroupItem``

source: ``discussion_prepare_comment_notification`` changed to ``Elgg\Discussions\Notifications::prepareCommentOnDiscussionNotification``
fr: ``discussion_prepare_comment_notification`` changé pour ``Elgg\Discussions\Notifications::prepareCommentOnDiscussionNotification``

source: ``discussion_prepare_notification`` changed to ``Elgg\Discussions\Notifications\CreateDiscussionEventHandler``
fr: ``discussion_prepare_notification`` changé pour ``Elgg\Discussions\Notifications\CreateDiscussionEventHandler``

source: ``discussion_register_db_seeds`` changed to ``Elgg\Discussions\Database::registerSeeds``
fr: ``discussion_register_db_seeds`` changé pour ``Elgg\Discussions\Database::registerSeeds``

source: ``Elgg\DevelopersPlugins\*`` changed to ``Elgg\Developers\*``
fr: ``Elgg\DevelopersPlugins\*`` changé pour ``Elgg\Developers\*``

source: ``Elgg\Discussions\Menus::registerSiteMenuItem`` changed to ``Elgg\Discussions\Menus\Site::register``
fr: ``Elgg\Discussions\Menus::registerSiteMenuItem`` changé pour ``Elgg\Discussions\Menus\Site::register``

source: ``Elgg\Discussions\Menus::filterTabs`` changed to ``Elgg\Discussions\Menus\Filter::filterTabsForDiscussions``
fr: ``Elgg\Discussions\Menus::filterTabs`` changé pour ``Elgg\Discussions\Menus\Filter::filterTabsForDiscussions``

source: ``embed_longtext_menu`` changed to ``Elgg\Embed\Menus\LongText::register``
fr: ``embed_longtext_menu`` changé pour ``Elgg\Embed\Menus\LongText::register``

source: ``embed_select_tab`` changed to ``Elgg\Embed\Menus\Embed::selectCorrectTab``
fr: ``embed_select_tab`` changé pour ``Elgg\Embed\Menus\Embed::selectCorrectTab``

source: ``embed_set_thumbnail_url`` changed to ``Elgg\Embed\Icons::setThumbnailUrl``
fr: ``embed_set_thumbnail_url`` changé pour ``Elgg\Embed\Icons::setThumbnailUrl``

source: ``expages_menu_register_hook`` changed to ``Elgg\ExternalPages\Menus\ExPages::register``
fr: ``expages_menu_register_hook`` changé pour ``Elgg\ExternalPages\Menus\ExPages::register``

source: ``file_handle_object_delete`` changed to ``Elgg\File\Icons::deleteIconOnElggFileDelete``
fr: ``file_handle_object_delete`` changé pour ``Elgg\File\Icons::deleteIconOnElggFileDelete``

source: ``file_prepare_notification`` changed to ``Elgg\File\Notifications\CreateFileEventHandler``
fr: ``file_prepare_notification`` changé pour ``Elgg\File\Notifications\CreateFileEventHandler``

source: ``file_register_db_seeds`` changed to ``Elgg\File\Database::registerSeeds``
fr: ``file_register_db_seeds`` changé pour ``Elgg\File\Database::registerSeeds``

source: ``file_set_custom_icon_sizes`` changed to ``Elgg\File\Icons::setIconSizes``
fr: ``file_set_custom_icon_sizes`` changé pour ``Elgg\File\Icons::setIconSizes``

source: ``file_set_icon_file`` changed to ``Elgg\File\Icons::setIconFile``
fr: ``file_set_icon_file`` changé pour ``Elgg\File\Icons::setIconFile``

source: ``file_set_icon_url`` changed to ``Elgg\File\Icons::setIconUrl``
fr: ``file_set_icon_url`` changé pour ``Elgg\File\Icons::setIconUrl``

source: ``file_owner_block_menu`` changed to ``Elgg\File\Menus\OwnerBlock::registerUserItem`` and ``Elgg\File\Menus\OwnerBlock::registerGroupItem``
fr: ``file_owner_block_menu`` changé pour ``Elgg\File\Menus\OwnerBlock::registerUserItem`` et ``Elgg\File\Menus\OwnerBlock::registerGroupItem``

source: ``_elgg_friends_filter_tabs`` changed to ``Elgg\Friends\Menus\Filter::registerFilterTabs``
fr: ``_elgg_friends_filter_tabs`` changé pour ``Elgg\Friends\Menus\Filter::registerFilterTabs``

source: ``_elgg_friends_page_menu`` changed to ``Elgg\Friends\Menus\Page::register``
fr: ``_elgg_friends_page_menu`` changé pour ``Elgg\Friends\Menus\Page::register``

source: ``_elgg_friends_register_access_type`` changed to ``Elgg\Friends\Access::registerAccessCollectionType``
fr: ``_elgg_friends_register_access_type`` changé pour ``Elgg\Friends\Access::registerAccessCollectionType``

source: ``_elgg_friends_setup_title_menu`` changed to ``Elgg\Friends\Menus\Title::register``
fr: ``_elgg_friends_setup_title_menu`` changé pour ``Elgg\Friends\Menus\Title::register``

source: ``_elgg_friends_setup_user_hover_menu`` changed to ``Elgg\Friends\Menus\UserHover::register``
fr: ``_elgg_friends_setup_user_hover_menu`` changé pour ``Elgg\Friends\Menus\UserHover::register``

source: ``_elgg_friends_topbar_menu`` changed to ``Elgg\Friends\Menus\Topbar::register``
fr: ``_elgg_friends_topbar_menu`` changé pour ``Elgg\Friends\Menus\Topbar::register``

source: ``_elgg_friends_widget_urls`` changed to ``Elgg\Friends\Widgets::setWidgetUrl``
fr: ``_elgg_friends_widget_urls`` changé pour ``Elgg\Friends\Widgets::setWidgetUrl``

source: ``_elgg_send_friend_notification`` changed to ``Elgg\Friends\Notifications::sendFriendNotification``
fr: ``_elgg_send_friend_notification`` changé pour ``Elgg\Friends\Notifications::sendFriendNotification``

source: ``Elgg\Friends\FilterMenu::addFriendRequestTabs`` changed to ``Elgg\Friends\Menus\Filter::addFriendRequestTabs``
fr: ``Elgg\Friends\FilterMenu::addFriendRequestTabs`` changé pour ``Elgg\Friends\Menus\Filter::addFriendRequestTabs``

source: ``Elgg\Friends\RelationshipMenu::addPendingFriendRequestItems`` changed to ``Elgg\Friends\Menus\Relationship::addPendingFriendRequestItems``
fr: ``Elgg\Friends\RelationshipMenu::addPendingFriendRequestItems`` changé pour ``Elgg\Friends\Menus\Relationship::addPendingFriendRequestItems``

source: ``Elgg\Friends\Relationships::createFriendRelationship`` changed to ``Elgg\Friends\Relationships::removePendingFriendRequest``
fr: ``Elgg\Friends\Relationships::createFriendRelationship`` changé pour ``Elgg\Friends\Relationships::removePendingFriendRequest``

source: ``_groups_gatekeeper_allow_profile_page`` changed to ``Elgg\Groups\Access::allowProfilePage``
fr: ``_groups_gatekeeper_allow_profile_page`` changé pour ``Elgg\Groups\Access::allowProfilePage``

source: ``_groups_page_menu`` changed to ``Elgg\Groups\Menus\Page::register``
fr: ``_groups_page_menu`` changé pour ``Elgg\Groups\Menus\Page::register``

source: ``_groups_page_menu_group_profile`` changed to ``Elgg\Groups\Menus\Page::registerGroupProfile``
fr: ``_groups_page_menu_group_profile`` changé pour ``Elgg\Groups\Menus\Page::registerGroupProfile``

source: ``_groups_relationship_invited_menu`` changed to ``Elgg\Groups\Menus\Relationship::registerInvitedItems``
fr: ``_groups_relationship_invited_menu`` changé pour ``Elgg\Groups\Menus\Relationship::registerInvitedItems``

source: ``_groups_relationship_member_menu`` changed to ``Elgg\Groups\Menus\Relationship::registerRemoveUser``
fr: ``_groups_relationship_member_menu`` changé pour ``Elgg\Groups\Menus\Relationship::registerRemoveUser``

source: ``_groups_relationship_membership_request_menu`` changed to ``Elgg\Groups\Menus\Relationship::registerMembershipRequestItems``
fr: ``_groups_relationship_membership_request_menu`` changé pour ``Elgg\Groups\Menus\Relationship::registerMembershipRequestItems``

source: ``_groups_title_menu`` changed to ``Elgg\Groups\Menus\Title::register``
fr: ``_groups_title_menu`` changé pour ``Elgg\Groups\Menus\Title::register``

source: ``_groups_topbar_menu_setup`` changed to ``Elgg\Groups\Menus\Topbar::register``
fr: ``_groups_topbar_menu_setup`` changé pour ``Elgg\Groups\Menus\Topbar::register``

source: ``groups_access_default_override`` changed to ``Elgg\Groups\Access::overrideDefaultAccess``
fr: ``groups_access_default_override`` changé pour ``Elgg\Groups\Access::overrideDefaultAccess``

source: ``groups_create_event_listener`` changed to ``Elgg\Groups\Group::createAccessCollection``
fr: ``groups_create_event_listener`` changé pour ``Elgg\Groups\Group::createAccessCollection``

source: ``groups_default_page_owner_handler`` changed to ``Elgg\Groups\PageOwner::detectPageOwner``
fr: ``groups_default_page_owner_handler`` changé pour ``Elgg\Groups\PageOwner::detectPageOwner``

source: ``groups_entity_menu_setup`` changed to ``Elgg\Groups\Menus\Entity::register`` and ``Elgg\Groups\Menus\Entity::registerFeature``
fr: ``groups_entity_menu_setup`` changé pour ``Elgg\Groups\Menus\Entity::register`` et ``Elgg\Groups\Menus\Entity::registerFeature``

source: ``groups_fields_setup`` changed to ``Elgg\Groups\FieldsHandler``
fr: ``groups_fields_setup`` changé pour ``Elgg\Groups\FieldsHandler``

source: ``groups_members_menu_setup`` changed to ``Elgg\Groups\Menus\GroupsMembers::register``
fr: ``groups_members_menu_setup`` changé pour ``Elgg\Groups\Menus\GroupsMembers::register``

source: ``groups_set_access_collection_name`` changed to ``Elgg\Groups\Access::getAccessCollectionName``
fr: ``groups_set_access_collection_name`` changé pour ``Elgg\Groups\Access::getAccessCollectionName``

source: ``groups_set_url`` changed to ``Elgg\Groups\Group::getEntityUrl``
fr: ``groups_set_url`` changé pour ``Elgg\Groups\Group::getEntityUrl``

source: ``groups_setup_filter_tabs`` changed to ``Elgg\Groups\Menus\Filter::registerGroupsAll``
fr: ``groups_setup_filter_tabs`` changé pour ``Elgg\Groups\Menus\Filter::registerGroupsAll``

source: ``groups_update_event_listener`` changed to ``Elgg\Groups\Group::updateGroup``
fr: ``groups_update_event_listener`` changé pour ``Elgg\Groups\Group::updateGroup``

source: ``groups_user_join_event_listener`` changed to ``Elgg\Groups\Group::joinGroup``
fr: ``groups_user_join_event_listener`` changé pour ``Elgg\Groups\Group::joinGroup``

source: ``groups_user_leave_event_listener`` changed to ``Elgg\Groups\Group::leaveGroup``
fr: ``groups_user_leave_event_listener`` changé pour ``Elgg\Groups\Group::leaveGroup``

source: ``groups_write_acl_plugin_hook`` changed to ``Elgg\Groups\Access::getWriteAccess``
fr: ``groups_write_acl_plugin_hook`` changé pour ``Elgg\Groups\Access::getWriteAccess``

source: ``invitefriends_add_friends`` changed to ``Elgg\InviteFriends\Users::addFriendsOnRegister``
fr: ``invitefriends_add_friends`` changé pour ``Elgg\InviteFriends\Users::addFriendsOnRegister``

source: ``invitefriends_register_page_menu`` changed to ``Elgg\InviteFriends\Menus\Page::register``
fr: ``invitefriends_register_page_menu`` changé pour ``Elgg\InviteFriends\Menus\Page::register``

source: ``likes_permissions_check`` changed to ``Elgg\Likes\Permissions::allowLikedEntityOwner``
fr: ``likes_permissions_check`` changé pour ``Elgg\Likes\Permissions::allowLikedEntityOwner``

source: ``likes_permissions_check_annotate`` changed to ``Elgg\Likes\Permissions::allowLikeOnEntity``
fr: ``likes_permissions_check_annotate`` changé pour ``Elgg\Likes\Permissions::allowLikeOnEntity``

source: ``likes_social_menu_setup`` changed to ``Elgg\Likes\Menus\Social::register``
fr: ``likes_social_menu_setup`` changé pour ``Elgg\Likes\Menus\Social::register``

source: ``members_register_filter_menu`` changed to ``Elgg\Members\Menus\Filter::register``
fr: ``members_register_filter_menu`` changé pour ``Elgg\Members\Menus\Filter::register``

source: ``messages_can_edit`` changed to ``Elgg\Messages\Permissions::canEdit``
fr: ``messages_can_edit`` changé pour ``Elgg\Messages\Permissions::canEdit``

source: ``messages_can_edit_container`` changed to ``Elgg\Messages\Permissions::canEditContainer``
fr: ``messages_can_edit_container`` changé pour ``Elgg\Messages\Permissions::canEditContainer``

source: ``messages_purge`` changed to ``Elgg\Messages\User::purgeMessages``
fr: ``messages_purge`` changé pour ``Elgg\Messages\User::purgeMessages``

source: ``messages_register_topbar`` changed to ``Elgg\Messages\Menus\Topbar::register``
fr: ``messages_register_topbar`` changé pour ``Elgg\Messages\Menus\Topbar::register``

source: ``messages_user_hover_menu`` changed to ``Elgg\Messages\Menus\UserHover::register`` and ``Elgg\Messages\Menus\Title::register``
fr: ``messages_user_hover_menu`` changé pour ``Elgg\Messages\Menus\UserHover::register`` et ``Elgg\Messages\Menus\Title::register``

source: ``notifications_update_collection_notify`` changed to ``Elgg\Notifications\Relationships::updateUserNotificationsPreferencesOnACLChange``
fr: ``notifications_update_collection_notify`` changé pour ``Elgg\Notifications\Relationships::updateUserNotificationsPreferencesOnACLChange``

source: ``notifications_update_friend_notify`` changed to ``Elgg\Friends\Relationships::applyFriendNotificationsSettings``
fr: ``notifications_update_friend_notify`` changé pour ``Elgg\Friends\Relationships::applyFriendNotificationsSettings``

source: ``notifications_relationship_remove`` changed to ``Elgg\Friends\Relationships::deleteFriendNotificationSubscription`` and ``Elgg\Groups\Relationships::removeGroupNotificationSubscriptions``
fr: ``notifications_relationship_remove`` changé pour ``Elgg\Friends\Relationships::deleteFriendNotificationSubscription`` et ``Elgg\Groups\Relationships::removeGroupNotificationSubscriptions``

source: ``_notifications_page_menu`` changed to ``Elgg\Notifications\Menus\Page::register``
fr: ``_notifications_page_menu`` changé pour ``Elgg\Notifications\Menus\Page::register``

source: ``_notification_groups_title_menu`` changed to ``Elgg\Notifications\Menus\Title::register``
fr: ``_notification_groups_title_menu`` changé pour ``Elgg\Notifications\Menus\Title::register``

source: ``pages_container_permission_check`` changed to ``Elgg\Pages\Permissions::allowContainerWriteAccess``
fr: ``pages_container_permission_check`` changé pour ``Elgg\Pages\Permissions::allowContainerWriteAccess``

source: ``pages_entity_menu_setup`` changed to ``Elgg\Pages\Menus\Entity::register``
fr: ``pages_entity_menu_setup`` changé pour ``Elgg\Pages\Menus\Entity::register``

source: ``pages_icon_url_override`` changed to ``Elgg\Pages\Icons::getIconUrl``
fr: ``pages_icon_url_override`` changé pour ``Elgg\Pages\Icons::getIconUrl``

source: ``pages_owner_block_menu`` changed to ``Elgg\Pages\Menus\OwnerBlock::registerUserItem`` and ``Elgg\Pages\Menus\OwnerBlock::registerGroupItem``
fr: ``pages_owner_block_menu`` changé pour ``Elgg\Pages\Menus\OwnerBlock::registerUserItem`` et ``Elgg\Pages\Menus\OwnerBlock::registerGroupItem``

source: ``pages_prepare_notification`` changed to ``Elgg\Pages\Notifications\CreatePageEventHandler``
fr: ``pages_prepare_notification`` changé pour ``Elgg\Pages\Notifications\CreatePageEventHandler``

source: ``pages_register_db_seeds`` changed to ``Elgg\Pages\Database::registerSeeds``
fr: ``pages_register_db_seeds`` changé pour ``Elgg\Pages\Database::registerSeeds``

source: ``pages_set_revision_url`` changed to ``Elgg\Pages\Extender::setRevisionUrl``
fr: ``pages_set_revision_url`` changé pour ``Elgg\Pages\Extender::setRevisionUrl``

source: ``pages_write_access_options_hook`` changed to ``Elgg\Pages\Views::removeAccessPublic``
fr: ``pages_write_access_options_hook`` changé pour ``Elgg\Pages\Views::removeAccessPublic``
