Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Objects are no longer likable by default. To support liking, you can register a handler to permit the annotation, or more simply register for the hook ``["likes:is_likable", "<type>:<subtype>"]`` and return true. E.g.
fr: Les objets ne peuvent plus être aimés - "likés" - par défaut. Pour qu'ils puissent être aimés, vous pouvez enregistrer un gestionnaire pour permettre l’annotation, ou plus simplement vous inscrire au hook ``["likes:is_likable", "<type>:<subtype>"]`` et renvoyer true. Par ex.

source: Just as before, the ``permissions_check:annotate`` hook is still called and may be used to override default behavior.
fr: Tout comme auparavant, le hook ``permissions_check:annotated`` est toujours appelé et peut être utilisé pour remplacer le comportement par défaut.

source: If you've removed or replaced the handler function ``messages_notifier`` to hide/alter the inbox icon, you'll instead need to do the same for the topbar menu handler ``messages_register_topbar``. ``messages_notifier`` is no longer used to add the menu link.
fr: Si vous avez supprimé ou remplacé la fonction de gestionnaire ``messages_notifier`` pour masquer/modifier l’icône de la boîte de réception, vous devrez au lieu de cela faire de même pour le gestionnaire de menu de la barre supérieure - topbar - ``messages_register_topbar``. ``messages_notifier`` n’est plus utilisé pour ajouter le lien de menu.

source: Messages will no longer get the metadata 'msg' for newly created messages. This means you can not rely on that metadata to exist.
fr: Les messages ne recevront plus les métadonnées 'msg' pour les messages nouvellement créés. Cela signifie que vous ne pouvez plus compter sur l'existence de ces métadonnées.

source: The blog pages showing 'Mine' or 'Friends' listings of blogs have been changed to list all the blogs owned by the users (including those created in groups).
fr: Les pages de blog qui affichent les articles 'Mine' - Moi - ou 'Friends' - Contacts - ont été modifiés pour lister tous les articles de blog appartenant aux utilisateurs (y compris ceux créés dans les groupes).

source: Plugin Bookmarks
fr: Plugin des signets - Bookmarks

source: The bookmark pages showing 'Mine' or 'Friends' listings of bookmarks have been changed to list all the bookmarks owned by the users (including those created in groups).
fr: Les pages des signets qui affichent les listes de signets 'Mine' - Moi - ou 'Friends' - Contacts - ont été modifiées pour lister tous les signets appartenant aux utilisateurs (y compris ceux créés dans les groupes).

source: Plugin File
fr: Plugin des fichiers - File

source: The file pages showing 'Mine' or 'Friends' listings of files have been changed to list all the files owned by the users (including those created in groups).
fr: Les pages de fichiers qui affichent les listes de fichiers 'Mine' - Moi - ou 'Friends' - Contacts - ont été modifiées pour lister tous les fichiers appartenant aux utilisateurs (y compris ceux créés dans les groupes).

source: Removed Classes
fr: Classes supprimées

source: ``FilePluginFile``: replace with ``ElggFile`` (or load with ``get_entity()``)
fr: ``FilePluginFile`` : remplacez par ``ElggFile`` (ou chargez avec ``get_entity()``)

source: Removed keys available via ``elgg_get_config()``
fr: Clefs retirées disponibles via ``elgg_get_config()``

source: Also note that plugins should not be accessing the global ``$CONFIG`` variable except for in ``settings.php``.
fr: Notez également que les plugins ne devraient pas accéder à la variable globale ``$CONFIG`` à l’exception de ``settings.php``.

source: Removed Functions
fr: Fonctions supprimées

source: ``mysql_*()``: Elgg :ref:`no longer uses ext/mysql<migrated-to-pdo>`
fr: ``mysql_*()``: Elgg :ref:`n'utilise plus ext/mysql<migrated-to-pdo>`

source: Removed methods
fr: Méthodes supprimées

source: ``ElggObject::addToSite()``: parent function in ElggEntity still available
fr: ``ElggObject::addToSite()``: la fonction parente dans ElggEntity est toujours disponible

source: ``ElggObject::getSites()``: parent function in ElggEntity still available
fr: ``ElggObject::getSites()``: la fonction parente dans ElggEntity est toujours disponible

source: ``ElggUser::addToSite()``: parent function in ElggEntity still available
fr: ``ElggUser::addToSite()``: la fonction parente dans ElggEntity est toujours disponible

source: ``ElggUser::getSites()``: parent function in ElggEntity still available
fr: ``ElggUser::getSites()``: la fonction parente est toujours disponible dans ElggEntity

source: ``ElggUser::removeFromSite()``: parent function in ElggEntity still available
fr: ``ElggUser::removeFromSite()``: la fonction parente est toujours disponible dans ElggEntity

source: The following arguments have also been dropped:
fr: Les arguments suivants ont également été abandonnés :

source: Removed Plugin Hooks
fr: Hooks plugin supprimés

source: ``[display, view]``: See the :ref:`new plugin hook<guides/views#altering-view-output>`.
fr: ``[display, view]``: Voyez le :ref:`nouvel hook plugin<guides/views#altering-view-output>`.

source: Removed Actions
fr: Actions supprimées

source: Removed Views
fr: Vues supprimées

source: Removed View Variables
fr: Variables des Vues supprimées

source: During rendering, the view system no longer injects these into the scope:
fr: Pendant le rendu, le système des vues ne les injecte plus dans le champ - scope :

source: ``$vars['url']``: replace with ``elgg_get_site_url()``
fr: ``$vars['url']`` : remplacez par ``elgg_get_site_url()``

source: ``$vars['user']``: replace with ``elgg_get_logged_in_user_entity()``
fr: ``$vars['user']`` : remplacez par ``elgg_get_logged_in_user_entity()``

source: ``$vars['config']``: use ``elgg_get_config()`` and ``elgg_set_config()``
fr: ``$vars['config']`` : utilisez ``elgg_get_config()`` et ``elgg_set_config()``

source: ``$CONFIG``: use ``elgg_get_config()`` and ``elgg_set_config()``
fr: ``$CONFIG``: utilisez ``elgg_get_config()`` et ``elgg_set_config()``

source: Also several workarounds for very old views are no longer performed. Make these changes:
fr: Plusieurs solutions de contournement pour des vues très anciennes ne sont plus effectuées. Effectuez ces modifications :

source: Set ``$vars['full_view']`` instead of ``$vars['full']``.
fr: Définissez ``$vars['full_view']`` au lieu de ``$vars['full']``.

source: Set ``$vars['name']`` instead of ``$vars['internalname']``.
fr: Définissez ``$vars['name']`` au lieu de ``$vars['internalname']``.

source: Set ``$vars['id']`` instead of ``$vars['internalid']``.
fr: Définissez ``$vars['id']`` au lieu de ``$vars['internalid']``.

source: Removed libraries
fr: Bibliothèques supprimées

source: ``elgg:markdown``: Elgg no longer provides a markdown implementation. You must provide your own.
fr: ``elgg:markdown`` : Elgg ne fournit plus d'implémentation de markdown. Vous devez fournir la vôtre.

source: Specifying View via Properties
fr: Spécifier des Vues via les propriétés

source: The metadata ``$entity->view`` no longer specifies the view used to render in ``elgg_view_entity()``.
fr: La métadonnée ``$entity->view`` ne spécifie plus la vue utilisée pour l'affichage dans ``elgg_view_entity()``.

source: Similarly the property ``$annotation->view`` no longer has an effect within ``elgg_view_annotation()``.
fr: De même, la propriété ``$annotation->view`` n’a plus d’effet dans ``elgg_view_annotation()``.

source: Viewtype is static after the initial ``elgg_get_viewtype()`` call
fr: Le type de vue est statique après l’appel initial ``elgg_get_viewtype()``

source: ``elgg_set_viewtype()`` must be used to set the viewtype at runtime. Although Elgg still checks the ``view`` input and ``$CONFIG->view`` initially, this is only done once per request.
fr: ``elgg_set_viewtype()`` doit être utilisé pour définir le type de vue au moment de l’exécution. Bien que Elgg vérifie toujours l’entrée ``view`` et ``$CONFIG->view`` initialement, cela n’est fait qu’une fois par requête.

source: Deprecations
fr: Dépréciations

source: It's deprecated to read or write to metadata keys starting with ``filestore::`` on ``ElggFile`` objects. In Elgg 3.0 this metadata will be deleted if it points to the current data root path, so few file objects will have it. Plugins should only use ``ElggFile::setFilestore`` if files need to be stored in a custom location.
fr: Il est déprécié de lire ou d’écrire des clefs de métadonnées commençant par ``filestore::`` sur les objets ``ElggFile``. Dans Elgg 3.0, cette métadonnée sera supprimée si elle pointe vers le chemin d’accès racine actuel des données, aussi peu d’objets de fichiers devraient l'avoir. Les plugins ne doivent utiliser ``ElggFile::setFilestore`` que si les fichiers doivent être stockés dans un emplacement personnalisé.

source: This is not the only deprecation in Elgg 2.0. Plugin developers should watch their site error logs.
fr: Ce n’est pas la seule dépréciation dans Elgg 2.0. Les développeurs de plugins devraient regarder leurs journaux d’erreurs de site.

source: From 2.0 to 2.1
fr: De 2.0 à 2.1

source: Deprecated APIs
fr: APIs dépréciées

source: ``elgg_get_config('siteemail')``: Use ``elgg_get_site_entity()->email``
fr: ``elgg_get_config('siteemail')``: Utilisez ``elgg_get_site_entity()->email``

source: URLs starting with ``/css/`` and ``/js/``: ``Use elgg_get_simplecache_url()``
fr: URLs commençant par ``/css/`` et ``/js/`` : ``Utilisez elgg_get_simplecache_url()``

source: ``elgg.ui.widgets`` JavaScript object is deprecated by ``elgg/widgets`` AMD module
fr: ``elgg.ui.widgets`` L’objet JavaScript est déprécié par le module AMD ``elgg/widgets``

source: ``Application::getDb()`` changes
fr: Changements de ``Application::getDb()``

source: If you're using this low-level API, do not expect it to return an ``Elgg\Database`` instance in 3.0. It now returns an ``Elgg\Application\Database`` with many deprecated. These methods were never meant to be made public API, but we will do our best to support them in 2.x.
fr: Si vous utilisez cette API bas niveau, ne vous attendez pas à ce qu’elle renvoie une instance ``Elgg\Database`` dans Elgg 3.0. Elle renvoie maintenant un ``Elgg\Application\Database`` avec de nombreuses alertes de dépréciation. Ces méthodes n’ont jamais été destinées à devenir une API publique, mais nous ferons de notre mieux pour les prendre en charge dans les versions 2.x.

source: Added ``elgg/widgets`` module
fr: Ajout du module ``elgg/widgets``

source: If your plugin code calls ``elgg.ui.widgets.init()``, instead use the :doc:`elgg/widgets module </guides/javascript>`.
fr: Si le code de votre plugin appelle ``elgg.ui.widgets.init()``, utilisez le :doc:`module elgg/widgets </guides/javascript>` à la place.

source: From 2.1 to 2.2
fr: De 2.1 à 2.2

source: ``elgg.ui.river`` JavaScript library: Remove calls to ``elgg_load_js('elgg.ui.river')`` from plugin code. Update ``core/river/filter`` and ``forms/comment/save``, if overwritten, to require component AMD modules
fr: Bibliothèque JavaScript ``elgg.ui.river`` : Supprimez les appels à ``elgg_load_js('elgg.ui.river')`` dans le code du plugin. Mettez à jour ``core/river/filter`` et ``forms/comment/save``, s’ils sont remplacés, pour exiger des modules de composants AMD

source: ``elgg.ui.popupOpen()`` and ``elgg.ui.popupClose()`` methods in ``elgg.ui`` JS library: Use ``elgg/popup`` module instead.
fr: Méthodes ``elgg.ui.popupOpen()`` et ``elgg.ui.popupClose()`` dans la bibliothèque JS ``elgg.ui`` : Utilisez le module ``elgg/popup`` à la place.

source: ``lightbox.js`` library: Do not use ``elgg_load_js('lightbox.js');`` unless your code references deprecated ``elgg.ui.lightbox`` namespace. Use ``elgg/lightbox`` AMD module instead.
fr: Bibliothèque ``lightbox.js`` : n’utilisez pas ``elgg_load_js('lightbox.js');`` à moins que votre code ne référence l’espace de nom déprécié ``elgg.ui.lightbox``. Utilisez plutôt le module AMD ``elgg/lightbox``.

source: ``elgg.embed`` library and ``elgg.embed`` object: Do not use ``elgg_load_js('elgg.embed')``. Use ``elgg/embed`` AMD module instead
fr: Bibliothèque ``elgg.embed`` et objet ``elgg.embed`` : N’utilisez pas ``elgg_load_js('elgg.embed')``. Utilisez plutôt le module AMD ``elgg/embed``

source: Accessing ``icons_sizes`` config value directly: Use ``elgg_get_icon_sizes()``
fr: Accéder directement à la valeur de configuration ``icons_sizes`` : Utilisez ``elgg_get_icon_sizes()``

source: ``can_write_to_container()``: Use ``ElggEntity::canWriteToContainer()``
fr: ``can_write_to_container()`` : Utilisez ``ElggEntity::canWriteToContainer()``

source: Deprecated Views
fr: Vues obsolètes

source: ``elgg/ui.river.js`` is deprecated: Do not rely on simplecache URLs to work.
fr: ``elgg/ui.river.js`` est déprécié : ne vous fiez pas aux URLs de simplecache pour travailler.

source: ``groups/js`` is deprecated: Use ``groups/navigation`` AMD module as a menu item dependency for "feature" and "unfeature" menu items instead.
fr: ``groups/js`` est déprécié : utilisez à la place le module AMD ``groups/navigation`` comme dépendance d’élément du menu pour les éléments de menu de mise en Une "feature" et de retrait de la Une "unfeature".

source: ``lightbox/settings.js`` is deprecated: Use ``getOptions, ui.lightbox`` JS plugin hook or ``data-colorbox-opts`` attribute.
fr: ``lightbox/settings.js`` est déprécié : utilisez l’attribut ``getOptions, ui.lightbox`` ou ``data-colorbox-opts`` du hook plugin JS.

source: ``elgg/ckeditor/insert.js`` is deprecated: You no longer need to include it, hook registration takes place in ``elgg/ckeditor`` module
fr: ``elgg/ckeditor/insert.js`` est déprécié : vous n’avez plus besoin de l’inclure, l’enregistrement des hooks a lieu dans le module ``elgg/ckeditor``

source: ``embed/embed.js`` is deprecated: Use ``elgg/embed`` AMD module.
fr: ``embed/embed.js`` est déconseillé : utilisez le module AMD ``elgg/embed``.

source: Added ``elgg/popup`` module
fr: Ajout du module ``elgg/popup``

source: New :doc:`elgg/popup module </guides/javascript>` can be used to build out more complex trigger-popup interactions, including binding custom anchor types and opening/closing popups programmatically.
fr: Le nouveau :doc:`module elgg/popup </guides/javascript>` peut être utilisé pour créer des interactions plus complexes de déclenchement de popup, y compris la liaison des types d’ancrage personnalisés et l’ouverture/fermeture programmatique de fenêtres contextuelles.

source: Added ``elgg/lightbox`` module
fr: Ajout du module ``elgg/lightbox``

source: New :doc:`elgg/lightbox module </guides/javascript>` can be used to open and close the lightbox programmatically.
fr: Le nouveau :doc:`module elgg/lightbox </guides/javascript>` peut être utilisé pour ouvrir et fermer la lightbox de manière programmatique.

source: Added ``elgg/embed`` module
fr: Ajout du module ``elgg/embed``

source: Even though rarely necessary, ``elgg/embed`` AMD module can be used to access the embed methods programmatically. The module bootstraps itself when necessary and is unlikely to require further decoration.
fr: Même s’il est rarement nécessaire, le module AMD ``elgg/embed`` peut être utilisé pour accéder aux méthodes d’intégration programmatiquement. Le module s'initialise lui-même si nécessaire et est peu susceptible de nécessiter une décoration supplémentaire.

source: New API for handling entity icons
fr: Nouvelle API pour la manipulation des icônes d’entités

source: ``ElggEntity`` now implements ``\Elgg\EntityIcon`` interface
fr: ``ElggEntity`` implémente désormais l’interface ``\Elgg\EntityIcon``

source: ``elgg_get_icon_sizes()`` - return entity type/subtype specific icon sizes
fr: ``elgg_get_icon_sizes()`` - renvoie les tailles d’icônes spécifiques au type/sous-type d’entité spécifié

source: ``ElggEntity::saveIconFromUploadedFile()`` - creates icons from an uploaded file
fr: ``ElggEntity::saveIconFromUploadedFile()`` - crée des icônes à partir d’un fichier téléchargé

source: ``ElggEntity::saveIconFromLocalFile()`` - creates icons from a local file
fr: ``ElggEntity::saveIconFromLocalFile()`` - crée des icônes à partir d’un fichier local

source: ``ElggEntity::saveIconFromElggFile()`` - creates icons from an instance of ``ElggFile``
fr: ``ElggEntity::saveIconFromElggFile()`` - crée des icônes à partir d’une instance de ``ElggFile``

source: ``ElggEntity::getIcon()`` - returns an instanceof ``ElggIcon`` that points to entity icon location on filestore (this may be just a placeholder, use ``ElggEntity::hasIcon()`` to validate if file has been written)
fr: ``ElggEntity::getIcon()`` - renvoie une instance de ``ElggIcon`` qui pointe vers l’emplacement de l’icône de l’entité dans le répertoire de fichiers (il peut s’agir simplement d’un espace réservé, utilisez ``ElggEntity::hasIcon()`` pour vérifier si le fichier a effectivement été écrit)

source: ``ElggEntity::deleteIcon()`` - deletes entity icons
fr: ``ElggEntity::deleteIcon()`` - supprime les icônes d'entité

source: ``ElggEntity::getIconLastChange()`` - return modified time of the icon file
fr: ``ElggEntity::getIconLastChange()`` - retourne la date de modification du fichier icône

source: ``ElggEntity::hasIcon()`` - checks if an icon with given size has been created
fr: ``ElggEntity::hasIcon()`` - vérifie si une icône de la dimension donnée a bien été créée

source: ``elgg_get_embed_url()`` - can be used to return an embed URL for an entity's icon (served via `/serve-icon` handler)
fr: ``elgg_get_embed_url()`` - peut être utilisé pour retourner une URL afin d'intégrer l'icône d'une entité (servie via le gestionnaire `/serve-icon`)

source: User avatars are now served via ``serve-file`` handler. Plugins should start using ``elgg_get_inline_url()`` and note that:
fr: Les avatars des utilisateurs sont désormais servis via le gestionnaire ``serve-file``. Les plugins devraient commencer à utiliser ``elgg_get_inline_url()`` et noter que :

source: ``/avatar/view`` page handler and resource view have been deprecated
fr: le gestionnaire de page et la vue ressource``/avatar/view`` sont devenus obsolètes

source: ``/mod/profile/icondirect.php`` file has been deprecated
fr: le fichier ``/mod/profile/icondirect.php`` est devenu obsolète

source: ``profile_set_icon_url()`` is no longer registered as a callback for ``"entity:icon:url","user"`` plugin hook
fr: ``profile_set_icon_url()`` n'est plus enregistré comme fonction de rappel -callback- pour le hook plugin ``"entity:icon:url","user"``

source: Group avatars are now served via ``serve-file`` handler. Plugins should start using ``elgg_get_inline_url()`` and note that:
fr: Les avatars de groupe sont désormais servis via le gestionnaire ``serve-file``. Les plugins devraient commencer à utiliser ``elgg_get_inline_url()`` et noter que :

source: ``groupicon`` page handler (``groups_icon_handler()``) has been deprecated
fr: le gestionnaire de page ``groupicon`` (``groups_icon_handler()``) est devenu obsolète

source: ``/mod/groups/icon.php`` file has been deprecated
fr: le fichier ``/mod/groups/icon.php`` est devenu obsolète

source: File entity thumbs and downloads are now served via ``serve-file`` handler. Plugins should start using ``elgg_get_inline_url()`` and ``elgg_get_download_url()`` and note that:
fr: Les miniatures et les téléchargements sont désormais servis via le gestionnaire ``serve-file``. Les plugins devraient commencer à utiliser ``elgg_get_inline_url()`` et ``elgg_get_download_url()`` et noter que :

source: ``file/download`` page handler and resource view have been deprecated
fr: le gestionnaire de page et la vue ressource``file/download`` sont devenus obsolètes

source: ``mod/file/thumbnail.php`` file has been deprecated
fr: le fichier ``mod/file/thumbnail.php`` est devenu obsolète

source: Several views have been updated to use new download URLs, including:
fr: Plusieurs vues ont été mises à jour pour utiliser les nouvelles URLs de téléchargement, notamment :

source: Removed APIs
fr: APIs supprimées

source: Just a warning that the private entity cache functions (e.g. ``_elgg_retrieve_cached_entity``) have been removed. Some plugins may have been using them. Plugins should not use private APIs as they will more often be removed without notice.
fr: Juste un avertissement pour indiquer que les fonctions de caches d'entité privée (par ex. ``_elgg_retrieve_cached_entity``) ont été supprimées. Quelques plugins ont pu les utiliser. Les plugins ne devraient pas utiliser les API privées dans la mesure où elles seront plus souvent supprimées sans avertissement.

source: Improved ``elgg/ckeditor`` module
fr: Un module ``elgg/ckeditor`` amélioré

source: :doc:`elgg/ckeditor module </guides/javascript>` can now be used to add WYSIWYG to a textarea programmatically with ``elgg/ckeditor#bind``.
fr: le module :doc:`elgg/ckeditor </guides/javascript>` peut maintenant être utilisé pour ajouter un éditeur WYSIWYG à un textarea de manière programmatique avec ``elgg/ckeditor#bind``.

source: From 2.2 to 2.3
fr: De 2.2 à 2.3

source: PHP Version
fr: Version de PHP

source: PHP 5.5 has reached end of life in July 2016. To ensure that Elgg sites are secure, we now require PHP 5.6 for new installations.
fr: PHP 5.5 a atteint la date de fin de support en Juillet 2016. Afin de s'assurer que les sites Elgg soient sécurisés, nous exigeons désormais PHP 5.6 pour les nouvelles installations.

source: Existing installations can continue using PHP 5.5 until Elgg 3.0.
fr: Les installations existantes peuvent continuer à utiliser PHP 5.5 jusqu'à Elgg 3.0.

source: In order to upgrade Elgg to 2.3 using composer while using PHP 5.5, you may need to use ``--ignore-platform-reqs`` flag.
fr: Afin de mettre à niveau Elgg vers la version 2.3 en utilisant composer avec PHP 5.5, vous pouvez avoir besoin d'utiliser le drapeau ``--ignore-platform-reqs``.

source: Registering for ``to:object`` hook by the extender name: Use ``to:object, annotation`` and ``to:object, metadata`` hooks instead.
fr: Enregistrement pour le hook ``to:object`` par le nom de l’extenseur : Utilisez les hooks ``to:object, annotation`` et ``to:object, metadata`` à la place.

source: ``ajax_forward_hook()``: No longer used as handler for `'forward','all'` hook. Ajax response is now wrapped by the ``ResponseFactory``
fr: ``ajax_forward_hook()`` : N’est plus utilisé comme gestionnaire pour le hook `'forward','all'``. La réponse Ajax est maintenant enveloppée par la ``ResponseFactory``

source: ``ajax_action_hook()``: No longer used as handler for `'action','all'` hook. Output buffering now starts before the hook is triggered in ``ActionsService``
fr: ``ajax_action_hook()`` : N’est plus utilisé comme gestionnaire pour le hook `'action','all'`. La mise en mémoire tampon de la sortie commence maintenant avant que le hook ne soit déclenché dans ``ActionsService``

source: ``elgg_error_page_handler()``: No longer used as a handler for `'forward',<error_code>` hooks
fr: ``elgg_error_page_handler()`` : N’est plus utilisé comme gestionnaire pour les hooks `'forward',<error_code>`

source: ``get_uploaded_file()``: Use new file uploads API instead
fr: ``get_uploaded_file()`` : Utilisez la nouvelle API d'envoi de fichiers à la place

source: ``get_user_notification_settings()``: Use ``ElggUser::getNotificationSettings()``
fr: ``get_user_notification_settings()`` : Utilisez ``ElggUser::getNotificationSettings()``

source: ``set_user_notification_setting()``: Use ``ElggUser::setNotificationSetting()``
fr: ``set_user_notification_setting()`` : Utilisez ``ElggUser::setNotificationSetting()``

source: ``pagesetup, system`` event: Use the menu or page shell hooks instead.
fr: événement ``pagesetup, system`` : Utilisez le menu ou les hooks de la coquille de la page - page shell - à la place.
