Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``has_access_to_entity()`` use ``\ElggEnity->hasAccess()`` or ``elgg_has_access_to_entity()``
fr: ``has_access_to_entity()`` utilisez ``\ElggEnity->hasAccess()`` ou ``elgg_has_access_to_entity()``

source: ``is_email_address()`` use ``elgg_is_valid_email()``
fr: ``is_email_address()`` utilisez ``elgg_is_valid_email()``

source: ``log_login_failure()`` use ``elgg_register_authentication_failure()``
fr: ``log_login_failure()`` utilisez ``elgg_register_authentication_failure()``

source: ``login()`` use ``elgg_login()``
fr: ``login()`` utilisez ``elgg_login()``

source: ``logout()`` use ``elgg_logout()``
fr: ``logout()`` utilisez ``elgg_logout()``

source: ``parse_urls()`` use ``elgg_parse_urls()``
fr: ``parse_urls()`` utilisez ``elgg_parse_urls()``

source: ``register_pam_handler()`` use ``elgg_register_pam_handler()``
fr: ``register_pam_handler()`` utilisez ``elgg_register_pam_handler()``

source: ``register_user()`` use ``elgg_register_user()``
fr: ``register_user()`` utilisez ``elgg_register_user()``

source: ``remove_entity_relationship()`` use ``\ElggEntity->removeRelationship()``
fr: ``remove_entity_relationship()`` utilisez ``\ElggEntity->removeRelationship()``

source: ``remove_entity_relationships()`` use ``\ElggEntity->removeAllRelationships()``
fr: ``remove_entity_relationships()`` utilisez ``\ElggEntity->removeAllRelationships()``

source: ``remove_user_from_access_collection()`` use ``\ElggAccessCollection->removeMember()``
fr: ``remove_user_from_access_collection()`` utilisez ``\ElggAccessCollection->removeMember()``

source: ``reset_login_failure_count()`` use ``elgg_reset_authentication_failures()``
fr: ``reset_login_failure_count()`` utilisez ``elgg_reset_authentication_failures()``

source: ``send_new_password_request()`` use ``elgg_request_new_password()``
fr: ``send_new_password_request()`` utilisez ``elgg_request_new_password()``

source: ``string_to_tag_array()`` use ``elgg_string_to_array()``
fr: ``string_to_tag_array()`` utilisez ``elgg_string_to_array()``

source: ``unregister_pam_handler()`` use ``elgg_unregister_pam_handler()``
fr: ``unregister_pam_handler()`` utilisez ``elgg_unregister_pam_handler()``

source: ``\ElggEntity->deleteRelationships()`` use ``\ElggEntity->removeAllRelationships()``
fr: ``\ElggEntity->deleteRelationships()`` utilisez ``\ElggEntity->removeAllRelationships()``

source: ``\ElggUser->getFriends()`` use ``\ElggUser->getEntitiesFromRelationship()``
fr: ``\ElggUser->getFriends()`` utilisez ``\ElggUser->getEntitiesFromRelationship()``

source: ``\ElggUser->getFriendsObjects()`` use ``\ElggUser->getEntitiesFromRelationship()``
fr: ``\ElggUser->getFriendsObjects()`` utilisez ``\ElggUser->getEntitiesFromRelationship()``

source: ``\ElggUser->getFriendsOf()`` use ``\ElggUser->getEntitiesFromRelationship()``
fr: ``\ElggUser->getFriendsOf()`` utilisez ``\ElggUser->getEntitiesFromRelationship()``

source: ``\ElggUser->isFriend()`` use ``\ElggUser->isFriendOf()``
fr: ``\ElggUser->isFriend()`` utilisez ``\ElggUser->isFriendOf()``

source: Events
fr: Evénements

source: ``'annotate', '{$entity->getType()}'`` use the ``'create', 'annotate'`` event
fr: ``'annotate', '{$entity->getType()}'`` utilisez l'événement ``'create', 'annotate'``

source: ``'classes', 'icon'`` use the ``'view_vars', 'output/icon'`` hook
fr: ``'classes', 'icon'`` utilisez le hook ``'view_vars', 'output/icon'``

source: ``'file:icon:url', 'override'`` use the ``'entity:icon:url', 'object'`` hook
fr: ``'file:icon:url', 'override'`` utilisez le hook ``'entity:icon:url', 'object'``

source: ``'is_member', 'group'`` use the ``'gatekeeper', 'all'`` hook
fr: ``'is_member', 'group'`` utilisez le hook ``'gatekeeper', 'all'``

source: ``'page_owner', 'system'`` use route definitions
fr: ``'page_owner', 'system'`` utilisez les définitions de route

source: ``'status', 'user'`` use the ``'create', 'object'`` event
fr: ``'status', 'user'`` utilisez l'événement ``'create', 'object'``

source: ``'validate', 'input'`` use the ``'sanitize', 'input'`` hook
fr: ``'validate', 'input'`` utilisez le hook ``'sanitize', 'input'``

source: ``\ElggPAM`` use ``elgg_pam_authenticate()``
fr: ``\ElggPAM`` utilisez ``elgg_pam_authenticate()``

source: Notable function parameters
fr: Paramètres de fonction remarquables

source: Passing ``order_by_metadata`` or ``order_by_annotation`` to ``elgg_get_entities`` is deprecated. Use ``sort_by`` instead.
fr: Passer ``order_by_metadata`` ou ``order_by_annotation`` à ``elgg_get_entities`` est obsolète. Utilisez ``sort_by`` à la place.

source: ``path`` use ``elgg_get_root_path()``
fr: ``path`` utilisez ``elgg_get_root_path()``

source: ``pluginspath`` use ``elgg_get_plugins_path()``
fr: ``pluginspath`` utilisez ``elgg_get_plugins_path()``

source: ``site_guid`` use ``elgg_get_site_entity()->guid``
fr: ``site_guid`` utilisez ``elgg_get_site_entity()->guid``

source: ``sitedescription`` use ``elgg_get_site_entity()->description``
fr: ``sitedescription`` utilisez ``elgg_get_site_entity()->description``

source: ``sitename`` use ``elgg_get_site_entity()->getDisplayName()``
fr: ``sitename`` utilisez ``elgg_get_site_entity()->getDisplayName()``

source: ``url`` use ``elgg_get_site_url()``
fr: ``url`` utilisez ``elgg_get_site_url()``

source: From 4.x to 5.0
fr: De 4.x à 5.0

source: The editor has been updated to version 5. This brings some new features (like mentions and images in content) but also impacts existing plugins. Most notable are The Wire (which now also has mention support) and the removal of the Embed plugin.
fr: L'éditeur a été mis à jour vers la version 5. Cela apporte quelques nouvelles fonctionnalités (comme les mentions et les images dans le contenu) mais impacte également les plugins existants. Les plus notables sont The Wire (qui a désormais également mentionné le support) et la suppression du plugin Embed.

source: The related 'longtext' menu is no longer available.
fr: Le menu 'longtext' associé n'est plus disponible.

source: The minimal PHP version is now 8.0.
fr: La version minimale de PHP est maintenant 8.0.

source: The faker library is no longer maintained by fzaninotto so we switched to a fork which is maintained by FakerPHP.
fr: La bibliothèque faker n'est plus maintenue par fzaninotto, nous sommes donc passés à un fork qui est maintenu par FakerPHP.

source: Events and Hooks
fr: Événements et Hooks

source: These two similar concepts have been merged and from now on we will only refer to events. The public service ``hooks`` no longer exists. All hooks can now be registered in the `events` section of your plugin. If you use hook callbacks that expect a type hinted `Elgg\Hook` argument you will need to update this to `Elgg\Event`.
fr: Ces deux concepts similaires ont été fusionnés et nous ne ferons désormais référence qu'à des événements. Les « crochets » du service public n'existent plus. Tous les hooks peuvent maintenant être enregistrés dans la section « événements » de votre plugin. Si vous utilisez des rappels de hook qui attendent un argument `Elgg\Hook` d'indication de type, vous devrez le mettre à jour vers `Elgg\Event`.

source: Create event
fr: Créer un événement

source: The ``create``, ``<object|group|user|site>`` events can no longer be used to prevent the creation of the entity. Use ``create:before`` if you wish to prevent the creation.
fr: Les événements ``create``, ``<object|group|user|site>`` ne peuvent plus être utilisés pour empêcher la création de l'entité. Utilisez ``create:before`` si vous souhaitez empêcher la création.

source: Private Settings
fr: Paramètres privés

source: The concept of private settings has been removed from the system. All private settings have been copied to metadata. All related functions have been removed.
fr: Le concept de paramètres privés a été supprimé du système. Tous les paramètres privés ont été copiés dans les métadonnées. Toutes les fonctions associées ont été supprimées.

source: Breadcrumbs integrated into menu system
fr: Fil d'Ariane intégré au système de menu

source: Helper functions for the breadcrumb menu have been changed to use ``elgg_register_menu_item()`` for adding items to the breadcrumb menu. Breadcrumb related events have been removed in favor of the regular menu events.
fr: Les fonctions d'assistance pour le menu du fil d'Ariane ont été modifiées pour utiliser ``elgg_register_menu_item()`` pour ajouter des éléments au menu du fil d'Ariane. Les événements liés au fil d'Ariane ont été supprimés au profit des événements de menu standards.

source: Upgrades
fr: Mises à niveau

source: Async or system upgrades are no longer classes that implement interfaces but extend abstract classes. Update your upgrades to extend the correct classes. The reason for this change is to be able to access the ``ElggUpgrade`` entity from the ``Batch`` that runs a part of the upgrade. You can access the upgrade by calling ``$this->getUpgrade()``.
fr: Les mises à niveau asynchrones ou système ne sont plus des classes qui implémentent des interfaces, mais étendent des classes abstraites. Mettez à jour vos mises à niveau pour étendre les classes appropriées. La raison de ce changement est de pouvoir accéder à l'entité ``ElggUpgrade`` à partir du ``Batch`` qui exécute une partie de la mise à niveau. Vous pouvez accéder à la mise à niveau en appelant ``$this->getUpgrade()``.

source: If you use the session service directly (or via ``elgg_get_session()``) you might need to update your code. Various functions of this class have been moved to the ``elgg()->session_manager`` service.
fr: Si vous utilisez le service de session directement (ou via ``elgg_get_session()``), vous devrez peut-être mettre à jour votre code. Diverses fonctions de cette classe ont été déplacées vers le service ``elgg()->session_manager``.

source: Gatekeepers
fr: Gestionnaires d'accès

source: The ``PageOwnerCanEditGatekeeper`` middleware now requires a pageowner to be set. This gatekeeper now also requires a logged in user at all times.
fr: Le middleware ``PageOwnerCanEditGatekeeper`` requiert désormais de définir un propriétaire de page. Ce contrôleur d'accès requiert désormais également un utilisateur connecté à tout moment.

source: Files plugin
fr: Plugin Files

source: Files uploaded using the file plugin are no longer stored with the owner but with the file entity. File icons have also been changed. Icon images are only available for image file types. Icon sizes have been changed to use the default icon sizes.
fr: Les fichiers téléchargés à l'aide du plugin de fichiers "file" ne sont plus stockés avec le propriétaire mais avec l'entité du fichier. Les icônes de fichiers ont également été modifiées. Les images d'icônes ne sont disponibles que pour les types de fichiers image. La taille des icônes a été modifiée pour utiliser les tailles d'icône par défaut.

source: Embed plugin
fr: Plugin Embed

source: The embed plugin has been removed.
fr: Le plugin embed a été supprimé.

source: Hooks system
fr: Hooks système

source: The javascript hook functions have been moved to an AMD module. If you used javascript hooks than you need to update your code to use the ``elgg/hook`` module. The concept of 'instant hooks' is no longer present in the system.
fr: Les fonctions de hook javascript ont été déplacées vers un module AMD. Si vous avez utilisé des hooks javascript, vous devez mettre à jour votre code pour utiliser le module ``elgg/hook``. Le concept de 'hooks instantanés' n'est plus présent dans le système.

source: The ``'init', 'system'`` event is no longer triggered in javascript.
fr: L'événement ``'init', 'system'`` n'est plus déclenché en javascript.

source: ``elgg.register_hook_handler`` use the ``register`` function provide by the ``elgg\hooks`` module
fr: ``elgg.register_hook_handler`` utilise la fonction ``register`` fournie par le module ``elgg\hooks``

source: ``elgg.trigger_hook`` use the ``trigger`` function provided by the ``elgg\hooks`` module
fr: ``elgg.trigger_hook`` utilisez la fonction ``trigger`` fournie par le module ``elgg\hooks``

source: The uses of exceptions in Elgg has been revisited. The ``\Elgg\Exceptions\InvalidParameterException`` has been removed and replaced with the correct exception. Also the use of the ``\Elgg\Exceptions\InvalidArgumentException`` has been checked. In some cases the exception was replaced by a more appropriate exception.
fr: L'utilisation des exceptions dans Elgg a été revisitée. ``\Elgg\Exceptions\InvalidParameterException`` a été supprimé et remplacé par l'exception correcte. L'utilisation de ``\Elgg\Exceptions\InvalidArgumentException`` a également été vérifiée. Dans certains cas, l'exception a été remplacée par une exception plus appropriée.

source: It's no longer allowed to set arbitrary data during runtime on an ``ElggRiverItem``. Since the data was only available during runtime and not saved to the database this distinction has been removed. When setting an unsupported attribute an ``\Elgg\Exceptions\RuntimeException`` is thrown.
fr: Il n'est désormais plus permis de définir des données arbitraires pendant l'exécution sur un ``ElggRiverItem``. Étant donné que les données n'étaient disponibles que pendant l'exécution et n'étaient pas enregistrées dans la base de données, cette distinction a été supprimée. Lors de la définition d'un attribut non pris en charge, une ``\Elgg\Exceptions\RuntimeException`` est levée.

source: Metadata options in getter functions
fr: Options des métadonnées dans les fonctions de récupération ("getter")

source: Previously there was a magic that would turn the ``metadata_value`` string into an array if it contained an ``,``.
fr: Auparavant, il existait une magie qui transformait la chaîne ``metadata_value`` en tableau si elle contenait un ``,``.

source: This magic has been removed. You now need to provide the array yourself. Because of this magic it was impossible to query for a metadata value that contained an ``,``.
fr: Cette magie a été supprimée. Vous devez maintenant fournir le tableau vous-même. En raison de cette magie, il était impossible de rechercher une valeur de métadonnées contenant un ``,``.

source: Changes in functions
fr: Modification dans les fonctions

source: The following functions now have their arguments and/or return types type-hinted, this can cause ``TypeError`` errors. Also some class functions have their return value type hinted and you should update your function definition. Some function might have their arguments changed or the return type has been changed.
fr: Les fonctions suivantes ont maintenant leurs arguments et/ou valeurs de retour typées, ce qui peut provoquer des erreurs ``TypeError``. De plus, certaines fonctions de classe ont leur type de valeur de retour indiqué et vous devez mettre à jour la définition de votre fonction. Certaines fonctions peuvent avoir leurs arguments modifiés, ou le type de retour a été modifié.

source: Lib functions return types
fr: Types de retour des fonctions des bibliothèques

source: ``elgg_add_admin_notice()`` now returns ``null`` on failure instead of a ``bool``
fr: ``elgg_add_admin_notice()`` renvoie maintenant ``null`` en cas d'erreur au lieu d'un ``bool``

source: ``elgg_create_river_item()`` now returns ``null`` on failure or an ``ElggRiverItem``
fr: ``elgg_create_river_item()`` renvoie désormaisun ``ElggRiverItem``, ou ``null`` en cas d'échec

source: ``elgg_delete_metadata()`` no longer returns ``null``
fr: ``elgg_delete_metadata()`` ne renvoie plus ``null``

source: ``elgg_delete_river()`` no longer returns ``null``
fr: ``elgg_delete_river()`` ne renvoie plus ``null``

source: ``elgg_deprecated_notice()`` no longer returns ``bool``
fr: ``elgg_deprecated_notice()`` ne renvoie plus ``bool``

source: ``elgg_generate_entity_url()`` now returns ``null`` on failure instead of a ``bool``
fr: ``elgg_generate_entity_url()`` renvoie maintenant ``null`` en cas d'erreur au lieu d'un ``bool``

source: ``elgg_generate_url()`` now returns ``null`` on failure instead of a ``bool``
fr: ``elgg_generate_url()`` renvoie maintenant ``null`` en cas d'erreur au lieu d'un ``bool``

source: ``elgg_get_annotation_from_id()`` now returns ``null`` if no annotation is found instead of a ``bool``
fr: ``elgg_get_annotation_from_id()`` renvoie désormais ``null`` au lieu d'un ``bool`` si aucune annotation n'est trouvée

source: ``elgg_get_download_url()`` now returns ``null`` if there is an error
fr: ``elgg_get_download_url()`` renvoie maintenant ``null`` en cas d'erreur

source: ``elgg_get_entity_as_row()`` now returns ``null`` if no entity is found instead of a ``bool``
fr: ``elgg_get_entity_as_row()`` renvoie désormais ``null`` au lieu d'un ``bool`` si aucune entité n'est trouvée

source: ``elgg_get_entity_dates()`` no longer returns a ``bool``
fr: ``elgg_get_entity_dates()`` ne renvoie plus un ``bool``

source: ``elgg_get_form_footer()`` no longer returns a ``bool``
fr: ``elgg_get_form_footer()`` ne renvoie plus un ``bool``

source: ``elgg_get_inline_url()`` now returns ``null`` if there is an error
fr: ``elgg_get_inline_url()`` renvoie maintenant ``null`` en cas d'erreur

source: ``elgg_get_metadata_from_id()`` now returns ``null`` if no metadata could be found
fr: ``elgg_get_metadata_from_id()`` renvoie désormais ``null`` si aucune métadonnée n'a pu être trouvée

source: ``elgg_get_page_owner_entity()`` now returns ``null`` if page owner could not be found
fr: ``elgg_get_page_owner_entity()`` renvoie désormais ``null`` si le propriétaire de la page n'a pas pu être trouvé

source: ``elgg_get_river_item_from_id()`` now returns ``null`` if no river item could be found
fr: ``elgg_get_river_item_from_id()`` renvoie désormais ``null`` si aucun élément de rivière n'a pu être trouvé

source: ``elgg_get_system_cache()`` now returns an instance of ``\Elgg\Cache\BaseCache`` instead of an ``\ElggCache``
fr: ``elgg_get_system_cache()`` renvoie désormais une instance de ``\Elgg\Cache\BaseCache`` au lieu de ``\ElggCache``

source: ``elgg_get_uploaded_file()`` now returns ``null`` if no file could be found or the file was invalid
fr: ``elgg_get_uploaded_file()`` renvoie désormais ``null`` si aucun fichier n'a pu être trouvé ou si le fichier n'était pas valide

source: ``elgg_normalize_site_url()`` now returns ``null`` when the url is not a site url
fr: ``elgg_normalize_site_url()`` renvoie désormais ``null`` lorsque l'URL n'est pas une URL de site

source: ``elgg_register_action()`` no longer returns a ``bool``
fr: ``elgg_register_action()`` ne renvoie plus un ``bool``

source: ``elgg_register_menu_item()`` no longer has a return value
fr: ``elgg_register_menu_item()`` n'a plus de valeur de retour

source: ``elgg_register_widget_type()`` no longer has a return value
fr: ``elgg_register_widget_type()`` n'a plus de valeur de retour

source: ``elgg_set_form_footer()`` no longer has a return value
fr: ``elgg_set_form_footer()`` n'a plus de valeur de retour

source: ``elgg_trigger_after_event()`` no longer has a return value
fr: ``elgg_trigger_after_event()`` n'a plus de valeur de retour

source: ``elgg_unregister_action()`` no longer has a return value
fr: ``elgg_unregister_action()`` n'a plus de valeur de retour

source: ``elgg_unregister_event_handler()`` no longer has a return value
fr: ``elgg_unregister_event_handler()`` n'a plus de valeur de retour

source: ``elgg_unregister_notification_event()`` no longer has a return value
fr: ``elgg_unregister_notification_event()`` n'a plus de valeur de retour

source: ``elgg_unregister_notification_method()`` no longer has a return value
fr: ``elgg_unregister_notification_method()`` n'a plus de valeur de retour

source: ``elgg_unregister_widget_type()`` no longer has a return value
fr: ``elgg_unregister_widget_type()`` n'a plus de valeur de retour

source: ``elgg_view_annotation()`` no longer returns a ``bool``
fr: ``elgg_view_annotation()`` ne renvoie plus un ``bool``

source: ``elgg_view_comments()`` no longer returns a ``bool``
fr: ``elgg_view_comments()`` ne renvoie plus un ``bool``

source: ``elgg_view_list_item()`` no longer returns a ``bool``
fr: ``elgg_view_list_item()`` ne renvoie plus un ``bool``

source: ``elgg_view_relationship()`` no longer returns a ``bool``
fr: ``elgg_view_relationship()`` ne renvoie plus un ``bool``

source: ``get_entity()`` now returns ``null`` if no entity is found instead of a ``bool``
fr: ``get_entity()`` renvoie désormais ``null`` au lieu d'un ``bool`` si aucune entité n'est trouvée

source: ``get_user()`` now returns ``null`` if no user is found instead of a ``bool``
fr: ``get_user()`` renvoie désormais ``null`` au lieu d'un ``bool`` si aucun utilisateur n'est trouvé

source: ``elgg_ws_expose_function()`` no longer returns a ``bool``
fr: ``elgg_ws_expose_function()`` ne renvoie plus un ``bool``

source: Lib functions function parameters
fr: Paramètres de fonction des fonctions des bibliothèques

source: ``blog_prepare_form_vars()`` now requires a ``ElggBlog`` for ``$blog`` and a ``ElggAnnotation`` for ``$revision``
fr: ``blog_prepare_form_vars()`` requiert désormais un ``ElggBlog`` pour ``$blog`` et un ``ElggAnnotation`` pour ``$revision``

source: ``bookmarks_prepare_form_vars()`` now requires a ``ElggBookmark`` for ``$bookmark``
fr: ``bookmarks_prepare_form_vars()`` requiert désormais un ``ElggBookmark`` pour ``$bookmark``

source: ``discussion_prepare_form_vars()`` now requires a ``ElggDiscussion`` for ``$topic``
fr: ``discussion_prepare_form_vars()`` requiert désormais un ``ElggDiscussion`` pour ``$topic``

source: ``elgg_add_action_tokens_to_url()`` now requires a ``string`` for ``$url`` and a ``bool`` for ``$html_encode``
fr: ``elgg_add_action_tokens_to_url()`` requiert désormais un ``string`` pour ``$url`` et un ``bool`` pour ``$html_encode``

source: ``elgg_can_edit_widget_layout()`` now requires a ``string`` for ``$context`` and ``int`` for ``$user_guid``
fr: ``elgg_can_edit_widget_layout()`` requiert désormais un ``string`` pour ``$context`` et un ``int`` pour ``$user_guid``

source: ``elgg_clear_event_handlers()`` now requires a ``string`` for ``$event`` and ``$type``
fr: ``elgg_clear_event_handlers()`` requiert désormais un ``string`` pour ``$event`` et ``$type``

source: ``elgg_clear_sticky_form()`` now requires a ``string`` for ``$context``
fr: ``elgg_clear_sticky_form()`` requiert désormais un ``string`` pour ``$context``

source: ``elgg_create_widget()`` now requires an ``int`` for ``$owner_guid`` and ``$access_id`` and a ``string`` for ``$handler`` and ``$context``
fr: ``elgg_create_widget()`` requiert désormais un ``int`` pour ``$owner_guid`` et ``$access_id`` et un ``string`` pour ``$handler`` et ``$context``

source: ``elgg_define_js()`` now requires a ``string`` for ``$name`` and an ``array`` for ``$config``
fr: ``elgg_define_js()`` requiert désormais un ``string`` pour ``$name`` et un ``array`` pour ``$config``

source: ``elgg_delete_system_cache()`` now requires a ``string`` for ``$type``
fr: ``elgg_delete_system_cache()`` requiert désormais un ``string`` pour ``$type``

source: ``elgg_echo()`` now requires a ``string`` for ``$message_key`` and a ``string`` for ``$language``
fr: ``elgg_echo()`` requiert désormais un ``string`` pour ``$message_key`` et un ``string`` pour ``$language``

source: ``elgg_enqueue_notification_event()`` no longer requires a ``$type``
fr: ``elgg_enqueue_notification_event()`` n'a plus besoin d'un ``$type``

source: ``elgg_entity_exists()`` now requires a ``int`` for ``$guid``
fr: ``elgg_entity_exists()`` requiert désormais un ``int`` pour ``$guid``

source: ``elgg_entity_gatekeeper()`` now requires a ``int`` for ``$guid`` and a ``string`` for ``$type`` and a ``string`` for ``$subtype`` and a ``bool`` for ``$validate_can_edit``
fr: ``elgg_entity_gatekeeper()`` requiert désormais un ``int`` pour ``$guid``, un ``string`` pour ``$type``, un ``string`` pour ``$subtype`` et un ``bool`` pour ``$validate_can_edit``
