Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Since bugfix release focus on fixing bugs and not making major changes, themes and plugins should work from bugfix release to bugfix release.
fr: Dans la mesure où les versions correctives de bogues se concentrent sur la correction des bogues et évitent d'apporter des changements majeurs, les thèmes et les plugins doivent fonctionner de version corrective en version corrective.

source: Minor/Feature Releases (2.x.0)
fr: Versions mineures/fonctionnalités (2.x.0)

source: Every three months.
fr: Tous les trois mois.

source: Whenever we introduce new features, we'll bump the middle version number. These releases aren't as mature as bugfix release, but are considered stable and useable.
fr: Chaque fois que nous introduisons de nouvelles fonctionnalités, nous incrémentons le numéro de version du milieu. Ces versions ne sont pas aussi matures que les correctifs, mais sont considérées comme stables et utilisables.

source: We make every effort to be backward compatible in these releases, so plugins should work from minor release to minor release.
fr: Nous faisons tous les efforts possibles pour être rétrocompatibles dans ces versions, de sorte que les plugins devraient fonctionner de version mineure en version mineure.

source: However, plugins might need to be updated to make use of the new features.
fr: Toutefois, les plugins pourraient devoir être mis à jour pour utiliser les nouvelles fonctionnalités.

source: Major/Breaking Releases (x.0.0)
fr: Versions Majeures / de rupture (x.0.0)

source: Every year.
fr: Chaque année.

source: Inevitably, improving Elgg requires breaking changes and a new major release is made. These releases are opportunities for the core team to make strategic, breaking changes to the underlying platform. Themes and plugins from older versions are not expected to work without modification on different major releases.
fr: Inévitablement, l’amélioration de Elgg nécessite des changements non rétro-compatibles et une nouvelle version majeure est alors publiée. Ces versions sont des occasions pour l’équipe de base d’apporter des changements stratégiques et de rupture à la plateforme sous-jacente. Les thèmes et les plugins des anciennes versions ne sont pas censés fonctionner sans modification sur les différentes versions majeures.

source: We may remove deprecated APIs, but we will not remove APIs without first deprecating them.
fr: Nous pouvons supprimer des APIs obsolètes, mais nous ne supprimerons pas d'APIs sans les avoir d'abord dépréciées.

source: Elgg's dependencies may be upgraded by their major version or removed entirely. We will not remove any dependences before a major release, but we do not "deprecate" dependencies or issue any warnings before removing them.
fr: Les dépendances de Elgg peuvent être mises à niveau par leur version majeure ou supprimées entièrement. Nous ne supprimerons pas de dépendance avant une version majeure, mais nous ne rendons pas obsolète - "deprecate" - les dépendances ou ou n’émettons pas d'avertissement avant de les supprimer.

source: Your package, plugin, or app should declare its own dependencies directly so that this does not cause a problem.
fr: Votre package, plugin ou application doit déclarer ses propres dépendances directement afin que cela ne cause pas de problème.

source: Alphas, Betas, and Release Candidates
fr: Versions Alphas, Betas, et candidates RC - Release Candidates

source: Before major releases (and sometimes before feature releases), the core team will offer a pre-release version of Elgg to get some real-world testing and feedback on the release. These are meant for testing only and should not be used on a live site.
fr: Avant les versions majeures (et parfois avant les versions de fonctionnalités), l’équipe du noyau offrira une pré-version de Elgg pour obtenir des tests et des commentaires dans le monde réel sur la version. Ces versions sont destinées à des tests seulement et ne doivent pas être utilisées sur un site en production.

source: SemVer 2.0 does not define a particular meaning for pre-releases, but we approach alpha, beta, and rc releases with these general guidelines:
fr: SemVer 2.0 ne définit pas de signification particulière pour les pré-versions, mais nous abordons les versions alpha, bêta et rc avec ces indications générales :

source: An ``-alpha.X`` pre-release means that there are still breaking changes planned, but the feature set of the release is frozen. No new features or breaking changes can be proposed for that release.
fr: Une pré-version ``-alpha-X`` signifie qu’il y a encore des modifications de rupture prévues, mais l’ensemble des fonctionnalités de la version est gelé. Aucune nouvelle fonctionnalité ou modification de rupture ne peut être proposée pour cette version.

source: A ``-beta.X`` pre-release means that there are no known breaking changes left to be included, but there are known regressions or critical bugs left to fix.
fr: Une pré-version ``-beta.X`` signifie qu’il n’y a plus de modification de rupture connue à inclure, mais qu'il reste des régressions connues ou des bogues critiques à corriger.

source: An ``-rc.X`` pre-release means that there are no known regressions or critical bugs left to be fixed. This version could become the final stable version of Elgg if no new blockers are reported.
fr: Une pré-version ``-rc.X`` signifie qu’il n’y a plus de régression connue ou de bogue critique à corriger. Cette version pourrait devenir la version stable finale de Elgg si aucun nouveau blocage n’est signalé.

source: Backwards compatibility
fr: Rétro-compatibilité

source: Some parts of the system need some additional clarification if we are talking about being backwards compatible. Everything that is considered public API needs to adhere to the backwards compatibility rules that are part of `semantic versioning`_.
fr: Certaines parties du système ont besoin de clarifications supplémentaires si nous voulons être rétro-compatibles. Tout ce qui est considéré comme une API publique doit respecter les règles de rétro-compatibilité qui font partie du `versionnage sémantique`_.

source: Classes and functions
fr: Classes et fonctions

source: Classes and functions marked with ``@internal`` are not considered part of the public API and can be changed / removed at any time. If a class is marked with ``@internal`` all properties and methods in that class are considered private API and therefor can be changed / removed at any time.
fr: Les classes et fonctions marquées ``@internal`` ne sont pas considérées comme faisant partie de l’API publique et peuvent être modifiées/supprimées à tout moment. Si une classe est marquée ``@internal``, toutes les propriétés et méthodes de cette classe sont considérées comme une API privée et peuvent être modifiées/supprimées à tout moment.

source: Event callbacks
fr: Gestionnaires d'événements

source: All event callbacks should never be called directly but only be called by triggering the event.
fr: Tous les rappels d'événement ne doivent jamais être appelés directement mais uniquement en déclenchant l'événement.

source: The name of the callback function is considered API as plugin developers need to be able to rely on the fact that they can (un)register a callback. This only applies if the callback still serves the same purpose. If a callback becomes obsolete its allowed to be removed from the system.
fr: Le nom de la fonction de rappel est considéré comme une API dans le sens où les développeurs de plugins doivent être en mesure de compter sur le fait qu’ils peuvent (dé-)enregistrer une fonction de rappel. Ceci ne s’applique que si la fonction de rappel sert toujours le même but. Si une fonction de rappel devient obsolète, elle peut être supprimée du système.

source: Exceptions to these rules are the callback functions related to the following ``system`` events, these callbacks can be renamed / removed at any time.
fr: Les exceptions à ces règles sont les fonctions de rappel liées aux événements ``system``, ces fonctions de rappel peuvent être renommées / supprimées à tout moment.

source: Test suite
fr: Suite de tests

source: The Elgg PHPUnit test suite files are not considered part of the public API and can be changed / removed at any time.
fr: Les fichiers de la suite de tests Elgg PHPUnit ne sont pas considérés comme faisant partie de l'API publique et peuvent être modifiés/supprimés à tout moment.

source: Views
fr: Vues

source: View names are API.
fr: Les noms de vue sont des APIs.

source: View arguments ($vars array) are API.
fr: Les arguments de la vue (tableau $vars) sont des API.

source: Removing views or renaming views follows API deprecation policies.
fr: La suppression de vues ou le changement de nom de vues suit les stratégies de dépréciation de l’API.

source: Adding new views requires a minor version change.
fr: L’ajout de nouvelles vues nécessite une modification mineure de la version.

source: View output is not API and can be changed between patch releases.
fr: La sortie des vues n’est pas une API et peut être modifiée entre deux versions de correctifs.

source: Roadmap
es: Plan
fr: Feuille de route

source: What direction is the project going? What exciting new features are coming soon?
es: ¿En qué dirección va el proyecto? ¿Qué nuevas y emocionantes funcionalidades podemos esperar a corto plazo?
fr: Dans quelle direction va le projet ? Quelles nouvelles fonctionnalités passionnantes sont à venir bientôt ?

source: We do not publish detailed roadmaps, but it’s possible to get a sense for our general direction by utilizing the following resources:
es: No publicamos planes detallados, pero los siguientes recursos le permitirán hacerse una idea de la dirección que estamos siguiendo:
fr: Nous ne publions pas de feuilles de route détaillées, mais il est possible d’avoir une idée de notre orientation générale en utilisant les ressources suivantes :

source: Our `feedback and planning group`_ is used to host early discussion about what will be worked on next.
es: En nuestro `grupo de retroalimentación y planificación`_ tienen lugar las discusiones iniciales sobre aquello en lo que pensamos trabajar a continuación.
fr: Notre groupe de feedback et de planification `feedback and planning group`_ est utilisé pour accueillir des discussions préliminaires sur les travaux à venir.

source: Our `Github milestones`_ represent a general direction for the future releases of Elgg. This is the closest thing to a traditional roadmap that we have.
es: Nuestros`hitos en Github`_ representan la dirección general para las versiones futuras de Elgg. Es lo más parecido que tenemos a un plan tradicional.
fr: Nos `jalons Github`_ - "milestones" - représentent une orientation générale pour les futures versions de Elgg. C’est la chose la plus proche d’une feuille de route traditionnelle que nous avons.

source: `Github pull requests`_ will give you a good idea of what’s currently being developed, but nothing is sure until the PR is actually checked in.
es: Las `solicitudes de integración de cambios de Github`_ le indicarán en qué se está trabajando en estos momentos, pero nada es completamente seguro hasta que no se aceptan las solicitudes.
fr: Les `pull requests sur Github`_ vous donneront une bonne idée de ce qui est en cours de développement, mais rien n’est sûr tant que la PR n'est pas effectivement enregistrée.

source: We use the `developer blog`_ to post announcements of features that have recently been checked in to our development branch, which gives the surest indication of what features will be available in the next release.
es: Usamos el `blog de desarrollo`_ para publicar anuncios de funcionalidades que se han añadido recientemente en la rama de desarrollo. Se trata de la información más fiable disponible sobre nuevas funcionalidades que estarán disponibles en la siguiente versión.
fr: Nous utilisons le `developer blog`_ pour publier les annonces de fonctionnalités qui ont récemment été ajoutées dans notre branche de développement, et qui donne l’indication la plus sûre sur quelles fonctionnalités seront disponibles dans la prochaine version.

source: Values
es: Objetivos y valores
fr: Valeurs

source: We have several overarching goals/values that affect the direction of Elgg. Enhancements generally must promote these values in order to be accepted.
es: Tenemos una serie de objetivos y valores globales que afectan a la dirección de Elgg. Las mejoras deben promover en general estos valores para que las aceptemos.
fr: Nous avons plusieurs objectifs/valeurs généraux qui affectent les orientations prises par Elgg. Les améliorations doivent généralement promouvoir ces valeurs afin d’être acceptées.

source: Accessibility
es: Accesibilidad
fr: Accessibilité

source: Elgg-based sites should be usable by anyone anywhere. That means we'll always strive to make Elgg:
es: Los sitios basados en Elgg debería poder utilizarlos cualquiera. Eso significa que lucharemos por hacer de Elgg una plataforma:
fr: Les sites basés sur Elgg devraient être utilisables par n’importe qui n’importe où. Cela signifie que nous nous efforcerons toujours de rendre Elgg :

source: Device-agnostic -- mobile, tablet, desktop, etc. friendly
es: Para cualquier dispositivo — fácil de usar desde móviles, tabletas, equipos de escritorio, etc.
fr: Indépendant de l'appareil - compatible mobile, tablette, ordinateur de bureau, etc.

source: Language-agnostic -- i18n, RTL, etc.
es: Para cualquier idioma — internacionalización, idiomas que se leen de derecha a izquierda, etc.
fr: Multilingue -- i18n, RTL, etc.

source: Capability-agnostic -- touch, keyboard, screen-reader friendly
es: Para cualquier capacidad — para utilizar mediante tacto, teclado, lectores de pantalla, etc.
fr: Indépendant de la capacité -- compatible tactile, clavier, lecteur d’écran

source: Testability
es: Pruebas
fr: Testabilité

source: We want to **make manual testing unnecessary** for core developers, plugin authors, and site administrators by promoting and enabling fast, automated testing at every level of the Elgg stack.
es: Queremos **hacer innecesarias las pruebas manuales** por parte del equipo principal de desarrollo, de los creadores de complementos y de los administradores de sitios. Para ello promovemos y ayudamos a elaborar pruebas rápidas y automáticas para todos los aspectos de Elgg.
fr: Nous voulons **rendre les tests manuels inutiles** pour les développeurs du noyau, les auteurs de plugins, et les administrateurs de sites en faisant la promotion et en permettant des tests rapides et automatisés à tous les niveaux de la pile Elgg.

source: We think APIs are broken if they require plugin authors to write untestable code. We know there are a lot of violations of this principle in core currently and are working to fix it.
es: Consideramos que las API no están bien si obligan a los desarrolladores de complementos a escribir código que no se puede probar. Somos conscientes de que existen un gran número de casos en los que no se cumple con este principio, pero estamos trabajando en ello.
fr: Nous estimons que les API sont cassées si elles exigent des auteurs de plugins d’écrire du code non testable. Nous savons qu’il y a beaucoup de violations de ce principe dans le noyau actuellement et nous travaillons à les corriger.

source: We look forward to a world where the core developers do not need to do any manual testing to verify the correctness of code contributed to Elgg. Similarly, we envision a world where site administrators can upgrade and install new plugins with confidence that everything works well together.
es: Esperamos que llegue el día en que los desarrolladores principales no necesiten hacer pruebas manuales para verificar que todo el código contribuido a Elgg está bien. De manera similar, nuestra visión incluye un mundo en el que los administradores de sitios pueden actualizar e instalar complementos nuevos con la confianza de que todo funciona correctamente en conjunto.
fr: Nous visons un monde dans lequel les développeurs du noyau n'ont pas besoin de faire de tests manuels pour vérifier la validité du code contribué à Elgg. De manière similaire, nous envisageons un monde dans lequel les administrateurs de site peuvent mettre à niveau et installer de nouveaux plugins avec la certitude que tout fonctionnera bien ensemble.

source: TODO: other goals/values?
es: Pendiente: ¿otros objetivos o valores?
fr: TODO : d’autres objectifs/valeurs ?

source: When will feature X be implemented?
es: ¿Cuando se añadirá la funcionalidad «x»?
fr: Quand la fonctionnalité X sera-t-elle implémentée ?

source: We cannot promise when features will get implemented because new features are checked into Elgg only when someone is motivated enough to implement the feature and submit a pull request. The best we can do is tell you to look out for what features existing developers have expressed interest in working on.
es: No podemos hacer promesas sobre cuándo se añadirán qué funcionalidades porque a Elgg sólo se le añaden nuevas funcionalidades cuando una persona está lo suficientemente motivada para trabajar en ellas y enviar una solicitud de integración de cambios. Lo único que podemos hacer es sugerirle que intente averiguar en qué funcionalidades han mostrado los desarrolladores existentes su deseo de trabajar.
fr: Nous ne pouvons pas promettre quand les fonctionnalités seront mises en œuvre parce que les nouvelles fonctionnalités sont ajoutées dans Elgg seulement quand quelqu’un est suffisamment motivé pour implémenter la fonctionnalité et soumettre une demande de fusion. Le mieux que nous puissions faire est de vous dire de regarder pour quelles fonctionnalités les développeurs existants ont exprimé leur intérêt pour travailler dessus.

source: The best way to ensure a feature gets implemented is to discuss it with the core team and implement it yourself. See our :doc:`/contribute/index` guide if you're interested. We love new contributors!
fr: La meilleure façon de s’assurer qu’une fonctionnalité est implémentée est d’en discuter avec l’équipe du noyau et de la mettre en œuvre vous-même. Consultez notre guide :doc:`/contribute/index` si vous êtes intéressé. Nous adorons les nouveaux contributeurs !

source: Do not rely on future enhancements if you're on the fence as to whether to use Elgg. Evaluate it given the current feature set. Upcoming features will almost certainly not materialize within your timeline.
es: Si está intentando decidir si usar o no Elgg, no se decida por Elgg en base a funcionalidades que aún no están disponibles. Evalúe Elgg por sus funcionalidades actuales. Lo más probable es que las funcionalidades futuras no estén listas para cuando usted las necesite.
fr: Ne comptez pas sur les améliorations futures si vous hésitez à utiliser Elgg. Évaluez le logiciel compte tenu de l’ensemble de fonctionnalités existantes. Les fonctionnalités à venir ne se réaliseront certainement pas à temps dans votre calendrier.

source: When is version X.Y.Z going to be released?
es: ¿Cuando publicáis la versión X.Y.Z?
fr: Quand est-ce que la version X.Y.Z sera publiée ?

source: The next version will be released when the core team feels it's ready and has time to cut the release. http://github.com/Elgg/Elgg/issues/milestones will give you some rough ideas of timeline.
es: La siguiente versión se publicará cuando el equipo principal de desarrollo considere que está lista y dispone de tiempo para prepararla. La información de http://github.com/Elgg/Elgg/issues/milestones debería darle una idea aproximada de los tiempos.
fr: La prochaine version sera publiée lorsque l’équipe du noyau se sentira prête et aura le temps de publier la version. http://github.com/Elgg/Elgg/issues/milestones vous donnera une idée générale de la chronologie.

source: Support policy
fr: Politique de support

source: As of Elgg 2.0, each minor release receives bug and security fixes only until the next minor release.
fr: À partir de Elgg 2.0, chaque version mineure reçoit des corrections de bogue et de sécurité jusqu’à la prochaine version mineure.

source: Long Term Support Releases
fr: Versions LTS supportées sur le long terme - Long Term Support

source: Within each major version, the last minor release is designated for long term support ("LTS") and will receive bug fixes until 1 year after the release of the next major version and security fixes until the 2nd following major version release.
fr: Au sein de chaque version majeure, la dernière version mineure est désignée pour le support à long terme ("LTS" pour Long Term Support) et recevra des correctifs de bogues jusqu’à 1 an après la sortie de la prochaine version majeure, et des correctifs de sécurité jusqu’à la 2ème version majeure suivante.

source: E.g. 2.3 is the last minor release within 2.x. It will receive bug fixes until 1 year aftr 3.0 is released and security fixes until 4.0 is released.
fr: Par ex., 2.3 est la dernière version mineure dans les 2.x. Elle recevra des correctifs de bogues jusqu’à 1 an après que la version 3.0 a été publiée, et les correctifs de sécurité jusqu’à ce que la version 4.0 soit publiée.

source: When bugs are found, a good faith effort will be made to patch the LTS release, but **not all fixes will be back-ported.** E.g. some fixes may depend on new APIs, break backwards compatibility, or require significant refactoring.
fr: Lorsque des bogues sont trouvés, un effort de bonne foi sera fait pour corriger la publication de la version LTS, mais **tous les correctifs ne seront pas rétro-portés.** Par ex., certains correctifs peuvent dépendre de nouvelles API, rompre la rétro-compatibilité, ou nécessiter une refactorisation significative.

source: If a fix risks stability of the LTS branch, it will not be included.
fr: Si un correctif risque de compromettre la stabilité de la branche LTS, il ne sera pas inclus.

source: Security issues
fr: Problèmes de sécurité

source: When a security issue is found every effort will be made to patch the LTS release.
fr: Lorsqu’un problème de sécurité est constaté, tous les efforts seront faits pour corriger la version LTS.

source: Please report any security issue to **security @ elgg . org**
fr: Veuillez signaler tout problème de sécurité à **security @ elgg . org**

source: Timeline
fr: Chronologie

source: Below is a table outlining the specifics for each release (future dates are tentative):
fr: Vous trouverez ci-dessous un tableau décrivant les détails de chaque version (les dates futures sont provisoires) :

source: First stable release
fr: Première publication stable

source: Bug fixes through
fr: Corrections de bogues à travers

source: Security fixes through
fr: Correctifs de sécurité à travers

source: July 2015
fr: Juillet 2015

source: April 2019
fr: Avril 2019

source: December 2015
fr: Décembre 2015

source: March 2016
fr: Mars 2016

source: June 2016
fr: Juin 2016

source: November 2016
fr: Novembre 2016

source: April 2020
fr: Avril 2020

source: September 2021
fr: Septembre 2021

source: July 2019
fr: Juillet 2019

source: October 2019
fr: Octobre 2019

source: January 2020
fr: Janvier 2020

source: September 2022
fr: Septembre 2022

source: June 2023
fr: Juin 2023

source: January 2022
fr: Janvier 2022

source: April 2022
fr: Avril 2022

source: July 2022
fr: Juillet 2022

source: June 2024
fr: Juin 2024

source: October 2023
fr: Octobre 2023

source: June 2025
fr: Juin 2025

source: **Until 7.0**
fr: **Jusqu'à la 7.0**

source: TBD
fr: A FAIRE

source: Upgrade Notes
fr: Notes de mise à niveau

source: If you are upgrading your plugins and website to a new major Elgg releases, the following noteworthy changes apply.
fr: Si vous mettez à niveau vos plugins et votre site Web vers une nouvelle version majeure de Elgg, les modifications notables suivantes s’appliquent.
