Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: The registration process can be changed through a plugin. Everything about registration can be changed: the look and feel, different registration fields, additional validation of the fields, additional steps and so on. These types of changes require some basic knowledge of HTML, CSS, PHP.
fr: Le processus d'inscription peut être modifié par un plugin. Tout ce qui concerne l'inscription peut être modifié : l'apparence du formulaire, des champs d'inscription différents, des validations additionnelles des champs, des étapes additionnelles, et ainsi de suite. Ces types de changements demandent quelques connaissances de base en HTML, CSS, PHP.

source: Another option is to use the `Profile Manager`_ plugin that lets you add fields to both user profiles and the registration form.
fr: Une autre option est d'utiliser le plugin `Profile Manager`_ qui vous permet d'ajouter des champs à la fois aux profils des utilisateurs et au formulaire d'inscription.

source: Create the plugin skeleton
fr: Créez le squelette du plugin

source: Changing registration display
fr: Modification de l'apparence de l'inscription

source: Override the ``account/forms/register`` view
fr: Surchargez la vue ``account/forms/register``

source: Changing the registration action handler
fr: Modification du gestionnaire de l'action d'inscription

source: You can write your own action to create the user's account
fr: Vous pouvez écrire votre propre action pour créer le compte utilisateur

source: How do I change PHP settings using .htaccess?
fr: Comment puis-je modifier les paramètres PHP en utilisant .htaccess ?

source: You may want to change php settings in your ``.htaccess`` file. This is especially true if your hosting provider does not give you access to the server's ``php.ini`` file. The variables could be related to file upload size limits, security, session length, or any number of other php attributes. For examples of how to do this, see the `PHP documentation`_ on this.
fr: Vous pouvez modifier les paramètres php dans votre fichier ``.htaccess``. Cela est particulièrement vrai si votre fournisseur d’hébergement ne vous donne pas accès au fichier ``php.ini`` du serveur. Les variables peuvent être associées aux limites de téléchargement de fichiers, à la sécurité, à la longueur de la session, ou à n’importe quel nombre d’autres attributs php. Pour des exemples sur comment faire cela, voyez la `documentation PHP`_ à ce sujet.

source: HTTPS login turned on accidently
fr: Connexion via HTTPS activée par erreur

source: If you have turned on HTTPS login but do not have SSL configured, you are now locked out of your Elgg install. To turn off this configuration parameter, you will need to edit your database. Use a tool like phpMyAdmin to view your database. Select the ``config`` table and delete the row that has the name ``https_login``.
fr: Si vous avez activé la connexion HTTPS mais que vous n’avez pas configuré SSL, vous êtes maintenant bloqué hors de votre installation Elgg. Pour désactiver ce paramètre de configuration, vous devrez modifier votre base de données. Utilisez un outil comme phpMyAdmin pour afficher votre base de données. Sélectionnez la table ``config`` et supprimez la ligne qui a le nom ``https_login``.

source: Using a test site
fr: Utiliser un site de test

source: It is recommended to always try out new releases or new plugins on a test site before running them on a production site (a site with actual users). The easiest way to do this is to maintain a separate install of Elgg with dummy accounts. When testing changes it is important to use dummy accounts that are not admins to test what your users will see.
fr: Il est recommandé de toujours tester les nouvelles versions ou les nouveaux plugins sur un site de test avant de les exécuter sur un site de production (un site avec des utilisateurs réels). La façon la plus simple de le faire est de maintenir une installation séparée de Elgg avec des comptes factices. Lors des tests, il est important d’utiliser des comptes factices qui ne sont pas des administrateurs pour tester ce que vos utilisateurs verront.

source: A more realistic test is to mirror the content from your production site to your test site. Following the instructions for :doc:`duplicating a site </admin/duplicate-installation>`. Then make sure you prevent emails from being sent to your users. You could write a small plugin that redirects all email to your own account (be aware of plugins that include their own custom email sending code so you'll have to modify those plugins). After this is done you can view all of the content to make sure the upgrade or new plugin is functioning as desired and is not breaking anything. If this process sounds overwhelming, please stick with running a simple test site.
fr: Un test plus réaliste consiste à refléter le contenu de votre site de production sur votre site de test. Suivez les instructions pour :doc:`dupliquer un site </admin/duplicate-installation>`. Assurez-vous ensuite d’empêcher l’envoi d’e-mails à vos utilisateurs. Vous pouvez écrire un petit plugin qui redirige tous les e-mails vers votre propre compte (soyez conscient des plugins qui comprennent leur propre code d’envoi d'e-mail personnalisé, car vous devrez modifier ces plugins). Une fois cela fait, vous pouvez afficher tout le contenu pour s’assurer que la mise à niveau ou le nouveau plugin fonctionne comme vous le souhaitez et ne casse rien. Si ce processus vous semble trop lourd, veuillez vous en tenir à l’exécution d’un site de test simple.

source: What is it?
fr: Qu'est-ce que c'est ?

source: A **500 - Internal Server Error** means the web server experienced a problem serving a request.
fr: Une erreur interne du serveur **500 - Internal Server Error** signifie que le serveur web a rencontré un problème en servant une requête.

source: `The Wikipedia page on HTTP status codes <https://en.wikipedia.org/wiki/List_of_HTTP_status_codes#5xx_Server_Error>`_
fr: `La page Wikipédia sur les codes de statut HTTP <https://fr.wikipedia.org/wiki/Liste_des_codes_HTTP#5xx_-_Erreur_du_serveur_/_du_serveur_d'application>`_

source: Possible causes
fr: Causes possibles

source: Web server configuration
fr: Configuration du serveur web

source: The most common cause for this is an incorrectly configured server. If you edited the ``.htaccess`` file and added something incorrect, Apache will send a 500 error.
fr: La cause la plus fréquente pour cela est un serveur mal configuré. Si vous avez modifié le fichier ``.htaccess`` et ajouté quelque chose d’incorrect, Apache renverra une erreur 500.

source: Permissions on files
fr: Permissions sur les fichiers

source: It could also be a permissions problem on a file. Apache needs to be able to read Elgg's files. Using permissions 755 on directories and 644 on files will allow Apache to read the files.
fr: Il peut également s’agir d’un problème de permissions sur un fichier. Apache doit pouvoir lire les fichiers de Elgg. L’utilisation des autorisations 755 sur les répertoires et 644 sur les fichiers permettra à Apache de lire les fichiers.

source: When I upload a photo or change my profile picture I get a white screen
fr: Lorsque je télécharge une photo ou que je modifie ma photo de profil, j'obtiens un écran blanc

source: Most likely you don't have the PHP GD library installed or configured properly. You may need assistance from the administrator of your server.
fr: Il est fort probable que la bibliothèque PHP GD n’est pas installée ou configurée correctement. Vous pourriez avoir besoin de l’aide de l’administrateur de votre serveur.

source: CSS is missing
fr: CSS manquant

source: Wrong URL
fr: Mauvaise URL

source: Sometimes people install Elgg so that the base URL is ``localhost`` and then try to view the site using a hostname. In this case, the browser won't be able to load the CSS file. Try viewing the source of the web page and copying the link for the CSS file. Paste that into your browser. If you get a 404 error, it is likely this is your problem. You will need to change the base URL of your site.
fr: Parfois, les gens installent Elgg de sorte que l’URL de base est ``localhost`` et essaient ensuite d’afficher le site à l’aide d’un nom d’hôte. Dans ce cas, le navigateur ne pourra pas charger le fichier CSS. Essayez d’afficher la source de la page Web et de copier le lien du fichier CSS. Collez-le dans votre navigateur. Si vous obtenez une erreur 404, il est probable que c’est votre problème. Vous devrez modifier l’URL de base de votre site.

source: Syntax error
fr: Erreur de syntaxe

source: Elgg stores its CSS as PHP code to provide flexibility and power. If there is a syntax error, the CSS file served to the browser may be blank. Disabling non-bundled plugins is the recommended first step.
fr: Elgg stocke ses CSS sous forme de code PHP pour fournir flexibilité et puissance. S’il y a une erreur de syntaxe, le fichier CSS servi au navigateur peut être vide. La désactivation des plugins tierce partie est la première étape recommandée.

source: Rewrite rules errors
fr: Erreurs de règles de réécriture d'URL - Rewrite rules

source: A bad ``.htaccess`` file could also result in a 404 error when requesting the CSS file. This could happen when doing an upgrade and forgetting to also upgrade ``.htaccess``.
fr: Un mauvais fichier ``.htaccess`` peut également entraîner une erreur 404 lors de la requête du fichier CSS. Cela pourrait se produire lors d’une mise à niveau si vous oubliez de mettre également à niveau le fichier ``.htaccess``.

source: Should I edit the database manually?
fr: Devrais-je modifier la base de données manuellement ?

source: No, you should never manually edit the database!
fr: Non, vous ne devriez jamais modifier manuellement la base de données !

source: Will editing the database manually break my site?
fr: Est-ce que modifier manuellement la base de données va casser mon site ?

source: Yes.
fr: Oui.

source: Can I add extra fields to tables in the database?
fr: Est-ce que je peux ajouter des champs supplémentaires aux tables dans la base de données ?

source: (AKA: I don't understand the Elgg :doc:`data model </design/database>` so I'm going to add columns. Will you help?)
fr: (CÀD : Je ne comprends pas le :doc:`modèle de données </design/database>` de Elgg donc je vais ajouter des colonnes. Est-ce que vous allez m'aider ?)

source: No, this is a bad idea. Learn the :doc:`data model </design/database>` and you will see that unless it's a very specific and highly customized installation, you can do everything you need within Elgg's current data model.
fr: Non, c'est une mauvaise idée. Étudiez le modèle de données :doc:`data model </design/database>` et vous verrez qu'à moins que ce soit une installation très spécifique et hautement personnalisée, vous pouvez faire tout ce que vous voulez avec le modèle de données actuel de Elgg.

source: I want to remove users. Can't I just delete them from the elgg_entities table?
fr: Je veux supprimer des utilisateurs. Est-ce que je ne peux pas les supprimer directement de la table elgg_entities ?

source: No, it will corrupt your database. Delete them through the site.
fr: Non, cela va corrompre votre base de données. Supprimez-les via le site.

source: I want to remove spam. Can't I just search and delete it from the elgg_entities table?
fr: Je veux supprimer du spam. Est-ce que je ne peux pas juste le rechercher et le supprimer dans la table elgg_entities ?

source: No, it will corrupt your database. Delete it through the site.
fr: Non, cela va corrompre votre base de données. Supprimez-le via le site.

source: Someone on the community site told me to edit the database manually. Should I?
fr: Quelqu'un sur le site communautaire m'a dit de modifier manuellement la base de données. Est-ce que je devrais le faire ?

source: Who was it? Is it someone experienced with Elgg, like one of the core developers or a well-known plugin author? Did he or she give you clear and specific instructions on what to edit? If you don't know who it is, or if you can't understand or aren't comfortable following the instructions, do not edit the database manually.
fr: Qui étais-ce ? Est-ce quelqu'un d'expérimenté avec Elgg, comme l'un des développeurs du noyau ou un auteur de plugins bien connu ? Est-ce qu'il ou elle vous a donné des instructions claires sur quoi modifier ? Si vous ne savez pas qui c'est, ou si vous ne comprenez pas ou n'êtes pas à l'aise avec ces instructions, ne modifiez pas la base de données manuellement.

source: I know PHP and MySQL and have a legitimate reason to edit the database. Is it okay to manually edit the database?
fr: Je connais PHP et MySQL et ai une raison légitime de modifier la base de données. Est-ce OK de modifier manuellement la base de données ?

source: Make sure you understand Elgg's :doc:`data model </design/database>` and schema first. Make a backup, edit carefully, then test copiously.
fr: Assurez-vous d'abord de bien comprendre le :doc:`modèle de données </design/database>` de Elgg et le schéma. Faites un backup, modifiez avec soin, puis testez généreusement.

source: Internet Explorer (IE) login problem
fr: Problème de connexion d'Internet Explorer (IE)

source: Canonical URL
fr: URL canonique

source: IE does not like working with sites that use both http://example.org and http://www.example.org. It stores multiple cookies and this causes problems. Best to only use one base URL. For details on how to do this see Login token mismatch error.
fr: IE n’aime pas travailler avec des sites qui utilisent à la fois http://example.org et http://www.example.org. Il stocke plusieurs cookies et cela cause des problèmes. Il est préférable d’utiliser une seule URL de base. Pour plus d’informations sur la façon de le faire, voyez l'erreur "Login token mismatch error" - erreur de correspondance des jetons de connexion.

source: Chrome Frame
fr: Cadre Chrome

source: Using the chrome frame within IE can break the login process.
fr: Utiliser le cadre Chrome au sein de IE peut rompre le processus d'authentification.

source: Emails don't support non-Latin characters
fr: Les e-mails ne supportent pas les caractères non-latins

source: In order to support non-Latin characters, (such as Cyrillic or Chinese) Elgg requires `multibyte string support`_ to be compiled into PHP.
fr: Pour prendre en charge les caractères non-latins, (tels que Cyrilliques ou Chinois) Elgg a besoin du support des chaînes de caractère multibyte `multibyte string support`_ soit compilé dans PHP.

source: On many installs (e.g. Debian & Ubuntu) this is turned on by default. If it is not, you need to turn it on (or recompile PHP to include it). To check whether your server supports multibyte strings, check `phpinfo`_.
fr: Sur de nombreuses installations (par ex. Debian & Ubuntu), c'est activé par défaut. Si ce n’est pas le cas, vous devez l’activer (ou recompiler PHP pour l’inclure). Pour vérifier si votre serveur prend en charge les chaînes multioctets - multibyte -, vérifiez `phpinfo`_.

source: Session length
fr: Durée de session

source: Session length is controlled by your php configuration. You will first need to locate your ``php.ini`` file. In that file will be several session variables. A complete list and what they do can be found in the `php manual`_.
fr: La durée de la session est contrôlée par votre configuration php. Vous devrez d’abord localiser votre fichier ``php.ini``. Dans ce fichier vous trouverez plusieurs variables de session. Une liste complète et ce qu’elles font peuvent être trouvée dans le `manuel de php`_.

source: File is missing an owner
fr: Un fichier n'a pas de propriétaire

source: There are three causes for this error. You could have an entity in your database that has an ``owner_guid`` of ``0``. This should be extremely rare and may only occur if your database/server crashes during a write operation.
fr: Il y a trois causes à cette erreur. Vous pourriez avoir une entité dans votre base de données qui a un ``owner_guid`` de ``0``. Cela devrait être extrêmement rare et ne peut se produire que si votre base de données/serveur plante lors d’une opération d’écriture.

source: The second cause would be an entity where the owner no longer exists. This could occur if a plugin is turned off that was involved in the creation of the entity and then the owner is deleted but the delete operation failed (because the plugin is turned off). If you can figure out entity is causing this, look in your ``entities`` table and change the ``owner_guid`` to your own and then you can delete the entity through Elgg.
fr: La deuxième cause serait une entité où le propriétaire n’existe plus. Cela peut se produire si un plugin désactivé a été impliqué dans la création de l’entité, puis que le propriétaire est supprimé, mais l’opération de suppression a échoué (parce que le plugin est désactivé). Si vous pouvez comprendre quelle entité est à l’origine de cette situation, regardez dans votre table ``entities`` et modifiez le ``owner_guid`` pour le vôtre, puis vous pouvez supprimer l’entité via Elgg.

source: Reed the section "Should I edit the database manually?". Be very carefull when editing the database directly. It can break your site. **Always** make a backup before doing this.
fr: Lisez la section "Devrais-je modifier la base de données manuellement ?". Soyez très prudent lors de l’édition directe de la base de données. Cela peut briser votre site. Faites **toujours** une sauvegarde avant de faire cela.

source: Fixes
fr: Corrections

source: `Database Validator`_ plugin will check your database for these causes and provide an option to fix them. Be sure to backup the database before you try the fix option.
fr: Le plugin `Database Validator`_ vérifiera votre base de données pour ces causes et vous fournira une option pour les corriger. Assurez-vous de sauvegarder la base de données avant d’essayer l’option de correction.

source: No images
fr: Pas d'image

source: If profile images, group images, or other files have stopped working on your site it is likely due to a misconfiguration, especially if you have migrated to a new server.
fr: Si des images de profil, des images de groupe ou d’autres fichiers ont cessé de fonctionner sur votre site, il est probable qu’il s’agit d’une mauvaise configuration, surtout si vous avez migré vers un nouveau serveur.

source: These are the most common misconfigurations that cause images and other files to stop working.
fr: Ce sont les erreurs de configuration les plus courantes qui bloquent le fonctionnement des images et d’autres fichiers.

source: Wrong path for data directory
fr: Mauvais chemin pour le répertoire des données

source: Make sure the data directory's path is correct in the Site Administration admin area. It should have a trailing slash.
fr: Assurez-vous que le chemin d’accès au répertoire des données est correct dans la zone d’administration du site. Il devrait avoir un slash à la fin.

source: Wrong permissions on the data directory
fr: Mauvaises permissions sur le répertoire des données

source: Check the permissions for the data directory. The data directory should be readable and writeable by the web server user.
fr: Vérifiez les permissions du répertoire des données. L’utilisateur du serveur web devrait pouvoir lire et écrire dans le répertoire des données.

source: Migrated installation with new data directory location
fr: Installation migrée avec un nouvel emplacement du répertoire des données

source: If you migrated an installation and need to change your data directory path, be sure to update the SQL for the filestore location as documented in the :doc:`/admin/duplicate-installation` instructions.
fr: Si vous avez migré une installation et que vous devez modifier votre chemin d’accès au répertoire des données, assurez-vous de mettre à jour le SQL pour le répertoire de fichiers tel que documenté dans les instructions :doc:`/admin/duplicate-installation`.

source: Deprecation warnings
fr: Avertissements d'obsolescence

source: If you are seeing many deprecation warnings that say things like
fr: Si vous voyez de nombreux avertissements de dépréciation qui disent des choses comme

source: then you are using a plugin that was written for an older version of Elgg. This means the plugin is using functions that are scheduled to be removed in a future version of Elgg. You can ask the plugin developer if the plugin will be updated or you can update the plugin yourself. If neither of those are likely to happen, you should not use that plugin.
fr: alors vous utilisez un plugin qui a été écrit pour une ancienne version de Elgg. Cela signifie que le plugin utilise des fonctions qui vont être supprimées dans une future version de Elgg. Vous pouvez demander au développeur de plugin si le plugin sera mis à jour, ou vous pouvez mettre à jour le plugin vous-même. Si aucune de ces alternatives n'est susceptible de se produire, vous ne devriez pas utiliser ce plugin.

source: Javascript not working
fr: JavaScript ne fonctionne pas

source: If the user hover menu stops working or you cannot dismiss system messages, that means JavaScript is broken on your site. This usually due to a plugin having bad JavaScript code. You should find the plugin causing the problem and disable it. You can do this be disabling non-bundled plugins one at a time until the problem goes away. Another approach is disabling all non-bundled plugins and then enabling them one by one until the problem occurs again.
fr: Si le menu utilisateur qui apparaît au survol cesse de fonctionner ou si vous ne pouvez pas supprimer les messages système, cela signifie que JavaScript est cassé sur votre site. Ceci est généralement dû à un plugin ayant un mauvais code JavaScript. Vous devriez trouver le plugin à l'origine du problème et le désactiver. Vous pouvez le faire en désactivant les plugins tierce partie un par un jusqu’à ce que le problème disparaisse. Une autre approche consiste à désactiver tous les plugins tierce partie, puis à les activer un par un jusqu’à-ce que le problème se reproduise.

source: Most web browsers will give you a hint as to what is breaking the JavaScript code. They often have a console for JavaScript errors or an advanced mode for displaying errors. Once you see the error message, you may have an easier time locating the problem.
fr: La plupart des navigateurs Web vous donneront un indice quant à ce qui casse le code JavaScript. Ils disposent souvent d'une console pour les erreurs JavaScript ou un mode avancé pour afficher les erreurs. Une fois que vous voyez le message d’erreur, il est plus facile de localiser le problème.

source: IP addresses in the logs are wrong
fr: Les adresses IP dans les journaux sont incorrectes

source: When your Elgg installation is behind a proxy server or loadbalancer the IP addresses logged in the System Log plugin can be wrong. It could show only the IP addresses for the proxy server.
fr: Si votre installation Elgg est derrière un serveur proxy ou un équilibreur de charge, les adresses IP enregistrées dans les plugin des journaux système - System Log - peuvent être erronées. Elles pourraient n'indiquer que les adresses IP du serveur proxy.

source: In order to solve this you can configure the IP addresses of the proxy server as a trusted IP address and with that allow the system access to the correct IP address of your users.
fr: Afin de résoudre ceci, vous pouvez configurer les adresses IP du serveur proxy comme adresses IP de confiance, ce qui permettra au système d'accéder aux bonnes IPs de vos utilisateurs.
