Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: PHP 7.1 has reached `end of life`_ in December 2019. To ensure that Elgg sites are secure, we now require PHP 7.2 for new installations.
fr: PHP 7.1 a atteint sa `fin de vie`_ en décembre 2019. Pour assurer la sécurité des sites Elgg, nous demandons maintenant au moins PHP 7.2 pour les nouvelles installations.

source: In order to be able to test Elgg on PHP 7.4 we had to update the PHPUnit testsuite to version 8.5. This may require some rewrites of your own unit/integration tests.
fr: Afin de pouvoir tester Elgg sur PHP 7.4, nous avons dû mettre à jour la suite de test PHPUnit à la version 8.5. Cela peut nécessiter quelques réécritures de vos propres tests d’unité/intégration.

source: Simpler use of 'default' layout
fr: Utilisation plus simple de la disposition 'default'

source: Currently a common pattern is to do the following:
fr: Actuellement, le modèle le plus courant est de faire ce qui suit :

source: We made this kind of pattern simpler. You can now pass an array of layout options to the second parameter of `elgg_view_page`. The `elgg_view_page` function will use this array to wrap it in the 'default' layout. It also adds the page title to the layout.
fr: Nous avons rendu ce genre de modèle plus simple. Vous pouvez maintenant passer un tableau d’options de disposition au deuxième paramètre de `elgg_view_page`. La fonction `elgg_view_page` utilisera ce tableau pour l’envelopper dans la disposition 'default'. Elle ajoute également le titre de la page à la mise en page.

source: The new way to do it is:
fr: La nouvelle manière de le faire est :

source: Deprecated layout names
fr: Noms de disposition dépréciés

source: For an easy transition from Elgg 2.x to 3.x we kept some old layout names ('one_sidebar', 'one_column', 'two_sidebar' and 'content') intact when used in the `elgg_view_layout` function. As of Elgg 3.3 these layout names are deprecated and you should update your code to use the new 'default' layout.
fr: Pour faciliter la transition de Elgg 2.x à 3.x, nous avons gardé certains anciens noms de mise en page ('one_sidebar', 'one_column', 'two_sidebar' et 'content') intacts lorsqu’ils sont utilisés dans la fonction `elgg_view_layout`. À partir de Elgg 3.3, ces noms de disposition sont obsolètes et vous devez mettre à jour votre code pour utiliser la nouvelle disposition 'default'.

source: When changing the use of the 'content' layout name you should take into consideration that the 'content' generates a filter menu. This menu is slightly different from the regular 'filter' menu generated in the 'default' layout. It uses different hook names. If you already disabled the filter in your layout you can change the layout without any issues.
fr: Lorsque vous modifiez l’utilisation du nom de disposition 'content', vous devriez tenir compte du fait que la mise en page 'content' génère un menu de filtre. Ce menu est légèrement différent du menu 'filter' habituel, généré dans la disposition 'default'. Il utilise d'autres noms de hook. Si vous avez déjà désactivé le filtre dans votre disposition, vous pouvez modifier la disposition sans aucun problème.

source: Plugin Manifest changes
fr: Modifications du manifeste du plugin

source: We are working towards the removal of the plugin manifest file. Some features of the manifest will be replaced and some will be dropped. To make this transition a bit easier we have already deprecated the following ``ElggPluginManifest`` api functions:
fr: Nous travaillons à la suppression du fichier de manifeste de plugin. Certaines caractéristiques du manifeste seront remplacées et d’autres seront abandonnées. Pour faciliter un peu cette transition, nous avons déjà déprécié les fonctions suivantes de l'api ``ElggPluginManifest`` :

source: ``getSuggests()`` use suggestions in composer
fr: ``getSuggests()`` utilisez les suggestions dans composer

source: ``elgg_format_attributes()`` use ``elgg_format_element()``
fr: ``elgg_format_attributes()`` utilisez ``elgg_format_element()``

source: ``elgg_flush_caches()`` use ``elgg_clear_caches()``
fr: ``elgg_flush_caches()`` utilisez ``elgg_clear_caches()``

source: ``elgg_get_ordered_event_handlers()`` use ``elgg()->events->getOrderedHandlers()``
fr: ``elgg_get_ordered_event_handlers()`` utilisez ``elgg()->events->getOrderedHandlers()``

source: ``elgg_get_ordered_hook_handlers()`` use ``elgg()->hooks->getOrderedHandlers()``
fr: ``elgg_get_ordered_hook_handlers()`` utilisez ``elgg()->hooks->getOrderedHandlers()``

source: ``elgg_invalidate_simplecache()`` use ``elgg_clear_caches()``
fr: ``elgg_invalidate_simplecache()`` utilisez ``elgg_clear_caches()``

source: ``execute_delayed_write_query()`` use ``elgg()->db->registerDelayedQuery()``
fr: ``execute_delayed_write_query()`` utilisez ``elgg()->db->registerDelayedQuery()``

source: ``execute_delayed_read_query()`` use ``elgg()->db->registerDelayedQuery()``
fr: ``execute_delayed_read_query()`` utilisez ``elgg()->db->registerDelayedQuery()``

source: ``elgg_unset_all_plugin_settings()`` use ``\ElggPlugin::unsetAllSettings()``
fr: ``elgg_unset_all_plugin_settings()`` utilisez ``\ElggPlugin::unsetAllSettings()``

source: ``elgg_get_file_simple_type()`` use ``elgg()->mimetype->getSimpleType()``
fr: ``elgg_get_file_simple_type()`` utilisez ``elgg()->mimetype->getSimpleType()``

source: ``ElggFile::detectMimeType()`` use ``elgg()->mimetype->getMimeType()``
fr: ``ElggFile::detectMimeType()`` utilisez ``elgg()->mimetype->getMimeType()``

source: ``generate_action_token()`` use ``elgg()->csrf->generateActionToken()``
fr: ``generate_action_token()`` utilisez ``elgg()->csrf->generateActionToken()``

source: Deprecated Config values
fr: Valeurs de configuration obsolètes

source: ``simplecache_lastupdate`` use ``lastcache``
fr: ``simplecache_lastupdate`` utilisez ``lastcache``

source: Deprecated CLI commands
fr: Commandes CLI obsolètes

source: ``elgg-cli flush`` use ``elgg-cli cache:clear``
fr: ``elgg-cli flush`` utilisez ``elgg-cli cache:clear``

source: Deprecated Hooks
fr: Hooks obsolètes

source: From 3.x to 4.0
fr: De 3.x à 4.0

source: PHP Requirements
fr: Pré-requis PHP

source: To be compatible with PHP 8 we needed to increase the minimal PHP version to 7.4. PHP versions < 7.4 are already end-of-life.
fr: Pour être compatible avec PHP 8, nous devions augmenter la version minimale de PHP à 7.4. Les versions PHP < 7.4 sont déjà en fin de vie.

source: Composer project
fr: Projet composer

source: The root of the composer project is no longer handled as a semi functional plugin. Languages from the ``languages`` directory are nog longer imported, the views from the ``views`` directory are no longer registered, the PHP DI services from the ``elgg-services.php`` are no longer registered and the ``start.php`` file is no longer included.
fr: La racine du projet composer n'est plus gérée comme un plugin semi-fonctionnel. Les langues du répertoire ``languages`` ne sont plus importées, les vues du répertoire ``views`` ne sont plus enregistrées, les services PHP DI du ``elgg-services.php`` ne sont plus enregistrés et le fichier ``start.php`` n'est plus inclus.

source: If you needed specific modification to your Elgg installation you need to make a :doc:`plugin</guides/plugins>` and ensure that the plugin is the latest in the plugin order to allow you to overrule everything you needed to change.
fr: Si vous avez besoin d'une modification spécifique à votre installation Elgg, vous devez créer un :doc:`plugin</guides/plugins>` et vous assurer que le plugin est le dernier dans l'ordre des plugins pour vous permettre de surcharger tout ce que vous avez besoin de changer.

source: Elgg replaced v2 with v3 of the ``doctrine/dbal`` dependency. On of the most notable changes is that if you work with QueryBuilders and use the ``$qb->fetch()`` function you will no longer get an object, but an array. If you want your rows to be useable as classes, you can use ``elgg()->db->getData($qb)``. Another important change is that if you provide your own query parameters, you should no longer prefix keys with a colon in the parameters but still do so in the query.
fr: Elgg a remplacé la v2 de la dépendance ``doctrine/dbal`` par la v3. L'un des changements les plus notables est que si vous travaillez avec QueryBuilders et utilisez la fonction ``$qb->fetch()``, vous n'obtiendrez plus un objet, mais un tableau. Si vous voulez que vos lignes soient utilisables comme classes, vous pouvez utiliser ``elgg()->db->getData($qb)``. Un autre changement important est que si vous fournissez vos propres paramètres de requête, vous ne devez plus préfixer les clés avec deux points dans les paramètres, mais continuer à le faire dans la requête.

source: This feature has been updated to use the latest version of PHP-DI. Most notable breaking change for Elgg is the need to change your plugin service definition to use ``\DI\create()`` instead of ``\DI\object()``.
fr: Cette fonctionnalité a été mise à jour pour utiliser la dernière version de PHP-DI. Le changement le plus notable pour Elgg est la nécessité de changer la définition de votre service de plugin pour utiliser ``\DI\create()`` au lieu de ``\DI\object()``.

source: Zend\Mail replaced by Laminas\Mail
fr: Zend\Mail remplacé par Laminas\Mail

source: Because of the `deprecation`_ of the ``Zend\Mail`` library and it's replacement by the ``Laminas\Mail`` all references have been updated.
fr: En raison de la `dépréciation`_ de la bibliothèque ``Zend\Mail`` et de son remplacement par ``Laminas\Mail`` toutes les références ont été mises à jour.

source: Removed composer dependencies
fr: Dépendances composer supprimées

source: ``bower-asset/jquery-treeview`` the related js and css are no longer available in the system
fr: ``bower-asset/jquery-treeview`` les js et css associés ne sont plus disponibles dans le système

source: ``bower-asset/jquery.imgareaselect`` the related js and css are no longer available in the system
fr: ``bower-asset/jquery.imgareaselect`` les js et css associés ne sont plus disponibles dans le système

source: ``npm-asset/formdata-polyfill`` all modern browser have support, no longer a need for a polyfill
fr: ``npm-asset/formdata-polyfill`` tous les navigateurs modernes ont un support, plus besoin d'un polyfill

source: ``npm-asset/jquery-form`` use native FormData functionality
fr: ``npm-asset/jquery-form`` utilisez la fonctionnalité native FormData

source: ``npm-asset/weakmap-polyfill`` all modern browser have support, no longer a need for a polyfill
fr: ``npm-asset/weakmap-polyfill`` tous les navigateurs modernes ont un support, plus besoin d'un polyfill

source: The following Ajax helper functions have been removed in favor of their counterparts in asynchronous module ``elgg/Ajax``. * ``elgg.action()`` * ``elgg.get()`` * ``elgg.getJSON()`` * ``elgg.post()``
fr: Les fonctions d'assistance Ajax suivantes ont été supprimées au profit de leurs homologues dans le module asynchrone ``elgg/Ajax``. * ``elgg.action()`` * ``elgg.get()`` * ``elgg.getJSON()`` * ``elgg.post()``

source: The ajax function ``elgg.api`` has been moved to the ``executeMethod`` function in the asynchronous module ``elgg/webservices`` in the webservices plugin. Other ``elgg.ajax`` functions and attributes have been removed from the system. Also the legacy handling of ajax calls have been removed from the system.
fr: La fonction ajax ``elgg.api`` a été déplacée vers la fonction ``executeMethod`` dans le module asynchrone ``elgg/webservices`` du plugin webservices. D'autres fonctions et attributs ``elgg.ajax`` ont été supprimés du système. De plus, la gestion héritée des appels ajax a été supprimée du système.

source: The javascript logic for automatically booting some javascript for your plugin and registering hooks via the ``Elgg/Plugin`` class has been removed from the system. This functionality was never used by core and hardly seen in plugins. Use AMD loaded javascript or extend ``elgg.js`` for always loaded javascript.
fr: La logique javascript pour démarrer automatiquement du javascript pour votre plugin et enregistrer des hooks via la classe ``Elgg/Plugin`` a été supprimée du système. Cette fonctionnalité n'a jamais été utilisée par le noyau et à peine vue dans les plugins. Utilisez le javascript chargé par AMD ou étendez ``elgg.js`` pour un javascript toujours chargé.

source: The ``ElggPriorityList`` javascript class has been removed from the system.
fr: La classe javascript ``ElggPriorityList`` a été supprimée du système.

source: System Hooks
fr: Hooks système

source: The AMD modules for ``elgg/init`` and ``elgg/ready`` have been removed. The ``init, system`` hook is still available but it only makes sense to rely on this hook from non-AMD loaded js libraries. The ``boot, system`` and ``ready, system`` triggers have been removed from the system. Replace with ``init, system`` for the same effect.
fr: Les modules AMD pour ``elgg/init`` et ``elgg/ready`` ont été supprimés. Le hook ``init, system`` est toujours disponible, mais cela n'a de sens de s'appuyer sur ce hook que pour des bibliothèques js non chargées par AMD. Les déclencheurs ``boot, system`` et ``ready, system`` ont été supprimés du système. Remplacez par ``init, system`` pour le même effet.

source: The jQuery library has been updated to the latest version (v3.5.x). This is a major update from the version used in Elgg 3.x. For information about what is changed between these release you should take a look at the jQuery website.
fr: La bibliothèque jQuery a été mise à jour vers la dernière version (v3.5.x). Il s'agit d'une mise à jour majeure de la version utilisée dans Elgg 3.x. Pour plus d'informations sur ce qui a changé entre ces versions, vous devriez jeter un œil au site Web de jQuery.

source: The jQuery UI library has been updated to v1.12.x. The library is no longer loaded in full by default. If you need to use features from the library you can require them in your own script. For example to be able to use the sortable functionality do the following:
fr: La bibliothèque jQuery UI a été mise à jour vers la v1.12.x. La bibliothèque n'est plus chargée en entier par défaut. Si vous devez utiliser des fonctionnalités de la bibliothèque, vous pouvez les exiger dans votre propre script. Par exemple, pour pouvoir utiliser la fonctionnalité de tri, procédez comme suit :

source: Miscellaneous JS changes
fr: Changements JS divers

source: The AMD module ``elgg/widgets`` no longer returns an object and no longer requires you to call ``init`` on the module
fr: Le module AMD ``elgg/widgets`` ne renvoie plus d'objet et ne vous oblige plus à appeler ``init`` sur le module

source: Pre Elgg 1.9 notification handling has been removed. Related functions and hooks no longer exist.
fr: La gestion des notifications avant Elgg 1.9 a été supprimée. Les fonctions et hooks associés n'existent plus.

source: Subscriptions
fr: Abonnements

source: The relationship in the database which stores the subscription method for notifications has been changed from ``notifymethod`` to ``notify:method``.
fr: La relation dans la base de données qui stocke la méthode d'abonnement pour les notifications a été modifiée de ``notifymethod`` à ``notify:method``.

source: Multiple Recipients
fr: Destinataires multiples

source: An Elgg\Email now supports multiple recipients in To, Cc and Bcc. The related getter functions like ``getTo()`` will now always return an array.
fr: Un Elgg\Email prend désormais en charge plusieurs destinataires en To, Cc et Bcc. Les fonctions de récupération associées telles que ``getTo()`` renverront désormais toujours un tableau.

source: Settings
fr: Paramètres

source: A generic storage for notification preferences has been introduced in ``\ElggUser::setNotificationSetting()`` and ``\ElggUser::getNotificationSettings()``, the notification settings now have a 'purpose'.
fr: Un stockage générique pour les préférences de notification a été introduit dans ``\ElggUser::setNotificationSetting()`` et ``\ElggUser::getNotificationSettings()``, les paramètres de notification ont maintenant un but 'purpose'.

source: For example ``group_join`` can be used to manage the default subscription you get with a group when you join the group.
fr: Par exemple, ``group_join`` peut être utilisé pour gérer l'abonnement par défaut que vous obtenez avec un groupe lorsque vous rejoignez le groupe.

source: The Notifications plugin has generic handling of displaying and saving the settings. To display the setting extend the view ``notifications/settings/records`` (plural) with a view which uses ``notifications/settings/record`` (singular).
fr: Le plugin Notifications a une gestion générique de l'affichage et de l'enregistrement des paramètres. Pour afficher le paramètre, étendez la vue ``notifications/settings/records`` (pluriel) avec une vue qui utilise ``notifications/settings/record`` (singulier).

source: When requesting notification settings other than the default setting, if the user hasn't saved a setting yet it'll fall back to the default notification settings.
fr: Lors de la demande de paramètres de notification autres que le paramètre par défaut, si l'utilisateur n'a pas encore enregistré de paramètre, cela reviendra aux paramètres de notification par défaut.

source: Management of the notification preferences for adding a new users to a friend collection has been removed.
fr: La gestion des préférences de notification pour l'ajout de nouveaux utilisateurs à une collection d'amis a été supprimée.

source: Notification Salutation & Sign-off
fr: Salutation et signature de la notification

source: To be able to have a more generic salutation and sign-off for outgoing mail notifications we have removed these texts from various translation strings and moved them to generic translations. This will mean you have to update your translations to reflect the new text and also check your code for uses of notifications where you provide your own salutation or sign-off text. You can find out more about this new behaviour in :doc:`/guides/notifications`.
fr: Pour pouvoir avoir une salutation et une signature plus génériques pour les notifications de courrier sortant, nous avons supprimé ces textes de diverses chaînes de traduction et les avons déplacés vers des traductions génériques. Cela signifie que vous devrez mettre à jour vos traductions pour refléter le nouveau texte et également vérifier votre code pour les utilisations des notifications où vous fournissez votre propre texte de salutation ou de signature. Vous pouvez en savoir plus sur ce nouveau comportement dans :doc:`/guides/notifications`.

source: The Notifications plugin has been removed. All the features of the plugin are now part of Elgg core. Some pages (like the group notification settings) have been moved to the correct plugin.
fr: Le plugin Notifications a été supprimé. Toutes les fonctionnalités du plugin font désormais partie du noyau Elgg. Certaines pages (comme les paramètres de notification de groupe) ont été déplacées vers le bon plugin.

source: This means that event handlers, hook handlers, actions, views and languages keys have been (re)moved or renamed.
fr: Cela signifie que les gestionnaires d'événements, les gestionnaires de crochets, les actions, les vues et les clés de langue ont été déplacés, retirés ou renommés.

source: Notification Event Handling
fr: Gestion de l'événement de notification

source: The notification hooks no longer receive the ``origin`` parameter.
fr: Les hooks de notification ne reçoivent plus le paramètre ``origin``.

source: Site notification
fr: Notification sur le site

source: The site notifications plugin now shows the notification subject by default. If a site notification was created with the factory function ``SiteNotification::factory()`` more of the original notification information is stored with the site notification:
fr: Le plugin de notifications du site affiche désormais l'objet de la notification par défaut. Si une notification de site a été créée avec la fonction d'usine ``SiteNotification::factory()``, davantage d'informations de la notification d'origine sont stockées avec la notification de site :

source: Notification ``subject`` is stored in ``title``
fr: Le sujet de la notification ``subject`` est stocké dans ``title``

source: Notification ``summary`` is stored in ``summary``
fr: Le résumé de la notification ``summary`` est stocké dans ``summary``

source: Notification ``body`` is stored in ``description``
fr: Le corps de la notification ``body`` est stocké dans ``description``

source: Split OkResponse, ErrorResponse and RedirectResponse
fr: Séparation de OkResponse, ErrorResponse et RedirectResponse

source: The classes ``Elgg\Http\ErrorResponse`` and ``Elgg\Http\RedirectResponse`` were extensions of ``Elgg\Http\OkReponse`` this complicated validating responses (for example in hooks). The classes have been split apart to allow for easier and clearer checks.
fr: Les classes ``Elgg\Http\ErrorResponse`` et ``Elgg\Http\RedirectResponse`` étaient des extensions de ``Elgg\Http\OkReponse``, ce qui compliquait la validation des réponses (par exemple dans les hooks). Les classes ont été séparées pour permettre des contrôles plus faciles et plus clairs.

source: All classes now extend ``Elgg\Http\Response`` and implement ``Elgg\Http\ReponseBuilder``. The default HTTP error code when using ``elgg_error_response()`` has been changed to return a 400 status.
fr: Toutes les classes étendent maintenant ``Elgg\Http\Response`` et implémentent ``Elgg\Http\ReponseBuilder``. Le code d'erreur HTTP par défaut lors de l'utilisation de ``elgg_error_response()`` a été modifié pour renvoyer un code d'état 400.

source: Datamodel
fr: Modèle de données

source: The ``access_id``, ``owner_guid`` and ``enabled`` columns in the ``metadata`` table have been removed
fr: Les colonnes ``access_id``, ``owner_guid`` et ``enabled`` dans la table ``metadata`` ont été supprimées

source: The ``enabled`` column in the ``river`` table has been removed
fr: La colonne ``enabled`` dans la table ``river`` a été supprimée

source: The ``relationship`` column in the ``entity_relationships`` table now has a max length of 255 (up from 50)
fr: La colonne ``relationship`` dans la table ``entity_relationships`` a maintenant une longueur maximale de 255 (au lieu de 50)

source: ElggEntity attributes
fr: Attributs ElggEntity

source: Setting the ``type``, ``subtype`` and ``enabled`` attributes of an ``ElggEntity`` is no longer possible using the magic setter. Changing the ``type`` is no longer possible, use the correct base class for your entity (eg. ``ElggObject``, ``ElggGroup`` or ``ElggUser``).
fr: Définir les attributs ``type``, ``subtype`` et ``enabled`` d'une ``ElggEntity`` n'est plus possible en utilisant la fonction de définition magique. Changer le ``type`` n'est plus possible, utilisez la classe de base correcte pour votre entité (ex. ``ElggObject``, ``ElggGroup`` ou ``ElggUser``).

source: To change the ``subtype`` use the function ``setSubtype($subtype)``
fr: Pour changer le ``subtype`` utilisez la fonction ``setSubtype($subtype)``

source: To change the ``enabled`` state of an entity use the correct functions
fr: Pour changer l'état activé ``enabled`` d'une entité utilisez les fonctions correctes

source: ElggUser attributes
fr: Attributs ElggUser

source: Setting the ``admin`` and ``banned`` metadata of an ``ElggUser`` is no longer possible using the magic setter.
fr: La définition des métadonnées ``admin`` et ``banned`` d'un ``ElggUser`` n'est plus possible en utilisant la fonction de définition magique.

source: To change the ``admin`` state use the functions ``makeAdmin()`` and ``removeAdmin()``
fr: Pour changer l'état d'administrateur ``admin``, utilisez les fonctions ``makeAdmin()`` and ``removeAdmin()``
