Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: **Boolean values are cast to integers when saved**: ``false`` is stored as ``0`` and ``true`` is stored as ``1``. This has breaking implications for private settings, which were previously stored as empty strings for ``false`` values. Plugins should write their own migration scripts to alter DB values from empty strings to ``0`` (for private settings that are expected to store boolean values) to ensure that ``elgg_get_entities()`` can retrieve these values with ``private_setting_name_value_pairs`` containing ``false`` values. This applies to plugin settings, as well as any private settings added to entities.
fr: **Les valeurs booléennes sont transformées en entiers lorsqu’elles sont enregistrées** : ``false`` est stocké comme ``0`` et ``true`` est stocké comme ``1``. Cela a des implications non rétro-compatibles pour les paramètres privés, qui étaient précédemment stockés comme des chaînes vides pour les valeurs ``false``. Les plugins doivent écrire leurs propres scripts de migration pour modifier les valeurs de la BD des chaînes vides à ``0`` (pour les paramètres privés qui sont censés stocker des valeurs booléennes) afin de s’assurer que ``elgg_get_entities()`` peut récupérer ces valeurs avec ``private_setting_name_value_pairs`` contenant des valeurs ``false``. Cela s’applique aux paramètres de plugin, ainsi qu’à tous les paramètres privés ajoutés aux entités.

source: Metadata Changes
fr: Modifications des métadonnées

source: Metadata is no longer access controlled. If your plugin created metadata with restricted access, those restrictions will not be honored. You should use annotations or entities instead, which do provide access control.
fr: Les métadonnées ne sont plus contrôlées par accès. Si votre plugin a créé des métadonnées avec un accès restreint, ces restrictions ne seront pas respectées. Vous devez utiliser des annotations ou des entités à la place, qui fournissent un contrôle d’accès.

source: Do not read or write to the ``access_id`` property on ElggMetadata objects.
fr: Ne lisez pas ou n’écrivez pas la propriété ``access_id`` sur les objets ElggMetadata.

source: Metadata is no longer enabled or disabled. You can no longer perform the ``enable`` and ``disable`` API calls on metadata.
fr: Les métadonnées ne sont plus activées ou désactivées. Vous ne pouvez plus effectuer les appels API ``enable`` et ``disable`` sur les métadonnées.

source: Metadata no longer has an ``owner_guid``. It is no longer possible to query metadata based on ``owner_guids``. Subsequently, ``ElggMetadata::canEdit()`` will always return ``true`` regardless of the logged in user, unless explicitly overriden by a plugin hook.
fr: Les métadonnées n’ont plus de ``owner_guid``. Il n’est plus possible d’interroger les métadonnées sur la base de leur ``owner_guids``. Par conséquence, ``ElggMetadata::canEdit()`` renvoie toujours ``true`` indépendamment de l’utilisateur connecté, à moins que cela soit explicitement remplacé par un hook de plugin.

source: Permissions and Access
fr: Permissions et droits d'accès

source: User capabilities service will no longer trigger permission check hooks when:
fr: Le service des capacités de l'utilisateur ne déclenche plus les hooks de vérification des autorisations lorsque :

source: permissions are checked for an admin user
fr: les autorisations sont vérifiées pour un utilisateur administrateur

source: permissions are checked when access is ignored with ``elgg_set_ignore_access()``
fr: les autorisations sont vérifiées lorsque l’accès est ignoré avec ``elgg_set_ignore_access()``

source: This means that plugins can no longer alter permissions in aforementioned cases.
fr: Cela signifie que les plugins ne peuvent plus modifier les autorisations dans les cas mentionnés ci-dessus.

source: ``elgg_check_access_overrides()`` has been removed, as plugins will no longer need to validate access overrides.
fr: ``elgg_check_access_overrides()`` a été supprimé, car les plugins n’auront plus besoin de valider les remplacements d’accès.

source: The translations for the default Elgg access levels have new translation language keys.
fr: Les traductions pour les niveaux d’accès de Elgg par défaut ont de nouvelles clefs de traduction.

source: Multi Site Changes
fr: Modifications Multisite

source: Pre 3.0 Elgg has some (partial) support for having multiple sites in the same database. This Multi Site concept has been completely removed in 3.0. Entities no longer have the site_guid attribute. This means there is no longer the ability to have entities on different sites. If you currently have multiple sites in your database, upgrading Elgg to 3.0 will fail. You need to separate the different sites into separate databases/tables.
fr: Avant la version 3.0, Elgg disposait d’une certaine prise en charge (partielle) pour avoir plusieurs sites dans la même base de données. Ce concept multisite a été complètement supprimé dans la version 3.0. Les entités n’ont plus l’attribut site_guid. Cela signifie qu’il n’y a plus la possibilité d’avoir des entités sur différents sites. Si vous avez actuellement plusieurs sites dans votre base de données, la mise à niveau de Elgg vers Elgg 3.0 échouera. Vous devez séparer les différents sites en bases de données/tables distinctes.

source: Related to the removal of the Multi Site concept in Elgg, there is no longer a need for entities having a 'member_of_site' relationship with the Site Entity. All functions related to adding/removing this relationship has been removed. All existing relationships will be removed as part of this upgrade.
fr: En lien avecla suppression du concept multisite de Elgg, il n’est plus nécessaire que les entités aient une relation 'member_of_site' avec l’entité du site. Toutes les fonctions liées à l’ajout/suppression de cette relation ont été supprimées. Toutes les relations existantes seront supprimées dans le cadre de cette mise à niveau.

source: Setting ``ElggSite::$url`` has no effect. Reading the site URL always pulls from the ``$CONFIG->wwwroot`` set in settings.php, or computed by Symphony Request.
fr: La définition de ``ElggSite::$url`` n’a aucun effet. La lecture de l’URL du site est toujours faite depuis la valeur définie par ``$CONFIG->wwwroot`` dans settings.php, ou calculée par Symphony Request.

source: ``ElggSite::save()`` will fail if it isn't the main site.
fr: ``ElggSite::save()`` échouera si ce n’est pas le site principal.

source: Entity Subtable Changes
fr: Modifications de la sous-table des entités

source: The subtable ``sites_entity`` for ``ElggSite`` no longer exists. All attributes have been moved to metadata. The subtable ``groups_entity`` for ``ElggGroup`` no longer exists. All attributes have been moved to metadata. The subtable ``objects_entity`` for ``ElggObject`` no longer exists. All attributes have been moved to metadata. The subtable ``users_entity`` for ``ElggUser`` no longer exists. All attributes have been moved to metadata.
fr: La sous-table ``sites_entity`` pour ``ElggSite`` n’existe plus. Tous les attributs ont été déplacés vers les métadonnées. La sous-table ``groups_entity`` pour ``ElggGroup`` n’existe plus. Tous les attributs ont été déplacés vers les métadonnées. La sous-table ``objects_entity`` pour ``ElggObject`` n’existe plus. Tous les attributs ont été déplacés vers les métadonnées. La sous-table ``users_entity`` pour ``ElggUser`` n’existe plus. Tous les attributs ont été déplacés vers les métadonnées.

source: If you have custom queries referencing this table you need to update them. If you have function that rely on ``Entity->getOriginalAttributes()`` be advised that this will only return the base attributes of an ``ElggEntity`` and no longer contain the secondary attributes.
fr: Si vous avez des requêtes personnalisées faisant référence à cette table, vous devez les mettre à jour. Si vous avez une fonction qui s’appuie sur ``Entity->getOriginalAttributes()``, sachez que cela ne renvoie que les attributs de base d’une ``ElggEntity`` et ne contient plus les attributs secondaires.

source: Friends and Group Access Collection
fr: Collection d'accès des Contacts et des Groupes

source: The access collections table now has a subtype column. This extra data helps identifying the purpose of the ACL. The user owned access collections are assumed to be used as Friends Collections and now have the 'friends_collection' subtype. The groups access collection information was previously stored in the group_acl metadata. With the introduction of the ACL subtype this information has been moved to the ACL subtype attribute.
fr: La table des collections d'accès dispose maintenant d'une colonne de sous-type. Ces données supplémentaires permettent d’identifier le but de l’ACL. Les collections d’accès appartenant à l’utilisateur sont supposées être utilisées comme collections de contacts - Friends Collections - et ont le sous-type 'friends_collection'. L'information de collection d’accès des groupes était auparavant conservée dans la métadonnée group_acl. Avec l’introduction du sous-type ACL, cette information a été déplacée vers l’attribut de sous-type ACL.

source: The ``ACCESS_FRIENDS`` access_id has been migrated to an actual access collection (with the subtype ``friends``). All entities and annotations have been updated to use the new access collection id. The access collection is created when a user is created. When a relationship of the type ``friends`` is created, the related guid will also be added to the access collection. You can no longer save or update entities with the access id ``ACCESS_FRIENDS``.
fr: L'access_id ``ACCESS_FRIENDS`` a été migré vers une collection d’accès réelle (avec le sous-type ``friends``). Toutes les entités et annotations ont été mises à jour pour utiliser le nouvel id de collection d’accès. La collection d'accès est créée lors de la création d’un utilisateur. Lorsqu’une relation du type ``friends`` est créée, le guid associé sera également ajouté à la collection d’accès. Vous ne pouvez plus enregistrer ou mettre à jour les entités avec l’id d’accès ``ACCESS_FRIENDS``.

source: Subtypes no longer have an ID
fr: Les sous-types n’ont plus d’ID

source: Entity subtypes have been denormalized. ``entity_subtypes`` table has been removed and ``subtype`` column in entities table simply holds the string representation of the subtype.
fr: Les sous-types d’entités ont été dénormalisés. La table ``entity_subtypes`` a été supprimée et la colonne ``subtype`` dans la table entités contient simplement la représentation sous forme de chaîne du sous-type.

source: Consequently, all API around adding/updating entity subtypes and classes have been removed.
fr: Par conséquent, toutes les API relatives à l’ajout et la mise à jour des sous-types et des classes d’entités ont été supprimées.

source: Plugins can now use ``elgg_set_entity_class()`` and ``elgg_get_entity_class()`` to register a custom entity class at runtime (e.g. in system init handler).
fr: Les plugins peuvent désormais utiliser ``elgg_set_entity_class()`` et ``elgg_get_entity_class()`` pour enregistrer une classe d’entité personnalisée au moment de l’exécution (par exemple dans le gestionnaire d'initialisation du système).

source: All entities now **MUST** have a subtype. By default, the following subtypes are added and reserved:
fr: Toutes les entités **DOIVENT** maintenant avoir un sous-type. Par défaut, les sous-types suivants sont ajoutés et réservés :

source: ``user`` for users
fr: ``user`` pour les utilisateurs

source: ``group`` for groups
fr: ``group`` pour les groupes

source: ``site`` for sites
fr: ``site`` pour les sites

source: Custom class loading
fr: Chargement de classe personnalisée

source: Elgg no longer provides API functions to register custom classes. If you need custom classes you can use ``PSR-0`` classes in the ``/classes`` folder of your plugin or use composer for autoloading of additional classes.
fr: Elgg ne fournit plus de fonctions API pour enregistrer des classes personnalisées. Si vous avez besoin de classes personnalisées, vous pouvez utiliser des classes ``PSR-0`` dans le dossier ``/classes`` de votre plugin ou utiliser composer pour charger automatiquement des classes supplémentaires.

source: The following class registration related functions have been removed:
fr: Les fonctions suivantes liées à l’enregistrement des classes ont été supprimées :

source: Dependency Injection Container
fr: Conteneur d’injection de dépendance - DI = Dependency Injection

source: Plugins can now define their services and attach them to Elgg's public DI container by providing definitions in ``elgg-services.php`` in the root of the plugin directory.
fr: Les plugins peuvent maintenant définir leurs services et les attacher au conteneur public DI de Elgg en fournissant des définitions dans ``elgg-services.php`` dans la racine du répertoire de plugin.

source: ``elgg()`` no longer returns an instance of Elgg application, but a DI container instance.
fr: ``elgg()`` ne renvoie plus une instance d’application Elgg, mais une instance de conteneur DI.

source: Search changes
fr: Modifications de la recherche

source: We have added a search service into core, consequently the ``search`` plugin now only provides a user interface for displaying forms and listing search results. Many of the views in the search plugin have been affected by this change.
fr: Nous avons ajouté un service de recherche dans le noyau, par conséquent, le plugin ``search`` fournit désormais uniquement une interface utilisateur pour afficher les formulaires et afficher les résultats de recherche. Beaucoup des vues du plugin search ont été affectées par ce changement.

source: The FULLTEXT indices have been removed on various tables. The search plugin will now always use a like query when performing a search.
fr: Les indices FULLTEXT ont été supprimés sur différentes tables. Le plugin de recherche utilise désormais toujours une requête LIKE lors de l’exécution d’une recherche.

source: See :doc:`Search Service </guides/search>` and :ref:`Search hooks <guides/events-list#search>` documentation for detailed information about new search capabilities.
fr: Voir la documentation :doc:`Search Service </guides/search>` et :ref:`Search hooks <guides/events-list#search>` pour des informations détaillées sur les nouvelles fonctionnalités de recherche.

source: Form and field related changes
fr: Modifications liées aux formulaires et aux champs

source: ``input/password``: by default this field will no longer show a value passed to it, this can be overridden by passing the view var ``always_empty`` and set it to false
fr: ``input/password`` : par défaut, ce champ n'affichera plus la valeur qui lui est transmise ; cela peut être remplacé en passant à la vue la variable ``always_empty`` définie sur false

source: ``input/submit``, ``input/reset`` and ``input/button`` are now rendered with a ``<button>`` instead of the ``<input>`` tag. These input view also accept ``text`` and ``icon`` parameters.
fr: ``input/submit``, ``input/reinit`` et ``input/button`` sont maintenant rendus avec un ``<button>`` au lieu de la balise ``<input>``. Ces vues d’entrée acceptent également les paramètres ``text`` et ``icon``.

source: ``output/url`` now sets ``.elgg-anchor`` class on anchor elements and accepts ``icon`` parameter. If no ``text`` is set, the ``href`` parameter used as a label will be restricted to 100 characters.
fr: ``output/url`` définit maintenant la classe ``.elgg-anchor`` sur les éléments d’ancre et accepte le paramètre ``icon``. Si aucun ``text`` n’est défini, le paramètre ``href`` est utilisé comme étiquette et sera limité à 100 caractères.

source: ``output/url`` now supports a ``badge`` parameter, which can be used where a counter, a badge, or similar is required as a postfix (mainly in menu items that have counters).
fr: ``output/url`` prend désormais en charge un paramètre ``badge``, qui peut être utilisé lorsqu’un compteur, un badge ou autre est requis comme suffixe (principalement dans les éléments de menu qui ont des compteurs).

source: ``output/tags`` no longer uses ``<ul>`` tags with floats and instead it relies on inherently inline elements such as ``<span>`` and ``<a>``
fr: ``output/tags`` n’utilise plus de balises ``<ul>`` avec des floats, et au lieu de cela s’appuie sur des éléments intrinsèquement en ligne inline tels que ``<span>`` et ``<a>``

source: Entity and River Menu Changes
fr: Modifications du menu des entités et de la rivière

source: The Entity and River menu now shows all the items in a dropdown. Social actions like liking or commenting are moved to an alternate menu called the social menu, which is meant for social actions.
fr: Le menu Entity et le menu River affichent désormais tous les éléments d’une liste déroulante. Les actions sociales comme aimer ou commenter sont déplacées vers un menu alternatif appelé le menu social, qui est destiné aux actions sociales.

source: ``elgg_register_library`` and ``elgg_load_library`` have been removed. These functions had little impact on performance (especially with OPCache enabled), and made it difficult for other plugins to work with APIs contained in libraries. Additionally it was difficult for developers to know that APIs were contained in a library while there being autocompleted by IDE.
fr: ``elgg_register_library`` et ``elgg_load_library`` ont été supprimées. Ces fonctions ont eu peu d’impact sur les performances (en particulier avec OPCache activé), et il a été difficile pour d’autres plugins de travailler avec les APIs contenues dans les bibliothèques. En outre, il était difficile pour les développeurs de savoir que les APIs étaient contenues dans une bibliothèque alors qu’il y a une autocomplétion par l'IDE.

source: If you are concerned with performance, move the logic to classes and let PHP autoload them as necessary, otherwise use ``require_once`` and require your libraries.
fr: Si vous êtes concerné par les performances, déplacez la logique vers les classes et laissez PHP les charger automatiquement au besoin, sinon utilisez ``require_once`` et exigez vos bibliothèques.

source: Removed pagehandling
fr: Gestionnaires de pages supprimés

source: ``discussion/reply``: See :ref:`upgrade-discussion-replies`
fr: ``discussion/reply`` : Voyez :ref:`upgrade-discussion-replies`

source: ``invitefriends``: Use ``friends/{username}/invite``
fr: ``invitefriends`` : Utilisez ``friends/{username}/invite``

source: ``messages/compose``: Use ``messages/add``
fr: ``messages/compose`` : Utilisez ``messages/add``

source: Removed actions
fr: Actions supprimées

source: ``file/download``: Use ``elgg_get_inline_url`` or ``elgg_get_download_url``
fr: ``file/download`` : Utilisez ``elgg_get_inline_url`` ou ``elgg_get_download_url``

source: ``file/delete``: Use ``entity/delete`` action
fr: ``file/delete`` : Utilisez l'action ``entity/delete``

source: ``discussion/reply/save``: See :ref:`upgrade-discussion-replies`
fr: ``discussion/reply/save`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion/reply/delete``: See :ref:`upgrade-discussion-replies`
fr: ``discussion/reply/delete`` : Voyez :ref:`upgrade-discussion-replies`

source: ``comment/delete``: Use ``entity/delete`` action
fr: ``comment/delete`` : Utilisez l’action ``entity/delete``

source: ``uservalidationbyemail/bulk_action``: use ``admin/user/bulk/validate`` or ``admin/user/bulk/delete``
fr: ``uservalidationbyemail/bulk_action`` : utilisez ``admin/user/bulk/validate`` ou ``admin/user/bulk/delete``

source: ``uservalidationbyemail/delete``: use ``admin/user/bulk/delete``
fr: ``uservalidationbyemail/delete`` : utilisez ``admin/user/bulk/delete``

source: ``uservalidationbyemail/validate``: use ``admin/user/bulk/validate``
fr: ``uservalidationbyemail/validate`` : utilisez ``admin/user/bulk/validate``

source: ``invitefriends/invite``: use ``friends/invite``
fr: ``invitefriends/invite`` : utilisez ``friends/invite``

source: Inheritance changes
fr: Modifications de l’héritage

source: ``ElggData`` (and hence most Elgg domain objects) no longer implements ``Exportable``
fr: ``ElggData`` (et donc la plupart des objets du domaine Elgg) n’implémente plus ``Exportable``

source: ``ElggEntity`` no longer implements ``Importable``
fr: ``ElggEntity`` n’implémente plus ``Importable``

source: ``ElggGroup`` no longer implements ``Friendable``
fr: ``ElggGroup`` n’implémente plus ``Friendable``

source: ``ElggRelationship`` no longer implements ``Importable``
fr: ``ElggRelationship`` n’implémente plus ``Importable``

source: ``ElggSession`` no longer implements ``ArrayAccess``
fr: ``ElggSession`` n’implémente plus ``ArrayAccess``

source: ``Elgg\Application\Database`` no longer extends ``Elgg\Database``
fr: ``Elgg\Application\Database`` n’étend plus ``Elgg\Database``

source: Removed JavaScript APIs
fr: APIs JavaScript supprimées

source: ``elgg.widgets``: Use the ``elgg/widgets`` module. The "widgets" layouts do this module automatically
fr: ``elgg.widgets`` : Utilisez le module ``elgg/widgets``. Les dispositions "widgets" chargent ce module automatiquement

source: ``lightbox.js``: Use the ``elgg/lightbox`` module as needed
fr: ``lightbox.js`` : Utilisez le module ``elgg/lightbox`` au besoin

source: ``lightbox/settings.js``: Use the ``getOptions, ui.lightbox`` JS hook or the ``data-colorbox-opts`` attribute
fr: ``lightbox/settings.js`` : Utilisez le hook JS ``getOptions, ui.lightbox`` ou l’attribut ``data-colorbox-opts``

source: ``elgg.ui.popupClose``: Use the ``elgg/popup`` module
fr: ``elgg.ui.popupClose`` : Utilisez le module ``elgg/popup``

source: ``elgg.ui.popupOpen``: Use the ``elgg/popup`` module
fr: ``elgg.ui.popupOpen`` : Utilisez le module ``elgg/popup``

source: ``elgg.ui.initDatePicker``: Use the ``input/date`` module
fr: ``elgg.ui.initDatePicker`` : Utilisez le module ``input/date``

source: ``elgg.embed``: Use the ``elgg/embed`` module
fr: ``elgg.embed`` : Utilisez le module ``elgg/embed``

source: ``elgg.discussion``: Use the ``elgg/discussion`` module
fr: ``elgg.discussion`` : Utilisez le module ``elgg/discussion``

source: ``embed/custom_insert_js``: Use the ``embed, editor`` JS hook
fr: ``embed/custom_insert_js`` : Utilisez le hook JS ``embed, editor``

source: ``elgg/ckeditor.js``: replaced by ``elgg-ckeditor.js``
fr: ``elgg/ckeditor.js`` : remplacé par ``elgg-ckeditor.js``

source: ``jQuery.cookie``: Use ``elgg.session.cookie``
fr: ``jQuery.cookie`` : Utilisez ``elgg.session.cookie``

source: ``likes.js``: The ``elgg/likes`` module is loaded automatically
fr: ``likes.js`` : Le module ``elgg/likes`` est chargé automatiquement

source: ``elgg.autocomplete`` is no longer defined.
fr: ``elgg.autocomplete`` n’est plus défini.

source: ``elgg.messageboard`` is no longer defined.
fr: ``elgg.messageboard`` n’est plus défini.

source: ``elgg.ui.toggleMenu`` is no longer defined
fr: ``elgg.ui.toggleMenu`` n’est plus défini

source: ``elgg.ui.toggleMenuItems``: Use ``data-toggle`` attribute when registering toggleable menu items
fr: ``elgg.ui.toggleMenuItems`` : Utilisez l’attribut ``data-toggle`` lorsque vous enregistrez des éléments de menu basculables

source: ``uservalidationbyemail/js.php``: Use the ``elgg/uservalidationbyemail`` module
fr: ``uservalidationbyemail/js.php`` : Utilisez le module ``elgg/uservalidationbyemail``

source: ``discussion.js``: See :ref:`upgrade-discussion-replies`
fr: ``discussion.js`` : Voyez :ref:`upgrade-discussion-replies`

source: Removed hooks/events
fr: Hooks/événements retirés

source: Event **login, user**: Use **login:before** or **login:after**. Note the user is not logged in during the **login:before** event
fr: Événement **login, user** : Utilisez **login:before** ou **login:after**. Notez que l’utilisateur n’est pas connecté pendant l’événement **login:before**
