Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``elgg_get_annotation_from_id()`` now requires an ``int`` for ``$id``
fr: ``elgg_get_annotation_from_id()`` requiert maintenant un entier ``int`` pour ``$id``

source: ``elgg_get_subscriptions_for_container()`` now requires an ``int`` for ``$container_guid``
fr: ``elgg_get_subscriptions_for_container()`` requiert maintenant un entier ``int`` pour ``$container_guid``

source: ``elgg_get_plugin_from_id()`` now requires a ``string`` for ``$plugin_id``
fr: ``elgg_get_plugin_from_id()`` requiert maintenant une chaîne de caractères ``string`` pour ``$plugin_id``

source: ``elgg_get_plugin_setting()`` now requires a ``string`` for ``$name`` and ``$plugin_id``
fr: ``elgg_get_plugin_setting()`` requiert maintenant une chaîne de caractères ``string`` pour ``$name`` et ``$plugin_id``

source: ``elgg_get_plugin_user_setting()`` now requires a ``string`` for ``$name`` and ``$plugin_id`` and ``int`` for ``$user_guid``
fr: ``elgg_get_plugin_user_setting()`` requiert maintenant une chaîne de caractères ``string`` pour ``$name`` et ``$plugin_id`` et un entier ``int`` pour ``$user_guid``

source: ``elgg_get_plugins()`` now requires a ``string`` for ``$status``
fr: ``elgg_get_plugins()`` requiert maintenant une chaîne de caractères ``string`` pour ``$status``

source: ``elgg_get_river_item_from_id()`` now requires a ``int`` for ``$id``
fr: ``elgg_get_river_item_from_id()`` requiert maintenant un entier ``int`` pour ``$id``

source: ``elgg_list_annotations()`` now requires an ``array`` for ``$options``
fr: ``elgg_list_annotations()`` requiert maintenant un tableau ``array`` pour ``$options``

source: ``elgg_ok_response()`` now requires an ``int`` for ``$status_code``
fr: ``elgg_ok_response()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``elgg_plugin_exists()`` now requires a ``string`` for ``$plugin_id``
fr: ``elgg_plugin_exists()`` requiert maintenant une chaîne de caractères ``string`` pour ``$plugin_id``

source: ``elgg_redirect_response()`` now requires an ``int`` for ``$status_code``
fr: ``elgg_redirect_response()`` requiert maintenant un entier ``int`` pour ``$status_code``

source: ``elgg_register_action()`` now requires a ``string`` for ``$action`` and ``$access``
fr: ``elgg_register_action()`` requiert maintenant une chaîne de caractères ``string`` pour ``$action`` et ``$access``

source: ``elgg_send_email()`` now requires an ``\Elgg\Email`` for ``$email``
fr: ``elgg_send_email()`` requiert maintenant un ``\Elgg\Email`` pour ``$email``

source: ``elgg_set_plugin_user_setting()`` now requires a ``string`` for ``$name`` and ``$plugin_id`` and ``int`` for ``$user_guid``
fr: ``elgg_set_plugin_user_setting()`` requiert maintenant une chaîne de caractères ``string`` pour ``$name`` et ``$plugin_id`` et un entier ``int`` pour ``$user_guid``

source: ``elgg_unregister_action()`` now requires a ``string`` for ``$action``
fr: ``elgg_unregister_action()`` requiert maintenant une chaîne de caractères ``string`` pour ``$action``

source: ``get_access_array()`` now requires an ``int`` for ``$user_guid``
fr: ``get_access_array()`` requiert maintenant un entier ``int`` pour ``$user_guid``

source: ``get_access_collection()`` now requires an ``int`` for ``$collection_id``
fr: ``get_access_collection()`` requiert maintenant un entier ``int`` pour ``$collection_id``

source: ``get_entity_statistics()`` now requires an ``int`` for ``$owner_guid``
fr: ``get_entity_statistics()`` requiert maintenant un entier ``int`` pour ``$owner_guid``

source: ``get_members_of_access_collection()`` now requires an ``int`` for ``$collection_id`` and ``bool`` for ``$guids_only``
fr: ``get_members_of_access_collection()`` requiert maintenant un entier ``int`` pour ``$collection_id`` et un booléen ``bool`` pour ``$guids_only``

source: ``get_readable_access_level()`` now requires an ``int`` for ``$entity_access_id``
fr: ``get_readable_access_level()`` requiert maintenant un entier ``int`` pour ``$entity_access_id``

source: ``get_write_access_array()`` now requires an ``int`` for ``$user_guid`` and ``bool`` for ``$flush``
fr: ``get_write_access_array()`` requiert maintenant un entier ``int`` pour ``$user_guid`` et un booléen ``bool`` for ``$flush``

source: ``has_access_to_entity()`` now requires an ``ElggEntity`` for ``$entity`` and ``ElggUser`` for ``$user``
fr: ``has_access_to_entity()`` requiert maintenant une ``ElggEntity`` pour ``$entity`` et ``ElggUser`` pour ``$user``

source: ``remove_user_from_access_collection()`` now requires an ``int`` for ``$user_guid`` and ``$collection_id``
fr: ``remove_user_from_access_collection()`` requiert maintenant un entier ``int`` pour ``$user_guid`` et ``$collection_id``

source: ``system_log_get_log()`` now requires an ``array`` for ``$options``
fr: ``system_log_get_log()`` requiert maintenant un tableau ``array`` pour ``$options``

source: ``messageboard_add()`` now requires an ``ElggUser``, ``ElggUser``, ``string`` and an ``int``
fr: ``messageboard_add()`` requiert maintenant les types ``ElggUser``, ``ElggUser``, ``string`` et ``int``

source: ``elgg_register_external_file()`` now requires all arguments to be of the type ``string``
fr: ``elgg_register_external_file()`` requiert maintenant que tous les arguments soient de type ``string``

source: ``elgg_unregister_external_file()`` now requires all arguments to be of the type ``string``
fr: ``elgg_unregister_external_file()`` requiert maintenant que tous les arguments soient de type ``string``

source: ``elgg_load_external_file()`` now requires all arguments to be of the type ``string``
fr: ``elgg_load_external_file()`` requiert maintenant que tous les arguments soient de type ``string``

source: ``elgg_get_loaded_external_files()`` now requires all arguments to be of the type ``string``
fr: ``elgg_get_loaded_external_files()`` requiert maintenant que tous les arguments soient de type ``string``

source: Change in function parameters
fr: Modification dans les paramètres de fonction

source: Class functions
fr: Fonctions de classe

source: ``Elgg\Http\ResponseBuilder::setStatusCode()`` no longer has a default value
fr: ``Elgg\Http\ResponseBuilder::setStatusCode()`` n'a plus de valeur par défaut

source: ``ElggEntity::canWriteToContainer()`` no longer has a default value for ``$type`` and ``$subtype`` but these are required
fr: ``ElggEntity::canWriteToContainer()`` n'a plus de valeur par défaut pour ``$type`` et ``$subtype`` mais ces paramètres sont obligatoires

source: Lib functions
fr: Fonctions de la bibliothèque

source: ``elgg_get_page_owner_guid()`` no longer accepts ``$guid`` as a parameter
fr: ``elgg_get_page_owner_guid()`` n'accepte plus ``$guid`` comme paramètre

source: ``get_access_array()`` no longer accepts ``$flush`` as a parameter
fr: ``get_access_array()`` n'accepte plus ``$flush`` comme paramètre

source: ``elgg_register_external_file()`` no longer accepts ``$priority`` as a parameter
fr: ``elgg_register_external_file()`` n'accepte plus ``$priority`` comme paramètre

source: Renamed hook/event handler callbacks
fr: Renommage des fonctions de callback du gestionnaire de hook/d'événement

source: Special attention is required if you unregister the callbacks in your plugins as you might need to update your code.
fr: Une attention particulière est requise si vous désenregistrez les callbacks dans vos plugins car vous devrez peut-être mettre à jour votre code.

source: Core
fr: Noyau

source: ``access_friends_acl_get_name()`` changed to ``Elgg\Friends\AclNameHandler::class``
fr: ``access_friends_acl_get_name()`` changé pour ``Elgg\Friends\AclNameHandler::class``

source: ``access_friends_acl_add_friend()`` changed to ``Elgg\Friends\AddToAclHandler::class``
fr: ``access_friends_acl_add_friend()`` changé pour ``Elgg\Friends\AddToAclHandler::class``

source: ``access_friends_acl_create()`` changed to ``Elgg\Friends\CreateAclHandler::class``
fr: ``access_friends_acl_create()`` changé pour ``Elgg\Friends\CreateAclHandler::class``

source: ``access_friends_acl_remove_friend()`` changed to ``Elgg\Friends\RemoveFromAclHandler::class``
fr: ``access_friends_acl_remove_friend()`` changé pour ``Elgg\Friends\RemoveFromAclHandler::class``

source: ``_elgg_add_admin_widgets()`` changed to ``Elgg\Widgets\CreateAdminWidgetsHandler::class``
fr: ``_elgg_add_admin_widgets()`` changé pour ``Elgg\Widgets\CreateAdminWidgetsHandler::class``

source: ``_elgg_admin_check_admin_validation()`` changed to ``Elgg\Users\Validation::checkAdminValidation()``
fr: ``_elgg_admin_check_admin_validation()`` changé pour ``Elgg\Users\Validation::checkAdminValidation()``

source: ``_elgg_admin_header_menu()`` changed to ``Elgg\Menus\AdminHeader::register()`` and ``Elgg\Menus\AdminHeader::registerMaintenance()``
fr: ``_elgg_admin_header_menu()`` changé pour ``Elgg\Menus\AdminHeader::register()`` et ``Elgg\Menus\AdminHeader::registerMaintenance()``

source: ``_elgg_admin_footer_menu()`` changed to ``Elgg\Menus\AdminFooter::registerHelpResources()``
fr: ``_elgg_admin_footer_menu()`` changé pour ``Elgg\Menus\AdminFooter::registerHelpResources()``

source: ``_elgg_admin_notify_admins_pending_user_validation()`` changed to ``Elgg\Users\Validation::notifyAdminsAboutPendingUsers()``
fr: ``_elgg_admin_notify_admins_pending_user_validation()`` changé pour ``Elgg\Users\Validation::notifyAdminsAboutPendingUsers()``

source: ``_elgg_admin_page_menu()`` changed to ``Elgg\Menus\Page::registerAdminAdminister()`` and ``Elgg\Menus\Page::registerAdminConfigure()`` and ``Elgg\Menus\Page::registerAdminInformation()``
fr: ``_elgg_admin_page_menu()`` changé pour ``Elgg\Menus\Page::registerAdminAdminister()`` et ``Elgg\Menus\Page::registerAdminConfigure()`` et ``Elgg\Menus\Page::registerAdminInformation()``

source: ``_elgg_admin_page_menu_plugin_settings()`` changed to ``Elgg\Menus\Page::registerAdminPluginSettings()``
fr: ``_elgg_admin_page_menu_plugin_settings()`` changé pour ``Elgg\Menus\Page::registerAdminPluginSettings()``

source: ``_elgg_admin_prepare_admin_notification_make_admin()`` changed to ``Elgg\Notifications\MakeAdminUserEventHandler``
fr: ``_elgg_admin_prepare_admin_notification_make_admin()`` changé pour ``Elgg\Notifications\MakeAdminUserEventHandler``

source: ``_elgg_admin_prepare_admin_notification_remove_admin()`` changed to ``Elgg\Notifications\RemoveAdminUserEventHandler``
fr: ``_elgg_admin_prepare_admin_notification_remove_admin()`` changé pour ``Elgg\Notifications\RemoveAdminUserEventHandler``

source: ``_elgg_admin_prepare_user_notification_make_admin()`` changed to ``Elgg\Notifications\MakeAdminUserEventHandler``
fr: ``_elgg_admin_prepare_user_notification_make_admin()`` changé pour ``Elgg\Notifications\MakeAdminUserEventHandler``

source: ``_elgg_admin_prepare_user_notification_remove_admin()`` changed to ``Elgg\Notifications\RemoveAdminUserEventHandler``
fr: ``_elgg_admin_prepare_user_notification_remove_admin()`` changé pour ``Elgg\Notifications\RemoveAdminUserEventHandler``

source: ``_elgg_admin_save_notification_setting()`` changed to ``Elgg\Users\Settings::setAdminValidationNotification()``
fr: ``_elgg_admin_save_notification_setting()`` changé pour ``Elgg\Users\Settings::setAdminValidationNotification()``

source: ``_elgg_admin_set_registration_forward_url()`` changed to ``Elgg\Users\Validation::setRegistrationForwardUrl()``
fr: ``_elgg_admin_set_registration_forward_url()`` changé pour ``Elgg\Users\Validation::setRegistrationForwardUrl()``

source: ``_elgg_admin_user_unvalidated_bulk_menu()`` changed to ``Elgg\Menus\UserUnvalidatedBulk::registerActions()``
fr: ``_elgg_admin_user_unvalidated_bulk_menu()`` changé pour ``Elgg\Menus\UserUnvalidatedBulk::registerActions()``

source: ``_elgg_admin_user_validation_login_attempt()`` changed to ``Elgg\Users\Validation::preventUserLogin()``
fr: ``_elgg_admin_user_validation_login_attempt()`` changé pour ``Elgg\Users\Validation::preventUserLogin()``

source: ``_elgg_admin_user_validation_notification()`` changed to ``Elgg\Users\Validation::notifyUserAfterValidation()``
fr: ``_elgg_admin_user_validation_notification()`` changé pour ``Elgg\Users\Validation::notifyUserAfterValidation()``

source: ``_elgg_admin_upgrades_menu()`` changed to ``Elgg\Menus\Filter::registerAdminUpgrades()``
fr: ``_elgg_admin_upgrades_menu()`` changé pour ``Elgg\Menus\Filter::registerAdminUpgrades()``

source: ``_elgg_cache_init()`` actions combined in ``Elgg\Application\SystemEventHandlers::ready()``
fr: Les actions ``_elgg_cache_init()`` ont été combinées dans ``Elgg\Application\SystemEventHandlers::ready()``

source: ``_elgg_clear_caches()`` changed to ``Elgg\Cache\EventHandlers::clear()``
fr: ``_elgg_clear_caches()`` changé pour ``Elgg\Cache\EventHandlers::clear()``

source: ``_elgg_comments_access_sync()`` changed to ``Elgg\Comments\SyncContainerAccessHandler::class``
fr: ``_elgg_comments_access_sync()`` changé pour ``Elgg\Comments\SyncContainerAccessHandler::class``

source: ``_elgg_comments_container_permissions_override()`` changed to ``Elgg\Comments\ContainerPermissionsHandler::class``
fr: ``_elgg_comments_container_permissions_override()`` changé pour ``Elgg\Comments\ContainerPermissionsHandler::class``

source: ``_elgg_comments_permissions_override()`` changed to ``Elgg\Comments\EditPermissionsHandler::class``
fr: ``_elgg_comments_permissions_override()`` changé pour ``Elgg\Comments\EditPermissionsHandler::class``

source: ``_elgg_comments_prepare_content_owner_notification()`` changed to ``Elgg\Notifications\CreateCommentEventHandler``
fr: ``_elgg_comments_prepare_content_owner_notification()`` changé pour ``Elgg\Notifications\CreateCommentEventHandler``

source: ``_elgg_comments_prepare_notification()`` changed to ``Elgg\Notifications\CreateCommentEventHandler``
fr: ``_elgg_comments_prepare_notification()`` changé pour ``Elgg\Notifications\CreateCommentEventHandler``

source: ``_elgg_comments_social_menu_setup()`` changed to ``Elgg\Menus\Social::registerComments()``
fr: ``_elgg_comments_social_menu_setup()`` changé pour ``Elgg\Menus\Social::registerComments()``

source: ``_elgg_create_default_widgets()`` changed to ``Elgg\Widgets\CreateDefaultWidgetsHandler::class``
fr: ``_elgg_create_default_widgets()`` changé pour ``Elgg\Widgets\CreateDefaultWidgetsHandler::class``

source: ``_elgg_create_notice_of_pending_upgrade()`` changed to ``Elgg\Upgrade\CreateAdminNoticeHandler::class``
fr: ``_elgg_create_notice_of_pending_upgrade()`` changé pour ``Elgg\Upgrade\CreateAdminNoticeHandler::class``

source: ``_elgg_db_register_seeds()`` changed to ``Elgg\Database\RegisterSeedsHandler::class``
fr: ``_elgg_db_register_seeds()`` changé pour ``Elgg\Database\RegisterSeedsHandler::class``

source: ``_elgg_disable_caches()`` changed to ``Elgg\Cache\EventHandlers::disable()``
fr: ``_elgg_disable_caches()`` changé pour ``Elgg\Cache\EventHandlers::disable()``

source: ``_elgg_default_widgets_permissions_override()`` changed to ``Elgg\Widgets\DefaultWidgetsContainerPermissionsHandler::class``
fr: ``_elgg_default_widgets_permissions_override()`` changé pour ``Elgg\Widgets\DefaultWidgetsContainerPermissionsHandler::class``

source: ``_elgg_disable_password_autocomplete()`` changed to ``Elgg\Input\DisablePasswordAutocompleteHandler::class``
fr: ``_elgg_disable_password_autocomplete()`` changé pour ``Elgg\Input\DisablePasswordAutocompleteHandler::class``

source: ``_elgg_enable_caches()`` changed to ``Elgg\Cache\EventHandlers::enable()``
fr: ``_elgg_enable_caches()`` changé pour ``Elgg\Cache\EventHandlers::enable()``

source: ``_elgg_filestore_move_icons()`` changed to ``Elgg\Icons\MoveIconsOnOwnerChangeHandler::class``
fr: ``_elgg_filestore_move_icons()`` changé pour ``Elgg\Icons\MoveIconsOnOwnerChangeHandler::class``

source: ``_elgg_filestore_touch_icons()`` changed to ``Elgg\Icons\TouchIconsOnAccessChangeHandler::class``
fr: ``_elgg_filestore_touch_icons()`` changé pour ``Elgg\Icons\TouchIconsOnAccessChangeHandler::class``

source: ``_elgg_head_manifest()`` changed to ``Elgg\Views\AddManifestLinkHandler::class``
fr: ``_elgg_head_manifest()`` changé pour ``Elgg\Views\AddManifestLinkHandler::class``

source: ``_elgg_annotations_default_menu_items()`` changed to ``Elgg\Menus\Annotation::registerDelete()``
fr: ``_elgg_annotations_default_menu_items()`` changé pour ``Elgg\Menus\Annotation::registerDelete()``

source: ``_elgg_walled_garden_menu()`` changed to ``Elgg\Menus\WalledGarden::registerHome()``
fr: ``_elgg_walled_garden_menu()`` changé pour ``Elgg\Menus\WalledGarden::registerHome()``

source: ``_elgg_site_menu_init()`` changed to ``Elgg\Menus\Site::registerAdminConfiguredItems()``
fr: ``_elgg_site_menu_init()`` changé pour ``Elgg\Menus\Site::registerAdminConfiguredItems()``

source: ``_elgg_site_menu_setup()`` changed to ``Elgg\Menus\Site::reorderItems()``
fr: ``_elgg_site_menu_setup()`` changé pour ``Elgg\Menus\Site::reorderItems()``

source: ``_elgg_entity_menu_setup()`` changed to ``Elgg\Menus\Entity::registerEdit()`` and ``Elgg\Menus\Entity::registerDelete()``
fr: ``_elgg_entity_menu_setup()`` changé pour ``Elgg\Menus\Entity::registerEdit()`` et ``Elgg\Menus\Entity::registerDelete()``

source: ``_elgg_entity_navigation_menu_setup()`` changed to ``Elgg\Menus\EntityNavigation::registerPreviousNext()``
fr: ``_elgg_entity_navigation_menu_setup()`` changé pour ``Elgg\Menus\EntityNavigation::registerPreviousNext()``

source: ``_elgg_enqueue_notification_event()`` changed to ``Elgg\Notifications\EnqueueEventHandler::class``
fr: ``_elgg_enqueue_notification_event()`` changé pour ``Elgg\Notifications\EnqueueEventHandler::class``

source: ``_elgg_groups_container_override()`` changed to ``Elgg\Groups\MemberPermissionsHandler::class``
fr: ``_elgg_groups_container_override()`` changé pour ``Elgg\Groups\MemberPermissionsHandler::class``

source: ``_elgg_groups_comment_permissions_override()`` changed to ``Elgg\Comments\GroupMemberPermissionsHandler::class``
fr: ``_elgg_groups_comment_permissions_override()`` changé pour ``Elgg\Comments\GroupMemberPermissionsHandler::class``

source: ``_elgg_htmlawed_filter_tags()`` changed to ``Elgg\Input\ValidateInputHandler::class``
fr: ``_elgg_htmlawed_filter_tags()`` changé pour ``Elgg\Input\ValidateInputHandler::class``

source: ``_elgg_invalidate_caches()`` changed to ``Elgg\Cache\EventHandlers::invalidate()``
fr: ``_elgg_invalidate_caches()`` changé pour ``Elgg\Cache\EventHandlers::invalidate()``

source: ``_elgg_widget_menu_setup()`` changed to ``Elgg\Menus\Widget::registerEdit()`` and ``Elgg\Menus\Widget::registerDelete()``
fr: ``_elgg_widget_menu_setup()`` changé pour ``Elgg\Menus\Widget::registerEdit()`` et ``Elgg\Menus\Widget::registerDelete()``

source: ``_elgg_login_menu_setup()`` changed to ``Elgg\Menus\Login::registerRegistration()`` and ``Elgg\Menus\Widget::registerResetPassword()``
fr: ``_elgg_login_menu_setup()`` changé pour ``Elgg\Menus\Login::registerRegistration()`` et ``Elgg\Menus\Widget::registerResetPassword()``

source: ``_elgg_nav_public_pages()`` changed to ``Elgg\WalledGarden\ExtendPublicPagesHandler::class``
fr: ``_elgg_nav_public_pages()`` changé pour ``Elgg\WalledGarden\ExtendPublicPagesHandler::class``

source: ``_elgg_notifications_cron()`` changed to ``Elgg\Notifications\ProcessQueueCronHandler::class``
fr: ``_elgg_notifications_cron()`` changé pour ``Elgg\Notifications\ProcessQueueCronHandler::class``

source: ``_elgg_notifications_smtp_default_message_id_header()`` changed to ``Elgg\Email\DefaultMessageIdHeaderHandler::class``
fr: ``_elgg_notifications_smtp_default_message_id_header()`` changé pour ``Elgg\Email\DefaultMessageIdHeaderHandler::class``

source: ``_elgg_notifications_smtp_thread_headers()`` changed to ``Elgg\Email\ThreadHeadersHandler::class``
fr: ``_elgg_notifications_smtp_thread_headers()`` changé pour ``Elgg\Email\ThreadHeadersHandler::class``

source: ``_elgg_rebuild_public_container()`` changed to ``Elgg\Cache\EventHandlers::rebuildPublicContainer()``
fr: ``_elgg_rebuild_public_container()`` changé pour ``Elgg\Cache\EventHandlers::rebuildPublicContainer()``

source: ``_elgg_river_update_object_last_action()`` changed to ``Elgg\River\UpdateLastActionHandler::class``
fr: ``_elgg_river_update_object_last_action()`` changé pour ``Elgg\River\UpdateLastActionHandler::class``

source: ``_elgg_rss_menu_setup()`` changed to ``Elgg\Menus\Footer::registerRSS()``
fr: ``_elgg_rss_menu_setup()`` changé pour ``Elgg\Menus\Footer::registerRSS()``

source: ``_elgg_plugin_entity_menu_setup()`` changed to ``Elgg\Menus\Entity::registerPlugin()``
fr: ``_elgg_plugin_entity_menu_setup()`` changé pour ``Elgg\Menus\Entity::registerPlugin()``

source: ``_elgg_purge_caches()`` changed to ``Elgg\Cache\EventHandlers::purge()``
fr: ``_elgg_purge_caches()`` changé pour ``Elgg\Cache\EventHandlers::purge()``

source: ``_elgg_river_menu_setup()`` changed to ``Elgg\Menus\River::registerDelete()``
fr: ``_elgg_river_menu_setup()`` changé pour ``Elgg\Menus\River::registerDelete()``

source: ``_elgg_save_notification_user_settings()`` changed to ``Elgg\Notifications\SaveUserSettingsHandler::class``
fr: ``_elgg_save_notification_user_settings()`` changé pour ``Elgg\Notifications\SaveUserSettingsHandler::class``

source: ``_elgg_session_cleanup_persistent_login()`` changed to ``Elgg\Users\CleanupPersistentLoginHandler::class``
fr: ``_elgg_session_cleanup_persistent_login()`` changé pour ``Elgg\Users\CleanupPersistentLoginHandler::class``

source: ``_elgg_set_lightbox_config()`` changed to ``Elgg\Javascript\SetLightboxConfigHandler::class``
fr: ``_elgg_set_lightbox_config()`` changé pour ``Elgg\Javascript\SetLightboxConfigHandler::class``

source: ``_elgg_set_user_default_access()`` changed to ``Elgg\Users\Settings::setDefaultAccess()``
fr: ``_elgg_set_user_default_access()`` changé pour ``Elgg\Users\Settings::setDefaultAccess()``

source: ``_elgg_set_user_email()`` changed to ``Elgg\Users\Settings::setEmail()``
fr: ``_elgg_set_user_email()`` changé pour ``Elgg\Users\Settings::setEmail()``

source: ``_elgg_set_user_password()`` changed to ``Elgg\Users\Settings::setPassword()``
fr: ``_elgg_set_user_password()`` changé pour ``Elgg\Users\Settings::setPassword()``

source: ``_elgg_set_user_language()`` changed to ``Elgg\Users\Settings::setLanguage()``
fr: ``_elgg_set_user_language()`` changé pour ``Elgg\Users\Settings::setLanguage()``

source: ``_elgg_set_user_name()`` changed to ``Elgg\Users\Settings::setName()``
fr: ``_elgg_set_user_name()`` changé pour ``Elgg\Users\Settings::setName()``

source: ``_elgg_set_user_username()`` changed to ``Elgg\Users\Settings::setUsername()``
fr: ``_elgg_set_user_username()`` changé pour ``Elgg\Users\Settings::setUsername()``

source: ``_elgg_send_email_notification()`` changed to ``Elgg\Notifications\SendEmailHandler::class``
fr: ``_elgg_send_email_notification()`` changé pour ``Elgg\Notifications\SendEmailHandler::class``

source: ``_elgg_upgrade_completed()`` changed to ``Elgg\Upgrade\UpgradeCompletedAdminNoticeHandler::class``
fr: ``_elgg_upgrade_completed()`` changé pour ``Elgg\Upgrade\UpgradeCompletedAdminNoticeHandler::class``

source: ``_elgg_upgrade_entity_menu()`` changed to ``Elgg\Menus\Entity::registerUpgrade()``
fr: ``_elgg_upgrade_entity_menu()`` changé pour ``Elgg\Menus\Entity::registerUpgrade()``

source: ``_elgg_user_ban_notification()`` changed to ``Elgg\Users\BanUserNotificationHandler::class``
fr: ``_elgg_user_ban_notification()`` changé pour ``Elgg\Users\BanUserNotificationHandler::class``

source: ``_elgg_user_get_subscriber_unban_action()`` changed to ``Elgg\Notifications\UnbanUserEventHandler``
fr: ``_elgg_user_get_subscriber_unban_action()`` changé pour ``Elgg\Notifications\UnbanUserEventHandler``

source: ``_elgg_user_prepare_unban_notification()`` changed to ``Elgg\Notifications\UnbanUserEventHandler``
fr: ``_elgg_user_prepare_unban_notification()`` changé pour ``Elgg\Notifications\UnbanUserEventHandler``
