Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: See the administrator guides for :doc:`how to upgrade a live site </admin/upgrading>`.
fr: Voir les guides d’administration pour savoir :doc:`comment mettre à niveau un site en production </admin/upgrading>`.

source: From 1.10 to 1.11
fr: De 1.10 à 1.11

source: Comment highlighting
fr: Surlignage des commentaires

source: If your theme is using the file ``views/default/css/elements/components.php``, you must add the following style definitions in it to enable highlighting for comments and discussion replies:
fr: Si votre thème utilise le fichier ``views/default/css/elements/components.php``, vous devez y ajouter les définitions de style suivantes pour activer la mise en surbrillance pour les commentaires et les réponses de discussion :

source: From 1.7 to 1.8
fr: 1.7 vers 1.8

source: Elgg 1.8 is the biggest leap forward in the development of Elgg since version 1.0. As such, there is more work to update core and plugins than with previous upgrades. There were a small number of API changes and following our standard practice, the methods we deprecated have been updated to work with the new API. The biggest changes are in the standardization of plugins and in the views system.
fr: Elgg 1.8 est le plus grand bond en avant dans le développement de Elgg depuis la version 1.0. Pour cette raison, cela demande plus de travail pour mettre à jour le noyau et les plugins qu’avec les mises à niveau précédentes. Il y a eu un petit nombre de changements d’API et, suivant notre pratique standard, les méthodes que nous avons dépréciées ont été mises à jour pour travailler avec la nouvelle API. Les plus grands changements sont dans la normalisation des plugins et dans le système de vues.

source: Updating core
fr: Mettre à niveau le cœur

source: Delete the following core directories (same level as _graphics and engine):
fr: Supprimez les répertoires du noyau suivants (même niveau que _graphics et engine) :

source: entities
fr: entités

source: If you do not delete these directories before an upgrade, you will have problems!
fr: Si vous ne supprimez pas ces répertoires avant une mise à niveau, vous allez avoir des ennuis !

source: Updating plugins
fr: Mettre à jour les plugins

source: Use standardized routing with page handlers
fr: Utilisez le routage standard avec vos gestionnaires de pages

source: All: /page_handler/all
fr: Tout : /page_handler/all

source: User’s content: /page_handler/owner/:username
fr: Publications de l'utilisateur : /page_handler/owner/:username

source: User’s friends' content: /page_handler/friends/:username
fr: Publications des contacts de l'utilisateur : /page_handler/friends/:username

source: Single entity: /page_handler/view/:guid/:title
fr: Entité seule : /page_handler/view/:guid/:title

source: Added: /page_handler/add/:container_guid
fr: Ajout : /page_handler/add/:container_guid

source: Editing: /page_handler/edit/:guid
fr: Modification : /page_handler/edit/:guid

source: Group list: /page_handler/group/:guid/all
fr: Liste des groupes : /page_handler/group/:guid/all

source: Include page handler scripts from the page handler
fr: Incluez les scripts des gestionnaires de page à partir du gestionnaire de page

source: Almost every page handler should have a page handler script. (Example: ``bookmarks/all => mod/bookmarks/pages/bookmarks/all.php``)
fr: Presque tous les gestionnaires de page doivent avoir un script de gestionnaire de page. (Exemple : ``bookmarks/all => mod/bookmarks/pages/bookmarks/all.php``)

source: Call ``set_input()`` for entity guids in the page handler and use ``get_input()`` in the page handler scripts.
fr: Appelez ``set_input()`` pour les guids d’entité dans le gestionnaire de page et utilisez ``get_input()`` dans les scripts du gestionnaire de page.

source: Call ``gatekeeper()`` and ``admin_gatekeeper()`` in the page handler function if required.
fr: Appelez ``gatekeeper()`` et ``admin_gatekeeper()`` dans la fonction du gestionnaire de page si nécessaire.

source: The group URL should use the ``pages/:handler/owner.php`` script.
fr: L’URL d'un groupe doit utiliser le script ``pages/:handler/owner.php``.

source: Page handlers should not contain HTML.
fr: Les gestionnaires de pages ne devraient pas contenir de HTML.

source: Update the URLs throughout the plugin. (Don't forget to remove ``/pg/``!)
fr: Mettez à jour les URLs dans tout le plugin. (N’oubliez pas d’enlever ``/pg/`` !)

source: Use standardized page handlers and scripts
fr: Utilisez les gestionnaires de pages standardisés et les scripts

source: Store page handler scripts in ``mod/:plugin/pages/:page_handler/:page_name.php``
fr: Stockez les scripts du gestionnaire de page dans ``mod/:plugin/pages/:page_handler/:page_name.php``

source: Use the content page layout in page handler scripts:
fr: Utilisez la disposition de page de contenu - content - dans les scripts du gestionnaire de pages :

source: Page handler scripts should not contain HTML.
fr: Les scripts des gestionnaires de pages ne devraient pas contenir de HTML.

source: Call ``elgg_push_breadcrumb()`` in the page handler scripts.
fr: Appelez ``elgg_push_breadcrumb()`` dans les scripts du gestionnaire de pages.

source: No need to set page owner if the URLs are in the standardized format.
fr: Inutile de définir le propriétaire de la page si les URLs sont au format standard.

source: For group content, check the container_guid by using elgg_get_page_owner_entity().
fr: Pour le contenu du groupe, vérifiez le conteneur container_guid en utilisant elgg_get_page_owner_entity().

source: The ``object/:subtype`` view
fr: La vue ``object/:subtype``

source: Make sure there are views for ``$vars['full_view'] == true`` and ``$vars['full_view'] == false``. ``$vars['full_view']`` replaced ``$vars['full]``.
fr: Assurez-vous qu'il existe bien des vues pour ``$vars['full_view'] == true`` et ``$vars['full_view'] == false``. ``$vars['full_view']`` a remplacé ``$vars['full]``.

source: Check for the object in ``$vars['entity']``. Use ``elgg_instance_of()`` to make sure it's the type of entity you want.
fr: Vérifiez l’objet dans ``$vars['entity']``. Utilisez ``elgg_instance_of()`` pour vous assurer qu’il s’agit du type d’entité que vous voulez.

source: Return ``true`` to short circuit the view if the entity is missing or wrong.
fr: Renvoyez ``true`` pour court-circuiter la vue si l’entité est manquante ou erronée.

source: Use ``elgg_view('object/elements/summary', array('entity' => $entity));`` and ``elgg_view_menu('entity', array('entity' => $entity));`` to help format. You should use very little markup in these views.
fr: Utilisez ``elgg_view('object/elements/summary', array('entity' => $entity));`` et ``elgg_view_menu('entity', array('entity' => $entity));`` pour faciliter le formatage. Vous devriez utiliser très peu de balisage dans ces vues.

source: Update action structure
fr: Mettez à jour la structure de l'action

source: Namespace action files and action names (example: ``mod/blog/actions/blog/save.php`` => ``action/blog/save``)
fr: Fichiers d’action et noms d’action de l’espace de noms (exemple : ``mod/blog/actions/blog/save.php`` => ``action/blog/save``)

source: Use the following action URLs:
fr: Utilisez les URLs d'action suivantes :

source: Add: ``action/:plugin/save``
fr: Ajoutez : ``action/:plugin/save``

source: Edit: ``action/:plugin/save``
fr: Modifiez : ``action/:plugin/save``

source: Delete: ``action/:plugin/delete``
fr: Supprimez : ``action/:plugin/delete``

source: Make the delete action accept ``action/:handler/delete?guid=:guid`` so the metadata entity menu has the correct URL by default.
fr: Faites que l'action de suppression accepte ``action/:handler/delete?guid=:guid`` de sorte que le menu des métadonnées de l'entité ait la bonne URL par défaut.

source: Update deprecated functions
fr: Mettez à jour les fonctions obsolètes

source: Functions deprecated in 1.7 will produce visible errors in 1.8.
fr: Les fonctions dépréciées en 1.7 produiront des erreurs visibles en 1.8.

source: You can also update functions deprecated in 1.8.
fr: Vous pouvez également mettre à jour les fonctions dépréciées dans 1.8.

source: Many registration functions simply added an ``elgg_`` prefix for consistency, and should be easy to update.
fr: De nombreuses fonctions d’enregistrement ont simplement ajouté un préfixe ``elgg_`` pour la cohérence, et devraient être faciles à mettre à jour.

source: See ``/engine/lib/deprecated-1.8.php`` for the full list.
fr: Voyez ``/engine/lib/deprecated-1.8.php`` pour la liste complète.

source: You can set the debug level to “warning” to get visual reminders of deprecated functions.
fr: Vous pouvez définir le niveau de débogage sur “warning” pour obtenir des rappels visuels des fonctions obsolètes.

source: Update the widget views
fr: Mettez à jour les vues widget

source: See the blog or file widgets for examples.
fr: Voyez les widgets des plugins blog ou file pour des exemples.

source: Update the group profile module
fr: Mettez à jour le module de profil de groupe

source: Use the blog or file plugins for examples. This will help with making your plugin themeable by the new CSS framework.
fr: Utilisez les plugins blog ou file pour des exemples. Cela vous aidera à pouvoir appliquer un thème à votre plugin avec le nouveau framework CSS.

source: Update forms
fr: Mettez à jour les formulaires

source: Move form bodies to the ``forms/:action`` view to use Evan's new ``elgg_view_form``.
fr: Déplacez les corps de formulaire vers la vue ``forms/:action`` pour utiliser le nouveau ``elgg_view_form`` d’Evan.

source: Use input views in form bodies rather than html. This helps with theming and future-proofing.
fr: Utilisez les vues d’entrée dans les corps de formulaire plutôt que du html. Cela aide à utiliser des thèmes et permet de préparer l’avenir.

source: Add a function that prepares the form (see ``mod/file/lib/file.php`` for an example)
fr: Ajoutez une fonction qui prépare le formulaire (voyez ``mod/file/lib/file.php`` pour un exemple)

source: Make your forms sticky (see the file plugin's upload action and form prepare function).
fr: Rendez vos formulaires persistants (voir l’action de téléchargement du plugin file et la fonction de préparation du formulaire).

source: The forms API is discussed in more detail in :doc:`/guides/actions`.
fr: L’API des formulaires est discutée plus en détail dans :doc:`/guides/actions`.

source: Clean up CSS/HTML
fr: Nettoyez le CSS/HTML

source: We have added many CSS patterns to the base CSS file (modules, image block, spacing primitives). We encourage you to use these patterns and classes wherever possible. Doing so should:
fr: Nous avons ajouté de nombreux modèles CSS au fichier CSS du noyau (modules, bloc avec une image, primitives d'espacement). Nous vous encourageons à utiliser ces modèles et ces classes dans la mesure du possible. Faire cela devrait :

source: Reduce maintenance costs, since you can delete most custom CSS.
fr: Réduire les coûts de maintenance, car vous pouvez supprimer la plupart des CSS personnalisés.

source: Make your plugin more compatible with community themes.
fr: Rendre votre plugin mieux compatible avec les thèmes de la communauté.

source: Look for patterns that can be moved into core if you need significant CSS.
fr: Recherchez des motifs qui peuvent être déplacés dans le noyau si vous avez besoin de CSS significatif.

source: We use hyphens rather than underscores in classes/ids and encourage you do the same for consistency.
fr: Nous utilisons des traits d’union plutôt que des soulignements dans les classes/ids et vous encourageons à faire de même pour maintenir la cohérence globale.

source: If you do need your own CSS, you should use your own namespace, rather than ``elgg-``.
fr: Si vous avez besoin de votre propre CSS, vous devez utiliser votre propre espace de noms, plutôt que ``elgg-``.

source: Update manifest.xml
fr: Mettez à jour manifest.xml

source: Use http://el.gg/manifest17to18 to automate this.
fr: Utilisez http://el.gg/manifest17to18 pour automatiser cette étape.

source: Don't use the "bundled" category with your plugins. That is only for plugins distributed with Elgg.
fr: N’utilisez pas la catégorie ``bundled`` avec vos plugins. Elle est réservée aux plugins distribués avec Elgg.

source: Update settings and user settings views
fr: Mettez à jour les paramètres et les vues des paramètres utilisateur

source: The view for settings is now ``plugins/:plugin/settings`` (previously ``settings/:plugin/edit``).
fr: La vue pour les paramètres est maintenant ``plugins/:plugin/settings`` (auparavant ``settings/:plugin/edit``).

source: The view for user settings is now ``plugins/:plugin/usersettings`` (previously ``usersettings/:plugin/edit``).
fr: La vue pour les paramètres utilisateur est maintenant ``plugins/:plugin/usersettings`` (auparavant ``usersettings/:plugin/edit``).

source: From 1.8 to 1.9
fr: De 1.8 à 1.9

source: In the examples we are upgrading an imaginary "Photos" plugin.
fr: Dans les exemples, nous mettons à niveau un plugin imaginaire ``Photos``.

source: Only the key changes are included. For example some of the deprecated functions are not mentioned here separately.
fr: Seuls les changements de clefs sont inclus. Par exemple, certaines des fonctions dépréciées ne sont pas mentionnées ici séparément.

source: Each section will include information whether the change is backwards compatible with Elgg 1.8.
fr: Chaque section comprendra des informations sur la rétro-compatibilité avec Elgg 1.8.

source: The manifest file
fr: Le fichier manifest.xml

source: No changes are needed if your plugin is compatible with 1.8.
fr: Aucun changement n’est nécessaire si votre plugin est compatible avec 1.8.

source: It's however recommended to add the ``<id>`` tag. It's value should be the name of the directory where the plugin is located inside the ``mod/`` directory.
fr: Il est toutefois recommandé d’ajouter l’étiquette ``<id>``. Sa valeur devrait être le nom du répertoire du plugin à l’intérieur du répertoire ``mod/``.

source: If you make changes that break BC, you must update the plugin version and the required Elgg release.
fr: Si vous effectuez des modifications qui cassent la rétro-compatibilité arrière - ou "BC" pour "Backward Compatibility", vous devez mettre à jour la version du plugin et la distribution de Elgg requise.

source: Example of (shortened) old version:
fr: Exemple (abrégé) d’une ancienne version :

source: Example of (shortened) new version:
fr: Exemple de nouvelle version (raccourcie) :

source: $CONFIG and $vars['config']
fr: $CONFIG et $vars['config']

source: Both the global ``$CONFIG`` variable and the ``$vars['config']`` parameter have been deprecated. They should be replaced with the ``elgg_get_config()`` function.
fr: La variable globale ``$CONFIG`` et le paramètre ``$vars['config']`` ont été dépréciés. Ils devraient être remplacés par la fonction ``elgg_get_config()``.

source: Example of old code:
fr: Exemple d'ancien code :

source: Example of new code:
fr: Exemple de nouveau code :

source: Compatible with 1.8
fr: Compatible avec 1.8

source: See how the community_plugins plugin was updated: https://github.com/Elgg/community_plugins/commit/f233999bbd1478a200ee783679c2e2897c9a0483
fr: Voyez comment le plugin community_plugins a été mis à jour : https://github.com/Elgg/community_plugins/commit/f233999bbd1478a200ee783679c2e2897c9a0483

source: Language files
fr: Fichiers linguistiques

source: In Elgg 1.8 the language files needed to use the ``add_translation()`` function. In 1.9 it is enough to just return the array that was previously passed to the function as a parameter. Elgg core will use the file name (e.g. en.php) to tell which language the file contains.
fr: Dans Elgg 1.8, les fichiers linguistiques devaient utiliser la fonction ``add_translation()``. En 1.9, il suffit de simplement renvoyer le tableau qui a été précédemment passé à la fonction en tant que paramètre. Le noyau de Elgg utilisera le nom du fichier (par ex. fr.php) pour déterminer quelle langue contient le fichier.

source: Example of the old way in ``languages/en.php``:
fr: Exemple d'ancienne manière de faire dans ``languages/en.php`` :

source: Example of new way:
fr: Exemple de nouvelle manière de faire :

source: Not compatible with 1.8
fr: Non compatible avec 1.8

source: One of the biggest changes in Elgg 1.9 is the notifications system. The new system allows more flexible and scalable way of sending notifications.
fr: L’un des plus grands changements dans Elgg 1.9 est le système de notifications. Le nouveau système offre une manière plus flexible et évolutive d’envoyer des notifications.

source: Example of the old way:
fr: Exemple d'ancienne manière de faire :

source: Example of the new way:
fr: Exemple de la nouvelle manière de faire :

source: See how the community_plugins plugin was updated to use the new system: https://github.com/Elgg/community_plugins/commit/bfa356cfe8fb99ebbca4109a1b8a1383b70ff123
fr: Voyez comment le plugin community_plugins a été mis à jour pour utiliser le nouveau système : https://github.com/Elgg/community_plugins/commit/bfa356cfe8fb99ebbca4109a1b8a1383b70ff123

source: Notifications can also be sent with the ``notify_user()`` function.
fr: Les notifications peuvent aussi être envoyées par la fonction ``notify_user()``.

source: It has however been updated to support three new optional parameters passed inside an array as the fifth parameter.
fr: Il a toutefois été mis à jour pour prendre en charge trois nouveaux paramètres optionnels passés à l’intérieur d’un tableau comme cinquième paramètre.

source: The parameters give notification plugins more control over the notifications, so they should be included whenever possible. For example the bundled site_notifications plugin won't work properly if the parameters are missing.
fr: Les paramètres donnent aux plugins de notification plus de contrôle sur les notifications, de sorte qu’ils doivent être inclus dans la mesure du possible. Par exemple, le plugin site_notifications inclus ne fonctionnera pas correctement si les paramètres sont manquants.

source: Parameters:
fr: Paramètres :

source: **object** The object that we are notifying about (e.g. ElggEntity or ElggAnnotation). This is needed so that notification plugins can provide a link to the object.
fr: **object** L’objet pour lequel nous envoyons une notification (par ex. ElggEntity ou ElggAnnotation). Ceci est nécessaire pour que les plugins de notification puissent fournir un lien vers l’objet.

source: **action** String that describes the action that triggered the notification (e.g. "create", "update", etc).
fr: **action** Chaîne qui décrit l’action qui a déclenché la notification (par ex. "create", "update", etc.).

source: **summary** String that contains a summary of the notification. (It should be more informative than the notification subject but less informative than the notification body.)
fr: **summary** Chaîne qui contient un résumé de la notification. (Elle devrait être plus informative que le sujet de notification, mais moins informative que le corps de la notification.)

source: Adding items to the Activity listing
fr: Ajout d’éléments à la liste des Activités

source: You can also add the optional ``target_guid`` parameter which tells the target of the create action.
fr: Vous pouvez également ajouter le paramètre facultatif ``target_guid`` qui indique la cible de l’action create.

source: If the photo would had been added for example into a photo album, we could add it by passing in also:
fr: Si la photo avait été ajoutée par exemple dans un album photo, nous pourrions l’ajouter en passant aussi :

source: Entity URL handlers
fr: Gestionnaires d'URL d'une entité

source: The ``elgg_register_entity_url_handler()`` function has been deprecated. In 1.9 you should use the ``'entity:url', 'object'`` plugin hook instead.
fr: La fonction ``elgg_register_entity_url_handler()`` a été dépréciée. Dans 1.9, vous devez utiliser le hook plugin ``'entity:url', 'object'``.

source: In Elgg 1.8 the web services API was included in core and methods were exposed using ``expose_function()``. To enable the same functionality for Elgg 1.9, enable the "Web services 1.9" plugin and replace all calls to ``expose_function()`` with ``elgg_ws_expose_function()``.
fr: Dans Elgg 1.8, l’API des services Web a été incluse dans le noyau et les méthodes ont été exposées à l’aide de ``expose_function()``. Pour activer la même fonctionnalité pour Elgg 1.9, activez le plugin ``Web services 1.9`` et remplacez tous les appels à ``expose_function()`` par ``elgg_ws_expose_function()``.

source: From 1.9 to 1.10
fr: De 1.9 à 1.10

source: File uploads
fr: Envois de fichiers

source: If your plugin is using a snippet copied from the ``file/upload`` action to fix detected mime types for Microsoft zipped formats, it can now be safely removed.
fr: Si votre plugin utilise un bout de code copié à partir de l’action ``file/upload`` pour corriger les types mime détectés pour les formats zippés Microsoft, ce bout de code peut maintenant être supprimé en toute sécurité.

source: If your upload action performs other manipulations on detected mime and simple types, it is recommended to make use of available plugin hooks:
fr: Si votre action de téléchargement effectue d’autres manipulations sur le type mime détecté et les types simples, il est recommandé de faire usage des hooks plugin disponibles :

source: ``'mime_type','file'`` for filtering detected mime types
fr: ``'mime_type','file'`` pour filtrer les types mime détectés

source: ``'simple_type','file'`` for filtering parsed simple types
fr: ``'simple_type','file'`` pour filtrer les types simples analysés

source: From 1.x to 2.0
fr: De 1.x à 2.0

source: Elgg can be now installed as a composer dependency instead of at document root
fr: Elgg peut maintenant être installé en tant que dépendance composer au lieu d'être situé à la racine

source: That means an Elgg site can look something like this:
fr: Cela signifie qu’un site Elgg peut ressembler à ceci :

source: ``elgg_get_root_path`` and ``$CONFIG->path`` will return the path to the application root directory, which is not necessarily the same as Elgg core's root directory (which in this case is ``vendor/elgg/elgg/``).
fr: ``elgg_get_root_path`` et ``$CONFIG->path`` vont renvoyer le chemin vers le répertoire racine de l’application, qui n’est pas nécessairement le même que le répertoire racine du noyau de Elgg (qui dans ce cas est ``vendor/elgg/elgg/``).

source: Do not attempt to access the core Elgg from your plugin directly, since you cannot rely on its location on the filesystem.
fr: N’essayez pas d’accéder directement au noyau de Elgg depuis votre plugin, car vous ne pouvez pas compter sur son emplacement dans le système de fichiers.

source: In particular, don't try load ``engine/start.php``.
fr: En particulier, n’essayez pas de charger ``engine/start.php``.

source: To boot Elgg manually, you can use the class ``Elgg\Application``.
fr: Pour démarrer Elgg manuellement, vous pouvez utiliser la classe ``Elgg\Application``.

source: However, use this approach sparingly. Prefer :doc:`/guides/routing` instead whenever possible as that keeps your public URLs and your filesystem layout decoupled.
fr: Cependant, utilisez cette approche avec parcimonie. Préférez le routage :doc:`/guides/routing` dans la mesure du possible, car cela permet de découpler vos URLs publiques et votre structure de système de fichiers.

source: Also, don't try to access the ``_graphics`` files directly.
fr: En outre, n’essayez pas d’accéder directement aux fichiers ``_graphics``.

source: Use :doc:`/guides/views` instead:
fr: Utilisez :doc:`/guides/views` à la place :
