Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: In the ``settings.php`` file you can configure settings for ``$CONFIG->http_request_trusted_proxy_ips`` and ``$CONFIG->http_request_trusted_proxy_headers`` check the ``settings.php`` file for more information.
fr: Dans le fichier ``settings.php``, vous pouvez configurer des paramètres pour ``$CONFIG->http_request_trusted_proxy_ips`` et ``$CONFIG->http_request_trusted_proxy_headers``. Regardez dans le fichier ``settings.php`` pour plus d'information.

source: Security
fr: Sécurité

source: Is upgrade.php a security concern?
fr: Est-ce que upgrade.php pose des soucis de sécurité ?

source: Upgrade.php is a file used to run code and database upgrades. It is in the root of the directory and doesn't require a logged in account to access. On a fully upgraded site, running the file will only reset the caches and exit, so this is not a security concern.
fr: Upgrade.php est un fichier utilisé pour exécuter des mises à niveau du code et de la base de données. Il est placé à la racine de l'installation et il n'y a pas besoin d'un compte identifié pour y accéder. Sur un site totalement à niveau, l'exécution du fichier va seulement réinitialiser les caches et quitter, de sorte que ceci ne constitue pas un problème de sécurité.

source: If you are still concerned, you can either delete, move, or change permissions on the file until you need to upgrade.
fr: SI cela vous préoccupe tout de même, vous pouvez supprimer, déplacer, ou modifier les permissions de ce fichier jusqu'à-ce que vous ayez besoin d'effectuer une mise à niveau.

source: Should I delete install.php?
fr: Devrais-je supprimer install.php ?

source: This file is used to install Elgg and doesn't need to be deleted. The file checks if Elgg is already installed and forwards the user to the front page if it is.
fr: Ce fichier est utilisé pour installer Elgg et n’a pas besoin d’être supprimé. Le fichier vérifie si Elgg est déjà installé et redirige l’utilisateur vers la première page si c'est le cas.

source: Filtering
fr: Filtrage

source: Filtering is used in Elgg to make `XSS`_ attacks more difficult. The purpose of the filtering is to remove Javascript and other dangerous input from users.
fr: Le filtrage est utilisé dans Elgg pour rendre les `attaques XSS`_ plus difficiles. L'objectif du filtrage est de supprimer les JavaScript et autres entrées dangereuses envoyées par les utilisateurs.

source: Filtering is performed through the function ``elgg_sanitize_input()``. This function takes in a string and returns a filtered string. It triggers a *sanitize*, *input* :doc:`event </design/events>`. By default Elgg comes with the htmLawed filtering code as a plugin. Developers can drop in any additional or replacement filtering code as a plugin.
fr: Le filtrage est effectué via la fonction ``elgg_sanitize_input()``. Cette fonction récupère une chaîne et renvoie une chaîne filtrée. Elle déclenche un :doc:`event </design/events>` *sanitize*, *input*. Par défaut, Elgg est livré avec la bibliothèque de filtrage htmLawed sous forme de plugin. Les développeurs peuvent ajouter n’importe quel code de filtrage supplémentaire ou de remplacement via un plugin.

source: The ``elgg_sanitize_input()`` function is called on any user input as long as the input is obtained through a call to ``get_input()``. If for some reason a developer did not want to perform the default filtering on some user input, the ``get_input()`` function has a parameter for turning off filtering.
fr: La fonction ``elgg_sanitize_input()`` est appelée pour chaque saisie utilisateur dès lors que la saisie est obtenue à travers un appel à ``get_input()``. Si pour une raison quelconque un développeur souhaite ne pas appliquer le filtrage par défaut sur certaines saisies utilisateur, la fonction ``get_input()`` dispose d'un paramètre pour désactiver le filtrage.

source: Development
fr: Développement

source: What should I use to edit php code?
fr: Que devrais-je utiliser pour modifier le code php ?

source: There are two main options: text editor or `integrated development environment`_ (IDE).
fr: Il existe deux options principales : l’éditeur de texte ou l'`environnement de développement intégré`_ (IDE).

source: Text Editor
fr: Éditeur de texte

source: If you are new to software development or do not have much experience with IDEs, using a text editor will get you up and running the quickest. At a minimum, you will want one that does syntax highlighting to make the code easier to read. If you think you might submit patches to the bug tracker, you will want to make sure that your text editor does not change line endings. If you are using Windows, `Notepad++`_ is a good choice. If you are on a Mac, TextWrangler_ is a popular choice. You could also give TextMate_ a try.
fr: Si vous débutez dans le développement de logiciels ou n’avez pas beaucoup d’expérience avec les IDE, l’utilisation d’un éditeur de texte vous permettra d'être opérationnel le plus rapidement. Au minimum, vous voudrez un éditeur avec coloration syntaxique, qui rend le code plus facile à lire. Si vous pensez que vous pouvez soumettre des correctifs pour le suivi de bogues, vous voudrez vous assurer que votre éditeur de texte ne modifie pas les terminaisons de ligne. Si vous utilisez Windows, `Notepad++`_ est un bon choix. Si vous êtes sur un Mac, TextWrangler_ est un choix populaire. Vous pouvez également essayer TextMate_.

source: Integrated Development Environment
fr: IDE - Environnement de Développement Intégré

source: An IDE does just what its name implies: it includes a set of tools that you would normally use separately. Most IDEs will include source code control which will allow you to directly commit and update your code from your cvs repository. It may have an FTP client built into it to make the transfer of files to a remote server easier. It will have syntax checking to catch errors before you try to execute the code on a server.
fr: Un IDE - EDI pour Environnement de Développement Intégré en français - fait exactement ce que son nom implique : il comprend un ensemble d’outils que vous utiliseriez normalement séparément. La plupart des IDE incluront le contrôle de code source qui vous permettra de valider et de mettre à jour directement votre code à partir de votre référentiel cvs. Il peut avoir un client FTP intégré pour faciliter le transfert de fichiers sur un serveur distant. Il disposera d'une vérification de syntaxe pour attraper les erreurs avant que vous essayiez d’exécuter le code sur un serveur.

source: The two most popular free IDEs for PHP developers are Eclipse_ and NetBeans_. Eclipse has two different plugins for working with PHP code: PDT_ and PHPEclipse_.
fr: Les deux IDE gratuits les plus populaires pour les développeurs PHP sont Eclipse_ et NetBeans_. Eclipse dispose de deux plugins différents pour travailler avec le code PHP : PDT_ et PHPEclipse_.

source: I don't like the wording of something in Elgg. How do I change it?
fr: Je n’aime pas certaines traductions dans Elgg. Comment puis-je les changer ?

source: The best way to do this is with a plugin.
fr: La meilleure façon de faire ceci est avec un plugin.

source: Locate the string that you want to change
fr: Localisez la chaîne que vous voulez modifier

source: All the strings that a user sees should be in the ``/languages`` directory or in a plugin's languages directory (``/mod/<plugin name>/languages``). This is done so that it is easy to change what language Elgg uses. For more information on this see the developer documentation on :doc:`/guides/i18n` .
fr: Toutes les chaînes qu’un utilisateur peut voir devraient être dans le répertoire ``/languages`` ou dans le répertoire des langues d’un plugin (``/mod/<plugin name>/languages``). Ceci est fait de sorte qu’il soit facile de changer la langue utilisée par Elgg. Pour plus d’informations à ce sujet, consultez la documentation développeur sur :doc:`/guides/i18n` .

source: To find the string use ``grep`` or a text editor that provides searching through files to locate the string. (A good text editor for Windows is `Notepad++`_ ) Let's say we want to change the string "Add friend" to "Make a new friend". The ``grep`` command to find this string would be ``grep -r "Add friend" *``. Using `Notepad++`_ , you would use the "Find in files" command. You would search for the string, set the filter to ``*.php``, set the directory to the base directory of Elgg, and make sure it searches all subdirectories. You might want to set it to be case sensitive also.
fr: Pour trouver la chaîne, utilisez ``grep`` ou un éditeur de texte qui fournit la recherche dans les fichiers pour localiser la chaîne. (Un bon éditeur de texte pour Windows est `Notepad++`_ ) Disons que nous voulons modifier la chaîne ``Ajouter un contact`` en ``Se faire un nouvel ami``. La commande ``grep`` qui pemet de trouver cette chaîne serait ``grep -r "Ajouter un contact" *``. Avec `Notepad++`_ , vous utiliseriez la commande "Trouver dans les fichiers". Vous recherchez la chaîne, définissez le filtre sur ``*.php``, définissez le répertoire de recherche sur le répertoire racine de Elgg, et vous assurez qu’il recherche dans tous les sous-répertoires. Vous voudrez peut-être aussi définir que la recherche soit sensible à la casse.

source: You should locate the string "Add friend" in ``/languages/en.php``. You should see something like this in the file:
fr: Vous devriez placer la chaîne "Ajouter un contact" dans ``/languages/fr.php``. Vous devriez voir quelque chose comme ceci dans le fichier :

source: This means every time Elgg sees ``friend:add`` it replaces it with "Add friend". We want to change the definition of ``friend:add``.
fr: Cela signifie que chaque fois que Elgg voit ``friend:add`` il le remplace par ``Ajouter un contact``. Nous voulons changer la définition de ``friend:add``.

source: Override the string
fr: Remplacement de la chaîne

source: To override this definition, we will add a languages file to the plugin that we built in the first step.
fr: Pour remplacer cette définition, nous ajouterons un fichier linguistique langues au plugin que nous avons construit dans la première étape.

source: Create a new directory: ``/mod/<your plugin name>/languages``
fr: Créez un nouveau répertoire : ``/mod/<your plugin name>/languages``

source: Create a file in that directory called ``en.php``
fr: Créer un fichier dans ce répertoire appelé ``fr.php``

source: Add these lines to that file
fr: Ajoutez ces lignes à ce fichier

source: Make sure that you do not have any spaces or newlines before the ``<?php``.
fr: Assurez-vous que vous n’avez pas d’espace ou de retour à la ligne avant ``<?php``.

source: You're done now and should be able to enable the plugin and see the change. If you are override the language of a plugin, make sure your plugin is loaded after the one you are trying to modify. The loading order is determined in the Tools Administration page of the admin section. As you find more things that you'd like to change, you can keep adding them to this plugin.
fr: Vous avez terminé maintenant et devriez être en mesure d’activer le plugin et de voir le changement. Si vous remplacez la langue d’un plugin, assurez-vous que votre plugin est chargé après celui que vous essayez de modifier. L’ordre de chargement est déterminé dans la page Administration des outils de la section Administrateur. Au fur et à mesure que vous trouverez d'autres choses à changer, vous pouvez continuer à les ajouter à ce plugin.

source: How do I find the code that does x?
fr: Comment puis-je trouver le code qui fait X ?

source: The best way to find the code that does something that you would like to change is to use ``grep`` or a similar search tool. If you do not have ``grep`` as a part of your operating system, you will want to install a grep tool or use a text-editor/IDE that has good searching in files. `Notepad++`_ is a good choice for Windows users. `Eclipse`_ with PHP and `NetBeans`_ are good choices for any platform.
fr: La meilleure façon de trouver le code qui fait quelque chose que vous souhaitez changer est d’utiliser ``grep`` ou un outil de recherche similaire. Si ``grep`` n'est pas intégré à votre système d’exploitation, vous voudrez installer un outil grep ou utiliser un éditeur de texte/IDE qui dispose d'un bonne recherche dans les fichiers. `Notepad++`_ est un bon choix pour les utilisateurs de Windows. `Eclipse`_ avec PHP et `NetBeans`_ sont de bons choix pour n’importe quelle plateforme.

source: String Example
fr: Exemple de chaîne - String

source: Let's say that you want to find where the *Log In* box code is located. A string from the *Log In* box that should be fairly unique is ``Remember me``. ``Grep`` for that string. You will find that it is only used in the ``en.php`` file in the ``/languages`` directory. There it is used to define the :doc:`/guides/i18n` string ``user:persistent``. ``Grep`` for that string now. You will find it in two places: the same ``en.php`` language file and in ``/views/default/forms/login.php``. The latter defines the html code that makes up the *Log In* box.
fr: Supposons que vous souhaitez trouver où se trouve le code de la boîte de *Connexion*. Une chaîne de la zone *Connexion* qui devrait être suffisamment unique est ``Se souvenir de moi`` - "Remember me". Faites un ``grep`` pour cette chaîne. Vous constaterez qu’elle n’est utilisée que dans le fichier ``fr.php`` - ou en.php pour la version d'origine - dans le répertoire ``/languages``. Là, il est utilisé pour définir la chaîne :doc:`/guides/i18n` ``user:persistent``. Faites maintenant un ``grep`` pour cette chaîne. Vous la trouverez en deux endroits : le même fichier linguistique ``fr.php`` et dans ``/views/default/forms/login.php``. Ce dernier emplacement définit le code html qui constitue la boîte *Connexion*.

source: Action Example
fr: Exemple d'Action

source: Let's say that you want to find the code that is run when a user clicks on the *Save* button when arranging widgets on a profile page. View the Profile page for a test user. Use Firebug to drill down through the html of the page until you come to the action of the edit widgets form. You'll see the url from the base is ``action/widgets/move``.
fr: Supposons que vous souhaitez trouver le code qui s’exécute lorsqu’un utilisateur clique sur le bouton *Enregistrer* après avoir agencé les widgets sur une page de profil. Consultez la page du Profil d’un utilisateur de test. Utilisez Firebug pour inspecter le html de la page jusqu’à ce que vous trouviez l’action du formulaire de widgets de modification. Vous verrez que l’URL depuis la racine est ``action/widgets/move``.

source: ``Grep`` on ``widgets/move`` and two files are returned. One is the JavaScript code for the widgets : ``/js/lib/ui.widgets.js``. The other one, ``/engine/lib/widgets.php``, is where the action is registered using ``elgg_register_action('widgets/reorder')``. You may not be familiar with that function in which case, you should look it up at the API reference. Do a search on the function and it returns the documentation on the function. This tells you that the action is in the default location since a file location was not specified. The default location for actions is ``/actions`` so you will find the file at ``/actions/widgets/move.php``.
fr: Faites un ``grep`` sur ``widgets/move`` et deux fichiers sont retournés. L’un est le code JavaScript pour les widgets : ``/js/lib/ui.widgets.js``. L’autre, ``/engine/lib/widgets.php``, est l’endroit où l’action est enregistrée à l’aide de ``elgg_register_action('widgets/reorder')``. Vous ne connaissez peut-être pas cette fonction : dans ce cas, vous devriez consulter sa page dans la référence de l'API. Effectuez une recherche sur la fonction et cela renverra la documentation de la fonction. Cela vous indique que l’action se trouve à l’emplacement par défaut puisqu’un emplacement de fichier n’a pas été spécifié. L’emplacement par défaut des actions est ``/actions`` de sorte que vous trouverez le fichier dans ``/actions/widgets/move.php``.

source: Debug mode
fr: Mode de débogage

source: During the installation process you might have noticed a checkbox that controlled whether debug mode was turned on or off. This setting can also be changed on the Site Administration page. Debug mode writes a lot of extra data to your php log. For example, when running in this mode every query to the database is written to your logs. It may be useful for debugging a problem though it can produce an overwhelming amount of data that may not be related to the problem at all. You may want to experiment with this mode to understand what it does, but make sure you run Elgg in normal mode on a production server.
fr: Durant le processus d’installation, vous avez peut-être remarqué une case à cocher qui contrôlait si le mode débogage était activé ou désactivé. Ce paramètre peut également être modifié dans la page Administration du site. Le mode de débogage écrit beaucoup de données supplémentaires dans votre journal php. Par exemple, lorsque vous utilisez ce mode, chaque requête dans la base de données est écrite dans vos journaux. Cela peut être utile pour le débogage d’un problème, mais peut produire une quantité énorme de données qui peuvent ne pas être liées du tout au problème recherché. Vous pouvez expérimenter avec ce mode pour comprendre ce qu’il fait, mais assurez-vous d’exécuter Elgg en mode normal sur un serveur de production.

source: Because of the amount of data being logged, don't enable this on a production server as it can fill up the log files really quick.
fr: En raison de la quantité de données enregistrées, il est préférable de ne pas l'activer sur un serveur de production car cela peut remplir les fichiers journaux très rapidement.

source: What goes into the log in debug mode?
fr: Que contient le journal en mode débogage ?

source: All database queries
fr: Toutes les requêtes de base de données

source: Database query profiling
fr: Profilage des requêtes de base de données

source: Page generation time
fr: Durée de génération de page

source: Number of queries per page
fr: Nombre de requêtes par page

source: List of plugin language files
fr: Liste des fichiers linguistiques du plugin

source: Additional errors/warnings compared to normal mode (it's very rare for these types of errors to be related to any problem that you might be having)
fr: Des erreurs/avertissements supplémentaires par rapport au mode normal (il est très rare que ces types d’erreurs soient liées à un problème que vous pourriez avoir)

source: What does the data look like?
fr: À quoi ressemblent les données ?

source: What events are triggered on every page load?
fr: Quels événements sont déclenchés sur chaque chargement de page ?

source: There are 4 :doc:`Elgg events </design/events>` that are triggered on every page load:
fr: Il y a 4 :doc:`événements Elgg </design/events>` qui sont déclenchés sur chaque chargement de page :

source: The first three are triggered in ``Elgg\Application::bootCore``. **shutdown, system** is triggered in ``\Elgg\Application\ShutdownHandler`` after the response has been sent to the client. They are all :doc:`documented </guides/events-list>`.
fr: Les trois premiers sont déclenchés dans ``Elgg\Application::bootCore``. **shutdown, system** est déclenché dans ``\Elgg\Application\ShutdownHandler`` après que la réponse a été envoyée au client. Ils sont tous :doc:`documentés </guides/events-list>`.

source: There are other events triggered by Elgg occasionally (such as when a user logs in).
fr: Il existe d’autres événements déclenchés par Elgg occasionnellement (par exemple lorsqu’un utilisateur se connecte).

source: Copy a plugin
fr: Copie d'un plugin

source: There are many questions asked about how to copy a plugin. Let's say you want to copy the ``blog`` plugin in order to run one plugin called ``blog`` and another called ``poetry``. This is not difficult but it does require a lot of work. You would need to
fr: Il y a beaucoup de questions posées sur la façon de copier un plugin. Disons que vous voulez copier le plugin ``blog`` afin d’exécuter un plugin appelé ``blog`` et un autre appelé ``poetry``. Ce n’est pas difficile, mais cela demande beaucoup de travail. Vous auriez besoin de

source: change the directory name
fr: changer le nom du répertoire

source: change the names of every function (having two functions causes PHP to crash)
fr: changer les noms de toutes les fonctions (avoir deux fonctions avec le même nom provoque un plantage de PHP)

source: change the name of every view (so as not to override the views on the original plugin)
fr: modifier le nom de chaque vue (afin de ne pas remplacer les vues du plugin d’origine)

source: change any data model subtypes
fr: modifier tous les sous-types du modèle de données

source: change the language file
fr: modifier le fichier linguistique

source: change anything else that was specific to the original plugin
fr: changer tout le reste de ce qui était spécifique au plugin d’origine

source: If you are trying to clone the ``groups`` plugin, you will have the additional difficulty that the group plugin does not set a subtype.
fr: Si vous essayez de cloner le plugin ``groups``, vous aurez la difficulté supplémentaire que le plugin de groupe ne définit pas de sous-type.

source: History
es: Historia
fr: Historique

source: The name comes from `a town in Switzerland`__. It also means "elk" or "moose" in Danish.
es: El nombre viene de `una ciudad suiza`__. También significa «alce» o «ratón» en danés.
fr: Le nom vient `d'une ville en Suisse`__. Cela signifie aussi "élan" ou "orignal" en Danois.

source: Elgg's initial funding was by a company called Curverider Ltd, which was started by David Tosh and Ben Werdmuller. In 2010, Curverider was acquired by Thematic Networks and control of the open-source project was turned over to `The Elgg Foundation`_. Today, Elgg is a community-driven open source project and has a variety of contributors and supporters.
fr: Le financement initial de Elgg a été initié par une société appelée Curverider Ltd, qui a été lancée par David Tosh et Ben Werdmuller. En 2010, Curverider a été acquise par Thematic Networks et le contrôle du projet open-source a été confié à `The Elgg Foundation`_. Aujourd’hui, Elgg est un projet open source communautaire avec une variété de contributeurs et de soutiens.

source: Appendix
es: Apéndice
fr: Annexes

source: Miscellaneous information about the project.
es: Información variada sobre el proyecto.
fr: Informations diverses à propos du projet.

source: Release Policy
es: Política de publicaciones
fr: Politique de versions

source: What to expect when upgrading Elgg.
es: Qué esperar al actualizar Elgg.
fr: À quoi s’attendre lors de la mise à niveau de Elgg.

source: We adhere to `semantic versioning`_.
fr: Nous adhérons au `versionnage sémantique`_.

source: Follow the blog to `stay up to date on the latest releases`__.
es: Siga el blog para `mantenerse informado de las últimas versiones publicadas`__.
fr: Suivez le blog pour `rester à jour sur les dernières versions`__.

source: Patch/Bugfix Releases (2.1.x)
fr: Versions de correctifs/bugfix (2.1.x)

source: Every two weeks.
fr: Toutes les deux semaines.

source: Bugfix releases are made regularly to make sure Elgg stays stable, secure, and bug-free. The higher the third digit, the more tested and stable the release is.
fr: Les publications de correctifs sont effectuées régulièrement pour s’assurer que Elgg reste stable, sécurisé et exempt de bogues. Plus le troisième chiffre est élevé, plus la version est testée et stable.
