Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``elgg.walled_garden`` JavaScript is deprecated: Use ``elgg/walled_garden`` AMD module instead.
fr: Le JavaScript ``elgg.walled_garden`` est obsolète : Utilisez le module AMD ``elgg/walled_garden`` à la place.

source: ``elgg()->getDb()->getTableprefix()``: Use ``elgg_get_config('dbprefix')``.
fr: ``elgg()->getDb()->getTableprefix()`` : Utilisez ``elgg_get_config('dbprefix')``.

source: Private ``update_entity_last_action()``: Refrain from manually updating last action timestamp.
fr: ``update_entity_last_action()`` est une fonction privée : Évitez de mettre à jour manuellement le timestamp de la dernière action.

source: Setting non-public ``access_id`` on metadata is deprecated. See below.
fr: Définir un ``access_id`` non-public sur une métadonnée est obsolète. Voyez ci-dessous.

source: ``get_resized_image_from_existing_file()``: Use ``elgg_save_resized_image()``.
fr: ``get_resized_image_from_existing_file()`` : Utilisez ``elgg_save_resized_image()``.

source: ``get_resized_image_from_uploaded_file()``: Use ``elgg_save_resized_image()`` in combination with upload API.
fr: ``get_resized_image_from_uploaded_file()`` : Utilisez ``elgg_save_resized_image()`` en combinaison avec l'API d'envoi de fichier

source: ``get_image_resize_parameters()`` will be removed.
fr: ``get_image_resize_parameters()`` sera supprimé.

source: ``elgg_view_input()``: Use ``elgg_view_field()``. Apologies for the API churn.
fr: ``elgg_view_input()`` : Utilisez ``elgg_view_field()``. Toutes nos excuses pour le changement d'API.

source: ``resources/file/world``: Use the ``resources/file/all`` view instead.
fr: ``resources/file/world`` : Utilisez la vue ``resources/file/all``.

source: ``resources/pages/world``: Use the ``resources/pages/all`` view instead.
fr: ``resources/pages/world`` : Utilisez la vue ``resources/pages/all``.

source: ``walled_garden.js``: Use the ``elgg/walled_garden`` module instead.
fr: ``walled_garden.js`` : Utilisez le module ``elgg/walled_garden`` à la place.

source: New API for page and action handling
fr: Nouvelle API pour la gestion des pages et des actions

source: Page handlers and action script files should now return an instance of ``\Elgg\Http\ResponseBuilder``. Plugins should use the following convenience functions to build responses:
fr: Les gestionnaires de pages et les fichiers de script d’action doivent maintenant renvoyer une instance de ``\Elgg\Http\ResponseBuilder``. Les plugins devraient utiliser les fonctions suivantes pour créer des réponses :

source: ``elgg_ok_response()`` sends a 2xx response with HTML (page handler) or JSON data (actions)
fr: ``elgg_ok_response()`` envoie une réponse 2xx avec des données HTML (gestionnaire de page) ou JSON (actions)

source: ``elgg_error_response()`` sends a 4xx or 5xx response without content/data
fr: ``elgg_error_response()`` envoie une réponse 4xx ou 5xx sans contenu/donnée

source: ``elgg_redirect_response()`` silently redirects the request
fr: ``elgg_redirect_response()`` redirige silencieusement la requête

source: New API for working with file uploads
fr: Nouvelle API pour travailler avec l'envoi de fichiers

source: ``elgg_get_uploaded_files()`` - returns an array of Symfony uploaded file objects
fr: ``elgg_get_uploaded_files()`` - renvoie un tableau d’objets Symfony de fichiers téléchargés

source: ``ElggFile::acceptUploadedFile()`` - moves an uploaded file to Elgg's filestore
fr: ``ElggFile::acceptUploadedFile()`` - déplace un fichier téléchargé dans le répertoire de fichiers de Elgg

source: New API for manipulating images
fr: Nouvelle API pour la manipulation d’images

source: New image manipulation service implements a more efficient approach to cropping and resizing images.
fr: Le nouveau service de manipulation d’images met en œuvre une approche plus efficace pour recadrer et redimensionner les images.

source: ``elgg_save_resized_image()`` - crops and resizes an image to preferred dimensions
fr: ``elgg_save_resized_image()`` - recadre et redimensionne une image aux dimensions choisies

source: New API for events
fr: Nouvelle API pour les événements

source: ``elgg_clear_event_handlers()`` - similar to ``elgg_clear_plugin_hook_handlers`` this functions removes all registered event handlers
fr: ``elgg_clear_event_handlers()`` - similaire à ``elgg_clear_plugin_hook_handlers`` cette fonction supprime tous les gestionnaires d’événements enregistrés

source: New API for signing URLs
fr: Nouvelle API pour la signature des URLs

source: URLs can now be signed with a SHA-256 HMAC key and validated at any time before URL expiry. This feature can be used to tokenize action URLs in email notifications, as well as other uses outside of the Elgg installation.
fr: Les URLs peuvent désormais être signées avec une clef HMAC SHA-256 et validées à tout moment avant l’expiration de l’URL. Cette fonctionnalité peut être utilisée pour tokenizer l'URL d’action dans les notifications par e-mail, ainsi que d’autres utilisations en dehors de l’installation Elgg.

source: ``elgg_http_get_signed_url()`` - signs the URL with HMAC key
fr: ``elgg_http_get_signed_url()`` - signe l’URL avec la clef HMAC

source: ``elgg_http_validate_signed_url()`` - validates the signed URL
fr: ``elgg_http_validate_signed_url()`` - valide l’URL signée

source: ``elgg_signed_request_gatekeeper()`` - gatekeeper that validates the signature of the current request
fr: ``elgg_signed_request_gatekeeper()`` - gardien qui valide la signature de la requête en cours

source: Extendable form views
fr: Vues de formulaire extensibles

source: Form footer rendering can now be deferred until the form view and its extensions have finished rendering. This allows plugins to collaborate on form views without breaking the markup logic.
fr: Le rendu du pied de page du formulaire peut maintenant être reporté jusqu’à ce que la vue du formulaire et ses extensions aient terminé le rendu. Cela permet aux plugins de collaborer sur les vues de formulaire sans casser la logique de balisage.

source: ``elgg_set_form_footer()`` - sets form footer for deferred rendering
fr: ``elgg_set_form_footer()`` - définit le pied de page du formulaire pour un rendu différé

source: ``elgg_get_form_footer()`` - returns currently set form footer
fr: ``elgg_get_form_footer()`` - renvoie le pied de page du formulaire actuellement défini

source: Metadata ``access_id``
fr: Métadonnées ``access_id``

source: It's now deprecated to create metadata with an explicit ``access_id`` value other than ``ACCESS_PUBLIC``.
fr: Il est maintenant obsolète de créer des métadonnées avec une valeur explicite de ``access_id`` autre que ``ACCESS_PUBLIC``.

source: In Elgg 3.0, metadata will not be access controlled, and will be available in all contexts. If your plugin relies on access control of metadata, it would be wise to migrate storage to annotations or entities instead.
fr: Dans Elgg 3.0, les métadonnées ne sont pas contrôlées et sont disponibles dans tous les contextes. Si votre plugin repose sur le contrôle d’accès des métadonnées, il serait sage de migrer le stockage vers des annotations ou des entités à la place.

source: New API for extracting class names from arrays
fr: Nouvelle API pour extraire des noms de classes à partir de tableaux

source: Similar to ``elgg_extract()``, ``elgg_extract_class()`` extracts the "class" key (if present), merges into existing class names, and always returns an array.
fr: Semblable à ``elgg_extract()``, ``elgg_extract_class()`` extrait la clef ``class`` (si elle est présente), la fusionne avec les noms de classe existants, et renvoie toujours un tableau.

source: A high level ``'prepare','notification'`` hook is now triggered for instant and subscription notifications and can be used to alter notification objects irrespective of their type.
fr: Un hook de haut niveau ``'prepare','notification'`` est maintenant déclenché pour les notifications instantanées et d’abonnement et peut être utilisé pour modifier les objets de notification quel que soit leur type.

source: ``'format','notification:<method>'`` hook is now triggered for instant and subscription notifications and can be used to format the notification (e.g. strip HTML tags, wrap the notification body in a template etc).
fr: le hook ``'format','notification:<method>'`` est maintenant déclenché pour les notifications instantanées et d’abonnement et peut être utilisé pour formater la notification (par ex. pour supprimer des balises HTML, envelopper le corps de la notification dans un modèle, etc.).

source: Instant notifications are now handled by the notifications service, hence almost all hooks applicable to subscription notifications also apply to instant notifications.
fr: Les notifications instantanées sont désormais traitées par le service de notifications, de sorte que la quasi-totalité des hooks applicables aux notifications d’abonnement s’appliquent également aux notifications instantanées.

source: ``elgg_get_notification_methods()`` can be used to obtain registered notification methods
fr: ``elgg_get_notification_methods()`` peut être utilisé pour obtenir les méthodes de notification enregistrées

source: Added ``ElggUser::getNotificationSettings()`` and ``ElggUser::setNotificationSetting()``
fr: Ajout de ``ElggUser::getNotificationSettings()`` et ``ElggUser::setNotificationSetting()``

source: Entity list functions can output tables
fr: Les fonctions de liste d’entités peuvent générer des tableaux

source: In functions like ``elgg_list_entities($options)``, table output is possible by setting ``$options['list_type'] = 'table'`` and providing an array of table columns as ``$options['columns']``. Each column is an ``Elgg\Views\TableColumn`` object, usually created via methods on the service ``elgg()->table_columns``.
fr: Dans des fonctions telles que ``elgg_list_entities($options)``, le rendu sous forme de tableau est possible en définissant ``$options['list_type'] = 'table'`` et en fournissant un tableau de colonnes de tableau dans ``$options['columns']``. Chaque colonne est un objet ``Elgg\Views\TableColumn``, généralement créé via des méthodes du service ``elgg()->table_columns``.

source: Plugins can provide or alter these factory methods (see ``Elgg\Views\TableColumn\ColumnFactory``). See the view ``admin/users/newest`` for a usage example.
fr: Les plugins peuvent fournir ou modifier ces méthodes d’usine - factory methods (voir ``Elgg\Views\TableColumn\ColumFactory``). Pour un exemple d’utilisation, consultez la vue ``admin/users/newest``.

source: Inline tabs components
fr: Composants d’onglets en ligne

source: Inline tabs component can now be rendered with ``page/components/tabs`` view. The components allows to switch between pre-populated and ajax-loaded. See ``page/components/tabs`` in core views and ``theme_sandbox/components/tabs`` in developers plugin for usage instructions and examples.
fr: Le composant des onglets en ligne peut désormais être rendu avec la vue ``page/components/tabs``. Le composant permet de basculer entre pré-remplissage et chargement-par-ajax. Voir ``page/components/tabs`` dans les vues du noyau et ``theme_sandbox/components/tabs`` dans le plugin developers pour des instructions d’utilisation et des exemples.

source: API to alter registration and login URL
fr: API pour modifier l’URL d’inscription et de connexion

source: ``elgg_get_registration_url()`` should be used to obtain site's registration URL
fr: ``elgg_get_registration_url()`` doit être utilisé pour obtenir l’URL d’inscription sur le site

source: ``elgg_get_login_url()`` should be used to obtain site's login URL
fr: ``elgg_get_login_url()`` doit être utilisé pour obtenir l’URL de connexion du site

source: ``registration_url, site`` hook can be used to alter the default registration URL
fr: le hook ``registration_url, site`` peut être utilisé pour modifier l’URL d’inscription par défaut

source: ``login_url, site`` hook can be used to alter the default login URL
fr: le hook ``login_url, site`` peut être utilisé pour modifier l’URL de connexion par défaut

source: Support for fieldsets in forms
fr: Prise en charge des jeux de champs - fieldsets - dans les formulaires

source: ``elgg_view_field()`` replaces ``elgg_view_input()``. It has a similar API, but accepts a single array.
fr: ``elgg_view_field()`` remplace ``elgg_view_input()``. Elle dispose d’une API similaire, mais accepte un seul tableau.

source: ``elgg_view_field()`` supports ``#type``, ``#label``, ``#help`` and ``#class``, allowing unprefixed versions to be sent to the input view ``$vars``.
fr: ``elgg_view_field()`` prend en charge ``#type``, ``#label``, ``#help`` et ``#class``, permettant l’envoi de versions non préfixées à la vue d’entrée ``$vars``.

source: The new view ``input/fieldset`` can be used to render a set of fields, each rendered with ``elgg_view_field()``.
fr: La nouvelle vue ``input/fieldset`` peut être utilisée pour rendre un ensemble de champs, chacun rendu avec ``elgg_view_field()``.

source: Lightbox css is no longer loaded as an external CSS file. Lightbox theme now extends ``elgg.css`` and ``admin.css``
fr: Le CSS de Lightbox n’est plus chargé en tant que fichier CSS externe. Le thème Lightbox étend maintenant ``elgg.css`` et ``admin.css``

source: Default lightbox config is now defined via ``'elgg.data','site'`` server-side hook
fr: La configuration de lightbox par défaut est maintenant définie via le hook ``'elgg.data','site'`` côté serveur

source: From 2.x to 3.0
fr: De 2.x à 3.0

source: PHP 7.0 is now required
fr: PHP 7.0 est désormais requis

source: 5.6 is reaching it's end of life. PHP 7.0 is now required to install and run Elgg.
fr: 5.6 atteint sa fin de vie. PHP 7.0 est maintenant nécessaire pour installer et exécuter Elgg.

source: ``$CONFIG`` is removed!
fr: ``$CONFIG`` est supprimé !

source: Not exactly, however you **must** audit its usage and *should* replace it with ``elgg_get_config()`` and ``elgg_set_config()``, as recommended since Elgg 1.9.
fr: Pas exactement, cependant vous **devez** auditer cet usage et *devriez* le remplacer par ``elgg_get_config()`` et ``elgg_set_config()``, comme recommandé depuis Elgg 1.9.

source: The global ``$CONFIG`` is now a proxy for Elgg's configuration container, and modifications **will fail** if you try to alter array properties directly. E.g. ``$CONFIG->cool_fruit[] = 'Pear';``. The silver lining is that failures will emit NOTICEs.
fr: La variable globale ``$CONFIG`` est maintenant un proxy pour le conteneur de configuration de Elgg, et les modifications **échoueront** si vous essayez de modifier directement les propriétés du tableau. Par exemple, ``$CONFIG->cool_fruit[] = 'Poire';``. Le bon côté est que ces échecs émettront des NOTICEs.

source: Removed views
fr: Vues supprimées

source: ``forms/account/settings``: usersettings extension can now extend the view ``forms/usersettings/save``
fr: ``forms/account/settings`` : l’extension de usersettings peut désormais étendre la vue ``forms/usersettings/save``

source: ``output/checkboxes``: use ``output/tags`` if you want the same behaviour
fr: ``output/checkboxes`` : utilisez ``output/tags`` si vous voulez le même comportement

source: ``input/write_access``: mod/pages now uses the **access:collections:write** plugin hook.
fr: ``input/write_access`` : mod/pages utilise désormais le hook de plugin **access:collections:write**.

source: ``page/layouts/content``: use ``page/layouts/default``
fr: ``page/layouts/content`` : utilisez ``page/layouts/default``

source: ``page/layouts/one_column``: use ``page/layouts/default``
fr: ``page/layouts/one_column`` : utilisez ``page/layouts/default``

source: ``page/layouts/one_sidebar``: use ``page/layouts/default``
fr: ``page/layouts/one_sidebar`` : utilisez ``page/layouts/default``

source: ``page/layouts/two_sidebar``: use ``page/layouts/default``
fr: ``page/layouts/two_sidebar`` : utilisez ``page/layouts/default``

source: ``page/layouts/walled_garden``: use ``page/layouts/default``
fr: ``page/layouts/walled_garden`` : utilisez ``page/layouts/default``

source: ``page/elements/topbar_wrapper``: update your use of ``page/elements/topbar`` to include a check for a logged in user
fr: ``page/elements/topbar_wrapper`` : mettez à jour votre utilisation de ``page/elements/topbar`` pour inclure une vérification si l'utilisateur est connecté

source: ``groups/group_sort_menu``: use ``register, filter:menu:groups/all`` plugin hook
fr: ``groups/group_sort_menu`` : utilisez le hook plugin ``register, filter:menu:groups/all``

source: ``subscriptions/form/additions``: extend ``notifications/settings/other`` instead
fr: ``subscriptions/form/additions`` : étendez plutôt ``notifications/parameters/other``

source: ``likes/count``: modifications can now be done to the ``likes_count`` menu item
fr: ``likes/count`` : des modifications peuvent désormais être apportées à l’élément de menu ``likes_count``

source: ``likes/css``: likes now uses ``elgg/likes.css``
fr: ``likes/css`` : les likes utilisent désormais ``elgg/likes.css``

source: ``river/item``: use elgg_view_river_item() to render river items
fr: ``river/item`` : utilisez elgg_view_river_item() pour afficher des éléments de la rivière

source: ``resources/avatar/view``: Use entity icon API
fr: ``resources/avatar/view``: Utilisez l'API des icônes d'entités

source: ``ajax_loader_bw.gif``: use ``graphics/ajax_loader_bw.gif``
fr: ``ajax_loader_bw.gif``: utilisez ``graphics/ajax_loader_bw.gif``

source: ``elgg_logo.png``: use ``graphics/elgg_logo.png``
fr: ``elgg_logo.png`` : utilisez ``graphics/elgg_logo.png``

source: ``favicon-128.png``: use ``graphics/favicon-128.png``
fr: ``favicon-128.png`` : utilisez ``graphics/favicon-128.png``

source: ``favicon-16.png``: use ``graphics/favicon-16.png``
fr: ``favicon-16.png`` : utilisez ``graphics/favicon-16.png``

source: ``favicon-32.png``: use ``graphics/favicon-32.png``
fr: ``favicon-32.png`` : utilisez ``graphics/favicon-32.png``

source: ``favicon-64.png``: use ``graphics/favicon-64.png``
fr: ``favicon-64.png`` : utilisez ``graphics/favicon-64.png``

source: ``favicon.ico``: use ``graphics/favicon.ico``
fr: ``favicon.ico`` : utilisez ``graphics/favicon.ico``

source: ``favicon.svg``: use ``graphics/favicon.svg``
fr: ``favicon.svg`` : utilisez ``graphics/favicon.svg``

source: ``friendspicker.png``: use ``graphics/friendspicker.png``
fr: ``friendspicker.png`` : utilisez ``graphics/friendspicker.png``

source: ``walled_garden.jpg``: use ``graphics/walled_garden.jpg``
fr: ``walled_garden.jpg`` : utilisez ``graphics/walled_garden.jpg``

source: ``navigation/menu/page``: now uses ``navigation/menu/default`` and a prepare hook
fr: ``navigation/menu/page`` : utilise désormais ``navigation/menu/default`` et un hook de préparation - prepare

source: ``navigation/menu/site``: now uses default view
fr: ``navigation/menu/site`` : utilise désormais la vue par défaut

source: ``page/elements/by_line``: Use ``object/elements/imprint``
fr: ``page/elements/by_line``: Utilisez ``object/elements/imprint``

source: ``forms/admin/site/advanced/security``: the site secret information has been moved to ``forms/admin/security/settings``
fr: ``forms/admin/site/advanced/security`` : l'information du secret du site a été déplacé vers ``forms/admin/security/settings``

source: ``river/object/file/create``: check :doc:`/guides/river`
fr: ``river/object/file/create`` : regardez :doc:`/guides/river`

source: ``river/object/page/create``: check :doc:`/guides/river`
fr: ``river/object/page/create`` : regardez :doc:`/guides/river`

source: ``river/object/page_top/create``: check :doc:`/guides/river`
fr: ``river/object/page_top/create`` : regardez :doc:`/guides/river`

source: ``river/relationship/member``: check :doc:`/guides/river`
fr: ``river/relationship/member`` : regardez :doc:`/guides/river`

source: ``object/page_top``: use ``object/page``
fr: ``object/page_top`` : utilisez ``object/page``

source: ``ajax/discussion/reply/edit``: See :ref:`upgrade-discussion-replies`
fr: ``ajax/discussion/reply/edit`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion/replies``: See :ref:`upgrade-discussion-replies`
fr: ``discussion/replies`` : Voyez :ref:`upgrade-discussion-replies`

source: ``object/discussion_reply``: See :ref:`upgrade-discussion-replies`
fr: ``object/discussion_reply`` : Voyez :ref:`upgrade-discussion-replies`

source: ``resources/discussion/reply/edit``: See :ref:`upgrade-discussion-replies`
fr: ``resources/discussion/reply/edit`` : Voyez :ref:`upgrade-discussion-replies`

source: ``resources/elements/discussion_replies``: See :ref:`upgrade-discussion-replies`
fr: ``resources/elements/discussion_replies`` : Voyez :ref:`upgrade-discussion-replies`

source: ``river/elements/discussion_replies``: See :ref:`upgrade-discussion-replies`
fr: ``river/elements/discussion_replies`` : Voyez :ref:`upgrade-discussion-replies`

source: ``river/object/discussion_reply/create``: See :ref:`upgrade-discussion-replies`
fr: ``river/object/discussion_reply/create`` : Voyez :ref:`upgrade-discussion-replies`

source: ``search/object/discussion_reply/entity``: See :ref:`upgrade-discussion-replies`
fr: ``search/object/discussion_reply/entity`` : Voyez :ref:`upgrade-discussion-replies`

source: ``rss/discussion/replies``: See :ref:`upgrade-discussion-replies`
fr: ``rss/discussion/replies`` : Voyez :ref:`upgrade-discussion-replies`

source: ``search/layout`` in both ``default`` and ``rss`` viewtypes
fr: ``search/layout`` dans les deux types de vues ``default`` et ``rss``

source: ``search/css``: Moved to ``search/search.css``
fr: ``search/css``: Déplacé vers ``search/search.css``

source: ``forms/invitefriends/invite``: use ``forms/friends/invite``
fr: ``forms/invitefriends/invite``: utilisez ``forms/friends/invite``

source: ``resources/invitefriends/invite``: use ``resources/friends/invite``
fr: ``resources/invitefriends/invite``: utilisez ``resources/friends/invite``

source: ``resources/site_notifications/view``: Use ``resources/site_notifications/owner``
fr: ``resources/site_notifications/view``: Utilisez ``resources/site_notifications/owner``

source: ``resources/site_notifications/everyone``: Use ``resources/site_notifications/all``
fr: ``resources/site_notifications/everyone`` : Utilisez ``resources/site_notifications/all``

source: Removed functions/methods
fr: Fonctions/méthodes supprimées

source: All the functions in ``engine/lib/deprecated-1.9.php`` were removed. See https://github.com/Elgg/Elgg/blob/2.0/engine/lib/deprecated-1.9.php for these functions. Each ``@deprecated`` declaration includes instructions on what to use instead. All the functions in ``engine/lib/deprecated-1.10.php`` were removed. See https://github.com/Elgg/Elgg/blob/2.0/engine/lib/deprecated-1.10.php for these functions. Each ``@deprecated`` declaration includes instructions on what to use instead.
fr: Toutes les fonctions dans ``engine/lib/deprecated-1.9.php`` ont été supprimées. Voir https://github.com/Elgg/Elgg/blob/2.0/engine/lib/deprecated-1.9.php pour ces fonctions. Chaque déclaration ``@deprecated`` comprend des instructions sur ce qu’il faut utiliser à la place. Toutes les fonctions de ``engine/lib/deprecated-1.10.php`` ont été supprimées. Voir https://github.com/Elgg/Elgg/blob/2.0/engine/lib/deprecated-1.10.php pour ces fonctions. Chaque déclaration ``@deprecated`` comprend des instructions sur ce qu’il faut utiliser à la place.

source: ``elgg_register_library``: require your library files so they are available globally to other plugins
fr: ``elgg_register_library`` : exigez - require - vos bibliothèques afin qu’elles soient disponibles globalement pour d’autres plugins

source: ``can_write_to_container``: Use ``ElggEntity->canWriteToContainer()``
fr: ``can_write_to_container`` : Utilisez ``ElggEntity->canWriteToContainer()``
