Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Event **delete, annotations**: Use **delete, annotation**
fr: Événement **delete, annotations** : Utilisez **delete, annotation**

source: Event **pagesetup, system**: Use the menu or page shell hooks instead
fr: Événement **pagesetup, system** : Utilisez plutôt les hook de menu ou de coquille depage

source: Event **upgrade, upgrade**: Use **upgrade, system** instead
fr: Événement **upgrade, upgrade** : Utilisez **upgrade, system** à la place

source: Hook **index, system**: Override the ``resources/index`` view
fr: Hook **index, system** : Remplacez la vue ``resources/index``

source: Hook **object:notifications, <type>**: Use the hook **send:before, notifications**
fr: Hook **object:notifications, <type>** : Utilisez le hook **send:before, notifications**

source: Hook **output:before, layout**: Use **view_vars, page/layout/<layout_name>**
fr: Hook **output:before, layout** : Utilisez **view_vars, page/layout/<layout_name>**

source: Hook **output:after, layout**: Use **view, page/layout/<layout_name>**
fr: Hook **output:after, layout** : Utilisez **view, page/layout/<layout_name>**

source: Hook **email, system**: Use more granular **<hook>, system:email** hooks
fr: Hook **email, system** : Utilisez les hooks plus granulaires **<hook>, system:email**

source: Hook **email:message, system**: Use **zend:message, system:email** hook
fr: Hook **email:message, system** : Utilisez le hook **zend:message, system:email**

source: Hook **members:list, <page>**: Use your own pagehandler or route hook
fr: Hook **members:list, <page>** : Utilisez le hook de route ou votre propre gestionnaire de page

source: Hook **members:config, <page>**: Use **register, menu:filter:members**
fr: Hook **members:config, <page>** : Utilisez **register, menu:filter:members**

source: Hook **profile_buttons, group**: Use **register, menu:title**
fr: Hook **profile_buttons, group** : Utilisez **register, menu:title**

source: Removed forms/actions
fr: Formulaires/actions supprimés

source: ``notificationsettings/save`` form and action
fr: formulaire et action ``notificationsettings/save``

source: ``notificationsettings/groupsave`` form and action
fr: formulaire et action ``notificationssettings/groupsave``

source: ``discussion/reply/save`` form and action
fr: formulaire et action ``discussion/reply/save``

source: APIs that now accept only an ``$options`` array
fr: APIs qui n’acceptent plus qu’un tableau ``$options``

source: ``ElggGroup::getMembers``
fr: ``ElggEntity::getEntitiesFromRelationship``

source: ``ElggUser::getFriends`` (as part of ``Friendable``)
fr: ``ElggUser::getFriends`` (en tant que ``Friendable``)

source: ``ElggUser::getFriendsOf`` (as part of ``Friendable``)
fr: ``ElggUser::getFriendsOf`` (dans le cadre de ``Friendable``)

source: ``ElggUser::getFriendsObjects`` (as part of ``Friendable``)
fr: ``ElggUser::getFriendsObjects`` (dans le cadre de ``Friendable``)

source: ``ElggUser::getObjects`` (as part of ``Friendable``)
fr: ``ElggUser::getObjects`` (dans le cadre de ``Friendable``)

source: Plugin functions that now require an explicit ``$plugin_id``
fr: Fonctions plugin qui nécessitent maintenant un ``$plugin_id`` explicite

source: Class constructors that now accept only a ``stdClass`` object or ``null``
fr: Constructeurs de classes qui n’acceptent désormais qu’un objet ``stdClass`` ou ``null``

source: ``ElggAnnotation``: No longer accepts an annotation ID
fr: ``ElggAnnotation`` : N’accepte plus un ID d’annotation

source: ``ElggGroup``: No longer accepts a GUID
fr: ``ElggGroup`` : N’accepte plus un GUID

source: ``ElggMetadata``: No longer accepts a metadata ID
fr: ``ElggMetadata`` : N’accepte plus un ID de métadonnées

source: ``ElggObject``: No longer accepts a GUID
fr: ``ElggObject`` : N’accepte plus un GUID

source: ``ElggRelationship``: No longer accepts a relationship ID or ``null``
fr: ``ElggRelationship`` : N’accepte plus un ID de relation ni ``null``

source: ``ElggSite``: No longer accepts a GUID or URL
fr: ``ElggSite`` : N’accepte plus un GUID ni une URL

source: ``ElggUser``: No longer accepts a GUID or username
fr: ``ElggUser`` : N’accepte plus un GUID ni un nom d’utilisateur

source: ``ElggPlugin``: No longer accepts a GUID or path. Use ``ElggPlugin::fromId`` to construct a plugin from its path
fr: ``ElggPlugin`` : N’accepte plus un GUID ni un chemin. Utilisez ``ElggPlugin::fromId`` pour construire un plugin à partir de son chemin

source: Miscellaneous API changes
fr: Modifications d’API diverses

source: ``ElggBatch``: You may only access public properties
fr: ``ElggBatch`` : Vous ne pouvez accéder qu’aux propriétés publiques

source: ``ElggEntity``: The ``tables_split`` and ``tables_loaded`` properties were removed
fr: ``ElggEntity`` : Les propriétés ``tables_split`` et ``tables_loaded`` ont été supprimées

source: ``ElggEntity``: Empty URLs will no longer be normalized. This means entities without URLs will no longer result in the site URL
fr: ``ElggEntity`` : Les URL vides ne seront plus normalisées. Cela signifie que les entités sans URL ne vont plus avoir l’URL du site

source: ``ElggGroup::removeObjectFromGroup`` requires passing in an ``ElggObject`` (no longer accepts a GUID)
fr: ``ElggGroup::removeObjectFromGroup`` nécessite de passer un ``ElggObject`` (n’accepte plus un GUID)

source: ``ElggUser::$salt`` no longer exists as an attribute, nor is it used for authentication
fr: ``ElggUser::$salt`` n’existe plus en tant qu’attribut, et n'est plus utilisé pour l’authentification

source: ``ElggUser::$password`` no longer exists as an attribute, nor is it used for authentication
fr: ``ElggUser::$password`` n’existe plus en tant qu’attribut, et n'est plus utilisé pour l’authentification

source: ``elgg_get_widget_types`` no longer supports ``$exact`` as the 2nd argument
fr: ``elgg_get_widget_types`` ne prend plus en charge ``$exact`` comme 2ème argument

source: ``elgg_instanceof`` no longer supports the fourth ``class`` argument
fr: ``elgg_instanceof`` ne prend plus en charge le quatrième argument ``class``

source: ``elgg_view``: The 3rd and 4th (unused) arguments have been removed. If you use the ``$viewtype`` argument, you must update your usage.
fr: ``elgg_view`` : Les 3ème et 4ème arguments (inutilisés) ont été supprimés. Si vous utilisiez l’argument ``$viewtype``, vous devez mettre à jour votre utilisation.

source: ``elgg_view_icon`` no longer supports ``true`` as the 2nd argument
fr: ``elgg_view_icon`` ne prend plus en charge ``true`` comme 2e argument

source: ``elgg_list_entities`` no longer supports the option ``view_type_toggle``
fr: ``elgg_list_entities`` ne prend plus en charge l’option ``view_type_toggle``

source: ``elgg_list_registered_entities`` no longer supports the option ``view_type_toggle``
fr: ``elgg_list_registered_entities`` ne prend plus en charge l’option ``view_type_toggle``

source: ``elgg_log`` no longer accepts the level ``"DEBUG"``
fr: ``elgg_log`` n’accepte plus le niveau ``"DEBUG"``

source: ``elgg_dump`` no longer accepts a ``$to_screen`` argument.
fr: ``elgg_dump`` n’accepte plus d'argument ``$to_screen``.

source: ``elgg_gatekeeper`` and ``elgg_admin_gatekeeper`` no longer report ``login`` or ``admin`` as forward reason, but ``403``
fr: ``elgg_gatekeeper`` et ``elgg_admin_gatekeeper`` ne signalent plus ``login`` ou ``admin`` comme motif de redirection, mais ``403``

source: ``Application::getDb()`` no longer returns an instance of ``Elgg\Database``, but rather a ``Elgg\Application\Database``
fr: ``Application::getDb()`` ne renvoie plus une instance de ``Elgg\Database``, mais de ``Elgg\Application\Database``

source: ``$CONFIG`` is no longer available as a local variable inside plugin ``start.php`` files.
fr: ``$CONFIG`` n’est plus disponible en tant que variable locale dans les fichiers ``start.php`` des plugins.

source: ``elgg_get_config('siteemail')`` is no longer available. Use ``elgg_get_site_entity()->email``.
fr: ``elgg_get_config('siteemail')`` n’est plus disponible. Utilisez ``elgg_get_site_entity()->email``.

source: ``ElggEntity::saveIconFromUploadedFile`` only saves `master` size, the other sizes are created when requested by ``ElggEntity::getIcon()`` based on the `master` size
fr: ``ElggEntity::saveIconFromUploadedFile`` enregistre uniquement la taille `master`, les autres tailles sont créées sur demande par ``ElggEntity::getIcon()`` à partir de la taille `master`

source: ``ElggEntity::saveIconFromLocalFile`` only saves `master` size, the other sizes are created when requested by ``ElggEntity::getIcon()`` based on the `master` size
fr: ``ElggEntity::saveIconFromLocalFile`` enregistre uniquement la taille `master`, les autres tailles sont créées sur demande par ``ElggEntity::getIcon()`` à partir de la taille `master`

source: ``ElggEntity::saveIconFromElggFile`` only saves `master` size, the other sizes are created when requested by ``ElggEntity::getIcon()`` based on the `master` size
fr: ``ElggEntity::saveIconFromElggFile`` enregistre uniquement la taille `master``, les autres tailles sont créées sur demande par ``ElggEntity::getIcon()`` à partir de la taille ``master``

source: Group entities do no longer have the magic ``username`` attribute.
fr: Les entités de groupe n’ont plus l’attribut magique ``username``.

source: Pagehandling will no longer detect ``group:<guid>`` in the URL
fr: Le gestionnaire de page ne détecte plus ``group:<guid>`` dans l’URL

source: The CRON interval ``reboot`` is removed.
fr: L’intervalle CRON ``reboot`` est supprimé.

source: The URL endpoints ``js/`` and ``css/`` are no longer supported. Use ``elgg_get_simplecache_url()``.
fr: Les points de terminaison d'URL ``js/`` et ``css/`` ne sont plus pris en charge. Utilisez ``elgg_get_simplecache_url()``.

source: The generic comment save action no longer sends the notification directly, this has been offloaded to the notification system.
fr: L’action générique d’enregistrement de commentaire n’envoie plus la notification directement, cela a été déchargé vers le système de notification.

source: The script ``engine/start.php`` is removed.
fr: Le script ``engine/start.php`` est supprimé.

source: The functions ``set_config``, ``unset_config`` and ``get_config`` have been deprecated and replaced by ``elgg_set_config``, ``elgg_remove_config`` and ``elgg_get_config``.
fr: Les fonctions ``set_config``, ``unset_config`` et ``get_config`` ont été dépréciées et remplacées par ``elgg_set_config``, ``elgg_remove_config`` et ``elgg_get_config``.

source: Config values ``path``, ``wwwroot``, and ``dataroot`` are not read from the database. The settings.php file values are always used.
fr: Les valeurs de configuration ``path``, ``wwwroot`` et ``dataroot`` ne sont pas lues dans la base de données. Les valeurs du fichier settings.php sont toujours utilisées.

source: Config functions like ``elgg_get_config`` no longer trim keys.
fr: Les fonctions de configuration telles que ``elgg_get_config`` n'émondent plus - trim - les clefs.

source: If you override the view ``navigation/menu/user_hover/placeholder``, you must change the config key ``lazy_hover:menus`` to ``elgg_lazy_hover_menus``.
fr: Si vous remplacez la vue ``navigation/menu/user_hover/placeholder``, vous devez modifier la clef de configuration ``lazy_hover:menus`` en ``elgg_lazy_hover_menus``.

source: The config value ``entity_types`` is no longer present or used.
fr: La valeur de configuration ``entity_types`` n’est plus présente ni utilisée.

source: Uploaded images are autorotated based on their orientation metadata.
fr: Les images téléchargées sont auto-pivotées en fonction de leurs métadonnées d’orientation.

source: The view ``object/widget/edit/num_display`` now uses an ``input/number`` field instead of ``input/select``; you might need to update your widget edit views accordingly.
fr: La vue ``object/widget/edit/num_display`` utilise désormais un champ ``input/number`` au lieu de ``input/select`` ; vous pourriez avoir besoin de mettre à jour vos vues de configuration des widgets en conséquence.

source: Annotation names are no longer trimmed during save
fr: Les noms d’annotation ne sont plus émondés - trim - lors de l’enregistrement

source: View extension behaviour changed
fr: Le comportement d’extension des vues a été modifié

source: An extended view now will receive all the regular hooks (like the `view_vars` hook). It now is also possible to extend view extensions. With this change in behaviour all view rendering will behave the same. It no longer matters if it was used as an extension or not.
fr: Une vue étendue recevra désormais tous les hooks classiques (comme le hook `view_vars`). Il est désormais également possible d’étendre les extensions de vue. Avec ce changement de comportement, tous les rendus de vue se comporteront de la même façon. Cela n’a plus d’importance si une vue est utilisée comme une extension ou non.

source: JavaScript hook calling order may change
fr: L’ordre d’appel des hooks JavaScript pourrait changer

source: When registering for hooks, the ``all`` keyword for wildcard matching no longer has any effect on the order that handlers are called. To ensure your handler is called last, you must give it the highest priority of all matching handlers, or to ensure your handler is called first, you must give it the lowest priority of all matching handlers.
fr: Lors de l’enregistrement pour des hooks, le mot clef ``all`` pour la correspondance générique n’a plus aucun effet sur l’ordre dans lequel les gestionnaires sont appelés. Pour vous assurer que votre gestionnaire est appelé en dernier, vous devez lui donner la plus haute priorité de tous les gestionnaires correspondants, ou pour vous assurer que votre gestionnaire est appelé en premier, vous devez lui donner la plus faible priorité de tous les gestionnaires correspondants.

source: Widget layout related changes
fr: Modifications liées à la disposition widget

source: The widget layout usage has been changed. Content is no longer drawn as part of the layout. You need to wrap you content in another layout and use the widgets layout as part of your content. If you want some special content to show if there are no widgets in the layout, you can now pass a special ``no_widgets`` parameter (as String or as a Closure).
fr: L’utilisation de la disposition widget a été modifiée. Le contenu n’est plus rendu dans le cadre de la mise en page. Vous devez envelopper votre contenu dans une autre mise en page et utiliser la disposition widget comme contenu. Si vous souhaitez que du contenu spécial s’affiche s’il n’y a pas de widgets dans la mise en page, vous pouvez maintenant passer un paramètre spécial ``no_widgets`` (sous forme de chaîne ou de Closure).

source: When registering widgets you can no longer omit passing a context as the ``all`` context is no longer supported. You need to explicitely pass the contexts for which the widget is intended.
fr: Lors de l’enregistrement des widgets, vous ne pouvez plus omettre de passer un contexte car le contexte ``all`` n’est plus pris en charge. Vous devez explicitement passer les contextes pour lesquels le widget est destiné.

source: Routing
fr: Routage

source: Page handling using ``elgg_register_page_handler()`` has been deprecated.
fr: La gestion des pages à l’aide de ``elgg_register_page_handler()`` est devenue obsolète.

source: We have added new routing API using ``elgg_register_route()``, which allows plugins to define named routes, subsequently using route names to generate URLs using ``elgg_generate_url()``.
fr: Nous avons ajouté une nouvelle API de routage utilisant ``elgg_register_route()``, qui permet aux plugins de définir des routes nommées, en utilisant par la suite des noms de routes pour générer des URLs à l’aide de ``elgg_generate_url()``.

source: See :doc:`routing </guides/routing>` docs for details.
fr: Pour plus d'informations, consultez les documentations sur le :doc:`routage </guides/routing>`.

source: As a result of this change all core page handlers have been removed, and any logic contained within these page handlers has been moved to respective resource views.
fr: À la suite de cette modification, tous les gestionnaires de pages de base ont été supprimés et toute la logique contenue dans ces gestionnaires de pages a été déplacée vers les vues de ressources respectives.

source: ``elgg_generate_entity_url()`` has been added as shortcut way to generate URLs from named routes that depend on entity type and subtype.
fr: ``elgg_generate_entity_url()`` a été ajouté comme raccourci pour générer des URLs à partir de routes nommées qui dépendent du type d’entité et du sous-type.

source: Use of ``handler`` parameter in entity menus has been deprecated in favour of named entity routes.
fr: L’utilisation du paramètre ``handler`` dans les menus des entités a été dépréciée au profit des routes d’entités nommées.

source: Gatekeeper function have been refactored to serve as middleware in the routing process, and as such they no longer return values. These functions throw HTTP exceptions that are then routed to error pages and can be redirected to other pages via hooks.
fr: Les fonctions Gatekeeper ont été refactorisées pour servir de middleware dans le processus de routage, et en tant que tel, elles ne retournent plus de valeurs. Ces fonctions lancent des exceptions HTTP qui sont ensuite acheminées vers des pages d’erreur et peuvent être redirigées vers d’autres pages via des hooks.

source: Labelling
fr: Nommage

source: Entity and collection labelling conventions have changed to comply with the new routing patterns:
fr: Les conventions de nommage des entités et des collections ont changé pour se conformer aux nouveaux schémas de routage :

source: These conventions are used across the routing and navigation systems, so plugins are advised to follow them.
fr: Ces conventions sont utilisées dans les systèmes de routage et de navigation, de sorte que les plugins sont invités à les suivre.

source: Request value filtering
fr: Filtrage des valeurs de la requête

source: ``set_input()`` and ``get_input()`` no longer trim values.
fr: ``set_input()`` et ``get_input()`` ne suppriment plus les espaces - trim - des valeurs.

source: Action responses
fr: Réponses des actions

source: All core and core plugin actions now all use the new Http Response functions like `elgg_ok_response` and `elgg_error_response` instead of `forward()`. The effect of this change is that is most cases the `'forward', 'system'` hook is no longer triggered. If you like to influence the responses you now can use the `'response', 'action:<name/of/action>'` hook. This gives you more control over the response and allows to target a specific action very easily.
fr: Toutes les actions du noyau et des plugins du noyau utilisent maintenant toutes les nouvelles fonctions de Http Response comme `elgg_ok_response` et `elgg_error_response` au lieu de `forward()`. L’effet de ce changement est que dans la plupart des cas le hook `'forward', 'system'` n’est plus déclenché. Si vous souhaitez modifier les réponses, vous pouvez maintenant utiliser le hook `'response','action:<name/of/action>'`. Cela vous donne plus de contrôle sur la réponse et permet de cibler une action spécifique très facilement.

source: HtmLawed is no longer a plugin
fr: HtmLawed n’est plus un plugin

source: Do not call ``elgg_load_library('htmlawed')``.
fr: N’appelez pas ``elgg_load_library('htmlawed')``.

source: In the hook params for ``'config', 'htmlawed'``, the ``hook_tag`` function name changed.
fr: Dans les paramètres du hook pour ``'config', 'htmlawed'``, le nom de la fonction ``hook_tag`` a changé.

source: New approach to page layouts
fr: Nouvelle approche des mises en page - layouts

source: ``one_column``, ``one_sidebar``, ``two_sidebar`` and ``content`` layouts have been removed - instead layout rendering has been centralized in the ``default``. Updated ``default`` layout provides full control over the layout elements via ``$vars``. For maximum backwards compatibility, calls to ``elgg_view_layout()`` with these layout names will still yield expected output, but the plugins should start using the ``default`` layout with an updated set of parameters.
fr: Les dispositions ``one_column``, ``one_sidebar``, ``two_sidebar`` et ``content`` ont été supprimées - au lieu de cela, le rendu de la disposition a été centralisé dans ``default``. La mise à jour de la disposition ``default`` permet de contrôler pleinement les éléments de mise en page via ``$vars``. Pour obtenir une compatibilité descendante maximale, les appels à ``elgg_view_layout()`` avec ces noms de disposition donneront toujours la sortie attendue, mais les plugins doivent commencer à utiliser la disposition ``default`` avec un ensemble de paramètres mis à jour.

source: Page layouts have been decomposed into smaller elements, which should make it easier for themes to target specific layout elements without having to override layouts at large.
fr: Les mises en page ont été découpées en éléments plus petits, ce qui devrait faciliter le ciblage d’éléments de mise en page spécifiques par les thèmes sans avoir à remplacer les dispositions en général.

source: As a result of these changes:
fr: À la suite de ces changements :

source: all layouts are consistent in how they handle title and filter menus, breadcrumbs and layout subviews
fr: toutes les dispositions sont cohérentes dans la façon dont elles gèrent les menus de titre et de filtre, le fil d'Ariane et les sous-vues de mise en page

source: all layouts can now be easily extended to have multiple tabs. Plugins can pass ``filter_id`` parameter that will allow other plugins to hook into ``register, menu:filter:<filter_id>`` hook and add new tabs. If no ``filter_id`` is provided, default ``register, menu:filter`` hook can be used.
fr: toutes les dispositions peuvent maintenant être facilement étendues pour avoir plusieurs onglets. Les plugins peuvent passer le paramètre ``filter_id`` qui permettra à d’autres plugins de s’accrocher au hook ``register, menu:filter:<filter_id>`` et d’ajouter de nouveaux onglets. Si aucun ``filter_id`` n’est fourni, le hook par défaut ``register, menu:filter`` peut être utilisé.

source: layout views and subviews now receive ``identifier`` and ``segments`` of the page being rendered
fr: les vues de mise en page et les sous-vues reçoivent désormais les ``identifier`` et ``segments`` de la page en cours de rendu

source: layout parameters are available to title and filter menu hooks, which allows resources to provide additional context information, for example, an ``$entity`` in case of a profile resource
fr: les paramètres de mise en page sont disponibles pour les hooks de menu de titre et de filtre, ce qui permet aux ressources de fournir des informations de contexte supplémentaires, par exemple ``$entity`` dans cas d'une ressource pour le profil

source: Plugins and themes should:
fr: Les plugins et thèmes devraient :

source: Update calls to ``elgg_view_layout()`` to use ``default`` layout
fr: Mettez à jour les appels à ``elgg_view_layout ()`` pour utiliser la disposition ``default``

source: Update replace ``nav`` parameter in layout views with ``breadcrumbs`` parameter
fr: Mettez à jour et remplacez le paramètre ``nav`` dans les vues de disposition par le paramètre ``breadcrumbs``

source: Update their use of ``filter`` parameter in layout views by either providing a default set of filter tabs, or setting a ``filter_id`` parameter and using hooks
fr: Mettez à jour leur utilisation du paramètre ``filter`` dans les vues de disposition - layouts, soit en fournissant un ensemble par défaut d’onglets de filtre, soit en définissant un paramètre ``filter_id`` et en utilisant des hooks

source: Remove ``page/layouts/one_column`` view
fr: Supprimez la vue ``page/layouts/one_column``
