Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``file_delete``: Use ``ElggFile->deleteIcon()``
fr: ``file_delete``: Utilisez ``ElggFile->deleteIcon()``

source: ``groups_get_group_tool_options``: Use ``elgg()->group_tools->all()``
fr: ``groups_get_group_tool_options`` : Utilisez ``elgg()->group_tools->all()``

source: ``groups_join_group``: Use ``ElggGroup::join``
fr: ``groups_join_group`` : Utilisez ``ElggGroup::join``

source: ``groups_prepare_profile_buttons``: Use ``register, menu:title`` hook
fr: ``groups_prepare_profile_buttons`` : Utilisez le hook ``register, menu:title``

source: ``groups_register_profile_buttons``: Use ``register, menu:title`` hook
fr: ``groups_register_profile_buttons`` : Utilisez le hook ``register, menu:title``

source: ``generate_user_password``: Use ``ElggUser::setPassword``
fr: ``generate_user_password`` : Utilisez ``ElggUser::setPassword``

source: ``run_function_once``: Use ``Elgg\Upgrade\Batch`` interface
fr: ``run_function_once`` : Utilisez l’interface ``Elgg\Upgrade\Batch``

source: ``elgg_format_url``: Use elgg_format_element() or the "output/text" view for HTML escaping.
fr: ``elgg_format_url`` : Utilisez elgg_format_element() ou la vue "output/text" pour échapper le HTML.

source: ``elgg_override_permissions``: No longer used as handler for ``permissions_check`` and ``container_permissions_check`` hooks
fr: ``elgg_override_permissions`` : N’est plus utilisé comme gestionnaire pour les hooks ``permissions_check`` et ``container_permissions_check``

source: ``AttributeLoader`` became obsolete and was removed
fr: ``AttributeLoader`` est devenu obsolète et a été supprimé

source: ``ElggPlugin::getFriendlyName``: Use ``ElggPlugin::getDisplayName()``
fr: ``ElggPlugin::getFriendlyName`` : Utilisez ``ElggPlugin::getDisplayName()``

source: ``ElggFile::setFilestore``: ElggFile objects can no longer use custom filestores.
fr: ``ElggFile::setFilestore`` : les objets ElggFile ne peuvent plus utiliser de répertoire de fichiers personnalisé.

source: ``ElggFile::size``: Use ``getSize``
fr: ``ElggFile::size`` : Utilisez ``getSize``

source: ``ElggDiskFilestore::makeFileMatrix``: Use ``Elgg\EntityDirLocator``
fr: ``ElggDiskFilestore::makeFileMatrix`` : Utilisez ``Elgg\EntityDirLocator``

source: ``ElggData::get``: Usually can be replaced by property read
fr: ``ElggData::get`` : Peut habituellement être remplacé par la lecture de la propriété

source: ``ElggData::getClassName``: Use ``get_class()``
fr: ``ElggData::getClassName`` : Utilisez ``get_class()``

source: ``ElggData::set``: Usually can be replaced by property write
fr: ``ElggData::set`` : Peut habituellement être remplacé par l’écriture de propriété

source: ``ElggEntity::setURL``: See ``getURL`` for details on the plugin hook
fr: ``ElggEntity::setURL`` : Voyez ``getURL`` pour plus de détails sur le hook plugin

source: ``ElggMenuBuilder::compareByWeight``: Use ``compareByPriority``
fr: ``ElggMenuBuilder::compareByWeight`` : Utilisez ``compareByPriority``

source: ``ElggMenuItem::getWeight``: Use ``getPriority``
fr: ``ElggMenuItem::getWeight`` : Utilisez ``getPriority``

source: ``ElggMenuItem::getContent``: Use ``elgg_view_menu_item()``
fr: ``ElggMenuItem::getContent`` : Utilisez ``elgg_view_menu_item()``

source: ``ElggMenuItem::setWeight``: Use ``setPriority``
fr: ``ElggMenuItem::setWeight`` : Utilisez ``setPriority``

source: ``ElggRiverItem::getPostedTime``: Use ``getTimePosted``
fr: ``ElggRiverItem::getPostedTime`` : Utilisez ``getTimePosted``

source: ``ElggSession`` has removed all deprecated methods
fr: ``ElggSession`` a supprimé toutes les méthodes dépréciées

source: ``ElggSite::getEntities``: Use ``elgg_get_entities()``
fr: ``ElggSite::getEntities`` : Utilisez ``elgg_get_entities()``

source: ``ElggSite::getExportableValues``: Use ``toObject``
fr: ``ElggSite::getExportableValues`` : Utilisez ``toObject``

source: ``ElggSite::getMembers``: Use ``elgg_get_entities()``
fr: ``ElggSite::getMembers`` : Utilisez ``elgg_get_entities()``

source: ``ElggSite::getObjects``: Use ``elgg_get_entities()``
fr: ``ElggSite::getObjects`` : Utilisez ``elgg_get_entities()``

source: ``ElggSite::listMembers``: Use ``elgg_list_entities()``
fr: ``ElggSite::listMembers`` : Utilisez ``elgg_list_entities()``

source: ``ElggSite::isPublicPage``: Logic moved to the router and should not be accessed directly
fr: ``ElggSite::isPublicPage`` : Logique déplacée vers le routeur et qui ne devrait pas être consultée directement

source: ``ElggSite::checkWalledGarden``: Logic moved to the router and should not be accessed directly
fr: ``ElggSite::checkWalledGarden`` : Logique déplacée vers le routeur et qui ne devrait pas être accédée directement

source: ``ElggUser::countObjects``: Use ``elgg_get_entities()``
fr: ``ElggUser::countObjects`` : Utilisez ``elgg_get_entities()``

source: ``Logger::getClassName``: Use ``get_class()``
fr: ``Logger::getClassName`` : Utilisez ``get_class()``

source: ``Elgg\Application\Database::getTablePrefix``: Read the ``prefix`` property
fr: ``Elgg\Application\Database::getTablePrefix`` : Lisez la propriété ``prefix``

source: ``ElggSession::get_ignore_access``: Use ``getIgnoreAccess``
fr: ``ElggSession::get_ignore_access`` : Utilisez ``getIgnoreAccess``

source: ``ElggSession::set_ignore_access``: Use ``setIgnoreAccess``
fr: ``ElggSession::set_ignore_access`` : Utilisez ``setIgnoreAccess``

source: ``pages_can_delete_page``: Use ``$entity->canDelete()``
fr: ``pages_can_delete_page`` : Utilisez ``$entity->canDelete()``

source: ``pages_is_page``: use ``$entity instanceof ElggPage``
fr: ``pages_is_page`` : utilisez ``$entity instanceof ElggPage``

source: ``discussion_comment_override``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_comment_override`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_can_edit_reply``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_can_edit_reply`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_reply_menu_setup``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_reply_menu_setup`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_reply_container_logic_override``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_reply_container_logic_override`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_reply_container_permissions_override``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_reply_container_permissions_override`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_update_reply_access_ids``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_update_reply_access_ids`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_search_discussion``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_search_discussion`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_add_to_river_menu``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_add_to_river_menu`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_prepare_reply_notification``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_prepare_reply_notification`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_redirect_to_reply``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_redirect_to_reply`` : Voyez :ref:`upgrade-discussion-replies`

source: ``discussion_ecml_views_hook``: See :ref:`upgrade-discussion-replies`
fr: ``discussion_ecml_views_hook`` : Voyez :ref:`upgrade-discussion-replies`

source: All functions around entity subtypes table:
fr: Toutes les fonctions liées à la table des sous-types d’entités :

source: ``add_subtype``: Use ``elgg_set_entity_class`` at runtime
fr: ``add_subtype`` : Utilisez ``elgg_set_entity_class`` lors de l’exécution

source: ``update_subtype``: Use ``elgg_set_entity_class`` at runtime
fr: ``update_subtype`` : Utilisez ``elgg_set_entity_class`` lors de l’exécution

source: ``get_subtype_class``: Use ``elgg_get_entity_class``
fr: ``get_subtype_class`` : Utilisez ``elgg_get_entity_class``

source: All caches have been consolidated into a single API layer. The following functions and methods have been removed:
fr: Tous les caches ont été consolidés en une seule couche d’API. Les fonctions et méthodes suivantes ont été supprimées :

source: ``Elgg\Cache\Pool`` interface and all extending classes
fr: L'interface ``Elgg\Cache\Pool`` et toutes les classes d’extension

source: As a result of system log changes:
fr: À la suite des modifications apportées au journal du système - system log :

source: ``system_log_default_logger``: moved to ``system_log`` plugin
fr: ``system_log_default_logger`` : déplacé dans le plugin ``system_log``

source: ``system_log_listener``: moved to ``system_log`` plugin
fr: ``system_log_listener`` : déplacé dans le plugin ``system_log``

source: ``system_log``: moved to ``system_log`` plugin
fr: ``system_log`` : déplacé dans le plugin ``system_log``

source: ``get_system_log``: renamed to ``system_log_get_log`` and moved to ``system_log`` plugin
fr: ``get_system_log`` : renommé ``system_log_get_log`` et déplacé dans le plugin ``system_log``

source: ``get_log_entry``: renamed to ``system_log_get_log_entry`` and moved to ``system_log`` plugin
fr: ``get_log_entry`` : renommé ``system_log_get_log_entry`` et déplacé dans le plugin ``system_log``

source: ``get_object_from_log_entry``: renamed to ``system_log_get_object_from_log_entry`` and moved to ``system_log`` plugin
fr: ``get_object_from_log_entry`` : renommé ``system_log_get_object_from_log_entry`` et déplacé dans le plugin ``system_log``

source: ``archive_log``: renamed to ``system_log_archive_log`` and moved to ``system_log`` plugin
fr: ``archive_log`` : renommé ``system_log_archive_log`` et déplacé dans le plugin ``system_log``

source: ``logbrowser_user_hover_menu``: renamed to ``system_log_user_hover_menu`` and moved to ``system_log`` plugin
fr: ``logbrowser_user_hover_menu`` : renommé ``system_log_user_hover_menu`` et déplacé dans le plugin ``system_log``

source: ``logrotate_archive_cron``: renamed to ``system_log_archive_cron`` and moved to ``system_log`` plugin
fr: ``logrotate_archive_cron`` : renommé ``system_log_archive_cron`` et déplacé dans le plugin ``system_log``

source: ``logrotate_delete_cron``: renamed to ``system_log_delete_cron`` and moved to ``system_log`` plugin
fr: ``logrotate_delete_cron`` : renommé ``system_log_delete_cron`` et déplacé dans le plugin ``system_log``

source: ``logrotate_get_seconds_in_period``: renamed to ``system_log_get_seconds_in_period`` and moved to ``system_log`` plugin
fr: ``logrotate_get_seconds_in_period`` : renommé ``system_log_get_seconds_in_period`` et déplacé dans le plugin ``system_log``

source: ``log_browser_delete_log``: renamed to ``system_log_browser_delete_log`` and moved to ``system_log`` plugin
fr: ``log_browser_delete_log`` : renommé ``system_log_browser_delete_log`` et déplacé dans le plugin ``system_log``

source: ``ban_user``: Use ``ElggUser->ban()``
fr: ``ban_user`` : Utilisez ``ElggUser->ban()``

source: ``create_metadata``: Use ``ElggEntity`` setter or ``ElggEntity->setMetadata()``
fr: ``create_metadata`` : Utilisez la définition avec ``ElggEntity`` ou ``ElggEntity->setMetadata()``

source: ``update_metadata``: Use ``ElggMetadata->save()``
fr: ``update_metadata`` : Utilisez ``ElggMetadata->save()``

source: ``create_annotation``: Use ``ElggEntity->annotate()``
fr: ``create_annotation`` : Utilisez ``ElggEntity->annotate()``

source: ``update_metadata``: Use ``ElggAnnotation->save()``
fr: ``update_metadata`` : Utilisez ``ElggAnnotation->save()``

source: ``elgg_get_user_validation_status``: Use ``ElggUser->isValidated()``
fr: ``elgg_get_user_validation_status`` : Utilisez ``ElggUser->isValidated()``

source: ``make_user_admin``: Use ``ElggUser->makeAdmin()``
fr: ``make_user_admin`` : Utilisez ``ElggUser->makeAdmin()``

source: ``remove_user_admin``: Use ``ElggUser->removeAdmin()``
fr: ``remove_user_admin`` : Utilisez ``ElggUser->removeAdmin()``

source: ``unban_user``: Use ``ElggUser->unban()``
fr: ``unban_user`` : Utilisez ``ElggUser->unban()``

source: ``elgg_get_entities_from_attributes``: Use ``elgg_get_entities()``
fr: ``elgg_get_entities_from_attributes`` : Utilisez ``elgg_get_entities()``

source: ``elgg_get_entities_from_metadata``: Use ``elgg_get_entities()``
fr: ``elgg_get_entities_from_metadata`` : Utilisez ``elgg_get_entities()``

source: ``elgg_get_entities_from_relationship``: Use ``elgg_get_entities()``
fr: ``elgg_get_entities_from_relationship`` : Utilisez ``elgg_get_entities()``

source: ``elgg_get_entities_from_private_settings``: Use ``elgg_get_entities()``
fr: ``elgg_get_entities_from_private_settings`` : Utilisez ``elgg_get_entities()``

source: ``elgg_get_entities_from_access_id``: Use ``elgg_get_entities()``
fr: ``elgg_get_entities_from_access_id`` : Utilisez ``elgg_get_entities()``

source: ``elgg_list_entities_from_metadata``: Use ``elgg_list_entities()``
fr: ``elgg_list_entities_from_metadata`` : Utilisez ``elgg_list_entities()``

source: ``elgg_list_entities_from_relationship``: Use ``elgg_list_entities()``
fr: ``elgg_list_entities_from_relationship`` : Utilisez ``elgg_list_entities()``

source: ``elgg_list_entities_from_private_settings``: Use ``elgg_list_entities()``
fr: ``elgg_list_entities_from_private_settings`` : Utilisez ``elgg_list_entities()``

source: ``elgg_list_entities_from_access_id``: Use ``elgg_list_entities()``
fr: ``elgg_list_entities_from_access_id`` : Utilisez ``elgg_list_entities()``

source: ``elgg_list_registered_entities``: Use ``elgg_list_entities()``
fr: ``elgg_list_registered_entities`` : Utilisez ``elgg_list_entities()``

source: ``\Elgg\Project\Paths::sanitize``: Use ``\Elgg\Project\Paths::sanitize()``
fr: ``\Elgg\Project\Paths::sanitize`` : Utilisez ``\Elgg\Project\Paths::sanitize()``

source: ``elgg_group_gatekeeper``: Use ``elgg_entity_gatekeeper()``
fr: ``elgg_group_gatekeeper`` : Utilisez ``elgg_entity_gatekeeper()``

source: ``get_entity_dates``: Use ``elgg_get_entity_dates()``
fr: ``get_entity_dates`` : Utilisez ``elgg_get_entity_dates()``

source: ``messages_set_url``: Use ``ElggEntity::getURL()``
fr: ``messages_set_url`` : Utilisez ``ElggEntity::getURL()``

source: Removed global vars
fr: Variables globales supprimées

source: ``$SESSION``: Use the API provided by ``elgg_get_session()``
fr: ``$SESSION``: Utilisez l’API fournie par ``elgg_get_session()``

source: ``$CONFIG->site_id``: Use ``1``
fr: ``$CONFIG->site_id`` : Utilisez ``1``

source: ``$CONFIG->input``: Use ``set_input`` and ``get_input``
fr: ``$CONFIG->input`` : Utilisez ``set_input`` et ``get_input``

source: Removed classes/interfaces
fr: Classes/interfaces supprimées

source: ``Exportable`` and its methods ``export`` and ``getExportableValues``: Use ``toObject``
fr: ``Exportable`` et ses méthodes ``export`` et ``getExportableValues`` : Utilisez ``toObject``

source: ``Importable`` and its method ``import``.
fr: ``Importable`` et sa méthode ``import``.

source: ``ODD`` and all classes beginning with ``ODD*``.
fr: ``ODD`` et toutes les classes commençant par ``ODD*``.

source: ``Elgg_Notifications_Event``: Use ``\Elgg\Notifications\Event``
fr: ``Elgg_Notifications_Event`` : Utilisez ``\Elgg\Notifications\Event``

source: ``Elgg\Mail\Address``: use ``Elgg\Email\Address``
fr: ``Elgg\Mail\Address`` : utilisez ``Elgg\Email\Address``

source: ``ElggDiscussionReply``: user ``ElggComment`` see :ref:`upgrade-discussion-replies`
fr: ``ElggDiscussionReply`` : utilisez ``ElggComment`` voyez :ref:`upgrade-discussion-replies`

source: Schema changes
fr: Modifications de schéma

source: The storage engine for the database tables has been changed from MyISAM to InnoDB. You maybe need to optimize your database settings for this change. The ``datalists`` table has been removed. All settings from datalists table have been merged into the ``config`` table.
fr: Le moteur de stockage des tables de la base de données a été changé de MyISAM à InnoDB. Vous devrez peut-être optimiser les paramètres de votre base de données pour cette modification. La table ``datalists`` a été supprimée. Tous les paramètres de la table datalists ont été fusionnés dans la table ``config``.

source: Metastrings in the database have been denormalized for performance purposes. We removed the metastrings table and put all the string values directly in the metadata and annotation tables. You need to update your custom queries to reflect these changes. Also the ``msv`` and ``msn`` table aliases are no longer available. It is best practice not to rely on the table aliases used in core queries. If you need to use custom clauses you should do your own joins.
fr: Les chaînes de métadonnées - metastrings - de la base de données ont été dénormalisées à des fins de performance. Nous avons supprimé la table metastrings et mis toutes les valeurs de chaîne directement dans les tables de métadonnées et d’annotation. Vous devez mettre à jour vos requêtes personnalisées pour refléter ces modifications. Les alias de table ``msv`` et ``msn`` ne sont plus disponibles. Il est préférable de ne pas s’appuyer sur les alias de table utilisés dans les requêtes du noyau. Si vous avez besoin d’utiliser des clauses personnalisées, vous devriez faire vos propres jointures.

source: From the "users_entity" table, the ``password`` and ``hash`` columns have been removed.
fr: Dans la table ``users_entity``, les colonnes ``password`` et ``hash`` ont été supprimées.

source: The ``geocode_cache`` table has been removed as it was no longer used.
fr: La table ``geocode_cache`` a été supprimée car elle n’était plus utilisée.

source: ``subtype`` column in ``entities`` table no longer holds a subtype ID, but a subtype string ``entity_subtypes`` table has been dropped.
fr: La colonne ``subtype`` dans la table ``entities`` ne contient plus d’ID de sous-type, mais une chaîne avec le sous-type. La table ``entity_subtypes`` a été supprimée.

source: ``type``, ``subtype`` and ``access_id`` columns in ``river`` table have been dropped. For queries without ``elgg_get_river()`` join the ``entities`` table on ``object_guid`` to check the type and the subtype of the entity. Access column hasn't been in use for some time: queries are built to ensure access to all three entities (subject, object and target).
fr: les colonnes ``type``, ``subtype`` et ``access_id`` de la table ``river`` ont été abandonnées. Pour les requêtes sans ``elgg_get_river()`` joignez la table ``entities`` sur ``object_guid`` pour vérifier le type et le sous-type de l’entité. La colonne d'accès n’est plus utilisée depuis un certain temps : les requêtes sont conçues pour garantir l’accès aux trois entités (subject, object et target).

source: Changes in ``elgg_get_entities``, ``elgg_get_metadata`` and ``elgg_get_annotations`` getter functions
fr: Changements dans les fonctions de récupération ``elgg_get_entities``, ``elgg_get_metadata`` et ``elgg_get_annotations``

source: ``elgg_get_entities`` now accepts all options that were previously distributed between ``elgg_get_entities_from_metadata``, ``elgg_get_entities_from_annotations``, ``elgg_get_entities_from_relationship``, ``elgg_get_entities_from_private_settings`` and ``elgg_get_entities_from_access_id``. The latter have been been deprecated.
fr: ``elgg_get_entities`` accepte désormais toutes les options qui étaient auparavant réparties entre ``elgg_get_entities_from_metadata``, ``elgg_get_entities_from_annotations``, ``elgg_get_entities_from_relationship``, ``elgg_get_entities_from_private_settings`` et ``elgg_get_entities_from_access_id``. Ces dernières ont été dépréciées.

source: Passing raw MySQL statements to options is deprecated. Plugins are advised to use closures that receive an instance of ``\Elgg\Database\QueryBuilder`` and prepare the statement using database abstraction layer. On one hand this will ensure that all statements are properly sanitized using the database driver, on the other hand it will allow us to transition to testable object-oriented query building.
fr: La transmission d'instructions MySQL brutes aux options est obsolète. Il est conseillé d’utiliser des Closures qui reçoivent une instance de ``\Elgg\Database\QueryBuilder`` et de préparer l’instruction à l’aide de la couche d’abstraction de la base de données. D’une part, cela permettra de s’assurer que toutes les instructions sont correctement aseptisées à l’aide du pilote de base de données, d’autre part, il nous permettra de passer à une construction de requête orientée objet qui soit testable.

source: ``wheres`` statements should not use raw SQL strings, instead pass an instance of ``\Elgg\Database\Clauses\WhereClause`` or a closure that returns an instance of ``\Doctrine\DBAL\Query\Expression\CompositeExpression``:
fr: Les instructions ``wheres`` ne devraient pas utiliser de chaînes SQL brutes, et plutôt passer une instance de ``\Elgg\Database\Clauses\WhereClause`` ou une Closure qui renvoie une instance de ``\Doctrine\DBAL\Query\Expression\CompositeExpression`` :

source: ``joins``, ``order_by``, ``group_by``, ``selects`` clauses should not use raw SQL strings. Use closures that receive an instance of ``\Elgg\Database\QueryBuilder`` and return a prepared statement.
fr: Les clauses ``joins``, ``order_by``, ``group_by``, ``selects`` ne devraient pas utiliser de chaînes SQL brutes. Utilisez les Closures qui reçoivent une instance de ``\Elgg\Database\QueryBuilder`` et renvoyez une instruction préparée - prepared statement.

source: The ``reverse_order_by`` option has been removed.
fr: L’option ``reverse_order_by`` a été supprimée.

source: Plugins should not rely on joined and selected table aliases. Closures passed to the options array will receive a second argument that corresponds to the selected table alias. Plugins must perform their own joins and use joined aliases accordingly.
fr: Les plugins ne devraient pas s’appuyer sur des alias de table jointes et sélectionnées. Les Closures transmises au tableau d’options recevront un deuxième argument correspondant à l’alias de table sélectionné. Les plugins doivent effectuer leurs propres jointures et utiliser des alias de jointure en conséquence.

source: Note that all of the private API around building raw SQL strings has also been removed. If you were relying on them in your plugins, be advised that anything marked as ``@access private`` or ``@internal`` in core can be modified and removed at any time, and we do not guarantee any backward compatibility for those functions. DO NOT USE THEM. If you find yourself needing to use them, open an issue on Github and we will consider adding a public equivalent.
fr: Notez que toute l’API privée autour de la construction de chaînes SQL brutes a également été supprimée. Si vous l'utilisiez dans vos plugins, soyez informé que tout ce qui est marqué comme ``@access private`` ou ``@internal`` dans le noyau peut être modifié et supprimé à tout moment, et que nous ne garantissons aucune compatibilité arrière pour ces fonctions. NE LES UTILISEZ PAS. Si vous avez besoin de les utiliser, ouvrez un ticket sur Github et nous envisagerons d’ajouter un équivalent public.

source: Boolean entity properties
fr: Propriétés de l’entité booléenne

source: Storage of metadata, annotation and private setting values has been aligned.
fr: Le stockage des métadonnées, des annotations et des valeurs de paramètres privés a été aligné.
