Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Cacheable views must have a file extension in their names
fr: Les vues pouvant être mises en cache doivent avoir une extension de fichier dans leur nom

source: This requirement makes it possibile for us to serve assets directly from disk for performance, instead of serving them through PHP.
fr: Cette exigence nous permet de servir des actifs directement à partir du disque pour des raisons de performance, au lieu de les servir via PHP.

source: It also makes it much easier to explore the available cached resources by navigating to dataroot/views_simplecache and browsing around.
fr: Il est également beaucoup plus facile d’explorer les ressources disponibles dans le cache en allant dans dataroot/views_simplecache et en naviguant à partir de là.

source: Bad: ``my/cool/template``
fr: Mauvais : ``my/cool/template``

source: Good: ``my/cool/template.html``
fr: Bon : ``my/cool/template.html``

source: We now cache assets by ``"$viewtype/$view"``, not ``md5("$viewtype|$view")``, which can result in conflicts between cacheable views that don't have file extensions to disambiguate files from directories.
fr: Nous mettons maintenant en cache des ressources par ``$viewtype/$view``, et plus ``md5('$viewtype|$view')``, qui entraînait des conflits entre les vues susceptibles d'être mises en cache qui n’avaient pas d’extension de fichier pour les distinguer des répertoires.

source: Dropped ``jquery-migrate`` and upgraded ``jquery`` to ^2.1.4
fr: Abandon de ``jquery-migrate`` et mise à niveau de ``jquery`` vers ^2.1.4

source: jQuery 2.x is API-compatible with 1.x, but drops support for IE8-, which Elgg hasn't supported for some time anyways.
fr: l'API jQuery 2.x est compatible avec 1.x, mais abandonne la prise en charge de IE8-, que Elgg ne prenait déjà plus en charge depuis un certain temps de toutes façons.

source: See http://jquery.com/upgrade-guide/1.9/ for how to move off jquery-migrate.
fr: Lisez http://jquery.com/upgrade-guide/1.9/ pour savoir comment se passer de jquery-migrate.

source: If you'd prefer to just add it back, you can use this code in your plugin's init:
fr: Si vous préférez le conserver, vous pouvez utiliser ce code dans l'initialisation de votre plugin :

source: Also, define a ``jquery-migrate.js`` view containing the contents of the script.
fr: Définissez également une vue ``jquery-migrate.js`` contenant le contenu du script.

source: JS and CSS views have been moved out of the js/ and css/ directories
fr: JS et CSS ont été déplacés hors des répertoires js/ et css/

source: They also have been given .js and .css extensions respectively if they didn't already have them:
fr: Ils ont également reçu des extensions .js et .css respectivement s’ils ne les avaient pas déjà :

source: Old view
fr: Ancienne vue

source: New view
fr: Nouvelle vue

source: The main benefit this brings is being able to co-locate related assets. So a template (``view.php``) can have its CSS/JS dependencies right next to it (``view.css``, ``view.js``).
fr: Le principal avantage que cela apporte est d’être en mesure de co-localiser les actifs connexes. Ainsi un modèle (``view.php``) peut avoir ses dépendances CSS/JS juste à côté (``view.css``, ``view.js``).

source: Care has been taken to make this change as backwards-compatible as possible, so you should not need to update any view references right away. However, you are certainly encouraged to move your JS and CSS views to their new, canonical locations.
fr: Un grand soin a été pris pour rendre cette modification aussi rétro-compatible que possible, de sorte que vous ne devriez pas avoir besoin de mettre à jour les références des vues immédiatement. Cependant, vous êtes certainement encouragés à déplacer vos vues JS et CSS vers leurs nouveaux emplacements canoniques.

source: Practically speaking, this carries a few gotchas:
fr: En pratique, ceci introduit quelques pièges :

source: The ``view_vars, $view_name`` and ``view, $view_name`` hooks will operate on the *canonical* view name:
fr: Les hooks ``view_vars, $view_name`` et ``view, $view_name`` fonctionneront sur le nom *canonique* de la vue :

source: Using the ``view, all`` hook and checking for individual views may not work as intended:
fr: L’utilisation du hook ``view, all`` et la vérification des vues individuelles peuvent ne pas fonctionner comme prévu :

source: Please let us know about any other BC issues this change causes. We'd like to fix as many as possible to make the transition smooth.
fr: Merci de nous faire part de tous les autres problèmes de rétro-compatibilité que ce changement provoque. Nous aimerions en résoudre le plus grand nombre possible pour faciliter la transition.

source: ``fxp/composer-asset-plugin`` is now required to install Elgg from source
fr: ``fxp/composer-asset-plugin`` est maintenant nécessaire pour installer Elgg à partir de la source

source: We use ``fxp/composer-asset-plugin`` to manage our browser assets (js, css, html) with Composer, but it must be installed globally *before installing Elgg* in order for the ``bower-asset/*`` packages to be recognized. To install it, run:
fr: Nous utilisons ``fxp/composer-asset-plugin`` pour gérer nos actifs de navigateur (js, css, html) avec Composer, mais il doit être installé globalement *avant d’installer Elgg* afin que les packages ``bower-asset/*`` soient reconnus. Pour l’installer, exécutez :

source: If you don't do this before running ``composer install`` or ``composer create-project``, you will get an error message:
fr: Si vous ne le faites pas avant d’exécuter ``composer install`` ou ``composer create-project``, vous obtiendrez un message d’erreur :

source: List of deprecated views and view arguments that have been removed
fr: Liste des vues dépréciées et des arguments d'une vue qui ont été supprimés

source: We dropped support for and/or removed the following views:
fr: Nous avons abandonné la prise en charge des vues suivantes et/ou les avons supprimées :

source: footer/analytics (Use page/elements/foot instead)
fr: footer/analytics (Utilisez page/elements/foot à la place)

source: input/calendar (Use input/date instead)
fr: input/calendar (Utilisez input/date)

source: input/datepicker (Use input/date instead)
fr: input/datepicker (Utilisez input/date à la place)

source: input/pulldown (Use input/select instead)
fr: input/pulldown (Utilisez input/select à la place)

source: js/admin (Use AMD and ``elgg_require_js`` instead of extending JS views)
fr: js/admin (Utilisez AMD et ``elgg_require_js`` au lieu d'étendre les vues JS existantes)

source: js/initialise_elgg (Use AMD and ``elgg_require_js`` instead of extending JS views)
fr: js/initialise_elgg (Utilisez AMD et ``elgg_require_js`` au lieu d'étendre les vues JS)

source: metatags (Use the 'head', 'page' plugin hook instead)
fr: metatags (Utilisez le hook plugin 'head', 'page' à la place)

source: output/calendar (Use output/date instead)
fr: output/calendar (Utilisez output/date à la place)

source: output/confirmlink (Use output/url instead)
fr: output/confirmlink (Utilisez output/url à la place)

source: page/elements/shortcut_icon (Use the 'head', 'page' plugin hook instead)
fr: page/elements/shortcut_icon (Utilisez le hook plugin 'head', 'page' à la place)

source: profile/icon (Use ``elgg_get_entity_icon``)
fr: profile/icon (Utilisez ``elgg_get_entity_icon``)

source: settings/{plugin}/edit (Use plugins/{plugin}/settings instead)
fr: settings/{plugin}/edit (Utilisez plugins/{plugin}/settings à la place)

source: usersettings/{plugin}/edit (Use plugins/{plugin}/usersettings instead)
fr: usersettings/{plugin}/edit (Utilisez plugins/{plugin}/usersettings à la place)

source: widgets/{handler}/view (Use widgets/{handler}/content instead)
fr: widgets/{handler}/view (Utilisez widgets/{handler}/content à la place)

source: We also dropped the following arguments to views:
fr: Nous avons également abandonné les arguments suivants des vues :

source: "value" in output/iframe (Use "src" instead)
fr: "value" dans output/iframe (Utilisez plutôt "src")

source: "area2" and "area3" in page/elements/sidebar (Use "sidebar" or view extension instead)
fr: "area2" et "area3" dans page/elements/sidebar (utilisez plutôt "sidebar" ou l’extension de vue)

source: "js" in icon views (e.g. icon/user/default)
fr: "js" dans les vues des icônes (par exemple icon/user/default)

source: "options" to input/radio and input/checkboxes which aren't key-value pairs will no longer be acceptable.
fr: Les "options" pour input/radio et input/checkboxes qui ne sont pas des paires de clef-valeur ne seront plus acceptées.

source: All scripts moved to bottom of page
fr: Tous les scripts ont été déplacés vers le bas de la page

source: You should test your plugin **with the JavaScript error console visible**. For performance reasons, Elgg no longer supports ``script`` elements in the ``head`` element or in HTML views. ``elgg_register_js`` will now load *all* scripts at the end of the ``body`` element.
fr: Vous devriez tester votre plugin **avec la console d’erreur JavaScript affichée**. Pour des raisons de performance, Elgg ne prend plus en charge les éléments ``script`` dans l’élément ``head`` ou dans les vues HTML. ``elgg_register_js`` chargera désormais *tous les scripts* à la fin de l’élément ``body``.

source: You must convert inline scripts to :doc:`AMD </guides/javascript>` or to external scripts loaded with ``elgg_load_js``.
fr: Vous devez convertir les scripts en ligne en modules :doc:`AMD </guides/javascript>` ou en scripts externes chargés avec ``elgg_load_js``.

source: Early in the page, Elgg provides a shim of the RequireJS ``require()`` function that simply queues code until the AMD ``elgg`` and ``jQuery`` modules are defined. This provides a straightforward way to convert many inline scripts to use ``require()``.
fr: Tôt de la page, Elgg fournit un shim de la fonction RequireJS ``require()`` qui met simplement le code en file d'attente jusqu’à ce que les modules AMD ``elgg`` et ``jQuery`` soient définis. Cela fournit un moyen simple de convertir de nombreux scripts en ligne pour utiliser ``require()``.

source: Inline code which will fail because the stack is not yet loaded:
fr: Du code en ligne échouera car la pile n’est pas encore chargée :

source: This should work in Elgg 2.0:
fr: Ceci devrait fonctionner dans Elgg 2.0 :

source: Attribute formatter removes keys with underscores
fr: Le formateur d’attributs supprime les clefs avec des tirets bas

source: ``elgg_format_attributes()`` (and all APIs that use it) now filter out attributes whose name contains an underscore. If the attribute begins with ``data-``, however, it will not be removed.
fr: ``elgg_format_attributes()`` (et toutes les API qui l’utilisent) filtrent désormais les attributs dont le nom contient un tiret bas - underscore. Toutefois si l’attribut commence par ``data-``, il ne sera pas supprimé.

source: Breadcrumbs
fr: Fil d'Ariane

source: Breadcrumb display now removes the last item if it does not contain a link. To restore the previous behavior, replace the plugin hook handler ``elgg_prepare_breadcrumbs`` with your own:
fr: L’affichage du fil d'Ariane supprime maintenant le dernier élément s’il ne contient pas de lien. Pour restaurer le comportement précédent, remplacez le gestionnaire de hook plugin ``elgg_prepare_breadcrumbs`` par le vôtre :

source: Callbacks in Queries
fr: Fonctions de rappel - Callbacks - dans les Requêtes

source: Make sure to use only valid *callable* values for "callback" argument/options in the API.
fr: Assurez-vous d’utiliser uniquement des valeurs *appelables* - callable - valides pour l’argument/les options du "callback" dans l’API.

source: Querying functions will now will throw a ``RuntimeException`` if ``is_callable()`` returns ``false`` for the given callback value. This includes functions such as ``elgg_get_entities()``, ``get_data()``, and many more.
fr: Les fonctions de requêtage lanceront désormais une ``RuntimeException`` si ``is_callable()`` renvoie ``false`` comme valeur pour la fonction de rappel donnée. Cela comprend des fonctions telles que ``elgg_get_entities()``, ``get_data()``, et bien d’autres.

source: Comments plugin hook
fr: Hook plugin des commentaires

source: Plugins can now return an empty string from ``'comments',$entity_type`` hook in order to override the default comments component view. To force the default comments component, your plugin must return ``false``. If you were using empty strings to force the default comments view, you need to update your hook handlers to return ``false``.
fr: Les plugins peuvent désormais renvoyer une chaîne vide depuis le hook ``'comments',$entity_type`` afin de remplacer la vue du composant de commentaires par défaut. Pour forcer le composant de commentaires par défaut, votre plugin doit renvoyer ``false``. Si vous utilisiez des chaînes vides pour forcer l’affichage des commentaires par défaut, vous devez mettre à jour vos gestionnaires de hooks pour qu’ils renvoient ``false``.

source: Container permissions hook
fr: Hook des permissions du conteneur

source: The behavior of the ``container_permissions_check`` hook has changed when an entity is being created: Before 2.0, the hook would be called twice if the entity's container was not the owner. On the first call, the entity's owner would be passed in as ``$params['container']``, which could confuse handlers.
fr: Le comportement du hook ``container_permissions_check`` a changé lorsqu'une entité est créée : avant la version 2.0, le hook était appelé deux fois si le conteneur de l’entité n’était pas le propriétaire. Lors du premier appel, le propriétaire de l’entité était transmis en tant que ``$params['container']``, ce qui pouvait créer des confusion dans les gestionnaires.

source: In 2.0, when an entity is created in a container like a group, if the owner is the same as the logged in user (almost always the case), this first check is bypassed. So the ``container_permissions_check`` hook will almost always be called once with ``$params['container']`` being the correct container of the entity.
fr: Dans la version 2.0, lorsqu’une entité est créée dans un conteneur tel qu'un groupe, si le propriétaire est le même que l’utilisateur connecté (ce qui est presque toujours le cas), cette première vérification est contournée. Ainsi, le hook ``container_permissions_check`` sera presque toujours appelé une seule fois avec ``$params['container']`` comme conteneur correct de l’entité.

source: Creating or deleting a relationship triggers only one event
fr: La création ou la suppression d’une relation déclenche un seul événement

source: The "create" and "delete" relationship events are now only fired once, with ``"relationship"`` as the object type.
fr: Les événements de relation "create" et "delete" sont désormais déclenchés une seule fois, avec ``"relationship"`` comme type d’objet.

source: E.g. Listening for the ``"create", "member"`` or ``"delete", "member"`` event(s) will no longer capture group membership additions/removals. Use the ``"create", "relationship"`` or ``"delete", "relationship"`` events.
fr: Par ex. Écouter l’événement (ou les événements) ``"create", "member"`` ou ``"delete", "member"`` ne capturera plus les ajouts/suppressions d’appartenance au groupe. Utilisez les événements ``"create", "relationship"`` ou ``"delete", "relationship"`` events.

source: Discussion feature has been pulled from groups into its own plugin
fr: La fonction de discussion a été extraite des groupes vers son propre plugin

source: The ``object, groupforumtopic`` subtype has been replaced with the ``object, discussion`` subtype. If your plugin is using or altering the old discussion feature, you should upgrade it to use the new subtype.
fr: Le sous-type ``object, groupforumtopic`` a été remplacé par le sous-type ``object, discussion``. Si votre plugin utilise ou modifie l’ancienne fonctionnalité de discussion, vous devez le mettre à niveau pour utiliser le nouveau sous-type.

source: Nothing changes from the group owners' point of view. The discussion feature is still available as a group tool and all old discussions are intact.
fr: Rien ne change du point de vue du propriétaire du groupe. La fonction de discussion est toujours disponible en tant qu’outil de groupe et toutes les anciennes discussions sont intactes.

source: Dropped login-over-https feature
fr: Fonctionnalité de connexion via https abandonnée

source: For the best security and performance, serve all pages over HTTPS by switching the scheme in your site's wwwroot to ``https`` at http://yoursite.tld/admin/settings/advanced
fr: Pour une meilleure sécurité et de meilleures performances, servez toutes les pages par HTTPS en changeant le protocole dans le wwwroot de votre site pour ``https`` dans http://yoursite.tld/admin/settings/advanced

source: Elgg has migrated from ext/mysql to PDO MySQL
fr: Elgg a migré d’ext/mysql vers PDO MySQL

source: Elgg now uses a ``PDO_MYSQL`` connection and no longer uses any ext/mysql functions. If you use ``mysql_*`` functions, implicitly relying on an open connection, these will fail.
fr: Elgg utilise désormais une connexion ``PDO_MYSQL`` et n’utilise plus de fonctions ext/mysql. Si vous utilisez les fonctions ``mysql_ *``, en vous appuyant implicitement sur une connexion ouverte, celles-ci échoueront.

source: If your code uses one of the following functions, read below.
fr: Si votre code utilise l’une des fonctions suivantes, lisez ce qui suit.

source: If you provide a callable ``$handler`` to be called with the results, your handler will now receive a ``\Doctrine\DBAL\Driver\Statement`` object. Formerly this was an ext/mysql ``result`` resource.
fr: Si vous fournissez un objet ``$handler`` qui doit être appelé avec les résultats, votre gestionnaire recevra désormais un objet ``\Doctrine\DBAL\Driver\Statement``. Auparavant, il s’agissait d’une ressource ext/mysql ``result``.

source: Event/Hook calling order may change
fr: L’ordre d’appel d'un événement/hook pourrait changer

source: When registering for events/hooks, the ``all`` keyword for wildcard matching no longer has any effect on the order that handlers are called. To ensure your handler is called last, you must give it the highest priority of all matching handlers, or to ensure your handler is called first, you must give it the lowest priority of all matching handlers.
fr: Lors de l’enregistrement pour des événements/hooks, le mot-clef ``all`` pour la correspondance générique n’a plus aucun effet sur l’ordre dans lequel les gestionnaires sont appelés. Pour vous assurer que votre gestionnaire est appelé en dernier, vous devez lui donner la plus haute priorité de tous les gestionnaires correspondants, ou pour vous assurer que votre gestionnaire est appelé en premier, vous devez lui donner la plus basse priorité de tous les gestionnaires correspondants.

source: If handlers were registered with the same priority, these are called in the order they were registered.
fr: Si les gestionnaires ont été enregistrés avec la même priorité, ceux-ci sont appelés dans l’ordre où ils ont été enregistrés.

source: To emulate prior behavior, Elgg core handlers registered with the ``all`` keyword have been raised in priority. Some of these handlers will most likely be called in a different order.
fr: Pour émuler le comportement antérieur, les gestionnaires du noyau Elgg enregistrés avec le mot clé ``all`` ont été élevés en priorité. Certains de ces gestionnaires seront très probablement appelés dans un ordre différent.

source: ``export/`` URLs are no longer available
fr: Les URLs ``export/`` ne sont plus disponibles

source: Elgg no longer provides this endpoint for exposing resource data.
fr: Elgg ne prend plus en charge ce point de terminaison pour exposer les données de ressources.

source: Icons migrated to Font Awesome
fr: Icônes migrés vers Font Awesome

source: Elgg's sprites and most of the CSS classes beginning with ``elgg-icon-`` `have been removed <https://github.com/Elgg/Elgg/pull/8578/files#diff-b3912b37ca7bd6c53a2968ccb6c22a94L22>`_.
fr: Les sprites de Elgg et la plupart des classes CSS commençant par ``elgg-icon-`` `ont été supprimées <https://github.com/Elgg/Elgg/pull/8578/files#diff-b3912b37ca7bd6c53a2968ccb6c22a94L22>`_.

source: Usage of ``elgg_view_icon()`` is backward compatible, but static HTML using the ``elgg-icon`` classes will have to be updated to the new markup.
fr: L’utilisation de ``elgg_view_icon()`` est rétro-compatible, mais le HTML statique utilisant les classes ``elgg-icon`` devra être mis à jour vers le nouveau balisage.

source: Increase of z-index value in elgg-menu-site class
fr: Augmentation de la valeur de z-index dans la classe elgg-menu-site

source: The value of z-index in the elgg-menu-site class has been increased from 1 to 50 to allow for page elements in the content area to use the z-index property without the "More" site menu's dropdown being displayed behind these elements. If your plugin/theme overrides the elgg-menu-site class or views/default/elements/navigation.css please adjust the z-index value in your modified CSS file accordingly.
fr: La valeur de z-index dans la classe elgg-menu-site est passée de 1 à 50 pour permettre aux éléments de page de la zone de contenu d’utiliser la propriété z-index sans que le menu du site additionnel "More" s’affiche derrière ces éléments. Si votre plugin/thème remplace la classe elgg-menu-site ou les views/default/elements/navigation.css veuillez ajuster en conséquence la valeur de z-index dans votre fichier CSS modifié.

source: input/autocomplete view
fr: vue input/autocomplete

source: Plugins that override the ``input/autocomplete`` view will need to include the source URL in the ``data-source`` attribute of the input element, require the new ``elgg/autocomplete`` AMD module, and call its ``init`` method. The 1.x javascript library ``elgg.autocomplete`` is no longer used.
fr: Les plugins qui remplacent la vue ``input/autocomplete`` devront inclure l’URL source dans l’attribut ``data-source`` de l’élément d’entrée, exiger le nouveau module AMD ``elgg/autocomplete`` et appeler sa méthode ``init``. La bibliothèque javascript 1.x ``elgg.autocomplete`` n’est plus utilisée.

source: Introduced third-party library for sending email
fr: Introduction d’une bibliothèque tierce pour l’envoi d'e-mails

source: We are using the excellent ``Zend\Mail`` library to send emails in Elgg 2.0. There are likely edge cases that the library handles differently than Elgg 1.x. Take care to test your email notifications carefully when upgrading to 2.0.
fr: Nous utilisons l’excellente bibliothèque ``Zend\Mail`` pour envoyer des e-mails dans Elgg 2.0. Il y a probablement des cas particuliers que la bibliothèque gère différemment de Elgg 1.x. Prenez soin de tester attentivement vos notifications par e-mail lors de la mise à niveau vers 2.0.

source: Label elements
fr: Éléments d’étiquetage - label

source: The following views received ``label`` elements around some of the input fields. If your plugin/theme overrides these views please check for the new content.
fr: Les vues suivantes ont reçu des éléments ``label`` autour de certains des champs d’entrée. Si votre plugin/thème remplace ces vues, veuillez vérifier le nouveau contenu.

source: Plugin Aalborg Theme
fr: Plugin de thème Aalborg

source: The view ``page/elements/navbar`` now uses a Font Awesome icon for the mobile menu selector instead of an image. The ``bars.png`` image and supporting CSS for the 1.12 rendering has been removed, so update your theme accordingly.
fr: La vue ``page/elements/navbar`` utilise désormais une icône Font Awesome pour le sélecteur de menu mobile au lieu d’une image. L’image ``bars.png`` et les CSS correspondantes pour le rendu 1.12 ont été supprimées, aussi mettez à jour votre thème en conséquence.
