Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: Remove ``page/layouts/one_sidebar`` view
fr: Supprimez la vue ``page/layouts/one_sidebar``

source: Remove ``page/layouts/two_sidebar`` view
fr: Supprimez la vue ``page/layouts/two_sidebar``

source: Remove ``page/layouts/content`` view
fr: Supprimez la vue ``page/layouts/content``

source: Update their use of ``page/layouts/default``
fr: Mettez à jour leur utilisation de ``page/layouts/default``

source: Update their use of ``page/layouts/error``
fr: Mettez à jour leur utilisation de ``page/layouts/error``

source: Update their use of ``page/layouts/elements/filter``
fr: Mettez à jour leur utilisation de ``page/layouts/elements/filter``

source: Update their use of ``page/layouts/elements/header``
fr: Mettez à jour leur utilisation de ``page/layouts/elements/header``

source: Update their use of ``page/layouts/elements/footer``
fr: Mettez à jour leur utilisation de ``page/layouts/elements/footer``

source: Update their use of ``page/elements/title``
fr: Mettez à jour leur utilisation de ``page/elements/title``

source: Update their use of ``navigation/breadcrumbs`` to pass ``$vars['breadcrumbs']`` to ``elgg_get_breadcrumbs()``
fr: Mettez à jour leur utilisation de ``navigation/breadcrumb`` pour passer ``$vars ['breadcrumb']`` à ``elgg_get_breadcrumbs()``

source: Update hook registrations for ``output:before, layout`` to ``view_vars, page/layout/<layout_name>``
fr: Mettez à jour les enregistrements du hook ``output:before, layout`` vers ``view_vars, page/layout/<layout_name>``

source: Update hook registrations for ``output:after, layout`` to ``view, page/layout/<layout_name>``
fr: Mettez à jour les enregistrements du hook ``output:after, layout`` vers ``view, page/layout/<layout_name>``

source: Likes plugin
fr: Plugin Likes

source: Likes no longer uses Elgg's toggle API, so only a single ``likes`` menu item is used. The add/remove actions no longer return Ajax values directly, as likes status data is now returned with *every* Ajax request that sends a "guid". When the number of likes is zero, the ``likes_count`` menu item is now hidden by adding `.hidden` to the LI element, instead of the anchor. Also the ``likes_count`` menu item is a regular link, and is no longer created by the ``likes/count`` view.
fr: La fonctionnalité Likes n'utilise plus l’API de bascule "toggle" de Elgg, de sorte qu’un seul élément de menu ``likes`` est utilisé. Les actions d'ajout/suppression "add" et "remove" ne renvoient plus directement les valeurs Ajax, car les données d’état des mentions J’aime sont maintenant renvoyées avec *chaque* requête Ajax qui envoie un "guid". Lorsque le nombre de mentions J’aime est nul, l’élément de menu ``likes_count`` est maintenant masqué en ajoutant `.hidden` à l’élément LI, au lieu de le faire sur l’ancre. De plus, l’élément de menu ``likes_count`` est un lien classique, et n’est plus créé par la vue ``likes/count``.

source: Notifications plugin
fr: Plugin Notifications

source: Notifications plugin has been rewritten dropping many views and actions. The purpose of this rewrite was to implement a more efficient, extendable and scalable interface for managing notifications preferences. We have implemented a much simpler markup and removed excessive styling and javascript that was required to make the old interface work.
fr: Le plugin Notifications a été réécrit en abandonnant de nombreuses vues et actions. Le but de cette réécriture était de mettre en œuvre une interface plus efficace, extensible et évolutive pour la gestion des préférences de notifications. Nous avons mis en œuvre un balisage beaucoup plus simple, supprimé les styles en excès et le javascript qui était nécessaire pour faire fonctionner l’ancienne interface.

source: If your plugin is extending any of the views or relies on any actions in the notifications plugin, it has to be updated.
fr: Si votre plugin étend l’une des vues ou s’appuie sur des actions du plugin notifications, il doit être mis à jour.

source: Pages plugin
fr: Plugin Pages

source: The suptype ``page_top`` has been migrated into the subtype ``page``. The subtype ``page`` has it's own class namely ``ElggPage``. In order to check if an ``ElggPage`` is a top page the class function ``ElggPage->isTopPage()`` was added.
fr: Le sous-type ``page_top`` a été migré dans le sous-type ``page``. Le sous-type ``page`` dispose de sa propre classe, à savoir ``ElggPage``. Pour vérifier si une ``ElggPage`` est une page de premier niveau, la fonction de classe ``ElggPage->isTopPage()`` a été ajoutée.

source: All pages have a metadata value for ``parent_guid``, for top pages this contains ``0``.
fr: Toutes les pages ont une valeur de métadonnée pour ``parent_guid``, pour les pages de premier niveau celle-ci est ``0``.

source: Profile plugin
fr: Plugin Profile

source: All profile related functionality has been moved out of core into this plugin. Most noteable are the profile field admin utility and the hook to set up the profile fields config data.
fr: Toutes les fonctionnalités liées au profil ont été déplacées hors du noyau dans ce plugin. Les plus remarquables sont l’utilitaire d’administration des champs de profil et le hook pour définir les données de configuration des champs de profil.

source: Data Views plugin
fr: Vues de données "Plugin Data Views"

source: The Data Views plugin no longer comes bundled.
fr: Le plugin Data Views n’est plus distribué avec le noyau.

source: Twitter API plugin
fr: Plugin de l'API Twitter

source: The ``twitter_api`` plugin has been removed from the Elgg core. The plugin is still available as the Composer package `elgg/twitter_api <https://packagist.org/packages/elgg/twitter_api>`_, in order to install it add the following to you ``composer.json`` ``require`` section:
fr: Le plugin ``twitter_api`` a été retiré du noyau de Elgg. Le plugin est toujours disponible sous forme de package Composer `elgg/twitter_api <https://packagist.org/packages/elgg/twitter_api>`_. Pour l’installer, ajoutez ce qui suit à la section ``require`` de votre ``composer.json`` :

source: Legacy URLs plugin
fr: Plugin de support des URLs d'origine

source: The ``legacy_urls`` plugin has been removed from the Elgg core. The plugin is still available as the Composer package `elgg/legacy_urls <https://packagist.org/packages/elgg/legacy_urls>`_, in order to install it add the following to you ``composer.json`` ``require`` section:
fr: Le plugin ``legacy_urls`` a été retiré du noyau de Elgg. Le plugin est toujours disponible sous la forme du package Composer `elgg/legacy_urls <https://packagist.org/packages/elgg/legacy_urls>`_. Pour l’installer, ajoutez ce qui suit à la section ``require`` de votre ``composer.json`` :

source: User validation by email plugin
fr: Plugin de validation par e-mail de l’utilisateur

source: The listing view of unvalidated users has been moved from the plugin to Elgg core. Some generic action (eg. validate and delete) have also been moved to Elgg core.
fr: La vue qui liste les utilisateurs non validés a été déplacée du plugin vers le noyau de Elgg. Certaines actions génériques (par exemple valider et supprimer) ont également été déplacées vers le noyau de Elgg.

source: Email delivery
fr: Expédition d'e-mail

source: To provide for more granularity in email handling and delivery, **email, system** hook has been removed. New email service provides for several other replacement hooks that allow plugins to control email content, format, and transport used for delivery.
fr: Pour prévoir plus de granularité dans la gestion et la livraison des e-mails, le hook **email, system** a été supprimé. Le nouveau service de messagerie fournit plusieurs autres hooks de remplacement qui permettent aux plugins de contrôler le contenu, le format et l'agent de transport de messagerie utilisés pour la livraison.

source: ``elgg_set_email_transport()`` can now be used to replace the default Sendmail transport with another instance of ``\Zend\Mail\Transport\TransportInterface``, e.g. SMTP, in-memory, or file transport. Note that this function must be called early in the boot process. Note that if you call this function on each request, using plugin settings to determine transport config may not be very efficient - store these settings in as datalist or site config values, so they are loaded from boot cache.
fr: ``elgg_set_email_transport()`` peut désormais être utilisé pour remplacer l'agent de transport Sendmail par défaut par une autre instance de ``\Zend\Mail\Transport\TransportInterface``, par exemple SMTP, in-memory, ou le transport de fichiers. Notez que cette fonction doit être appelée tôt dans le processus de démarrage. Notez que si vous appelez cette fonction sur chaque requête, l’utilisation des paramètres du plugin pour déterminer la configuration de transport peut ne pas être très efficace - stockez ces paramètres sous forme de liste de données "datalist" ou dans les valeurs de configuration du site, de sorte qu’ils soient chargés à partir du cache de démarrage.

source: Theme and styling changes
fr: Changements de thème et de style

source: Aalborg theme is no longer bundled with Elgg. Default core theme is now based on Aalboard, but it has undergone major changes.
fr: Le thème Aalborg n’est plus distribué avec Elgg. Le thème du noyau par défaut est maintenant basé sur Aalborg, mais avec des changements majeurs.

source: Notable changes in plugins:
fr: Évolutions notables dans les plugins :

source: Topbar, navbar and header have been combined into a single responsive topbar component
fr: La barre supérieure -topbar-, la barre de navigation -navbar- et l’entête -header- ont été combinés en un seul composant de barre supérieure responsive - topbar

source: Default inner width is now 1280px (80rem * 16px/1rem)
fr: La largeur intérieure par défaut est maintenant 1280px (80rem * 16px/1rem)

source: Preferred unit of measurement is now `rem` and not `px`
fr: L'unité de mesure préférée est maintenant `rem` et non `px`

source: The theme uses `8-point grid system <https://builttoadapt.io/intro-to-the-8-point-grid-system-d2573cde8632>`
fr: Le thème utilise un `système de grille à 8 points <https://builttoadapt.io/intro-to-the-8-point-grid-system-d2573cde8632>`

source: Menus, layout elements and other components now use flexbox
fr: Les menus, éléments de mise en page -layouts- et autres composants utilisent maintenant flexbox

source: Reset is done using `8-point grid system <https://necolas.github.io/normalize.css/>`
fr: La réinitialisation se fait à l’aide d'un `système de grille à 8 points <https://necolas.github.io/normalize.css/>`

source: Media queries have been rewritten for mobile-first experience
fr: Les requêtes multimédias ont été réécrites pour une expérience mobile-first

source: Form elements (text inputs, buttons and selects) now have an equal height of 2.5rem
fr: Les éléments de formulaire (entrées de texte, boutons et sélecteurs) ont maintenant tous une hauteur identique de 2.5rem

source: Layout header is now positioned outside of the layout columns, which have been wrapped into ``elgg-layout-columns``
fr: L’entête -header- de la disposition -layout- est maintenant positionné à l’extérieur des colonnes de la disposition, qui ont été enveloppées dans ``elgg-layout-columns``

source: z-index properties have been reviewed and stacked with simple iteration instead of `9999999 <https://hackernoon.com/my-approach-to-using-z-index-eca67feb079c>`.
fr: les propriétés z-index ont été examinées et empilées avec une itération simple au lieu de `9999999 <https://hackernoon.com/my-approach-to-using-z-index-eca67feb079c>`.

source: Color scheme has been changed to highlight actionable elements and reduce abundance of gray shades
fr: Le schéma de couleurs a été modifié pour mettre en évidence les éléments exploitables et réduire l’abondance des nuances de gris

source: search plugin no longer extends ``page/elements/header`` and instead ``page/elements/topbar`` renders ``search/search_box`` view
fr: le plugin de recherche n’étend plus ``page/elements/header``, et au lieu de cela ``page/elements/topbar`` affiche la vue ``search/search_box``

source: ``.elgg-icon`` no longer has a global ``font-size``, ``line-height`` or ``color``: these values will be inherited from parent items
fr: ``.elgg-icon`` n’a plus de ``font-size``, ``line-height`` ou ``color`` global : ces valeurs seront héritées des éléments parents

source: Support for ``.elgg-icon-hover`` has been dropped
fr: Le support de ``.elgg-icon-hover`` a été abandonné

source: User "hover" icons are no longer covered with a "caret" icon
fr: Les icônes "hover" de l’utilisateur ne sont plus recouvertes par une icône "caret"

source: Read more about :doc:`Theming Principles </guides/themes>`
fr: Pour en savoir plus au sujet des :doc:`Principes de création de thèmes </guides/themes>`

source: Also note, CSS views served via ``/cache`` URLs are pre-processed using `CSS Crush <http://the-echoplex.net/csscrush/>`. If you make references to CSS variables or other elements, the definition must be located within the same view output. E.g. A variable defined in ``elgg.css`` cannot be referenced in a separate CSS file like ``colorbox.css``.
fr: Notez également que les vues CSS servies via les URL ``/cache`` sont pré-traitées à l’aide de `CSS Crush <http://the-echoplex.net/csscrush/>`. Si vous faites des références à des variables CSS ou à d’autres éléments, la définition doit être située dans la même vue d’affichage. Par exemple, une variable définie dans ``elgg.css`` ne peut pas être référencée dans un fichier CSS distinct comme ``colorbox.css``.

source: Comments
fr: Commentaires

source: Submitting comments is now AJAXed. After a succesful submission the comment list will be updated automatically.
fr: L'envoi des commentaires est maintenant AJAXifié. Après un envoi réussi, la liste des commentaires sera mise à jour automatiquement.

source: The following changes have been made to the comment notifications.
fr: Les modifications suivantes ont été apportées aux notifications des commentaires.

source: The language keys related to comment notifications have changed. Check the ``generic_comment:notification:owner:`` language keys
fr: Les clefs de traduction relatives aux notifications des commentaires ont changé. Vérifiez les clefs de traduction ``generic_comment:notification:owner:``

source: The action for creating a comment (``action/comment/save``) was changed. If your plugin overruled this action you should have a look at it in order to prevent double notifications
fr: L’action de création d’un commentaire (``action/comment/save``) a été modifiée. Si votre plugin a remplacé cette action, vous devriez jeter un œil dessus afin d’éviter les doubles notifications

source: Object listing views
fr: Vues de listing d'objets

source: ``object/elements/full/body`` now wraps the full listing body in a ``.elgg-listing-full-body`` wrapper
fr: ``object/elements/full/body`` enveloppe maintenant l'ensemble du corps du listing dans un emballage -wrapper- ``.elgg-listing-full-body``

source: ``object/elements/full`` now supports ``attachments`` and ``responses`` which are rendered after listing body
fr: ``object/elements/full`` supporte désormais ``attachments`` et ``responses`` qui sont affichés après le corps du listing

source: In core plugins, resource views no longer render comments/replies - instead they pass a ``show_responses`` flag to the entity view, which renders the responses and passes them to the full listing view. Third party plugins will need to update their uses of ``object/<subtype>`` and ``resources/<handler>/view`` views.
fr: Dans les plugins du noyau, les vues des ressources n'affichent plus comments/replies - au lieu de cela, elles transmettent un indicateur ``show_responses`` à la vue de l’entité, ce qui génère les réponses et les transmet à la vue de la liste complète. Les plugins tiers devront mettre à jour leurs utilisations des vues ``object/<subtype>`` et ``ressources/<handler>/view``.

source: Full discussion view is now rendered using ``object/elements/full`` view
fr: La vue de la discussion complète est désormais affichée en utilisant la vue ``object/elements/full``

source: ``object/file`` now passes image (specialcontent) view as an ``attachment`` to the full listing view
fr: ``object/file`` passe désormais la vue image (specialcontent) sous la forme d'une pièce jointe ``attachment`` à la vue listing complète

source: Menu changes
fr: Modifications des menus

source: Default sorting of menu items has been changed from ``text`` to ``priority``.
fr: Le tri par défaut des éléments de menu a été modifié de ``text`` à ``priority``.

source: Note that ``register`` and ``prepare`` hooks now use collections API. For the most part, all hooks should continue working, as long as they are not performing complex operations with arrays.
fr: Notez que les hooks ``register`` et ``prepare`` utilisent maintenant l’API des collections. Dans la majorité des cas, tous les hooks devraient continuer à fonctionner, tant qu’ils n’effectuent pas d’opérations complexes avec des tableaux.

source: Support for ``icon`` and ``badge`` parameters was added. Plugins should start using these parameters and prefer them to a single ``text`` parameter. CSS should be used to control visibility of the label, icon and badge, instead of conditionals in preparing menu items.
fr: La prise en charge des paramètres ``icon`` et ``badge`` a été ajoutée. Les plugins doivent commencer à utiliser ces paramètres et les préférer à un seul paramètre ``text``. CSS devrait être utilisé pour contrôler la visibilité de l’étiquette, de l’icône et du badge, au lieu de conditions dans la préparation des éléments de menu.

source: All menus are now wrapped with ``nav.elgg-menu-container`` to ensure that multiple menu sections have a single parent element, and can be styled using flexbox or floats.
fr: Tous les menus sont maintenant enveloppés par ``nav.elgg-menu-container`` pour s’assurer que plusieurs sections de menu ont un unique élément parent, et peuvent être stylisés à l’aide de flexbox ou de floats.

source: All menu items are now identified with with ``data-menu-item`` attribute, sections - with ``data-menu-section``, containers with - ``data-menu-name`` attributes.
fr: Tous les éléments de menu sont maintenant identifiés avec l’attribut ``data-menu-item``, les sections avec ``data-menu-section``, et les conteneurs avec des attributs ``data-menu-name``.

source: ``topbar`` menu:
fr: menu ``topbar`` :

source: ``account`` menu item with priority ``800`` added to ``alt`` section
fr: l'élément de menu ``account`` avec la priorité ``800`` ajouté à la section ``alt``

source: ``site_notifications`` menu item is now a child of ``account`` with priority ``100``
fr: l'élément de menu ``site_notifications`` est désormais un enfant de ``account`` avec pour priorité ``100``

source: ``usersettings`` menu item is now a child of ``account`` with priority ``300``
fr: l'élément de menu ``usersettings`` est désormais un enfant de ``account`` avec pour priorité ``300``

source: ``administration`` menu item is now a child of ``account`` with priority ``800``
fr: l'élément de menu ``administration`` est désormais un enfant de ``account`` avec pour priorité ``800``

source: ``logout`` menu item is now a child of ``account`` with priority ``900``
fr: l'élément de menu ``logout`` est désormais un enfant de ``account`` avec pour priorité ``900``

source: ``dashboard`` menu item now is now a child of ``acount`` has priority of ``100``
fr: l'élément de menu ``dashboard`` est désormais un enfant de ``account`` avec pour priorité ``100``

source: In ``default`` section (``profile``, ``friends``, ``messages``), core menu items now use ``icon`` parameter and use CSS to hide the label. Plugins that register items to this section and expect a visible label need to update their CSS.
fr: Dans la section ``default`` (``profile``, ``friends``, ``messages``), les éléments de menu du noyau utilisent désormais le paramètre ``icon`` et utilisent CSS pour masquer l’étiquette. Les plugins qui enregistrent des éléments dans cette section et s’attendent à ce qu’une étiquette soit visible doive mettre à jour leur CSS.

source: ``profile`` menu item is now a child of ``account``
fr: l'élément de menu ``profile`` est désormais un enfant de ``account``

source: ``friends`` menu item is now a child of ``account``
fr: l'élément de menu ``friends`` est désormais un enfant de ``account``

source: ``entity`` menu:
fr: menu ``entity`` :

source: ``access`` menu item has been removed. Access information is now rendered in the entity byline.
fr: l'élément de menu ``access`` a été supprimé. L'information sur les accès est désormais affichée dans la signature (byline) de l'entité.

source: ``user_hover`` menu:
fr: menu ``user_hover`` :

source: All items use the ``icon`` parameter.
fr: Tous les éléments utilisent le paramètre ``icon``.

source: The layout of the dropdown has been changed. If you have modified the look and feel of this dropdown, you might need to update your HTML/CSS.
fr: La disposition de la liste déroulante a été modifiée. Si vous avez modifié l’apparence de cette liste déroulante, vous devrez peut-être mettre à jour votre code HTML/CSS.

source: ``widget`` menu:
fr: menu ``widget`` :

source: ``collapse`` menu item has been removed and CSS updated accordingly
fr: l'élément de menu ``collapse`` a été supprimé et les CSS ont été mises à jour en conséquence

source: ``title`` menu:
fr: menu ``title`` :

source: The ``profile`` plugin no longer uses the actions section of the ``user_hover`` menu, but registers regulare ``title`` menu items.
fr: Le plugin ``profile`` n’utilise plus la section actions du menu ``user_hover``, mais enregistre des éléments de menu ``title`` classiques.

source: ``extras`` menu:
fr: menu ``extras`` :

source: This menu has been removed from the page layout. Menu items that registered for this menu have been moved to other menus.
fr: Ce menu a été supprimé de la mise en page. Les éléments de menu enregistrés pour ce menu ont été déplacés vers d’autres menus.

source: ``groups:my_status`` menu:
fr: menu ``groups:my_status`` :

source: This menu has been removed from the group profile page.
fr: Ce menu a été supprimé de la page de profil du groupe.

source: ``site_notifications`` menu:
fr: menu ``site_notifications`` :

source: This menu has been removed. Site Notification objects now use the entity menu for actions.
fr: Ce menu a été supprimé. Les objets de notification de site utilisent désormais le menu de l'entité pour les actions.

source: ``site`` menu:
fr: menu ``site`` :

source: Registration of custom menu item defined in admin interface has been moved to ``register, menu:site`` hook. ``navigation/menu/site`` view has been removed. Site menu now adds a ``more` menu item directly to the ``default`` section.
fr: L’enregistrement d’un élément de menu personnalisé défini dans l’interface d’administrateur a été déplacé vers le hook ``register, menu:site``. La vue ``navigation/menu/site`` a été supprimée. Le menu du site ajoute maintenant un élément de menu ``more`` directement dans la section ``default``.

source: Entity icons
fr: Icônes des entités

source: Default icon image files have been moved and re-mapped as follows:
fr: Les fichiers images des icônes par défaut ont été déplacés et re-mappés comme suit :

source: Default icons: ``views/default/icon/default/$size.png``
fr: Icônes par défaut : ``views/default/icon/default/$size.png``

source: User icons: ``views/default/icon/user/default/$size.gif``
fr: Icônes utilisateur : ``views/default/icon/user/default/$size.gif``

source: Group icons: ``views/default/icon/group/default/$size.gif`` in the groups plugin
fr: Icônes de groupe : ``views/default/icon/group/default/$size.gif`` dans le plugin groups
