Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``pages_write_access_vars`` changed to ``Elgg\Pages\Views::preventAccessPublic``
fr: ``pages_write_access_vars`` changé pour ``Elgg\Pages\Views::preventAccessPublic``

source: ``pages_write_permission_check`` changed to ``Elgg\Pages\Permissions::allowWriteAccess``
fr: ``pages_write_permission_check`` changé pour ``Elgg\Pages\Permissions::allowWriteAccess``

source: ``Elgg\Pages\Menus::registerPageMenuItems`` changed to ``Elgg\Pages\Menus\PagesNav::register``
fr: ``Elgg\Pages\Menus::registerPageMenuItems`` changé pour ``Elgg\Pages\Menus\PagesNav::register``

source: ``_profile_admin_page_menu`` changed to ``Elgg\Profile\Menus\Page::registerAdminProfileFields``
fr: ``_profile_admin_page_menu`` changé pour ``Elgg\Profile\Menus\Page::registerAdminProfileFields``

source: ``_profile_fields_setup`` changed to ``Elgg\Profile\FieldsHandler``
fr: ``_profile_fields_setup`` changé pour ``Elgg\Profile\FieldsHandler``

source: ``_profile_title_menu`` changed to ``Elgg\Profile\Menus\Title::register``
fr: ``_profile_title_menu`` changé pour ``Elgg\Profile\Menus\Title::register``

source: ``_profile_topbar_menu`` changed to ``Elgg\Profile\Menus\Topbar::register``
fr: ``_profile_topbar_menu`` changé pour ``Elgg\Profile\Menus\Topbar::register``

source: ``_profile_user_hover_menu`` changed to ``Elgg\Profile\Menus\UserHover::register``
fr: ``_profile_user_hover_menu`` changé pour ``Elgg\Profile\Menus\UserHover::register``

source: ``_profile_user_page_menu`` changed to ``Elgg\Profile\Menus\Page::registerProfileEdit``
fr: ``_profile_user_page_menu`` changé pour ``Elgg\Profile\Menus\Page::registerProfileEdit``

source: ``profile_default_widgets_hook`` changed to ``Elgg\Profile\Widgets::getDefaultWidgetsList``
fr: ``profile_default_widgets_hook`` changé pour ``Elgg\Profile\Widgets::getDefaultWidgetsList``

source: ``reportedcontent_user_hover_menu`` changed to ``Elgg\ReportedContent\Menus\UserHover::register``
fr: ``reportedcontent_user_hover_menu`` changé pour ``Elgg\ReportedContent\Menus\UserHover::register``

source: ``search_exclude_robots`` changed to ``Elgg\Search\Site::preventSearchIndexing``
fr: ``search_exclude_robots`` changé pour ``Elgg\Search\Site::preventSearchIndexing``

source: ``search_output_tag`` changed to ``Elgg\Search\Views::setSearchHref``
fr: ``search_output_tag`` changé pour ``Elgg\Search\Views::setSearchHref``

source: ``site_notifications_register_entity_menu`` changed to ``Elgg\SiteNotifications\Menus\Entity::register``
fr: ``site_notifications_register_entity_menu`` changé pour ``Elgg\SiteNotifications\Menus\Entity::register``

source: ``site_notifications_send`` changed to ``Elgg\SiteNotifications\Notifications::createSiteNotifications``
fr: ``site_notifications_send`` changé pour ``Elgg\SiteNotifications\Notifications::createSiteNotifications``

source: ``_uservalidationbyemail_user_unvalidated_bulk_menu`` changed to ``Elgg\UserValidationByEmail\Menus\UserUnvalidatedBulk::register``
fr: ``_uservalidationbyemail_user_unvalidated_bulk_menu`` changé pour ``Elgg\UserValidationByEmail\Menus\UserUnvalidatedBulk::register``

source: ``_uservalidationbyemail_user_unvalidated_menu`` changed to ``Elgg\UserValidationByEmail\Menus\UserUnvalidated::register``
fr: ``_uservalidationbyemail_user_unvalidated_menu`` changé pour ``Elgg\UserValidationByEmail\Menus\UserUnvalidated::register``

source: ``uservalidationbyemail_after_registration_url`` changed to ``Elgg\UserValidationByEmail\Response::redirectToEmailSent``
fr: ``uservalidationbyemail_after_registration_url`` changé pour ``Elgg\UserValidationByEmail\Response::redirectToEmailSent``

source: ``uservalidationbyemail_check_manual_login`` changed to ``Elgg\UserValidationByEmail\User::preventLogin``
fr: ``uservalidationbyemail_check_manual_login`` changé pour ``Elgg\UserValidationByEmail\User::preventLogin``

source: ``uservalidationbyemail_disable_new_user`` changed to ``Elgg\UserValidationByEmail\User::disableUserOnRegistration``
fr: ``uservalidationbyemail_disable_new_user`` changé pour ``Elgg\UserValidationByEmail\User::disableUserOnRegistration``

source: ``system_log_archive_cron`` changed to ``Elgg\SystemLog\Cron::rotateLogs``
fr: ``system_log_archive_cron`` changé pour ``Elgg\SystemLog\Cron::rotateLogs``

source: ``system_log_default_logger`` changed to ``Elgg\SystemLog\Logger::log``
fr: ``system_log_default_logger`` changé pour ``Elgg\SystemLog\Logger::log``

source: ``system_log_delete_cron`` changed to ``Elgg\SystemLog\Cron::deleteLogs``
fr: ``system_log_delete_cron`` changé pour ``Elgg\SystemLog\Cron::deleteLogs``

source: ``system_log_listener`` changed to ``Elgg\SystemLog\Logger::listen``
fr: ``system_log_listener`` changé pour ``Elgg\SystemLog\Logger::listen``

source: ``system_log_user_hover_menu`` changed to ``Elgg\SystemLog\Menus\UserHover::register``
fr: ``system_log_user_hover_menu`` changé pour ``Elgg\SystemLog\Menus\UserHover::register``

source: ``thewire_add_original_poster`` changed to ``Elgg\TheWire\Notifications\CreateTheWireEventHandler``
fr: ``thewire_add_original_poster`` changé pour ``Elgg\TheWire\Notifications\CreateTheWireEventHandler``

source: ``thewire_owner_block_menu`` changed to ``Elgg\TheWire\Menus\OwnerBlock::register``
fr: ``thewire_owner_block_menu`` changé pour ``Elgg\TheWire\Menus\OwnerBlock::register``

source: ``thewire_prepare_notification`` changed to ``Elgg\TheWire\Notifications\CreateTheWireEventHandler``
fr: ``thewire_prepare_notification`` changé pour ``Elgg\TheWire\Notifications\CreateTheWireEventHandler``

source: ``thewire_setup_entity_menu_items`` changed to ``Elgg\TheWire\Menus\Entity::register``
fr: ``thewire_setup_entity_menu_items`` changé pour ``Elgg\TheWire\Menus\Entity::register``

source: Reworked exceptions
fr: Exceptions retravaillées

source: All exceptions in the Elgg system now extend the ``Elgg\Exceptions\Exception`` and are in the namespace ``Elgg\Exceptions``
fr: Toutes les exceptions du système Elgg étendent désormais ``Elgg\Exceptions\Exception`` et se trouvent dans l'espace de noms ``Elgg\Exceptions``

source: Moved exceptions
fr: Exceptions déplacées

source: ``ClassException`` use ``Elgg\Exceptions\ClassException``
fr: ``ClassException`` utilisez ``Elgg\Exceptions\ClassException``

source: ``ConfigurationException`` use ``Elgg\Exceptions\ConfigurationException``
fr: ``ConfigurationException`` utilisez ``Elgg\Exceptions\ConfigurationException``

source: ``CronException`` use ``Elgg\Exceptions\CronException``
fr: ``CronException`` utilisez ``Elgg\Exceptions\CronException``

source: ``DatabaseException`` use ``Elgg\Exceptions\DatabaseException``
fr: ``DatabaseException`` utilisez ``Elgg\Exceptions\DatabaseException``

source: ``DataFormatException`` use ``Elgg\Exceptions\DataFormatException``
fr: ``DataFormatException`` utilisez ``Elgg\Exceptions\DataFormatException``

source: ``InstallationException`` use ``Elgg\Exceptions\Configuration\InstallationException``
fr: ``InstallationException`` utilisez ``Elgg\Exceptions\Configuration\InstallationException``

source: ``InvalidParameterException`` use ``Elgg\Exceptions\InvalidParameterException``
fr: ``InvalidParameterException`` utilisez ``Elgg\Exceptions\InvalidParameterException``

source: ``IOException`` use ``Elgg\Exceptions\FileSystem\IOException``
fr: ``IOException`` utilisez ``Elgg\Exceptions\FileSystem\IOException``

source: ``LoginException`` use ``Elgg\Exceptions\LoginException``
fr: ``LoginException`` utilisez ``Elgg\Exceptions\LoginException``

source: ``PluginException`` use ``Elgg\Exceptions\PluginException``
fr: ``PluginException`` utilisez ``Elgg\Exceptions\PluginException``

source: ``RegistrationException`` use ``Elgg\Exceptions\Configuration\RegistrationException``
fr: ``RegistrationException`` utilisez ``Elgg\Exceptions\Configuration\RegistrationException``

source: ``SecurityException`` use ``Elgg\Exceptions\SecurityException``
fr: ``SecurityException`` utilisez ``Elgg\Exceptions\SecurityException``

source: ``Elgg\Database\EntityTable\UserFetchFailureException`` use ``Elgg\Exceptions\Database\UserFetchFailureException``
fr: ``Elgg\Database\EntityTable\UserFetchFailureException`` utilisez ``Elgg\Exceptions\Database\UserFetchFailureException``

source: ``Elgg\Di\FactoryUncallableException`` use ``Elgg\Exceptions\Di\FactoryUncallableException``
fr: ``Elgg\Di\FactoryUncallableException`` utilisez ``Elgg\Exceptions\Di\FactoryUncallableException``

source: ``Elgg\Di\MissingValueException`` use ``Elgg\Exceptions\Di\MissingValueException``
fr: ``Elgg\Di\MissingValueException`` utilisez ``Elgg\Exceptions\Di\MissingValueException``

source: ``Elgg\Http\Exception\AdminGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\AdminGatekeeperException``
fr: ``Elgg\Http\Exception\AdminGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\AdminGatekeeperException``

source: ``Elgg\Http\Exception\AjaxGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\AjaxGatekeeperException``
fr: ``Elgg\Http\Exception\AjaxGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\AjaxGatekeeperException``

source: ``Elgg\Http\Exception\GroupToolGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\GroupToolGatekeeperException``
fr: ``Elgg\Http\Exception\GroupToolGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\GroupToolGatekeeperException``

source: ``Elgg\Http\Exception\LoggedInGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\LoggedInGatekeeperException``
fr: ``Elgg\Http\Exception\LoggedInGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\LoggedInGatekeeperException``

source: ``Elgg\Http\Exception\LoggedOutGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\LoggedOutGatekeeperException``
fr: ``Elgg\Http\Exception\LoggedOutGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\LoggedOutGatekeeperException``

source: ``Elgg\Http\Exception\UpgradeGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\UpgradeGatekeeperException``
fr: ``Elgg\Http\Exception\UpgradeGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\UpgradeGatekeeperException``

source: ``Elgg\I18n\InvalidLocaleException`` use ``Elgg\Exceptions\I18n\InvalidLocaleException``
fr: ``Elgg\I18n\InvalidLocaleException`` utilisez ``Elgg\Exceptions\I18n\InvalidLocaleException``

source: ``Elgg\BadRequestException`` use ``Elgg\Exceptions\Http\BadRequestException``
fr: ``Elgg\BadRequestException`` utilisez ``Elgg\Exceptions\Http\BadRequestException``

source: ``Elgg\CsrfException`` use ``Elgg\Exceptions\Http\CsrfException``
fr: ``Elgg\CsrfException`` utilisez ``Elgg\Exceptions\Http\CsrfException``

source: ``Elgg\EntityNotFoundException`` use ``Elgg\Exceptions\Http\EntityNotFoundException``
fr: ``Elgg\EntityNotFoundException`` utilisez ``Elgg\Exceptions\Http\EntityNotFoundException``

source: ``Elgg\EntityPermissionsException`` use ``Elgg\Exceptions\Http\EntityPermissionsException``
fr: ``Elgg\EntityPermissionsException`` utilisez ``Elgg\Exceptions\Http\EntityPermissionsException``

source: ``Elgg\GatekeeperException`` use ``Elgg\Exceptions\Http\GatekeeperException``
fr: ``Elgg\GatekeeperException`` utilisez ``Elgg\Exceptions\Http\GatekeeperException``

source: ``Elgg\GroupGatekeeperException`` use ``Elgg\Exceptions\Http\Gatekeeper\GroupGatekeeperException``
fr: ``Elgg\GroupGatekeeperException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\GroupGatekeeperException``

source: ``Elgg\HttpException`` use ``Elgg\Exceptions\HttpException``
fr: ``Elgg\HttpException`` utilisez ``Elgg\Exceptions\HttpException``

source: ``Elgg\PageNotFoundException`` use ``Elgg\Exceptions\Http\PageNotFoundException``
fr: ``Elgg\PageNotFoundException`` utilisez ``Elgg\Exceptions\Http\PageNotFoundException``

source: ``Elgg\ValidationException`` use ``Elgg\Exceptions\Http\ValidationException``
fr: ``Elgg\ValidationException`` utilisez ``Elgg\Exceptions\Http\ValidationException``

source: ``Elgg\WalledGardenException`` use ``Elgg\Exceptions\Http\Gatekeeper\WalledGardenException``
fr: ``Elgg\WalledGardenException`` utilisez ``Elgg\Exceptions\Http\Gatekeeper\WalledGardenException``

source: Removed exceptions
fr: Exceptions supprimées

source: ``NotImplementedException`` from the Web Services plugin
fr: ``NotImplementedException`` du plugin Web Services

source: Reworked Traits
fr: Traits retravaillés

source: In order to better organize the Elgg namespace all Traits have been moved to the ``Elgg\Traits`` namespace
fr: Afin de mieux organiser l'espace de noms Elgg, tous les Traits ont été déplacés vers l'espace de noms ``Elgg\Traits``

source: ``Elgg\Cacheable`` moved to ``Elgg\Traits\Cacheable``
fr: ``Elgg\Cacheable`` a été déplacé vers ``Elgg\Traits\Cacheable``

source: ``Elgg\Cli\PluginsHelper`` moved to ``Elgg\Traits\Cli\PluginsHelper``
fr: ``Elgg\Cli\PluginsHelper`` a été déplacé vers ``Elgg\Traits\Cli\PluginsHelper``

source: ``Elgg\Cli\Progressing`` moved to ``Elgg\Traits\Cli\Progressing``
fr: ``Elgg\Cli\Progressing`` a été déplacé vers ``Elgg\Traits\Cli\Progressing``

source: ``Elgg\Database\Seeds\Seeding\GroupHelpers`` moved to ``Elgg\Traits\Seeding\GroupHelpers``
fr: ``Elgg\Database\Seeds\Seeding\GroupHelpers`` a été déplacé vers ``Elgg\Traits\Seeding\GroupHelpers``

source: ``Elgg\Database\Seeds\Seeding\TimeHelpers`` moved to ``Elgg\Traits\Seeding\TimeHelpers``
fr: ``Elgg\Database\Seeds\Seeding\TimeHelpers`` a été déplacé vers ``Elgg\Traits\Seeding\TimeHelpers``

source: ``Elgg\Database\Seeds\Seeding`` moved to ``Elgg\Traits\Seeding``
fr: ``Elgg\Database\Seeds\Seeding`` a été déplacé vers ``Elgg\Traits\Seeding``

source: ``Elgg\Database\LegacyQueryOptionsAdapter`` moved to ``Elgg\Traits\Database\LegacyQueryOptionsAdapter``
fr: ``Elgg\Database\LegacyQueryOptionsAdapter`` a été déplacé vers ``Elgg\Traits\Database\LegacyQueryOptionsAdapter``

source: ``Elgg\Debug\Profilable`` moved to ``Elgg\Traits\Debug\Profilable``
fr: ``Elgg\Debug\Profilable`` a été déplacé vers ``Elgg\Traits\Debug\Profilable``

source: ``Elgg\Di\ServiceFacade`` moved to ``Elgg\Traits\Di\ServiceFacade``
fr: ``Elgg\Di\ServiceFacade`` a été déplacé vers ``Elgg\Traits\Di\ServiceFacade``

source: ``Elgg\Entity\ProfileData`` moved to ``Elgg\Traits\Entity\ProfileData``
fr: ``Elgg\Entity\ProfileData`` a été déplacé vers ``Elgg\Traits\Entity\ProfileData``

source: ``Elgg\Loggable`` moved to ``Elgg\Traits\Loggable``
fr: ``Elgg\Loggable`` a été déplacé vers ``Elgg\Traits\Loggable``

source: ``Elgg\Notifications\EventSerialization`` moved to ``Elgg\Traits\Notifications\EventSerialization``
fr: ``Elgg\Notifications\EventSerialization`` a été déplacé vers ``Elgg\Traits\Notifications\EventSerialization``

source: ``Elgg\TimeUsing`` moved to ``Elgg\Traits\TimeUsing``
fr: ``Elgg\TimeUsing`` a été déplacé vers ``Elgg\Traits\TimeUsing``

source: The defaults for ``ignore_empty_body`` and ``prevent_double_submit`` when using ``elgg_view_form`` have been changed to ``true``.
fr: La valeur par défaut pour ``ignore_empty_body`` et ``prevent_double_submit`` lors de l'utilisation de ``elgg_view_form`` a été changé pour ``true``.

source: The plugin settings forms (``plugins/{$plugin_id}/settings``) no longer receive ``$vars['plugin']`` use ``$vars['entity']``
fr: Les formulaires de paramètres de plugin (``plugins/{$plugin_id}/settings``) ne reçoivent plus ``$vars['plugin']``, utilisez ``$vars['entity']``

source: ``Elgg\Router\Middleware\WalledGarden::isPublicPage()`` can no longer be called statically
fr: ``Elgg\Router\Middleware\WalledGarden::isPublicPage()`` ne peut plus être appelé de manière statique

source: ``Elgg\Cli\PluginsHelper::getDependents()`` is no longer publically available
fr: ``Elgg\Cli\Plugin Helper::get Dependents()`` n'est plus disponible publiquement

source: ``ElggPlugin::getLanguagesPath()`` is no longer publically available
fr: ``ElggPlugin::getLanguagesPath()`` n'est plus disponible publiquement

source: An ``\ElggBatch`` no longer implements the interface ``Elgg\BatchResult`` but still has the same features
fr: Un ``\ElggBatch`` n'implémente plus l'interface ``Elgg\BatchResult`` mais a toujours les mêmes fonctionnalités

source: An ``\ElggEntity`` no longer implements the interface ``Locatable`` but still has the same features
fr: Une ``\ElggEntity`` n'implémente plus l'interface ``Locatable`` mais a toujours les mêmes fonctionnalités

source: An ``\Elgg\Event`` no longer implements the interfaces ``\Elgg\ObjectEvent`` and ``\Elgg\UserEvent`` but still has the same features
fr: Un ``\Elgg\Event`` n'implémente plus les interfaces ``\Elgg\ObjectEvent`` et ``\Elgg\UserEvent`` mais a toujours les mêmes fonctionnalités

source: The view ``output/icon`` no longer uses the ``convert`` view var
fr: La vue ``output/icon`` n'utilise plus la variable de vue ``convert``

source: ``ElggData::save()`` now always returns a ``bool`` as documented. All extending classes have been updated (eg. ``ElggEntity``, ``ElggMetadata``, ``ElggRelationship``, etc.)
fr: ``ElggData::save()`` renvoie désormais toujours un ``bool`` tel que documenté. Toutes les classes d'extension ont été mises à jour (par exemple ``ElggEntity``, ``ElggMetadata``, ``ElggRelationship``, etc.)

source: ``Elgg\Email::getTo()`` now always returns an ``array``
fr: ``Elgg\Email::getTo()`` renvoie désormais toujours un ``array``

source: ``ElggPlugin::activate()`` and ``ElggPlugin::deactivate()`` now can throw an ``Elgg\Exceptions\PluginException`` with more details about the failure
fr: ``ElggPlugin::activate()`` et ``ElggPlugin::deactivate()`` peuvent maintenant lancer une ``Elgg\Exceptions\PluginException`` avec plus d'informations sur l'échec

source: ``\ElggRelationship::RELATIONSHIP_LIMIT`` has been removed use \Elgg\Database\RelationshipsTable::RELATIONSHIP_COLUMN_LENGTH``
fr: ``\ElggRelationship::RELATIONSHIP_LIMIT`` a été supprimé utilisez \Elgg\Database\RelationshipsTable::RELATIONSHIP_COLUMN_LENGTH``

source: The constants ``ORIGIN_SUBSCRIPTIONS`` and ``ORIGIN_INSTANT`` in ``\Elgg\Notifications\Notification`` have been removed
fr: Les constantes ``ORIGIN_SUBSCRIPTIONS`` et ``ORIGIN_INSTANT`` dans ``\Elgg\Notifications\Notification`` ont été supprimées

source: You can no longer use the ``delete, <entity_type>`` event to prevent deletion of an entity. Use the ``delete:before, <entity_type>`` event
fr: Vous ne pouvez plus utiliser l'événement ``delete, <entity_type>`` pour empêcher la suppression d'une entité. Utilisez l'événement ``delete:before, <entity_type>``

source: External Files are no longer ordered by priority but will be returned in the same order as they are registered
fr: Les fichiers externes ne sont plus classés par priorité mais seront retournés dans le même ordre qu'ils sont enregistrés

source: The interface ``Friendable`` has been removed. Implemented functions in ``ElggUser`` have been moved to ``Elgg\Traits\Entity\Friends``
fr: L'interface ``Friendable`` a été supprimée. Les fonctions implémentées dans ``ElggUser`` ont été déplacées vers ``Elgg\Traits\Entity\Friends``

source: The config flag ``profile_using_custom`` is no longer available
fr: Le drapeau de configuration ``profile_using_custom`` n'est plus disponible

source: The return value of ``elgg_create_river_item()`` will be ``false`` in the case the creation was prevented by the ``'create:before', 'river'`` event
fr: La valeur de retour de ``elgg_create_river_item()`` sera ``false`` dans le cas où la création a été empêchée par l'événement ``'create:before', 'river'``

source: The constant ``ELGG_PLUGIN_USER_SETTING_PREFIX`` has been removed use the helper function ``\ElggUser::getNamespacedPluginSettingName()``
fr: La constante ``ELGG_PLUGIN_USER_SETTING_PREFIX`` a été supprimée, utilisez la fonction d'assistance ``\ElggUser::getNamespacedPluginSettingName()``

source: The constant ``ELGG_PLUGIN_INTERNAL_PREFIX`` has been removed to get the plugin priority private setting name use ``\ElggPlugin::PRIORITY_SETTING_NAME``
fr: La constante ``ELGG_PLUGIN_INTERNAL_PREFIX`` a été supprimée, pour obtenir le nom de paramètre privé de priorité du plugin utilisez ``\ElggPlugin::PRIORITY_SETTING_NAME``

source: The class ``SiteNotificationFactory`` was removed use ``SiteNotification::factory()``
fr: La classe ``SiteNotificationFactory`` a été supprimée, utilisez ``SiteNotification::factory()``

source: The class ``Elgg\Email\Address`` no longer throws ``Laminas\Mail\Exception\InvalidArgumentException`` but now throws ``Elgg\Exceptions\InvalidArgumentException``
fr: La classe ``Elgg\Email\Address`` ne lance plus ``Laminas\Mail\Exception\InvalidArgumentException`` mais lance maintenant ``Elgg\Exceptions\InvalidArgumentException``

source: ``ElggPlugin::getUserSetting()`` use ``ElggUser::getPluginSetting()``
fr: ``ElggPlugin::getUserSetting()`` utilisez ``ElggUser::getPluginSetting()``

source: ``ElggPlugin::setUserSetting()`` use ``ElggUser::setPluginSetting()``
fr: ``ElggPlugin::setUserSetting()`` utilisez ``ElggUser::setPluginSetting()``

source: ``forward()`` use ``Elgg\Exceptions\HttpException`` instances or ``elgg_redirect_response()``
fr: ``forward()`` utilisez des instances ``Elgg\Exceptions\HttpException`` ou ``elgg_redirect_response()``

source: Plugin hooks
fr: Hooks plugin

source: ``'usersettings', 'plugin'`` use the hook ``'plugin_setting', '<entity type>'``
fr: ``'usersettings', 'plugin'`` utilisez le hook ``'plugin_setting', '<entity type>'``

source: ``Elgg\Config::getEntityTypes()`` use ``Elgg\Config::ENTITY_TYPES`` constant
fr: ``Elgg\Config::getEntityTypes()`` utilisez la constante ``Elgg\Config::ENTITY_TYPES``

source: ``ElggFile::setDescription()`` use ``$file->description = $new_description``
fr: ``ElggFile::setDescription()`` utilisez ``$file->description = $new_description``

source: ``ElggPlugin::unsetAllUserAndPluginSettings()`` use ``ElggPlugin::unsetAllEntityAndPluginSettings()``
fr: ``ElggPlugin::unsetAllUserAndPluginSettings()`` utilisez ``ElggPlugin::unsetAllEntityAndPluginSettings()``

source: ``ElggWidget::getContext()`` use ``$entity->context``
fr: ``ElggWidget::getContext()`` utilisez ``$entity->context``

source: ``ElggWidget::setContext()`` use ``$entity->context = $context``
fr: ``ElggWidget::setContext()`` utilisez ``$entity->context = $context``

source: ``Elgg\Notifications\NotificationsService::getMethodsAsDeprecatedGlobal()`` use ``elgg_get_notification_methods()``
fr: ``Elgg\Notifications\NotificationsService::getMethodsAsDeprecatedGlobal()`` utilisez ``elgg_get_notification_methods()``

source: ``Elgg\Email::getRecipient()`` use ``Elgg\Email::getTo()``
fr: ``Elgg\Email::getRecipient()`` utilisez ``Elgg\Email::getTo()``

source: ``Elgg\Entity::getLocation()`` use ``$entity->location``
fr: ``Elgg\Entity::getLocation()`` utilisez ``$entity->location``

source: ``Elgg\Entity::setLocation()`` use ``$entity->location = $location``
fr: ``Elgg\Entity::setLocation()`` utilisez ``$entity->location = $location``

source: ``access_get_show_hidden_status()`` use ``elgg()->session->getDisabledEntityVisibility()``
fr: ``access_get_show_hidden_status()`` utilisez ``elgg()->session->getDisabledEntityVisibility()``

source: ``elgg_add_subscription()`` use ``\ElggEntity::addSubscription()``
fr: ``elgg_add_subscription()`` utilisez ``\ElggEntity::addSubscription()``

source: ``elgg_get_available_languages()`` use ``elgg()->translator->getAvailableLanguages()``
fr: ``elgg_get_available_languages()`` utilisez ``elgg()->translator->getAvailableLanguages()``

source: ``elgg_get_entities_from_plugin_user_settings()`` use ``elgg_get_entities()`` with private settings parameters and prefix your setting name with ``plugin:user_setting:``
fr: ``elgg_get_entities_from_plugin_user_settings()`` utilisez ``elgg_get_entities()`` avec les paramètres de configuration privés et préfixez le nom de votre paramètre avec ``plugin:user_setting:``
