Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/appendix.po
Languages: es, fr

source: ``elgg_get_filter_tabs()`` use menu hooks on ``'register', 'menu:filter:<filter_id>'``
fr: ``elgg_get_filter_tabs()`` utilise les hooks de menu sur ``'register', 'menu:filter:<filter_id>'``

source: ``elgg_get_loaded_css()`` use ``elgg_get_loaded_external_files('css', 'head')``
fr: ``elgg_get_loaded_css()`` utilisez ``elgg_get_loaded_external_files('css', 'head')``

source: ``elgg_get_loaded_js()`` use ``elgg_get_loaded_external_files('js', $location)``
fr: ``elgg_get_loaded_js()`` utilisez ``elgg_get_loaded_external_files('js', $location)``

source: ``elgg_get_system_messages()`` use ``elgg()->system_messages->loadRegisters()``
fr: ``elgg_get_system_messages()`` utilisez ``elgg()->system_messages->loadRegisters()``

source: ``elgg_remove_subscription()`` use ``\ElggEntity::removeSubscription()``
fr: ``elgg_remove_subscription()`` utilisez ``\ElggEntity::removeSubscription()``

source: ``elgg_set_plugin_setting()`` use ``$plugin->setSetting($name, $value)``
fr: ``elgg_set_plugin_setting()`` utilisez ``$plugin->setSetting($name, $value)``

source: ``elgg_set_plugin_user_setting()`` use ``ElggUser::setPluginSetting()``
fr: ``elgg_set_plugin_user_setting()`` utilisez ``ElggUser::setPluginSetting()``

source: ``elgg_set_system_messages()`` use ``elgg()->system_messages->saveRegisters()``
fr: ``elgg_set_system_messages()`` utilisez ``elgg()->system_messages->saveRegisters()``

source: ``elgg_unset_plugin_setting()`` use ``$plugin->unsetSetting($name)``
fr: ``elgg_unset_plugin_setting()`` utilisez ``$plugin->unsetSetting($name)``

source: ``elgg_unset_plugin_user_setting()`` use ``ElggUser::removePluginSetting()``
fr: ``elgg_unset_plugin_user_setting()`` utilisez ``ElggUser::removePluginSetting()``

source: ``get_language_completeness()`` use ``elgg()->translator->getLanguageCompleteness()``
fr: ``get_language_completeness()`` utilisez ``elgg()->translator->getLanguageCompleteness()``

source: ``get_installed_translations()`` use ``elgg()->translator->getInstalledTranslations()``
fr: ``get_installed_translations()`` utilisez ``elgg()->translator->getInstalledTranslations()``

source: ``thewire_get_parent()`` use ``\ElggWire::getParent()``
fr: ``thewire_get_parent()`` utilisez ``\ElggWire::getParent()``

source: ``validate_email_address()`` use ``elgg()->accounts->assertValidEmail()``
fr: ``validate_email_address()`` utilisez ``elgg()->accounts->assertValidEmail()``

source: ``validate_password()`` use ``elgg()->accounts->assertValidPassword()``
fr: ``validate_password()`` utilisez ``elgg()->accounts->assertValidPassword()``

source: ``validate_username()`` use ``elgg()->accounts->assertValidUsername()``
fr: ``validate_username()`` utilisez ``elgg()->accounts->assertValidUsername()``

source: Removed views / resources
fr: Vues / ressources supprimées

source: ``messages/js`` moved to ``forms/messages/process.js``
fr: ``messages/js`` a été déplacé vers ``forms/messages/process.js``

source: ``navigation/menu/elements/item_deps`` the functionality has been merged into ``navigation/menu/elements/item``
fr: ``navigation/menu/elements/item_deps`` la fonctionnalité a été fusionnée dans ``navigation/menu/elements/item``

source: ``notifications/personal`` use ``notifications/settings`` or ``notifications/users``
fr: ``notifications/personal`` utilisez ``notifications/settings`` ou ``notifications/users``

source: ``notifications/settings/personal`` moved to ``notifications/settings/records``
fr: ``notifications/settings/personal`` a été déplacé vers ``notifications/settings/records``

source: ``notifications/settings/other`` extend ``notifications/settings/records``
fr: ``notifications/settings/other`` étend ``notifications/settings/records``

source: ``notifications/subscriptions/groups`` use ``forms/notifications/subscriptions/groups``
fr: ``notifications/subscriptions/groups`` utilisez ``forms/notifications/subscriptions/groups``

source: ``notifications/subscriptions/users`` use ``forms/notifications/subscriptions/users``
fr: ``notifications/subscriptions/users`` utilisez ``forms/notifications/subscriptions/users``

source: ``resources/comments/view`` use ``\Elgg\Controllers\CommentEntityRedirector``
fr: ``resources/comments/view`` utilisez ``\Elgg\Controllers\CommentEntityRedirector``

source: ``resources/river`` use ``resources/activity/all`` or ``resources/activity/owner`` or ``resources/activity/friends``
fr: ``resources/river`` utilisez ``resources/activity/all`` ou ``resources/activity/owner`` ou ``resources/activity/friends``

source: Removed hooks / events
fr: Hooks/événements retirés

source: Event ``created, river`` has been removed. Use the ``create:after, river`` event.
fr: L'événement ``created, river`` a été supprimé. Utilisez l'événement ``create:after, river``.

source: Hook ``creating, river`` has been removed. Use the ``create:before, river`` event if you want to block the creation of a river item.
fr: Le hook ``creating, river`` a été supprimé. Utilisez l'événement ``create:before, river`` si vous souhaitez bloquer la création d'un élément river.

source: Hook ``filter_tabs, <context>`` has been removed. Use the ``register, menu:filter:<filter_id>`` hook
fr: Le hook ``filter_tabs, <context>`` a été supprimé. Utilisez le hook ``register, menu:filter:<filter_id>``

source: Hook ``output, ajax`` has been removed. Use the ``ajax_response`` hook if you want to influence the results.
fr: Le hook ``output, ajax`` a été supprimé. Utilisez le hook ``ajax_response`` si vous souhaitez modifier les résultats.

source: Hook ``reportedcontent:add`` has been removed. Use the ``create, object`` event to prevent creation.
fr: Le hook ``reportedcontent:add`` a été supprimé. Utilisez l'événement ``create, object`` pour empêcher la création.

source: Hook ``reportedcontent:archive`` has been removed. Use the ``permissions_check, object`` hook.
fr: Le hook ``reportedcontent:archive`` a été supprimé. Utilisez le hook ``permissions_check, object``.

source: Hook ``reportedcontent:delete`` has been removed. Use the ``delete, object`` event to prevent deletion.
fr: Le hook ``reportedcontent:delete`` a été supprimé. Utilisez l'événement ``delete, object`` pour empêcher la suppression.

source: The action ``reportedcontent/delete`` has been replaced with a generic entity delete action
fr: L'action ``reportedcontent/delete`` a été remplacée par une action de suppression d'entité générique

source: From 4.0 to 4.1
fr: De 4.0 à 4.1

source: Entity Capabilities
fr: Capacités des entités

source: A new way of registering entity capabilities has been introduced. The following related functions have been deprecated:
fr: Une nouvelle façon d'enregistrer les capacités des entités a été introduite. Les fonctions associées suivantes ont été dépréciées :

source: ``elgg_register_entity_type()`` use ``elgg_entity_enable_capability($type, $subtype, 'searchable')``
fr: ``elgg_register_entity_type()`` utilisez ``elgg_entity_enable_capability($type, $subtype, 'searchable')``

source: ``elgg_unregister_entity_type()`` use ``elgg_entity_disable_capability($type, $subtype, 'searchable')``
fr: ``elgg_unregister_entity_type()`` utilisez ``elgg_entity_disable_capability($type, $subtype, 'searchable')``

source: ``get_registered_entity_types()`` use ``elgg_entity_types_with_capability('searchable')``
fr: ``get_registered_entity_types()`` utilisez ``elgg_entity_types_with_capability('searchable')``

source: ``is_registered_entity_type()`` use ``elgg_entity_has_capability($type, $subtype, 'searchable')``
fr: ``is_registered_entity_type()`` utilisez ``elgg_entity_has_capability($type, $subtype, 'searchable')``

source: The config variable ``registered_entities`` is no longer available.
fr: La variable de configuration ``registered_entities`` n'est plus disponible.

source: The current implemented capabilities are 'commentable', 'likable' and 'searchable'.
fr: Les capacités actuellement implémentées sont 'commentable', 'likable' et 'searchable'.

source: Threaded Comments
fr: Commentaires imbriqués

source: Support for threaded comments has been added. This feature needs to be enable in the site settings. To make this work changes have been made to comments related JavaScript and CSS. If you use specific styling or have custom features related to this feature you might need to give it some extra attention.
fr: La prise en charge des commentaires imbriqués a été ajoutée. Cette fonctionnalité doit être activée dans les paramètres du site. Pour faire ce travail, des modifications ont été apportées aux commentaires liés à JavaScript et CSS. Si vous utilisez un style spécifique ou avez des fonctionnalités personnalisées liées à cette fonctionnalité, vous devrez peut-être leur accorder une attention supplémentaire.

source: ``elgg_get_version()`` use ``elgg_get_release()``
fr: ``elgg_get_version()`` utilisez ``elgg_get_release()``

source: ``get_user_by_code()`` use ``elgg_get_user_by_persistent_token()`` where you only need to provide the token, not the hashed token
fr: ``get_user_by_code()`` utilisez ``elgg_get_user_by_persistent_token()`` où vous devez uniquement fournir le jeton, pas le jeton haché

source: ``'likes:is_likable', '<type>:<subtype>'`` use ``$entity->hasCapability('likable')``
fr: ``'likes:is_likable', '<type>:<subtype>'`` utilisez ``$entity->hasCapability('likable')``

source: From 4.1 to 4.2
fr: De 4.1 à 4.2

source: Stash replaced with Phpfastcache
fr: Stash remplacé par Phpfastcache

source: The internal caching library Stash has been replaced with `Phpfastcache <https://www.phpfastcache.com/>`_. Phpfastcache is better maintained, provides more cachedrivers and adds more features to the cache implementation. This change should cause no issues on any existing installation. If you have Memcache or Redis configured in your ``elgg-config/settings.php`` you might need to update your configuration.
fr: La bibliothèque de cache interne Stash a été remplacée par `Phpfastcache <https://www.phpfastcache.com/>`_. Phpfastcache est mieux entretenu, fournit plus de pilotes de cache et ajoute plus de fonctionnalités à l'implémentation du cache. Cette modification ne devrait causer aucun problème sur les installations existantes. Si vous avez configuré Memcache ou Redis dans votre ``elgg-config/settings.php``, vous pourriez avoir besoin de mettre à jour votre configuration.

source: Metadata and Annotation boolean values
fr: Valeurs booléennes des Metadata et des Annotation

source: The database model has been changed to keep boolean values intact between saving and retrieving. Before this change if you saved a boolean value it would be returned as an integer. Now it will remain a boolean.
fr: Le modèle de base de données a été modifié pour conserver les valeurs booléennes intactes entre l'enregistrement et la récupération. Avant ce changement, si vous enregistriez une valeur booléenne, elle était renvoyée sous la forme d'un entier. Désormais elle reste un booléen.

source: If you saved boolean values previously they will still be integers in the database (until saved again).
fr: Si vous avez précédemment enregistré des valeurs booléennes, elles seront sous forme d'entiers dans la base de données (jusqu'à ce qu'elles soient de nouveau enregistrées).

source: System message functions
fr: Fonctions des messages système

source: The functions ``system_message()`` and ``register_error()`` have been replaced by ``elgg_register_success_message()`` and ``elgg_register_error_message()``. The new functions have the ability to pass extra options to the system messages registry.
fr: Le fonctions ``system_message()`` et ``register_error()`` ont été remplacées par ``elgg_register_success_message()`` et ``elgg_register_error_message()``. Les nouvelles fonctions ont la capacité de passer des options supplémentaires au registre des messages système.

source: Javascript functions
fr: Fonctions Javascript

source: The Elgg javascript libraries have gotten a massive overhaul. A lot of functions have been deprecated. You can find all deprecated functions and globals in `views/default/core/js/deprecated.js`.
fr: Les bibliothèques javascript Elgg ont connu une refonte massive. Beaucoup de fonctions ont été dépréciées. Vous pouvez trouver toutes les fonctions obsolètes et globales dans `views/default/core/js/deprecated.js`.

source: System messages
fr: Messages système

source: If you use system messages in your javascript, you now should require the ``elgg/system_messages`` module.
fr: Si vous utilisez les messages système dans votre javascript, vous devriez maintenant requérir le module ``elgg/system_messages``.

source: Security tokens
fr: Jetons de sécurité

source: If you use ``elgg.security.addToken()`` in your javascript, you now should require the ``elgg/security`` module.
fr: Si vous utilisez ``elgg.security.addToken()`` dans votre javascript, vous devriez maintenant requérir le module ``elgg/security``.

source: Translations
fr: Traductions

source: If you use ``elgg.echo()`` in your javascript, you now should require the ``elgg/i18n`` module.
fr: Si vous utilisez ``elgg.echo()`` dans votre javascript, vous devriez maintenant requérir le module ``elgg/i18n``.

source: UI functions
fr: Fonctions UI

source: The user hover menu is no longer initialized from the global ui.js, but requires the javascript on demand from the ``icon/user/default`` view.
fr: Le menu déroulant de l'utilisateur n'est plus initialisé à partir du fichier ui.js global, mais requiert le javascript à la demande à partir de la vue ``icon/user/default``.

source: The javascript equivalent of the ``ElggUser`` and ``ElggEntity`` should no longer be used. The logged in user entity should no longer be referenced in the ``elgg.session.user`` page data. You can find its attributes in ``elgg.user`` as an array.
fr: Les équivalents javascript de ``ElggUser`` et ``ElggEntity`` ne devraient plus être utilisés. L'entité utilisateur connecté ne devrait plus être référencée dans les données de la page ``elgg.session.user``. Vous pouvez trouver ses attributs dans ``elgg.user`` sous forme de tableau.

source: ``output/url`` now has added security features to help prevent malicious user generated output. The view supports ``$vars['allowed_schemes']`` which contains a list of allowed URL schemes. The provided ``$vars['href']`` will be matched against the allowed list. If the URL doesn't have an allowed scheme the URL will be prefixed with ``denied:``.
fr: ``output/url`` a maintenant ajouté des fonctionnalités de sécurité pour aider à bloquer les sorties générées par des utilisateurs malveillants. La vue prend en charge ``$vars['allowed_schemes']`` qui contient une liste des schémas d'URL autorisés. Le ``$vars['href']`` fourni est mis en correspondance avec la liste autorisée. Si l'URL n'a pas de schéma autorisé, l'URL sera préfixée par ``denied:``.

source: This will help to prevent user input like ``javascript:alert('just testing');`` from being presented to the users.
fr: Cela aidera à empêcher que des entrées utilisateur telles que ``javascript:alert('just testing');`` ne soient présentées aux utilisateurs.

source: By default the following schemes are allowed: ``http, https, ftp, sftp, ssh, file``
fr: Par défaut, les schémas suivants sont autorisés : ``http, https, ftp, sftp, ssh, file``

source: If you use the pattern ``elgg_view('output/url', ['text' => 'something', 'href' => 'javascript:void(0);'])`` update your code to set ``href`` to ``false``.
fr: Si vous utilisez le modèle ``elgg_view('output/url', ['text' => 'something', 'href' => 'javascript:void(0);'])`` mettez à jour votre code pour définir `` href`` à ``false``.

source: Groups
fr: Groupes

source: The menu name for the tabs on the group members page has been replaced to use the default filter menu logic. Rewrite your plugin hooks from ``menu:groups_members`` to ``menu:filter:groups/members``. Since this is a different menu the current group entity is now available in the hook parameter ``filter_entity``.
fr: Le nom du menu des onglets de la page des membres du groupe a été remplacé pour utiliser la logique de menu de filtre par défaut. Réécrivez vos hooks de plugin ``menu:groups_members`` en ``menu:filter:groups/members``. Puisqu'il s'agit d'un menu différent, l'entité de groupe actuelle est désormais disponible dans le paramètre de hook ``filter_entity``.

source: ``elgg_view_menu_item()`` use ``elgg_view('navigation/menu/elements/item/url', ['item' => $myMenuItem])``
fr: ``elgg_view_menu_item()`` utilisez ``elgg_view('navigation/menu/elements/item/url', ['item' => $myMenuItem])``

source: ``register_error()`` use ``elgg_register_error_message()``
fr: ``register_error()`` utilisez ``elgg_register_error_message()``

source: ``system_message()`` use ``elgg_register_success_message()``
fr: ``system_message()`` utilisez ``elgg_register_success_message()``

source: From 4.2 to 4.3
fr: De 4.2 à 4.3

source: Deprecation of rel="toggle" and rel="popup"
fr: Dépréciation de rel="toggle" et rel="popup"

source: If you are using ``rel="toggle"`` or ``rel="popup"`` for showing some hidden content you will need to update your code. The correct javascript will automatically be loaded if you draw content using ``output/url`` (directly or indirectly) and pass the class ``elgg-popup`` or ``elgg-toggle``. If you need popup/toggle features on your own elements, you will need to set the correct class and require the correct javascript (``elgg/popup`` or ``elgg/toggle``).
fr: Si vous utilisez ``rel="toggle"`` ou ``rel="popup"`` pour afficher du contenu caché, vous devrez mettre à jour votre code. Le javascript correct sera automatiquement chargé si vous dessinez du contenu en utilisant ``output/url`` (directement ou indirectement) et passez la classe ``elgg-popup`` ou ``elgg-toggle``. Si vous avez besoin de fonctionnalités popup/toggle sur vos propres éléments, vous devrez définir la bonne classe et exiger le bon javascript (``elgg/popup`` ou ``elgg/toggle``).

source: PAM handlers
fr: Gestionnaires PAM

source: PAM handlers, which handle authentication, have been reworked. The registration now uses a DI service instead of a static variable in a class.
fr: Les gestionnaires PAM, qui gèrent l'authentification, ont été retravaillés. L'enregistrement utilise désormais un service DI au lieu d'une variable statique dans une classe.

source: Because of the rework PAM handlers can now also be invokable classes and Elgg core (including the Webservices plugin) is using this. If as a developer you unregistered certain PAM handlers please check the new code.
fr: En raison de la refonte, les gestionnaires PAM peuvent désormais également être des classes invocables et le noyau Elgg (y compris le plugin Webservices) l'utilise. Si, en tant que développeur, vous avez dé-enregistré certains gestionnaires PAM, veuillez vérifier le nouveau code.

source: ``add_entity_relationship()`` use ``\ElggEntity->addRelationship()``
fr: ``add_entity_relationship()`` utilisez ``\ElggEntity->addRelationship()``

source: ``add_translation()`` use ``elgg()->translator->addTranslation()``
fr: ``add_translation()`` utilisez ``elgg()->translator->addTranslation()``

source: ``add_user_to_access_collection()`` use ``\ElggAccessCollection->addMember()``
fr: ``add_user_to_access_collection()`` utilisez ``\ElggAccessCollection->addMember()``

source: ``can_edit_access_collection()`` use ``\ElggAccessCollection->canEdit()``
fr: ``can_edit_access_collection()`` utilisez ``\ElggAccessCollection->canEdit()``

source: ``check_entity_relationship()`` use ``\ElggEntity->hasRelationship()`` or ``\ElggEntity->getRelationship()``
fr: ``check_entity_relationship()`` utilisez ``\ElggEntity->hasRelationship()`` ou ``\ElggEntity->getRelationship()``

source: ``check_rate_limit_exceeded()`` use ``elgg_is_authentication_failure_limit_reached()``
fr: ``check_rate_limit_exceeded()`` utilisez ``elgg_is_authentication_failure_limit_reached()``

source: ``create_access_collection()`` use ``elgg_create_access_collection()``
fr: ``create_access_collection()`` utilisez ``elgg_create_access_collection()``

source: ``current_page_url()`` use ``elgg_get_current_url()``
fr: ``current_page_url()`` utilisez ``elgg_get_current_url()``

source: ``delete_access_collection()`` use ``\ElggAccessCollection->delete()``
fr: ``delete_access_collection()`` utilisez ``\ElggAccessCollection->delete()``

source: ``delete_relationship()`` use ``\ElggRelationship->delete()``
fr: ``delete_relationship()`` utilisez ``\ElggRelationship->delete()``

source: ``elgg_authenticate()`` use ``elgg_pam_authenticate()``
fr: ``elgg_authenticate()`` utilisez ``elgg_pam_authenticate()``

source: ``elgg_delete_metadata_by_id()`` use ``\ElggMetadata->delete()()``
fr: ``elgg_delete_metadata_by_id()`` utilisez ``\ElggMetadata->delete()()``

source: ``elgg_get_loaded_external_files()`` use ``elgg_get_loaded_external_resources()``
fr: ``elgg_get_loaded_external_files()`` utilisez ``elgg_get_loaded_external_resources()``

source: ``elgg_register_external_view()`` use ``elgg_register_ajax_view()`` and ``elgg_register_simplecache_view()``
fr: ``elgg_register_external_view()`` utilisez ``elgg_register_ajax_view()`` et ``elgg_register_simplecache_view()``

source: ``elgg_unregister_external_view()`` use ``elgg_unregister_ajax_view()``
fr: ``elgg_unregister_external_view()`` utilisez ``elgg_unregister_ajax_view()``

source: ``execute_new_password_request()`` use ``elgg_save_new_password()``
fr: ``execute_new_password_request()`` utilisez ``elgg_save_new_password()``

source: ``filter_tags()`` use ``elgg_sanitize_input()``
fr: ``filter_tags()`` utilisez ``elgg_sanitize_input()``

source: ``find_active_users()`` use ``elgg_get_entities()``
fr: ``find_active_users()`` utilisez ``elgg_get_entities()``

source: ``force_user_password_reset()`` use ``\ElggUser->setPassword()``
fr: ``force_user_password_reset()`` utilisez ``\ElggUser->setPassword()``

source: ``generate_invite_code()`` use ``elgg_generate_invite_code()``
fr: ``generate_invite_code()`` utilisez ``elgg_generate_invite_code()``

source: ``generate_random_cleartext_password()`` use ``elgg_generate_password()``
fr: ``generate_random_cleartext_password()`` utilisez ``elgg_generate_password()``

source: ``get_access_array()`` use ``elgg_get_access_array()``
fr: ``get_access_array()`` utilisez ``elgg_get_access_array()``

source: ``get_access_collection()`` use ``elgg_get_access_collection()``
fr: ``get_access_collection()`` utilisez ``elgg_get_access_collection()``

source: ``get_current_language()`` use ``elgg_get_current_language()``
fr: ``get_current_language()`` utilisez ``elgg_get_current_language()``

source: ``get_default_access()`` use ``elgg_get_default_access()``
fr: ``get_default_access()`` utilisez ``elgg_get_default_access()``

source: ``get_entity_relationships()`` use ``elgg_get_relationships()``
fr: ``get_entity_relationships()`` utilisez ``elgg_get_relationships()``

source: ``get_entity_statistics()`` use ``elgg_get_entity_statistics()``
fr: ``get_entity_statistics()`` utilisez ``elgg_get_entity_statistics()``

source: ``get_members_of_access_collection()`` use ``\ElggAccessCollection->getMembers()``
fr: ``get_members_of_access_collection()`` utilisez ``\ElggAccessCollection->getMembers()``

source: ``get_online_users()`` use ``elgg_list_entities()``
fr: ``get_online_users()`` utilisez ``elgg_list_entities()``

source: ``get_readable_access_level()`` use ``elgg_get_readable_access_level()``
fr: ``get_readable_access_level()`` utilisez ``elgg_get_readable_access_level()``

source: ``get_relationship()`` use ``elgg_get_relationship()``
fr: ``get_relationship()`` utilisez ``elgg_get_relationship()``

source: ``get_write_access_array()`` use ``elgg_get_write_access_array()``
fr: ``get_write_access_array()`` utilisez ``elgg_get_write_access_array()``
