Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/contribute.po
Languages: fr

source: Ideally plugins are configured in such a way that they can be unit-tested much like Elgg core. Plugin developers are free to implement their own methods for unit testing, but we encourage everyone to make it as easy as Elgg core:
fr: Idéalement, les plugins sont configurés d'une telle manière qu'ils peuvent faire l'objet de tests unitaires de la même manière que le noyau de Elgg. Les développeurs de plugins sont libres d'implémenter leurs propres méthodes pour les tests unitaires, mais nous encourageons tout le monde à les rendre aussi simple que pour le noyau de Elgg :

source: End-to-end tests
fr: Tests de bout en bout

source: Since Elgg plugins have so much power to override, filter, and modify Elgg's and other plugins' behavior, it's important to be able to run end-to-end tests on a staging server with your final configuration before deploying to production.
fr: Dans la mesure où les plugins de Elgg ont une telle capacité à remplacer, filtrer et modifier Elgg et le comportement d'autres plugins, il est important de pouvoir exécuter des tests de bout en bout sur un serveur de pré-production avec votre configuration finale avant de déployer en production.

source: ToDo: Make it easy to run all Elgg integration and acceptance tests from the admin area given the current plugin configuration. (without worrying about database corruption!)
fr: ToDo : Faciliter l'exécution de tous les tests d'intégration et d'acceptabilité depuis le panneau admin en utilisant la configuration courante du plugin. (sans se soucier de corruption de la base de données !)

source: Briefly, the wins we expect from testing are:
fr: Brièvement, les gains escomptés des tests sont :

source: Increased confidence in the system.
fr: Une confiance accrue dans le système.

source: More freedom to refactor.
fr: Plus de liberté pour remanier le code.

source: Built-in, up-to-date documentation.
fr: Une documentation intégrée et à jour.

source: We love community contributions, but in order to maintain stability we cannot accept outside contributions without first verifying their correctness. By promoting automated testing, the core developers can avoid the hassle of manual verification before accepting patches. It also means that external developers don't have to spend time earning trust with the core team. If a patch comes in and has tests to verify it, then we can be confident it works without worrying about the reputation of the contributor.
fr: Nous adorons les contributions communautaires, mais afin de maintenir la stabilité nous ne pouvons pas accepter de contributions extérieures sans vérifier au préalable leur correction. En promouvant les tests automatisés, les développeurs du noyau peuvent éviter les ennuis d'une vérification manuelle avant d'accepter un patch. Cela signifie également que les développeurs externes n'ont pas à perdre de temps à gagner la confiance de l'équipe du noyau. SI un patch arrive et qu'il dispose de tests pour le vérifier, nous pouvons être confiants dans le fait qu'il fonctionne sans avoir besoin de se soucier de la réputation de l'auteur.

source: Note that these benefits can also extend to the plugins repository. Site owners are encouraged to "test plugins thoroughly" before deploying them on a production site. As of March 2013, this translates to manually verifying all the features that the plugin promises to offer. But Elgg provides a huge number of features, and it's not reasonable to test for *all* of them on *every browser* you want to support on *every device* you want to support. But what if plugin developers could write tests for their plugins and site owners could just run the tests for all installed plugins to verify the functionality is maintained? Then they wouldn't be limited to just picking plugins from "trusted" developers or "stable" releases. They could see that, indeed, nothing broke when they upgraded that critical plugin from 1.3 to 2.5, and push the upgrade to production with confidence.
fr: Notez que ces bénéfices peuvent également s'étendre au dépôt des plugins. Les propriétaires de sites sont encouragés à "tester les plugins minutieusement" avant de les déployer sur un site de production. En mars 2013, ceci signifiait tester manuellement toutes les fonctionnalités que le plugin promet d'offrir. Mais Elgg fournit un grand nombre de fonctionnalités, et il n'est pas raisonnable de tester *chacune* d'entre elles sur *chaque navigateur* que vous voulez supporter et sur *chaque appareil* que vous voulez supporter. Mais que se passerait-il si les développeurs de plugins pouvaient écrire des tests pour leurs plugins, et si les propriétaires de sites pouvaient simplement exécuter ces tests pour tous les plugins installés pour vérifier si la fonctionnalité est bien conservée ? Alors ils ne seraient pas limités à seulement prendre des plugins de développeurs "de confiance" ou des versions "stables". Ils pourraient voir que, en réalité, rien n'a été cassé quand ils ont mis à niveau ce plugin critique depuis la version 1.3 vers la 2.5, et publier la mise à niveau en production en toute confiance.

source: The reason this isn't happening today is because Elgg itself is not easily testable at this level yet. We want to change that.
fr: La raison pour laquelle ce n'est pas le cas actuellement est parce que Elgg lui-même n'est pas encore si facile à tester à ce niveau. Nous voulons changer cela.

source: Strategy
fr: Stratégie

source: We have several guiding principles that we think will be helpful in bringing our vision into reality.
fr: Nous avons quelques principes pour nous guider, dont nous pensons qu'ils seront utiles pour faire de cette vision une réalité.

source: In short, we are advocating:
fr: En bref, nous prônons :

source: Continuous integration -- if GitHub checks aren't happy, we're not happy
fr: Intégration continue -- si les vérifications de Github ne sont pas satisfaisantes, nous ne sommes pas satisfaits

source: Dependency injection -- For creating highly testable, modular code
fr: L'injection des dépendances -- Pour créer un code hautement testable et modulaire

source: BDD -- Tests should verify features and provide documentation, not rehash the Class API
fr: BDD - "Behaviour Driven Development" ou Développement Orienté Comportement -- Les tests devraient vérifier des fonctionnalités et fournir de la documentation, et pas simplement reprendre l'API de la Classe

source: Continuous Integration
fr: Intégration continue

source: We run all of our tests on GitHub Actions so that we can get real time feedback on the correctness of incoming pull requests and development as it progresses. **If the GitHub checks aren't passing, we don't commit to the repo.** This empowers us to merge pull requests in at a rapid pace, so long as they pass the tests. It also allows us to reject pull requests without detailed investigation if they do not pass the tests. We can get past the "does it work or not" question and talk about the things that humans need to talk about: API design, usefulness to the project, whether it belongs in core or a plugin, etc. We want as many features as possible provided by Elgg core to be verified automatically by tests running on GitHub Actions.
fr: Nous exécutons tous nos tests avec les Actions GitHub afin de pouvoir obtenir des commentaires en temps réel sur l'exactitude des demandes de fusion -pull requests- et du développement au fur et à mesure de sa progression. ** Si les vérifications de GitHub ne réussissent pas, nous ne faisons pas de commit dans le dépôt. ** Cela nous permet de fusionner les demandes de fusion à un rythme rapide, tant qu'elles réussissent les tests. Cela nous permet également de rejeter les demandes de fusion sans examen détaillé si elles ne réussissent pas les tests. Nous pouvons dépasser la question "ça marche ou pas" et parler des choses dont les humains ont besoin de parler : la conception d'API, l'utilité pour le projet, si cela appartient au noyau ou à un plugin, etc. Nous voulons qu'autant de fonctionnalités que possible fournies par le noyau de Elgg -Elgg core- puissent être vérifiées automatiquement par des tests exécutés sur GitHub Actions.

source: Dependency Injection
fr: Injection des dépendances

source: In order to maximize testability, **all dependencies need to be explicit**. Global functions, Singletons, and service locators are death for testability because it's impossible to tell what dependencies are hiding under the covers, and it's even harder to mock out those dependencies. Mocking is critical because you want your unit tests to test only one class at a time. Test failures in a TestCase should not result due to brokenness in a dependency; test failures should only indicate brokenness in the class under test. This makes everything much easier to debug. As of March 2013, most of Elgg still assumes and uses global state, and that has made Elgg and Elgg plugins historically very difficult to test. Fortunately we are moving in the opposite direction now, and a lot of work in Elgg 1.9 has gone into refactoring core components to be more dependency injectable. We are already reaping the benefits from that effort.
fr: Afin de maximiser la testabilité, **toutes les dépendances doivent être explicites**. Les fonctions globales, les Singletons, et les localiseurs de service sont mortels pour la testabilité parce qu'il est impossible de dire quelles dépendances se cachent sous le capot, et qu'il est encore plus difficile de modéliser ces dépendances. La capacité de modélisation est critique parce que vous voulez que vos tests unitaires ne testent qu'une seule classe à la fois. Les échecs de test dans un TestCase ne devraient pas aboutir à la rupture d'une dépendance ; les échecs des tests ne devraient indiquer de rupture que dans la classe en train d'être testée. Ceci rend tout plus facile à déboguer. En mars 2013, l'essentiel de Elgg présupposait et utilisait encore l'état global, ce qui a rendu les plugins Elgg et le noyau Elgg historiquement très difficiles à tester. Heureusement, nous avons pris la direction opposée, et beaucoup de travail dans Elgg 1.9 a été consacré à la refactorisation des composants de base pour qu'ils soient plus dépendants et injectables. Nous récoltons déjà les fruits de cet effort.

source: Behavior-Driven Development
fr: Behavior-Driven Development - Développement Orienté Comportement

source: For us this means **we name tests for features rather than methods**. When you test for features, you are encouraged to write fewer, smaller, logical tests. When a test fails, we can know exactly what feature is compromised. Furthermore, when naming your tests for features, the list of tests provides documentation on what features the system supports. Documentation is something that is typically very troublesome to keep up to date, but when documentation and verification are one and the same, it becomes very easy to keep the documentation up to date.
fr: Pour nous ceci signifie que **nous nommons les tests d'après les fonctionnalités plutôt que d'après les méthodes**. Quand vous testez des fonctionnalités, vous êtes encouragés à écrire moins de tests, plus petits, et plus logiques. Quand un test échoue, cela permet de savoir exactement quelle fonctionnalité est compromise. De plus, en nommant vos tests d'après les fonctionnalités, la liste des tests fournit une documentation des fonctionnalités que le système supporte. La documentation est typiquement quelque chose de problématique à conserver à jour, mais quand la documentation et la vérification sont une seule et même chose, il devient très facile de maintenir la documentation à jour.

source: Consider these two test methods:
fr: Considérez ces deux méthodes de test :

source: From just looking at the names, ``testRegister`` tells you that the class under test probably has a method named register. If this test passes, it presumably verifies that it is behaving correctly, but doesn't tell you what correct behavior entails, or what the original author of the test was intending to verify. If that method has multiple correct uses that you need to test for, this terse naming convention also encourages you to write a very long test which tests for all conditions and features of said method. Test failure could be caused by any one of those uses being compromised, and it will take more time to figure out where the true problem lies.
fr: En regardant seulement les noms, ``testRegister`` vous indique que la classe testée a probablement une méthode nommée "register". Si ce test est passé, il vérifie probablement qu'elle se comporte correctement, mais ne vous dit pas ce qui caractérise un comportement correct, ou ce que l'auteur original du test essayait de vérifier. Si cette méthode a plusieurs usages corrects que vous devez tester, cette convention de nommage succincte vous encourage également à écrire un très long test qui teste toutes les conditions et fonctionnalités de ladite méthode. L'échec du test pourrait être causée par la compromission de n'importe laquelle d'entre elles, et cela prendra plus de temps pour savoir où se situe le véritable problème.

source: On the other hand, ``testCanRegisterFilesAsActionHandlers`` tells you that there are these things called "actions" that need to be "handled" and that files can be registered as valid handlers for actions. This introduces newcomers to project terminology and communicates clearly the intent of the test to those already familiar with the terminology.
fr: De l'autre côté, ``testCanRegisterFilesAsActionHandlers`` vous indique qu'il y a ces choses appelées "actions" qui ont besoin d'être "gérées" ("handled"), et que des fichiers peuvent être enregistrés comme des gestionnaires valides pour les actions. Ceci expose mieux aux nouveaux venus la terminologie du projet et communique clairement l'intention du test pour ceux qui sont déjà familiers avec la terminologie.

source: For a good example of what we're looking for, check out ``/tests/phpunit/Elgg/ViewServiceTest.php``
fr: Pour un bon exemple de ce que nous recherchons, regardez ``/tests/phpunit/Elgg/ViewServiceTest.php``
