Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/contribute.po
Languages: fr

source: Where possible, have functions/methods return a single type. Use empty values such as ``array()``, ``""``, or ``0`` to indicate no results.
fr: Autant que possible, ayez des fonctions/méthodes qui renvoient un type unique. Utilisez des valeurs vides telle que ``array()``, ``""``, ou ``0`` pour indiquer l'absence de résultat.

source: Be careful where valid return values (like ``"0"``) could be interpreted as empty.
fr: Faites attention aux cas où des valeurs de retour valides (telles que ``"0"``) pourraient être interprétées comme vides.

source: Functions not throwing an exception on error should return ``false`` upon failure.
fr: Les fonctions qui ne déclenchent pas une exception lors d'une erreur devraient retourner ``false`` lorsqu'elles échouent.

source: Particularly low-level, non-API functions/methods (e.g. entity_row_to_elggstar), which should not fail under normal conditions, should throw instead of returning false.
fr: Les fonctions/méthodes particulièrement bas-niveau et sans API (par ex. entity_row_to_elggstar), qui ne devraient pas échouer dans des conditions normales, devraient renvoyer une exception au lieu de retourner false.

source: Functions returning only boolean should be prefaced with ``is_`` or ``has_`` (eg, ``elgg_is_logged_in()``, ``elgg_has_access_to_entity()``).
fr: Les fonctions qui ne renvoient qu'un booléen devraient être préfixées par ``is_`` ou ``has_`` (par ex., ``elgg_is_logged_in()``, ``elgg_has_access_to_entity()``).

source: Ternary syntax
fr: Syntaxe ternaire

source: Acceptable only for single-line, non-embedded statements.
fr: Acceptable seulement pour des déclarations sur une seule ligne, non imbriquées.

source: Minimize complexity
fr: Minimisez la complexité

source: Minimize nested blocks and distinct execution paths through code. Use `Return Early`__ to reduce nesting levels and cognitive load when reading code.
fr: Minimisez les blocs imbriqués et les chemins d'exécution distincts au sein du code. Faites un `Retour rapide`__ pour réduire les niveaux imbriqués et la charge cognitive lors de la lecture du code.

source: Use comments effectively
fr: Utilisez les commentaires à bon escient

source: Good comments describe the "why." Good code describes the "how." E.g.:
fr: Les bons commentaires décrivent le "pourquoi." Le bon code décrit le "comment." Par ex. :

source: Bad:
fr: Mauvais :

source: Good:
fr: Bon :

source: Always include a comment if it's not obvious that something must be done in a certain way. Other developers looking at the code should be discouraged from refactoring in a way that would break the code.
fr: Ajoutez toujours un commentaire s'il n'est pas évident que quelque chose doit être fait d'une certaine manière. D'autres développeurs qui regardent le code devraient être découragés de réorganiser le code d'une manière qui le casserait.

source: Commit effectively
fr: Commitez de manière efficace

source: Err on the side of `atomic commits`__ which are highly focused on changing one aspect of the system.
fr: Péchez par excès de `commits atomiques`__ qui sont précisément ciblés sur la modification d'un seul aspect du système.

source: Avoid mixing in unrelated changes or extensive whitespace changes. Commits with many changes are scary and make pull requests difficult to review.
fr: Évitez de mélanger des modifications qui ne sont pas liées ou des modifications importantes des espaces. Les commits avec de nombreux changements sont effrayants et rendent les demandes de fusion - Pull Requests - difficiles à évaluer.

source: Use visual git tools to craft `highly precise and readable diffs`__.
fr: Utilisez des outils git visuels pour façonner `des diffs extrêmement précis et lisibles`__.

source: Include tests
fr: Incluez des tests

source: When at all possible :ref:`include unit tests <contribute/code#testing>` for code you add or alter.
fr: A chaque fois que c'est possible, :ref:`incluez des tests unitaires <contribute/code#testing>` pour le code que vous ajoutez ou modifiez.

source: Keep bugfixes simple
fr: Conservez des corrections simples des bugs

source: Avoid the temptation to refactor code for a bugfix release. Doing so tends to introduce regressions, breaking functionality in what should be a stable release.
fr: Évitez la tentation de refactoriser le code pour la publication d'une correction de bug. Faire cela a tendance à introduire des régressions, à casser la fonctionnalité dans ce qui devrait être une version stable.

source: PHP guidelines
fr: Recommandations PHP

source: These are the required coding standards for Elgg core and all bundled plugins. Plugin developers are strongly encouraged to adopt these standards.
fr: Voici les standards de développement requis pour le noyau de Elgg et pour tous les plugins inclus. Les développeurs de plugins sont fortement encouragés à adopter ces standards.

source: Developers should first read the `PSR-2 Coding Standard Guide`__.
fr: Les développeurs devraient lire en premier le `Guide des Standards de Développement PSR-2`__.

source: Elgg's standards extend PSR-2, but differ in the following ways:
fr: Les standards de Elgg étendent PSR-2, mais diffèrent des manières suivantes :

source: Indent using one tab character, not spaces.
fr: Indentez en utilisant le caractère tabulation, pas des espaces.

source: Opening braces for classes, methods, and functions must go on the same line.
fr: Les parenthèses ouvrantes pour les classes, méthodes, et fonctions doivent être sur la même ligne.

source: If a line reaches over 100 characters, consider refactoring (e.g. introduce variables).
fr: Si une ligne dépasse 100 caractères, envisagez de la remanier (par ex. en introduisant des variables).

source: Compliance with `PSR-1`__ is encouraged, but not strictly required.
fr: La compatibilité avec `PSR-1`__ est encouragée, mais pas strictement requise.

source: Include PHPDoc comments on functions and classes (all methods; declared properties when appropriate), including types and descriptions of all parameters.
fr: Incluez des commentaires PHPDoc sur les fonctions et les classes (toutes les méthodes ; et les propriétés déclarées quand c'est approprié), y compris les types et descriptions de tous les paramètres.

source: In lists of ``@param`` declarations, the beginnings of variable names and descriptions must line up.
fr: Dans les listes de déclarations ``@param``, le début des noms de variables et des descriptions doivent être alignés.

source: Annotate classes, methods, properties, and functions with ``@internal`` unless they are intended for public use, are already of limited visibility, or are within a class already marked as ``@internal``.
fr: Annotez les classes, les méthodes, les propriétés et les fonctions avec ``@internal`` à moins qu’elles ne soient destinées au public, qu’elles ne soient déjà d’une visibilité limitée ou qu’elles ne soient dans une classe déjà marquée comme ``@internal``.

source: Use ``//`` or ``/* */`` when commenting.
fr: Utilisez ``//`` ou ``/* */`` pour les commentaires.

source: Use only ``//`` comments inside function/method bodies.
fr: Utilisez seulement les commentaires ``//`` à l'intérieur du corps des fonctions et méthodes.

source: Naming
fr: Règles de nommage

source: Use underscores to separate words in the names of functions, variables, and properties. Method names are camelCase.
fr: Utilisez des traits de soulignements - "underscores" - pour séparer les mots dans les noms de fonctions, de variables, et les propriétés. Les noms de méthodes utilisent la syntaxe camelCase.

source: Names of functions for public use must begin with ``elgg_``.
fr: Les noms de fonctions pour un usage public doivent commencer par ``elgg_``.

source: All other function names must begin with ``_elgg_``.
fr: Tous les autres noms de fonctions doivent commencer par ``_elgg_``.

source: Name globals and constants in ``ALL_CAPS`` (``ACCESS_PUBLIC``, ``$CONFIG``).
fr: Nommez les globales et les constantes en ``MAJUSCULE`` (``ACCESS_PUBLIC``, ``$CONFIG``).

source: Miscellaneous
fr: Divers

source: For PHP requirements, see ``composer.json``.
fr: Pour les pré-requis PHP, voyez ``composer.json``.

source: Do not use PHP shortcut tags ``<?`` or ``<%``. It is OK to use ``<?=`` since it is always enabled as of PHP 5.4.
fr: N'utilisez pas les balises PHP raccourcies ``<?`` ou ``<%``. Il est possible d'utiliser ``<?=`` dans la mesure où cela est toujours activé à partir de PHP 5.4.

source: When creating strings with variables:
fr: Quand vous créez des chaînes de caractères avec des variables :

source: use double-quoted strings
fr: utilisez des chaînes de caractères avec des guillemets doubles

source: wrap variables with braces only when necessary.
fr: encadrez les variables avec des accolades seulement quand c'est nécessaire.

source: Bad (hard to read, misuse of quotes and {}s):
fr: Mauvais (difficile à lire, mauvais usage des guillemets et des {}):

source: Remove trailing whitespace at the end of lines.
fr: Retirez les espaces vides à la fin des lignes.

source: Value validation
fr: Validation de la valeur

source: When working with user input prepare the input outside of the validation method.
fr: Quand vous travaillez avec des saisies utilisateur, préparez les saisies en dehors de la méthode de validation.

source: Use exceptions
fr: Utilisez les exceptions

source: Do not be afraid to use exceptions. They are easier to deal with than mixed function output:
fr: N'ayez pas peur d'utiliser les exceptions. Elles sont plus faciles à gérer que des sorties de fonction mixtes :

source: Documenting return values
fr: Documentez les valeurs de retour

source: Do not use ``@return void`` on methods that return a value or null.
fr: N'utilisez pas ``@return void`` sur des méthodes qui renvoient une valeur ou null.

source: CSS guidelines
fr: Recommandations CSS

source: Save the css in files with a ``.css`` extension.
fr: Enregistrez le CSS dans des fichiers avec une extension ``.css``.

source: Use shorthand where possible
fr: Utilisez des abréviations quand c'est possible

source: Use hyphens, not underscores
fr: Utilisez les traits d'union "-", pas les tirets de soulignement ou underscores "_"

source: You should prefix your ids and classnames with text that identifies your plugin.
fr: Vous devriez préfixer vos identifiants et noms de classe avec un texte qui identifie votre plugin.

source: One property per line
fr: Une propriété par ligne

source: Property declarations
fr: Déclarations de propriété

source: These should be spaced like so: ``property: value;``
fr: Celles-ci devraient être espacées comme ceci : ``propriété: valeur;``

source: Vendor prefixes
fr: Préfixes fournisseurs - vendor

source: Group vendor-prefixes for the same property together
fr: Regroupez les préfixes fournisseurs pour la même propriété

source: Longest vendor-prefixed version first
fr: La version la plus longue des préfixes fournisseurs en premier

source: Always include non-vendor-prefixed version
fr: Incluez toujours la version sans préfixe fournisseur

source: Put an extra newline between vendor-prefixed groups and other properties
fr: Ajoutez une ligne supplémentaire entre les groupes avec préfixes fournisseurs et les autres propriétés

source: Group subproperties
fr: Regroupez les sous-propriétés

source: Javascript guidelines
fr: Recommandations JavaScript

source: Same formatting standards as PHP apply.
fr: Les mêmes standards de formatage que PHP s'appliquent.

source: All functions should be in the ``elgg`` namespace.
fr: Toutes les fonctions devraient être dans l'espace de nom -namespace- ``elgg``.

source: Function expressions should end with a semi-colon.
fr: Les expressions d'une fonction devraient se terminer par un point-virgule.

source: Deprecating APIs
fr: APIs obsolètes

source: Occasionally functions and classes must be deprecated in favor of newer replacements. Since 3rd party plugin authors rely on a consistent API, backward compatibility must be maintained, but will not be maintained indefinitely as plugin authors are expected to properly update their plugins. In order to maintain backward compatibility, deprecated APIs will follow these guidelines:
fr: De temps en temps, des fonctions et des classes doivent être dépréciées au profit de nouveaux remplacements. Dans la mesure où les auteurs de plugins tierce-partie s'appuient sur une API cohérente, la compatibilité ascendante doit être maintenue, mais ne sera pas maintenue indéfiniment dans la mesure où les auteurs de plugins sont supposés mettre à jour leurs plugins. Afin de maintenir la compatibilité ascendante, les API obsolètes vont suivre les recommandations suivantes :

source: Minor version (1.x) that deprecates an API must include a wrapper function/class (or otherwise appropriate means) to maintain backward compatibility, including any bugs in the original function/class. This compatibility layer uses ``elgg_deprecated_notice('...', '1.11')`` to log that the function is deprecated.
fr: Les versions mineures (1.x) qui déprécient une API doivent inclure une fonction/classe d'emballage "wrapper" (ou tout autre moyen approprié) qui maintient la compatibilité ascendante, y compris tout bug de la fonction/classe originelle. Cette couche de compatibilité utilise ``elgg_deprecated_notice('...', '1.11')`` pour journaliser le fait que cette fonction est obsolète.

source: The next major revision (2.0) removes the compatibility layer. Any use of the deprecated API should be corrected before this.
fr: La révision majeure suivante (2.0) supprime la couche de compatibilité. Toute utilisation de l'API obsolète devrait être corrigé auparavant.

source: Core tasks
fr: Tâches principales

source: Certain tasks surrounding Elgg are reserved for the core developer as they require special permissions. The guides below show the workflow for these actions.
fr: Certaines tâches autour de Elgg sont réservées à l'équipe des développeurs du noyau dans la mesure où elles demandent certaines permissions spéciales. Les guides ci-dessous décrivent le processus pour ces actions.

source: Moving a plugin to its own repository
fr: Déplacer un plugin vers son propre dépôt

source: Plugin extraction steps
fr: Étapes d'extraction d'un plugin

source: Move the code to its own repository
fr: Déplacez le code vers son propre dépôt

source: Follow the GitHub guide `Splitting a subfolder out into a new repository`_. This will make sure that the commit history is preserved.
fr: Suivez le guide Github pour transformer un sous-dossier en un nouveau dépôt `Splitting a subfolder out into a new repository`_. Ceci va faire en sorte que l'historique des commits soit préservé.

source: Dependencies
fr: Dépendances

source: If the plugin has dependencies on any external libraries, make sure these dependencies are managed. For example if a PHP library is required which comes bundled with Elgg core, make sure to add it to the ``composer.json`` of this plugin as you can't rely on Elgg core keeping the library.
fr: Si le plugin a des dépendances sur des bibliothèques externes, assurez-vous que ces dépendances soient gérées. Par exemple, si une bibliothèque PHP est requise qui est livrée incluse avec le noyau de Elgg, assurez-vous de l'ajouter dans le fichier ``composer.json`` de ce plugin dans la mesure où vous ne pouvez pas vous compter sur le fait que le noyau de Elgg conserve cette bibliothèque.

source: Commit the code
fr: Commitez le code

source: During the GitHub guide a new repository is created for the plugin you're trying to move.
fr: Durant ce guide GitHub un nouveau dépôt est créé pour le plugin que vous essayez de déplacer.

source: Since an attemp was already made to extract some of the plugins to their own repository maybe the repository already exists.
fr: Dans la mesure où une tentative a déjà été faite pour extraire certains des plugins vers leur propre dépôt il se peut que le dépôt existe déjà.

source: If the repository didn't exist for the plugin, make sure you create it under the `Elgg organisation`_.
fr: Si le dépôt n'existait pas pour le plugin, assurez-vous que vous le créez dans l' `organisation Elgg`_.

source: If the repository already exists, the best way to update the code would be by a Pull Request. This will however probably fail because of a difference in how the repository was first created (as discussed in this `GitHub issue`_).
fr: Si le dépôt existe déjà, le meilleur moyen de mettre à jour le code serait de faire une Pull Request. Ceci risque cependant probablement d'échouer à cause d'une différence dans la manière dont le dépôt a été initialement créé (comme discuté dans `Problème avec GitHub`_).

source: The initial repositories where created with
fr: Les dépôts initiaux ont été créés avec

source: and the guide calls for
fr: et le guide appelle

source: This will leave a difference in the commits which GitHub is unable to resolve. In that case you'll have to force push the changes to the existing Elgg plugin repository.
fr: Ceci va laisser une différence dans les commits que Github est incapable de résoudre. Dans ce cas vous devrez forcer un push des modifications vers le dépôt du plugin Elgg existant.

source: Since this will override all the history in the plugin repository, make sure you know this is what you want to do.
fr: Dans la mesure où cela va réécrire tout l'historique du dépôt du plugin, assurez-vous que vous savez que c'est bien ce que vous voulez faire.

source: Make sure the ``composer.json`` of the plugin contains all the relevant information. Here is an example:
fr: Assurez-vous que le ``composer.json`` du plugin contient bien toutes les informations pertinentes. Voici un exemple :

source: The ``conflict`` rule is there to help prevent the installation of this plugin in an unsupported Elgg version.
fr: La règle ``conflict`` est ici pour aider à éviter l'installation de ce plugin dans une version de Elgg non supportée.

source: Add the repository to `Packagist`_, for the existing repositories this was already done. Make sure `Packagist`_ is updated correctly with all the commits.
fr: Ajoutez le dépôt à `Packagist`_, pour les dépôts existants ceci a déjà été fait. Assurez-vous que `Packagist`_ est mis à jour correctement avec tous les commits.

source: Tag a release
fr: Taguer une release

source: In order for Composer to be able to cache the plugin for faster installation, a release has to be made on the repository. Probably the first version that needs to be tagged is the same version as mentioned in the ``elgg-plugin.php`` or ``composer.json``. After this development can begin, following the `Semver`_ versioning scheme.
fr: Pour que Composer puisse mettre en cache le plugin pour une installation plus rapide, une version doit être publiée dans le repository. La première version qui doit être taguée est probablement la même version que celle mentionnée dans ``elgg-plugin.php`` ou ``composer.json``. Après cela le développement peut commencer, en suivant le schéma de version `Semver`_.

source: Translations
fr: Traductions

source: If the translations for the plugin need to be managed by `Transifex`_, add the plugin to `Transifex`_.
fr: Si les traductions pour le plugin doivent être gérées par `Transifex`_, ajoutez le plugin à `Transifex`_.

source: Elgg core cleanup
fr: Nettoyage du noyau de Elgg

source: Now that the plugin has been moved to it's own repository, it's time to make a Pull Request on Elgg core to remove the original code.
fr: Maintenant que le plugin a été déplacé dans son propre dépôt, il est temps de faire une Pull Request sur le noyau de Elgg pour supprimer le code originel.

source: Remove the plugin
fr: Supprimez le plugin

source: Delete the ``mod`` folder for the plugin
fr: Supprimez le plugin du dossier ``mod``

source: Search for the plugin name in core to find any references which also need to be removed (eg. old docs, special tests, etc.)
fr: Recherchez le nom du plugin dans le noyau pour trouver toute référence qui aurait également besoin d'être retirée (par ex. anciennes documentations, tests spéciaux, etc.)

source: Since the plugin no longer is part of Elgg core, make sure the configuration of `Transifex`_ no longer contains the plugin.
fr: Dans la mesure où le plugin ne fait plus partie du noyau de Elgg, assurez-vous que la configuration de `Transifex`_ ne contient plus le plugin.

source: Bundled
fr: Plugins inclus

source: If the plugin still comes bundled with the release of a new Elgg version, make sure to add the plugin to the ``composer.json``.
fr: Si le plugin est toujours distribué inclus avec la publication d'une nouvelle version de Elgg, assurez-vous d'ajouter le plugin dans ``composer.json``.

source: Check the core composer dependencies if requirements that were specific for the removed plugin can also be removed in the core dependencies.
fr: Vérifiez les dépendances composer du noyau pour identifier si des exigences qui étaient spécifiques pour le plugin retiré peuvent également être retirées des dépendances du noyau.

source: Add a mention in the :doc:`/appendix/upgrade-notes` documentation that the plugin was removed from Elgg core.
fr: Ajoutez une mention dans la documentation :doc:`/appendix/upgrade-notes` qui indique que le plugin a été retiré du noyau de Elgg.

source: Release Process Workflow
fr: Processus de publication d'une nouvealle version - release

source: Release a new version of Elgg.
fr: Publier une nouvelle version de Elgg.

source: This is the process the core team follows for making a new Elgg release. We have published this information in the spirit of openness, and to streamline onboarding of new team members.
fr: Voici le processus suivi par l'équipe du noyau pour publier une nouvelle version de Elgg. Nous publions cette information dans un esprit d'ouverture, et pour faciliter l'intégration de nouveaux membres de l'équipe.

source: Requirements
fr: Pré-requis

source: SSH access to elgg.org
fr: Accès SSH à elgg.org

source: Commit access to http://github.com/Elgg/Elgg
fr: Accès aux commits sur http://github.com/Elgg/Elgg

source: Admin access to https://elgg.org/
fr: Accès admin à https://elgg.org/

source: Access to `Twitter account`_
fr: Accès au `compte Twitter`_

source: Node.js and Yarn installed
fr: Node.js et Yarn installés

source: Sphinx installed (``easy_install sphinx && easy_install sphinx-intl``)
fr: Sphinx installé (``easy_install sphinx && easy_install sphinx-intl``)

source: Transifex client installed (``easy_install transifex-client``)
fr: Client Transifex installé (``easy_install transifex-client``)

source: Transifex account with access to Elgg project
fr: Compte Transifex avec accès au projet Elgg

source: Merge commits up from lower branches
fr: Fusionnez les commits à partir des branches les plus basses

source: Determine the LTS branch. We need to merge any new commits there up through the other branches.
fr: Déterminez la branche LTS. Nous devons fusionner tous les nouveaux commits jusqu'ici en passant par les autres branches.

source: For each branch
fr: Pour chaque branche

source: Check out the branch, make sure it's up to date, and make a new work branch with the merge. E.g. here we're merging 1.12 commits into 2.0:
fr: Vérifiez la branche, assurez-vous qu'elle est à jour, et créez une nouvelle branche de travail avec la fusion. Par ex. ici nous fusionnons les commits de la 1.12 dans la 2.0 :

source: If already up-to-date (no commits to merge), we can stop here for this branch.
fr: Si elle est déjà à jour (aucun commit à fusionner), nous pouvons nous arrêter ici pour cette branche.

source: If there are conflicts, resolve them, ``git add .``, and ``git merge``.
fr: S'il y a des conflits, résolvez-les, ``git add .``, et ``git merge``.
