Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/contribute.po
Languages: fr

source: Make a PR for the branch and wait for automated tests and approval by other dev(s).
fr: Faites un PR pour la branche et attendez le résultat des tests automatiques et l'approbation par un autre développeur (ou plusieurs).

source: Once merged, we would repeat the process to merge 2.0 commits into 2.1.
fr: Une fois la fusion effectuée, nous répéterions le processus pour fusionner les commits de la 2.0 dans la 2.1.

source: Preparation for first new stable minor/major release
fr: Préparation pour la première nouvelle version stable mineure/majeure

source: Update the :doc:`/appendix/support` to include the new minor/major release date and fill in the blanks for the previous release.
fr: Mettez à jour :doc:`/appendix/support` pour inclure la date de la nouvelle date de version mineure/majeure et complétez les vides de la version précédente.

source: Update the README.md file badges to point to the correct new release numbers.
fr: Mettez à jour les badges du fichier README.md pour indiquer les nouveaux numéros de version corrects.

source: Preparation for a new major release
fr: Préparation pour une nouvelle version majeure

source: Change the Transifex configuration to push translations to a different project
fr: Modifiez la configuration Transifex pour pousser les traductions vers un autre projet

source: Prepare the release
fr: Préparez la publication

source: Make a PR with translation updates
fr: Faites un PR avec les mises à jour des traductions

source: Install the prerequisites:
fr: Installez les pré-requis :

source: On Windows you need to run these command in a console with admin privileges
fr: Sur Windows, vous devrez exécuter ces commandes dans une console avec des privilèges admin

source: Run the ``languages.php`` script. For example, to pull translations:
fr: Exécutez le script ``languages.php``. Par exemple, pour extraire les traductions :

source: Make a pull request with the new translations and have it merged before the next step.
fr: Faites une demande de fusion -PR- avec les nouvelles traductions et faites-la fusionner avant l’étape suivante.

source: Next, manually browse to the ``/admin/site_settings`` page and verify it loads. If it does not, a language file from Transifex may have a PHP syntax error. Fix the error and amend your commit with the new file:
fr: Ensuite, accédez manuellement à la page ``/admin/site_settings`` et vérifiez qu’elle se charge. Si ce n’est pas le cas, un fichier de langue de Transifex peut avoir une erreur de syntaxe PHP. Corrigez l’erreur et modifiez votre commit avec le nouveau fichier :

source: Make the release PR
fr: Faites le PR de la version

source: Bring your local git clone up to date.
fr: Mettez à jour votre clone git local.

source: Merge latest commits up from lowest supported branch.
fr: Fusionnez les derniers commits vers le haut en commençant par la branche supportée la plus basse.

source: Visit ``https://github.com/Elgg/Elgg/compare/<new>...<old>`` and submit the PR if there is anything that needs to be merged up.
fr: Visitez ``https://github.com/Elgg/Elgg/compare/<new>...<old>`` et soumettez le PR si quoi que ce soit a besoin d'être fusionné plus haut.

source: Run the ``release.php`` script. For example, to release 1.12.5:
fr: Exécutez le script ``release.php``. Par exemple, pour publier 1.12.5 :

source: This creates a ``release-1.12.5`` branch in your local repo.
fr: Ceci crée une branche ``release-1.12.5`` dans votre repo local.

source: Next, submit a pull request via GitHub for automated testing and approval by another developer:
fr: Ensuite, soumettez une demande de fusion -PR- via GitHub pour les tests automatisés et l’approbation par un autre développeur :

source: Tag the release
fr: Taguez la release

source: Once approved and merged, tag the release:
fr: Une fois approuvée et fusionnée, taguez la release :

source: Or create a release on GitHub
fr: Ou créez une release sur Github

source: Goto releases
fr: Allez sur les releases

source: Click 'Draft a new release'
fr: Cliquez sur 'Draft a new release'

source: Enter the version
fr: Saisissez la version

source: Select the correct branch (eg 1.12 for a 1.12.x release, 2.3 for a 2.3.x release, etc)
fr: Sélectionnez la bonne branche (par ex. 1.12 pour une release 1.12.x, 2.3 pour une release 2.3.x, etc.)

source: Set the release title as 'Elgg {version}'
fr: Définissez le titre de la release comme 'Elgg {version}'

source: Paste the CHANGELOG.md part related to this release in the description
fr: Collez la partie de CHANGELOG.md relative à cette release dans la description

source: Some final administration
fr: Un peu d'administration pour terminer

source: Mark GitHub release milestones as completed
fr: Marquez les jalons de release Github comme terminés

source: Move unresolved tickets in released milestones to later milestones
fr: Déplacez les tickets non résolus des jalons publiés vers des jalons ultérieurs

source: Additional actions for the first new minor / major
fr: Actions supplémentaires pour la première nouvelle mineure / majeure

source: Make a new branch on GitHub (for example 3.3)
fr: Créez une nouvelle branche sur GitHub (par exemple 3.3)

source: Set the new branch as the default branch (optional, but suggested for stable releases)
fr: Définissez la nouvelle branche comme branche par défaut (facultatif, mais suggéré pour les versions stables)

source: Configure Read The Docs to build the new branch (not the new tag)
fr: Configurez Read The Docs pour construire la nouvelle branche (et non la nouvelle balise)

source: Check the Elgg starter project for potential requirement / config changes in the ``composer.json``
fr: Vérifiez le projet de démarrage Elgg pour les pré-requis potentiels / modifications de configuration dans le ``composer.json``

source: Add the new minor / major version to the ``Elgg/community_plugins`` repository so developers can upload plugins for the new release
fr: Ajoutez la nouvelle version mineure/majeure au référentiel ``Elgg/community_plugins`` afin que les développeurs puissent télécharger des plugins pour la nouvelle version

source: Additional action for the first new major
fr: Action supplémentaire pour la première nouvelle majeure

source: On GitHub add a branch protection rule (for example ``4.*``)
fr: Sur GitHub ajoutez une règle de protection de branche (par exemple ``4.*``)

source: Configure Scrutinizer to track the new major branches (for example ``4.*``)
fr: Configurez Scrutinizer pour suivre les nouvelles branches principales (par exemple ``4.*``)

source: Update the website
fr: Mettez à jour le site web

source: ssh to elgg.org
fr: ssh vers elgg.org

source: Clone https://github.com/Elgg/elgg-scripts
fr: Clonez https://github.com/Elgg/elgg-scripts

source: Build zip package
fr: Construisez le package zip

source: Use ``elgg-scripts/build/elgg-starter-project.sh`` to generate the .zip file. Run without arguments to see usage.
fr: Utilisez ``elgg-scripts/build/elgg-starter-project.sh`` pour générer le fichier .zip. Exécutez sans argument pour voir son utilisation.

source: For Elgg 2.x releases use the ``2.x`` branch of the starter-project (eg. ``./elgg-starter-project.sh 2.x 2.0.4 /var/www/www.elgg.org/download/``)
fr: Pour les releases Elgg 2.x utilisez la branche ``2.x`` du starter-project (par ex. ``./elgg-starter-project.sh 2.x 2.0.4 /var/www/www.elgg.org/download/``)

source: Verify that ``vendor/elgg/elgg/composer.json`` in the zip file has the expected version.
fr: Vérifiez que ``vendor/elgg/elgg/composer.json`` dans le fichier zip a bien la version attendue.

source: If not, make sure GitHub has the release tag, and that the starter project has a compatible ``elgg/elgg`` item in the composer requires list.
fr: Si ce n'est pas le cas, assurez-vous que GitHub a bien le tag de release, et que le projet de démarrage a un élément compatible ``elgg/elgg`` dans la liste "requires" de composer.

source: Update elgg.org download page
fr: Mettez à jour la page de téléchargement de elgg.org

source: Clone https://github.com/Elgg/community
fr: Clonez https://github.com/Elgg/community

source: Add the new version to ``classes/Elgg/Releases.php``
fr: Ajoutez la nouvelle version dans ``classes/Elgg/Releases.php``

source: Commit and push the changes
fr: Commitez et poussez les modifications

source: Update the plugin on www.elgg.org
fr: Mettez à jour le plugin sur www.elgg.org

source: Update elgg.org
fr: Mettez à jour elgg.org

source: Clone https://github.com/Elgg/www.elgg.org
fr: Clonez https://github.com/Elgg/www.elgg.org

source: Change the required Elgg version in ``composer.json``
fr: Modifiez la version de Elgg requise dans ``composer.json``

source: Update vendors
fr: Mettez à jours les vendors

source: Pull to live site
fr: Faites un pull vers le site en activité

source: Update dependencies
fr: Mettez à jour les dépendances

source: Go to community admin panel
fr: Allez sur la panneau admin de la communauté

source: Flush APC cache
fr: Videz le cache APC

source: Run upgrade
fr: Exécutez la mise à niveau

source: Make the announcement
fr: Faites l'annonce

source: This should be the very last thing you do.
fr: Ceci devrait être la toute dernière chose à faire.

source: Open ``https://github.com/Elgg/Elgg/blob/<tag>/CHANGELOG.md`` and copy the contents for that version
fr: Ouvrez ``https://github.com/Elgg/Elgg/blob/<tag>/CHANGELOG.md`` et copiez le contenu pour cette version

source: Sign in at https://elgg.org/blog and compose a new blog with a summary
fr: Connectez-vous sur https://elgg.org/blog et rédigez un nouvel article de blog avec un sommaire

source: Copy in the CHANGELOG contents, clear formatting, and manually remove the SVG anchors
fr: Copiez le contenu dans le CHANGELOG, supprimez le formattage, et supprimez manuellement les balises SVG

source: Add tags ``release`` and ``elgg2.x`` where x is whatever branch is being released
fr: Ajoutez les tags ``release`` et ``elgg2.x`` où x est le nom de la branche en train d'être publiée

source: Tweet from the elgg `Twitter account`_
fr: Tweetez depuis le `compte Twitter account`_ de Elgg

source: Database
fr: Base de données

source: Contributing database schema changes
fr: Contribuer aux modifications du schéma de la base de données

source: Database Migrations
fr: Migrations de la base de données

source: Elgg uses `Phinx`_ to manage the database migrations.
fr: Elgg utilise `Phinx`_ pour gérer les migrations de la base de données.

source: Create a migration
fr: Créer une migration

source: To create a new migration run the following in your console:
fr: Pour créer une nouvelle migration, exécutez ce qui suit dans votre console :

source: This will generate a timestamped skeleton migration in ``engine/schema/migrations/``. Follow Phinx documentation to call the necessary methods to modify the database tables.
fr: Ceci va générer un squelette de migration horodaté dans ``engine/schema/migrations/``. Suivez la documentation de Phinx pour appeler les méthodes nécessaires pour modifier les tables de la base de données.

source: Executing a migration
fr: Exécuter une migration

source: Migrations are executed every time your run ``upgrade.php``. If you would like to execute migrations manually, you can do so via the command line:
fr: Les migrations sont exécutées à chaque fois que vous exécutez ``upgrade.php``. Si vous préférez exécuter les migrations manuellement, vous pouvez le faire via la ligne de commande :

source: Check Phinx documentation for additional flags that allow you to run a single migration or a set of migrations within a time range.
fr: Vérifiez la documentation Phinx pour des drapeaux additionnels qui vous autorisent à effectuer une seule migration ou un jeu de migrations dans un intervalle de temps.

source: Writing Documentation
fr: Contribuer à la Documentation

source: New documentation should fit well with the rest of Elgg's docs.
fr: La nouvelle documentation devrait s'intégrer correctement avec le reste de la documentation de Elgg.

source: Testing docs locally
fr: Tester les documentations localement

source: Elgg has a `grunt`_ script that automatically builds the docs, opens them in a browser window, and automatically reloads as you make changes (the reload takes just a few seconds). You need `yarn`_ and `sphinx`_ installed to be able to use these scripts.
fr: Elgg dispose d'un script `grunt`_ qui construit automatiquement les docs, les ouvre dans une fenêtre de navigateur, et les recharge automatiquement pendant que vous faites des modifications (le rechargement ne prend que quelques secondes). Vous aurez besoin d'avoir `yarn`_ et `sphinx`_ installés pour pouvoir utiliser ces scripts.

source: It's that easy! Grunt will continue running, watching the docs for changes and automatically rebuilding.
fr: C'est aussi simple que cela ! Grunt va continuer à s'exécuter, à vérifier les docs pour des modifications, et à reconstruire automatiquement.

source: You might need to install 'sphinxcontrib-phpdomain'. You can do this with the following command: `pip install -U sphinxcontrib-phpdomain`
fr: Vous devrez peut-être installer 'sphinxcontrib-phpdomain'. Vous pouvez le faire avec la commande suivante : `pip install -U sphinxcontrib-phpdomain'

source: Follow the existing document organization
fr: Suivez l'organisation du document existant

source: The current breakdown is not necessarily the One True Way to organize docs, but consistency is better than randomness.
fr: L'organisation actuelle n'est pas nécessairement La Vraie Manière d'organiser les documentations, mais la cohérence est mieux que l'aléatoire.

source: This is everything that brand new users need to know (installation, features, license, etc.)
fr: C'est tout ce que les tout nouveaux utilisateurs ont besoin de savoir (installation, fonctionnalités, licence, etc.)

source: Guides for administrators. Task-oriented.
fr: Guides pour les administrateurs. Orienté tâches.

source: API guides for plugin developers. Cookbook-style. Example heavy. Code snippet heavy. Broken down by services (actions, i18n, routing, db, etc.). This should only discuss the public API and its behavior, not implementation details or reasoning.
fr: Guides de l'API pour les développeurs de plugins. Style recette de cuisine. Exemples solides. Éléments de code solides. Découpé par services (actions, i18n, routage, base de données, etc.). Ceci ne devrait discuter que de l'API publique et de son comportement, pas des détails d'implémentation ou de raisonnement.

source: Design docs for people who want to get a better understanding of how/why core is built the way it is. This should discuss internal implementation details of the various services, what tradeoffs were made, and the reasoning behind the final decision. Should be useful for people who want to contribute and for communication b/w core devs.
fr: Documentation de conception -design docs- pour les personnes qui veulent avoir une meilleure compréhension de comment/pourquoi le noyau est construit de cette manière. Ceci devrait discuter des détails d’implémentation internes des divers services, de quels compromis ont été faits, et du raisonnement derrière la décision finale. Devrait être utile aux personnes qui veulent contribuer ou pour la communication entre les développeurs du noyau.

source: Contributors guides for the various ways people can participate in the project.
fr: Guides des contributeurs pour les diverses manières dont des personnes peuvent participer au sein du projet.

source: More detailed/meta/background information about the project (history, roadmap, etc.)
fr: Des informations plus détaillées/méta/de contexte à propos du projet (historique, feuille de route, etc.)

source: Use "Elgg" in a grammatically correct way
fr: Utilisez "Elgg" d'une manière grammaticalement correcte

source: Elgg is not an acronym, so writing it in all caps (ELGG or E-LGG) is incorrect. Please don't do this.
fr: Elgg n'est pas un acronyme, l'écrire en majuscules (ELGG ou E-LGG) est incorrect. Veuillez ne pas le faire.

source: In English, Elgg does not take an article when used as a noun. Here are some examples to emulate:
fr: En Français, Elgg ne prend pas d'article quand il est utilisé comme un nom. Voici quelques exemples à imiter :

source: "I'm using Elgg to run my website"
fr: “J'utilise Elgg pour mon site web”

source: "Install Elgg to get your community online"
fr: “Installez Elgg pour mettre votre communauté en ligne”

source: When used as an adjective, the article applies to the main noun, so you should use one. For example:
fr: Quand il est utilisé comme adjectif, l'article s'applique au nom principal, aussi vous devriez en utiliser un. Par exemple :

source: "Go to the Elgg community website to get help."
fr: "Allez sur le site de la communauté Elgg pour trouver de l'aide."

source: "I built an Elgg-based network yesterday"
fr: "Hier, j'ai construis un réseau avec Elgg"

source: This advice may not apply in languages other than English.
fr: Ce conseil peut ne pas être valable pour d'autres langues que l'anglais.

source: Avoid first person pronouns
fr: Évitez les pronoms à la première personne

source: Refer to the reader as "you". Do not include yourself in the normal narrative.
fr: Faites référence au lecteur comme "vous". Ne vous incluez pas dans la narration habituelle.

source: Before:
fr: Avant :

source: When we're done installing Elgg, we'll look for some plugins!
fr: Quand nous aurons terminé l'installation de Elgg, nous irons rechercher quelques plugins !

source: After:
fr: Après :

source: When you're done installing Elgg, look for some plugins!
fr: Quand vous aurez terminé l'installation de Elgg, recherchez quelques plugins !

source: To refer to yourself (avoid this if possible), use your name and write in the third person. This clarifies to future readers/editors whose opinions are being expressed.
fr: Pour faire référence à vous-même (à éviter si possible), utilisez votre nom et écrivez à la troisième personne. Ceci permet aux futurs lecteurs/éditeurs de savoir de qui les opinions sont exprimées.

source: I think the best way to do X is to use Y.
fr: Je pense que le meilleur moyen pour faire X est d'utiliser Y.

source: Evan thinks the best way to do X is to use Y.
fr: Evan pense que le meilleur moyen pour faire X est d'utiliser Y.

source: Eliminate fluff
fr: Éliminer le superflu

source: If you want to use a third-party javascript library within the Elgg framework, you should take care to call the ``elgg_register_external_file`` function to register it.
fr: Si vous souhaitez utiliser une bibliothèque javascript tierce dans le framework Elgg, vous devez prendre soin d'appeler la fonction ``elgg_register_external_file`` pour l'enregistrer.

source: To use a third-party javascript library, call ``elgg_register_external_file`` to register it.
fr: Pour utiliser une bibliothèque javascript tierce-partie, appelez ``elgg_register_external_file`` pour l'enregistrer.

source: Prefer absolute dates over relative ones
fr: Préférez les dates absolues aux dates relatives

source: It is not easy to tell when a particular sentence or paragraph was written, so relative dates quickly become meaningless. Absolute dates also give the reader a good indication of whether a project has been abandoned, or whether some advice might be out of date.
fr: Il est difficile de dire quand une phrase ou un paragraphe particuliers ont été écrits, aussi les dates relatives deviennent vite incompréhensibles. Les dates absolues donnent également au lecteur une bonne indication de si un projet a été abandonné, ou si un conseil est toujours d'actualité.

source: Recently the foo was barred. Soon, the baz will be barred too.
fr: Récemment le truc a été machin. Bientôt, la chose sera machin aussi.

source: Recently (as of September 2013), the foo was barred. The baz is expected to be barred by October 2013.
fr: Récemment (à partir de septembre 2013), le truc a été machin. Il est prévu que la chose soit également machin d'ici octobre 2013.

source: Do not remind the reader to contribute
fr: Ne rappelez pas au lecteur de contribuer

source: Focus on addressing only the topic at hand. Constant solicitation for free work is annoying and makes the project look needy. If people want to contribute to the project, they can visit the contributor guide.
fr: Concentrez-vous pour ne traiter que du sujet en question. Des sollicitations constantes pour du travail gratuit sont agaçantes et donnent l'impression que le projet est dans le besoin. Si des personnes souhaitent contribuer au projet, elles peuvent visiter le guide du contributeur.

source: Internationalizing documentation
fr: Internationaliser la documentation

source: When you change documentation, remember to update the documentation translation templates before you commit:
fr: Quand vous modifiez la documentation, pensez à mettre à jour les modèles de traduction de la documentation avant de faire un commit :

source: For more information, see http://www.sphinx-doc.org/en/stable/intl.html#translating-with-sphinx-intl
fr: Pour plus d'information, voyez https://www.sphinx-doc.org/fr/master/usage/advanced/intl.html#translating-with-sphinx-intl

source: Special attention
fr: Points d'attention spécifiques

source: When translating the documentation be aware of special syntax in the documentation files.
fr: Quand vous traduisez la documentation soyez conscients de la syntaxe spécifique dans les fichiers de documentation.

source: Translating links
fr: Liens de traduction

source: Translate text in anonymous links (e.g., ```pronunciation`__``), but maintain the order of all anonymous links in a single block. If there are two anonymous links within a single block for translation, they must not be rearranged relative to each other.
fr: Traduisez le texte dans des liens anonymes (par ex., ```prononciation`__``), mais maintenez l'ordre de tous les liens anonymes dans un bloc unique. S'il y a deux liens anonymes à traduire dans un seul bloc de traduction, il ne doivent pas être inversés l'un par rapport à l'autre.

source: Translate the text of named links (e.g., ```demo site`_``) but only if you maintain the name using the correct rST syntax. In this case that would be ```translation of "demo site" <demo site_>`_``.
fr: Traduisez le texte des liens nommés (par ex., ```site de démo`_``) mais seulement si vous maintenez le noms en utilisant la bonne syntaxe rST. Dans ce cas ce devrait être ```traduction de "site de démo" <demo site_>`_``.

source: Do NOT translate
fr: NE traduisez PAS

source: Anything between pipe characters should not be translated (e.g., |version|).
fr: Tout ce qui se situe entre des caractères trait vertical ne devrait pas être traduit (par ex., |version|).

source: Code, unless it's a comment in the code.
fr: Le code, à moins que ce soit un commentaire dans le code.

source: Translations multiply the impact that Elgg can have by making it accessible to a larger percentage of the world.
fr: Les traductions démultiplient l'impact que Elgg peut avoir en le rendant accessible à un plus grand pourcentage du monde.

source: The community will always be indebted to those of you who work hard to provide high quality translations for Elgg's UI and docs.
fr: La communauté sera toujours reconnaissante à ceux qui travaillent dur pour fournir des traductions de haute qualité pour l'UI et la documentation de Elgg.

source: All translation for the Elgg project is organized through Transifex.
fr: Toutes les traductions pour le projet Elgg sont gérées avec Transifex.
