Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/contribute.po
Languages: fr

source: Writing Code
fr: Écrire du code

source: Understand Elgg's standards and processes to get your changes accepted as quickly as possible.
fr: Comprenez les standards et processus de Elgg pour que vos propositions de modification soient acceptées aussi vite que possible.

source: Contents
fr: Contenu

source: License agreement
fr: Agrément de licence

source: By submitting a patch you are agreeing to license the code under a `GPLv2 license`_ and `MIT license`_.
fr: En proposant un patch vous acceptez de publier le code sous une `licence GPLv2`_ et une `licence MIT`_.

source: Pull requests
fr: Demandes de fusion - Pull Requests

source: Pull requests (PRs) are the best way to get code contributed to Elgg core. The core development team uses them even for the most trivial changes.
fr: Les Pull requests (PRs) sont le meilleur moyen de contribuer au noyau de Elgg. L'équipe de développement les utilise y compris pour les modifications les plus mineures.

source: For new features, `submit a feature request <https://github.com/Elgg/Elgg/issues>`__ or `talk to us`_ first and make sure the core team approves of your direction before spending lots of time on code.
fr: Pour de nouvelles fonctionnalités, `soumettez une demande de fonctionnalité <https://github.com/Elgg/Elgg/issues>`__ ou `parlez-en avec nous`_ en premier lieu, et assurez-vous que l'équipe du noyau approuve votre proposition avant de passer beaucoup de temps sur du code.

source: Checklists
fr: Listes de vérification

source: Use these markdown checklists for new PRs on github to ensure high-quality contributions and help everyone understand the status of open PRs.
fr: Utilisez ces listes de vérification réduites pour les nouveaux PRs sur Github afin de garantir des contributions de haute qualité et d'aider tout le monde à comprendre le statut des PRs ouverts.

source: Bugfix PRs:
fr: Demandes de correction de bug - bugfix PRs :

source: Feature PRs:
fr: Demandes de fonctionnalité - feature PRs :

source: Choosing a branch to submit to
fr: Choisir une branche vers laquelle publier

source: The following table assumes the latest stable release is 2.1.
fr: Le tableau suivant suppose que la dernière version stable est la 2.1.

source: Type of change
fr: Type de changement

source: Branch to submit against
fr: Branche vers laquelle publier

source: Security fix
fr: Correctif de sécurité

source: Don't! Email security@elgg.org for guidance.
fr: Ne le faites pas ! Envoyez un e-mail à security@elgg.org pour des conseils.

source: Bug fix
fr: Correctif de bug

source: 1.12 (or 2.1 if the 1.12 fix is too complex)
fr: 1.12 (ou 2.1 si le correctif pour 1.12 est trop complexe)

source: Deprecation
fr: Dépréciation

source: Minor feature
fr: Fonctionnalité mineure

source: Major feature
fr: Fonctionnalité majeure

source: master
fr: master - maître

source: Has any breaking change
fr: Introduit un changement non rétro-compatible

source: If you're not sure which branch to submit against, just ask!
fr: Si vous ne savez pas quelle branche choisir, demandez !

source: The difference between minor and major feature is subjective and up to the core team.
fr: La différence entre des fonctionnalités mineures et majeures est subjective et soumise à l'appréciation de l'équipe du noyau.

source: Commit message format
fr: Format du message de commit

source: We require a particular format to allow releasing more often, and with improved changelogs and source history. Just follow these steps:
fr: Nous exigeons un format particulier afin de permettre de publier plus souvent, avec des journaux des modifications et un historique des modifications améliorés. Suivez simplement les étapes suivantes :

source: Start with the ``type`` by selecting the *last category which applies* from this list:
fr: Commencez par le ``type`` en sélectionnant la *dernière catégorie qui s'applique* dans cette liste :

source: **docs** - *only* docs are being updated
fr: **docs** - *uniquement* la documentation a été mise à jour

source: **chore** - this include refactoring, code style changes, adding missing tests, CI stuff, etc.
fr: **chore** - corvée - ceci comprend les remaniements, refactorisation de code, les changements de style de code, l'ajout de tests manquants, l'intégration continue, etc.

source: **perf** - the primary purpose is to improve performance
fr: **perf** - l'objectif principal est d'améliorer la performance

source: **fix** - this fixes a bug
fr: **fix** - ceci corrige un bug

source: **deprecate** - the change deprecates any part of the API
fr: **deprecate** - la modification rend obsolète une partie de l'API

source: **break** - the change breaks any part of the API
fr: **break** - le changement casse n'importe une partie de l'API

source: **feature** - this adds a new user-facing or developer feature
fr: **feature** - ajoute une nouvelle fonctionnalité pour les utilisateurs ou pour les développeurs

source: **removed** - this removes a user-facing or developer feature
fr: **removed** - cela supprime une fonctionnalité destinée aux utilisateurs ou aux développeurs

source: **security** - the change affects a security issue in any way. *Please do not push this commit to any public repo.* Instead contact security@elgg.org.
fr: **security** - la modification affecte la sécurité d'une manière ou d'une autre. *Merci de ne pas pousser ce commit vers un repository public.* Contactez plutôt security@elgg.org.

source: E.g. if your commit refactors to fix a bug, it's still a "fix". If that bug is security-related, however, the type must be "security" and you should email security@elgg.org before proceeding. When in doubt, make your best guess and a reviewer will provide guidance.
fr: Par ex., si votre commit fait des remaniements pour corriger un bug, cela reste un "fix". Cependant, si ce bug est lié à la sécurité, le type doit être "security" et vous devriez envoyer un e-mail à security@elgg.org avant de procéder. En cas de doute, faites au mieux, et un relecteur vous fournira des conseils.

source: In parenthesis, add the ``component``, a short string which describes the subsystem being changed.
fr: Entre parenthèses, ajoutez le ``component``, une courte chaîne qui décrit le sous-système en train d'être modifié.

source: Some examples: ``views``, ``i18n``, ``seo``, ``a11y``, ``cache``, ``db``, ``session``, ``router``, ``<plugin_name>``.
fr: Quelques exemples : ``views``, ``i18n``, ``seo``, ``a11y``, ``cache``, ``db``, ``session``, ``router``, ``<plugin_name>``.

source: Add a colon, a space, and a brief ``summary`` of the changes, which will appear in the changelog.
fr: Ajoutez une virgule, un espace, et un court résumé ``summary`` des modifications, qui va apparaître dans le journal des modifications - changelog.

source: No line may exceed 100 characters in length, so keep your summary concise.
fr: Aucune ligne ne devrait dépasser 100 caractères en longueur, aussi gardez un résumé concis.

source: Good summary
fr: Bon résumé

source: Bad summary (problem)
fr: Mauvais résumé (problème)

source: page owners see their own owner blocks on pages
fr: les propriétaires de pages voient leur propre bloc propriétaire sur les pages

source: bug fix (vague)
fr: correction de bug (vague)

source: bar view no longer dies if 'foo' not set
fr: la vue du graphique en barres n'échoue plus si 'foo' n'est pas défini

source: updates views/default/bar.php so bar view no longer... (redundant info)
fr: met à jour views/default/bar.php de sorte que la vue bar ne soit plus... (info redondante)

source: narrows river layout to fit iPhone
fr: réduit la mise en page de la rivière pour rentrer sur un iPhone

source: alters the river layout (vague)
fr: modifie la mise en page de la rivière (vague)

source: elgg_foo() handles arrays for $bar
fr: elgg_foo() gère les tableaux pour $bar

source: in elgg_foo() you can now pass an array for $bar and the function will... (move detail to description)
fr: dans elgg_foo() vous pouvez maintenant passer un tableau pour $bar et la fonction sera... (déplacez les précisions vers la description)

source: removes link color from comments header in river
fr: supprime la couleur du lien de l'entête des commentaires dans la rivière

source: fixes db so that... (redundant info)
fr: corrige la bdd pour que... (info redondante)

source: requires non-empty title when saving pages
fr: requiert un titre non-vide pour enregistrer les pages

source: can save pages with no title (confusingly summarizes old behavior)
fr: peut enregistrer des pages sans titre (résume de manière confuse l'ancien comportement)

source: (recommended) Skip a line and add a ``description`` of the changes. Include the motivation for making them, any info about back or forward compatibility, and any rationale of why the change had to be done a certain way. Example:
fr: (recommandé) Sautez une ligne et ajoutez une ``description`` des modifications. Incluez leur raison d'être, toute information sur la compatibilité ascendante ou descendante, et toute raison pour laquelle cette modification devait être faite d'une certaine manière. Par exemple :

source: We speed up the Remember Me table migration by using a single INSERT INTO ... SELECT query instead of row-by-row. This migration takes place during the upgrade to 1.9.
fr: Nous accélérons la migration des tables en utilisant une seule requête INSERT INTO ... SELECT au lieu de ligne par ligne. Cette migration se produit durant la mise à niveau vers Elgg 1.9.

source: Unless your change is trivial/obvious, a description is required.
fr: A moins que votre modification soit triviale/évidente, une description est requise.

source: If the commit resolves a GitHub issue, skip a line and add ``Fixes #`` followed by the issue number. E.g. ``Fixes #1234``. You can include multiple issues by separating with commas.
fr: Si le commit correspond à une demande - "issue" - Github, sautez une ligne et ajoutez ``Fixes #`` suivi par le numéro de demande. Par ex. ``Fixes #1234``. Vous pouvez inclure de multiples demande en les séparant par des virgules.

source: GitHub will auto-close the issue when the commit is merged. If you just want to reference an issue, use ``Refs #`` instead.
fr: GitHub va fermer automatiquement la demande quand le commit est fusionné. Si vous souhaitez simplement faire référence à une demande, utilisez plutôt ``Refs #``.

source: When done, your commit message will have the format:
fr: Quand c'est terminé, votre message de commit aura le format :

source: Here is an example of a good commit message:
fr: Voici un exemple de bon message de commit :

source: Rewriting commit messages
fr: Réécrire des messages de commits

source: If your PR does not conform to the standard commit message format, we'll ask you to rewrite it.
fr: Si votre PR ne se conforme pas au format standard de message de commit, nous vous demanderons de le réécrire.

source: To edit just the last commit:
fr: Pour modifier seulement le dernier commit :

source: Amend the commit: ``git commit --amend`` (git opens the message in a text editor).
fr: Amendez le commit: ``git commit --amend`` (git ouvre le message dans un éditeur de texte).

source: Change the message and save/exit the editor.
fr: Changez le message et enregistrez/quittez l'éditeur.

source: Force push your branch: ``git push -f your_remote your_branch`` (your PR with be updated).
fr: Forcez l'envoi de votre branche : ``git push -f your_remote your_branch`` (votre PR sera mis à jour).

source: Rename the PR title to match
fr: Renommez le titre du PR pour correspondre

source: Otherwise you may need to perform an interactive rebase:
fr: Sinon vous pourrez avoir besoin d'effectuer un "rebase" interactif :

source: Rebase the last N commits: ``git rebase -i HEAD~N`` where N is a number. (Git will open the ``git-rebase-todo`` file for editing)
fr: Faites un rebase des derniers N commits: ``git rebase -i HEAD~N`` où N est le nombre. (Git va ouvrir le fichier ``git-rebase-todo`` pour modification)

source: For the commits that need to change, change ``pick`` to ``r`` (for reword) and save/exit the editor.
fr: Pour les commits qui ont besoin d'être modifiés, modifiez ``pick`` en ``r`` (pour "reword", reformulation) et enregistrez/quittez l'éditeur.

source: Change the commit message(s), save/exit the editor (git will present a file for each commit that needs rewording).
fr: Modifiez le message (ou les messages) de commit, enregistrez/quitter l'éditeur (git va présenter un fichier pour chaque commit qui a besoin d'une reformulation).

source: ``git push -f your_remote your_branch`` to force push the branch (updating your PR).
fr: ``git push -f your_remote your_branch`` pour forcer un push de la branche (ce qui met à jour votre PR).

source: Coding Standards
fr: Standards de développements

source: Elgg uses set of standards that are based partially on PEAR and PSR2 standards. You can view the ruleset in ``vendor/elgg/sniffs/elgg.xml``.
fr: Elgg utilise des jeux de standards qui sont basés en partie sur les standards PEAR et PSR2. Vous pouvez voir le jeu de règles dans ``vendor/elgg/sniffs/elgg.xml``.

source: To check your code for standard violations (provided you have installed Elgg with dev dependencies), run:
fr: Pour vérifier les violations des standards de votre code (à condition que vous ayez installé Elgg avec les dépendances dev), exécutez :

source: To automatically fix fixable violations, run:
fr: Pour corriger automatiquement des violations réparables, exécutez :

source: Testing
fr: Tester

source: Elgg has automated tests for both PHP and JavaScript functionality. All new contributions are required to come with appropriate tests.
fr: Elgg dispose de tests automatisés à la fois pour PHP et JavaScript. Toutes les nouvelles contributions doivent intégrer les tests appropriés.

source: General guidelines
fr: Recommandations générales

source: Break tests up by the behaviors you want to test and use names that describe the behavior. E.g.:
fr: Découpez les tests par comportements que vous souhaitez tester et utilisez des noms qui décrivent le comportement. Par ex. :

source: Not so good: One big method ``testAdd()``.
fr: Pas si bon : Une seule grosse méthode ``testAdd()``.

source: Better: Methods ``testAddingZeroChangesNothing`` and ``testAddingNegativeNumberSubtracts``
fr: Mieux : Des méthodes ``testAddingZeroChangesNothing`` et ``testAddingNegativeNumberSubtracts``

source: Strive for :ref:`componentized designs <contribute/code#solid>` that allow testing in isolation, without large dependency graphs or DB access. Injecting dependencies is key here.
fr: Efforcez-vous d'utiliser des :ref:`designs à base de composants <contribute/code#solid>` qui permettent de tester en isolement, sans de grands graphes de dépendances ou d'accès à la base de données. L'injection de dépendances est ici critique.

source: PHP Tests
fr: Tests PHP

source: Located in ``engine/tests/phpunit``, this is our preferred test suite. It uses no DB access, and has only superficial access to the entities API.
fr: Située dans ``engine/tests/phpunit``, c'est notre suite de tests préférée. Elle n'utilise pas d'accès à la base de données, et n'a qu'un accès superficiel à l'API des entités.

source: We encourage you to create components that are testable in this suite if possible.
fr: Si possible, nous vous encourageons à créer des composants qui sont testables dans cette suite.

source: Consider separating storage from your component so at least business logic can be tested here.
fr: Envisagez de séparer le stockage de votre composant de sorte que la logique métier puisse être testée ici.

source: Depend on the ``Elgg\Filesystem\*`` classes rather than using PHP filesystem functions.
fr: Dépendez des classes ``Elgg\Filesystem\*`` plutôt que d'utiliser les fonctions du système de fichiers PHP.

source: Testing interactions between services
fr: Tester les interactions entre services

source: Ideally your tests would construct your own isolated object graphs for direct manipulation, but this isn't always possible.
fr: Dans l'idéal, vos tests devraient construire vos propres graphes d'objet isolés pour des manipulations directes, mais ce n'est pas toujours possible.

source: If your test relies on Elgg's Service Provider (``_elgg_services()`` returns a ``Elgg\Di\ServiceProvider``), realize that it maintains a singleton instance for most services it hands out, and many services keep their own local references to these services as well.
fr: Si votre test dépend du Fournisseur de Service Elgg (``_elgg_services()`` retourne un ``Elgg\Di\ServiceProvider``), réalisez que cela maintient une instance singleton pour la plupart des services qu'il fournit, et que de nombreux services conservent également leurs propres références locales vers ces services.

source: Due to these local references, replacing services on the SP within a test often will not have the desired effect. Instead, you may need to use functionality baked into the services themselves:
fr: Du fait de ces références locales, replacer les services sur le SP = "Service Provider" - Fournisseur de Service - au sein d'un test n'aura souvent pas l'effet désiré. Au lieu de cela, vous pourriez avoir besoin d'utiliser la fonctionnalité disponible dans les services eux-mêmes :

source: The ``events`` and ``hooks`` services have methods ``backup()`` and ``restore()``.
fr: Les services ``events`` et ``hooks`` ont des méthodes ``backup()`` et ``restore()``.

source: The ``logger`` service has methods ``disable()`` and ``enable()``.
fr: Le service ``logger`` a des méthodes ``disable()`` et ``enable()``.

source: Jasmine Tests
fr: Tests Jasmine

source: Test files must be named ``*Test.js`` and should go in either ``js/tests/`` or next to their source files in ``views/default/**.js``. Karma will automatically pick up on new ``*Test.js`` files and run those tests.
fr: Les fichiers de test doivent être nommés ``*Test.js`` et devraient être placés soit dans ``js/tests/`` ou à côté de leurs fichiers sources dans ``views/default/**.js``. Karma va automatiquement sélectionner les nouveaux fichiers ``*Test.js`` et exécuter ces tests.

source: Test boilerplate
fr: Test générique

source: Running the tests
fr: Effectuer les tests

source: Elgg uses `Karma`_ with `Jasmine`_ to run JS unit tests.
fr: Elgg utilise `Karma`_ avec `Jasmine`_ pour effectuer des tests unitaires JS.

source: You will need to have nodejs and yarn installed.
fr: Vous devez avoir nodejs et yarn installés.

source: First install all the development dependencies:
fr: Tout d'abord installez toute les dépendances de développement :

source: Run through the tests just once and then quit:
fr: Exécutez les tests une seule fois puis quittez :

source: You can also run tests continuously during development so they run on each save:
fr: Vous pouvez également exécuter les tests en continu pendant le développement de sorte qu'ils s'exécutent à chaque enregistrement :

source: Debugging JS tests
fr: Déboguer les tests JS

source: You can run the test suite inside Chrome dev tools:
fr: Vous pouvez exécuter la suite de test au sein des outils de développement de Chrome :

source: This will output a URL like ``http://localhost:9876/``.
fr: Ceci va renvoyer une URL telle que ``http://localhost:9876/``.

source: Open the URL in Chrome, and click "Debug".
fr: Ouvrez l'URL dans Chrome, et cliquez sur "Debug".

source: Open Chrome dev tools and the Console tab.
fr: Ouvrez les outils de développement de Chrome et l'onglet Console.

source: Reload the page.
fr: Rechargez la page.

source: If you alter a test you'll have to quit Karma with ``Ctrl-c`` and restart it.
fr: Si vous modifiez un test, vous devrez quitter Karma avec ``Ctrl-c`` et le redémarrer.

source: Coding best practices
fr: Meilleures pratiques de développement

source: Make your code easier to read, easier to maintain, and easier to debug. Consistent use of these guidelines means less guess work for developers, which means happier, more productive developers.
fr: Rendez votre code plus facile à lire, plus facile à maintenir, et plus facile à déboguer. Un usage consistant de ces recommandations signifie moins de travail de devinettes pour les développeurs, ce qui signifie des développeurs plus heureux, et plus productifs.

source: General coding
fr: Développement en général

source: Don't Repeat Yourself
fr: Ne. Vous. Répétez. Pas

source: If you are copy-pasting code a significant amount of code, consider whether there's an opportunity to reduce duplication by introducing a function, an additional argument, a view, or a new component class.
fr: Si vous copiez-collez des morceaux significatifs de code, considérez qu'il y a une opportunité de réduire la redondance en introduisant une fonction, un argument supplémentaire, une vue, ou une nouvelle classe de composant.

source: E.g. If you find views that are identical except for a single value, refactor into a single view that takes an option.
fr: Par ex. Si vous trouvez des vues qui sont identiques à l'exception d'une seule valeur, remaniez-les en une seule vue qui accepte une option.

source: **Note:** In a bugfix release, *some duplication is preferrable to refactoring*. Fix bugs in the simplest way possible and refactor to reduce duplication in the next minor release branch.
fr: **Note:** Pour la publication d'un correctif de bug, *un peu de duplication est préférable à de la refactorisation*. Corrigez les bugs de la manière la plus simple possible, et refactorisez pour réduire la redondance dans la branche de la prochaine version mineure.

source: Embrace SOLID and GRASP
fr: Adoptez SOLID et GRASP

source: Use these `principles for OO design`__ to solve problems using loosely coupled components, and try to make all components and integration code testable.
fr: Utilisez ces `principes pour le design OO`__ pour résoudre des problèmes en utilisant des composants couplés librement, et essayez de rendre tous les composants et le code d'intégration testables.

source: Whitespace is free
fr: Les espacements ne coûtent rien

source: Don't be afraid to use it to separate blocks of code. Use a single space to separate function params and string concatenation.
fr: N'ayez pas peur d'utiliser des blocs de code séparés. Utilisez un espace unique pour séparer les paramètres des fonctions et les concaténations de chaînes.

source: Variable names
fr: Noms de variable

source: Use self-documenting variable names. ``$group_guids`` is better than ``$array``.
fr: Utilisez des noms de variables auto-documentés. ``$group_guids`` est mieux que ``$array``.

source: Avoid double-negatives. Prefer ``$enable = true`` to ``$disable = false``.
fr: Évitez les doubles négations. Préférez ``$enable = true`` à ``$disable = false``.

source: Interface names
fr: Nom des interfaces

source: Use the pattern ``Elgg\{Namespace}\{Name}``.
fr: Utilisez le motif ``Elgg\{Namespace}\{Name}``.

source: Do not include an ``I`` prefix or an ``Interface`` suffix.
fr: N'ajoutez pas de préfixe ``I`` ou de suffixe ``Interface``.

source: We do not include any prefix or suffix so that we're encouraged to:
fr: Nous n'utilisons aucun préfixe ou suffixe de sorte que nous sommes encouragés à :

source: name implementation classes more descriptively (the "default" name is taken).
fr: nommez les classes d'implémentation de manière plus descriptive (le nom "default" est déjà pris).

source: type-hint on interfaces, because that is the shortest, easiest thing to do.
fr: typez sur les interfaces, parce que c'est la manière la plus courte et la plus simple de faire.

source: Name implementations like ``Elgg\{Namespace}\{Interface}\{Implementation}``.
fr: Nommez les implémentations comme ``Elgg\{Namespace}\{Interface}\{Implementation}``.

source: Functions
fr: Fonctions
