Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/contribute.po
Languages: fr

source: Plugin authors are encouraged to coordinate translations via Transifex as well so the whole community can be unified and make it really easy for translators to contribute to any plugin in the Elgg ecosystem.
fr: Les auteurs de plugins sont encouragés à coordonner les traductions via Transifex également, de sorte que la communauté entière puisse être unie, et que cela facilite la possibilité pour les traducteurs de contribuer à la traduction de n'importe quel plugin dans l'écosystème Elgg.

source: Pulling translations
fr: Récupérez les traductions

source: The translations made in Transifex need to be periodically pulled into the Elgg code repository. This can be done with the script ``.scripts/languages.php`` bundled within Elgg's source code.
fr: Les traductions faites dans Transifex ont besoin d'être récupérées périodiquement dans le dépôt de code de Elgg. Ceci peut être effectué avec le script ``.scripts/languages.php`` inclus dans le code source de Elgg.

source: Prerequisites for running the script are:
fr: Les pré-requis pour exécuter le script sont :

source: Access to command line
fr: Accès à la ligne de commande

source: The script will do the following steps:
fr: Le script va effectuer les étapes suivantes :

source: Create a new git branch named ``{branch}_i18n_{timestamp}``
fr: Créez une nouvelle branche git nommée ``{branch}_i18n_{timestamp}``

source: Pull translations for all languages that have 95% of the strings translated
fr: Récupérez les traductions pour toutes les langues qui ont au moins 95% des chaînes traduites

source: Remove possible invalid language codes
fr: Retirez les éventuels codes de langue invalides

source: Commit the changes to the branch
fr: Commitez les modifications vers la branche

source: After this you must push the branch to Github and make a new Pull request.
fr: Après cela, faites un push de la branche vers Github et faites une nouvelle Pull Request.

source: For example if you want to pull the translations for the ``3.x`` branch, run the following commands:
fr: Par exemple, si vous voulez récupérer les traductions pour la branche ``3.x``, exécutez les commandes suivantes :

source: Run the command without parameters to get more detailed information of the usage.
fr: Exécutez la commande sans paramètre pour obtenir des informations plus détaillées sur son utilisation.

source: Transifex configuration
fr: Configuration Transifex

source: The configuration for Transifex can be found from Elgg's source code in the file ``.tx/config``.
fr: La configuration pour Transifex se trouve dans le code source de Elgg dans le fichier ``.tx/config``.

source: This file defines:
fr: Ce fichier définit :

source: The Transifex project associated with Elgg's major version
fr: Le projet Transifex associé avec la version majeure de Elgg

source: The location of all the files that have translatable content
fr: L'emplacement des tous les fichiers qui ont du contenu traduisible

source: Read the `Transifex documentation`_ for further details.
fr: Lisez la `documentation Transifex`_ pour plus d'information.

source: New major Elgg version
fr: Nouvelle version majeure de Elgg

source: Every major version of Elgg must have its own project in Transifex. This way we can make sure that strings added and removed between versions do not conflict with each other. For example a translation key removed in Elgg 3 should not get removed from translations made for Elgg 2. Respectfully a new string added only to Elgg 3 should not be included in the translations meant for Elgg 2.
fr: Chaque version majeure de Elgg doit disposer de son propre projet dans Transifex. De cette manière nous pouvons nous assurer que les chaînes ajoutées et retirées entre les versions ne créent pas de conflit les unes avec les autres. Par exemple une clef de traduction retirée dans Elgg 4 ne devrait pas être retirée des traductions faites pour Elgg 3. De même, une nouvelle chaîne ajoutée seulement pour Elgg 4 ne devrait pas être incluses dans les traductions prévues pour Elgg 3.

source: The process of setting up a new major version is:
fr: Le processus pour mettre en place une nouvelle version majeure est le suivant :

source: Pull latest translations from Transifex to the previous major version
fr: Récupérez les dernières traductions depuis Transifex vers la précédente version majeure

source: Merge the git branch of the previous version to the new to make sure all the latest translation keys are present
fr: Fusionnez la branche git de la version précédente vers la nouvelle afin de s'assurer que toutes les dernières clefs de traduction sont présentes

source: Create a new Transifex project to https://www.transifex.com/elgg/
fr: Créez un nouveau projet Transifex sur https://www.transifex.com/elgg/

source: Update ``.tx/config`` file in the development branch of the new major version
fr: Mettez à jour le fichier ``.tx/config`` dans la branche de développement de la nouvelle version majeure

source: Update the configuration to point to the new Transifex project
fr: Mettez à jour la configuration pour pointer vers le nouveau projet Transifex

source: Remove configuration of removed plugins
fr: Retirez la configuration des plugins retirés

source: Add configuration for new plugins
fr: Ajoutez la configuration des nouveaux plugins

source: Push the translation sources to the new Transifex project with the command: ::
fr: Poussez les sources de traduction vers le nouveau projet Transifex avec la commande : ::

source: Copy the new configuration file temporarily (do not commit) to the previous major version, and push the existing translations from it to the new project: ::
fr: Copiez le nouveau fichier de configuration temporairement (sans commit) vers la version majeure précédente, et poussez les traductions existantes depuis là vers le nouveau projet : ::

source: Later, once the dedicated branch (e.g. ``3.x`` has been created for the major version, configure Transifex to fetch new translation keys from it automatically in https://www.transifex.com/elgg/elgg-core-3/content/. This way you don't have to repeat step 5 manually every time new translation keys are added.
fr: Plus tard, une fois que la branche dédiée (par ex. ``3.x``) a été créée pour la version majeure, configurez Transifex pour récupérer automatiquement les nouvelles clefs à partir de cette branche dans https://www.transifex.com/elgg/elgg-core-3/content/. De cette manière vous n'avez pas à répéter manuellement l'étape 5 à chaque fois que de nouvelles clefs de traduction sont ajoutées.

source: It is important to always have a ``n.x`` branch besides the branches meant for specific minor versions (``n.1``, ``n.2``, etc.). This way the URLs of the auto-update sources do not have to be updated every time a new minor branch is created.
fr: Il est important de toujours avoir une branche ``n.x`` en plus des branches créées pour des versions mineures spécifiques (``n.1``, ``n.2``, etc.). De cette manière les URLs des sources automatiquement mises à jour n'ont pas besoin d'être mises à jour à chaque fois qu'une nouvelle branche mineure est créée.

source: Contributor Guides
fr: Guides du contributeur

source: Participate in making Elgg even better.
fr: Contribuez à rendre Elgg encore meilleur.

source: Elgg is a community-driven project. It relies on the support of volunteers to succeed. Here are some ways you can help:
fr: Elgg est un projet communautaire. Il dépend du soutien de volontaires pour réussir. Voici plusieurs manières d'aider :

source: Reporting Issues
fr: Signaler des problèmes

source: Report bugs and features requests to https://github.com/Elgg/Elgg/issues. See below for guidelines.
fr: Signalez bugs et demandes de fonctionnalités sur https://github.com/Elgg/Elgg/issues. Voyez ci-dessous pour des recommandations.

source: DISCLAIMERS
fr: LIMITES DE RESPONSABILITÉ

source: Security issues should be reported to **security @ elgg . org**! Please do not post any security issues on github!!
fr: Les problèmes de sécurité devraient être signalés à **security @ elgg . org** ! Merci de ne publier aucun faille de sécurité sur github !!

source: Support requests belong on the `community site`_. Tickets with support requests will be closed.
fr: Les demandes d'aide relèvent du `site de la communauté`_. Les tickets avec des demandes d'aide seront fermés.

source: We cannot make any guarantees as to when your ticket will be resolved.
fr: Nous ne pouvons donner aucune garantie sur la date à laquelle votre ticket sera résolu.

source: Bug reports
fr: Rapports de bugs

source: Before submitting a bug report:
fr: Avant de soumettre un rapport de bug :

source: Search for an existing ticket on the issue you’re having. Add any extra info there.
fr: Recherchez un ticket existant à propos du problème que vous rencontrez. Ajoutez toute information supplémentaire à cet endroit.

source: Verify the problem is reproducible
fr: Vérifiez que le problème est reproductible

source: On the latest version of Elgg
fr: Sur la dernière version de Elgg

source: With all third-party plugins disabled
fr: Avec tous les plugins tierce-partie désactivés

source: Good bug report checklist:
fr: Liste de contrôle pour un bon signalement de bug :

source: Expected behavior and actual behavior
fr: Comportement attendu et comportement constaté

source: Clear steps to reproduce the problem
fr: Des étapes claires pour reproduire le problème

source: The version of Elgg you’re running
fr: La version de Elgg que vous utilisez

source: Browsers affected by this problem
fr: Les navigateurs affectés par ce problème

source: Feature requests
fr: Demandes de fonctionnalité

source: Before submitting a feature request:
fr: Avant de soumettre une demande de fonctionnalité :

source: Check the `community site`_ for a plugin that has the features you need.
fr: Vérifiez sur le `site de la communauté`_ si un plugin existe avec les fonctionnalités dont vous avez besoin.

source: Consider if you can :doc:`develop a plugin </tutorials/index>` that does what you need.
fr: Envisagez si vous le pouvez de :doc:`développer un plugin </tutorials/index>` qui fasse ce dont vous avez besoin.

source: Search through the closed tickets to see if someone else suggested the same feature, but got turned down. You’ll need to be able to explain why your suggestion should be considered this time.
fr: Recherchez parmi les tickets fermés pour voir si quelqu'un d'autre a suggéré la même fonctionnalité, mais que cela a été refusé. Vous devez pouvoir expliquer pourquoi votre suggestion devrait être examinée cette fois-ci.

source: Good feature request checklist:
fr: Liste de contrôle pour une bonne demande de fonctionnalité :

source: Detailed explanation of the feature
fr: Explication détaillée de la fonctionnalité

source: Real-life use-cases
fr: Cas d'usages réels

source: Proposed API
fr: API proposée

source: Becoming a Financial Supporter
fr: Devenir un soutien financier

source: All funds raised via the Elgg supporters network go directly into:
fr: Tous les fonds recueillis par l'intermédiaire du réseau de supporters Elgg vont directement pour :

source: Elgg core development
fr: Développement du noyau Elgg

source: Infrastructure provision (elgg.org, github, etc.)
fr: La fourniture d'infrastructures (elgg.org, github, etc)

source: It is a great way to help with Elgg development!
fr: Il s'agit d'un excellent moyen d'aider au développement de Elgg !

source: Benefits
fr: Avantages

source: For only $50 per year for individuals or $150 per year for organizations, you can get listed as a supporter on `our supporters page`_. Elgg supporters are listed there unless they request not to be.
fr: Pour seulement $50 par an pour les individus, ou $150 par an pour les organisations, vous pouvez être listé comme soutien sur `notre page des soutiens`_. Les soutiens de Elgg apparaissent dans cette liste sauf s'ils demandent à ne pas l'être.

source: Supporters are able to put this official logo on their site if they wish:
fr: Les soutiens ont l'autorisation d'ajouter ce logo officiel sur leur site s'ils le souhaitent :

source: Disclaimer
fr: Limite de responsabilité

source: We operate a no refund policy on supporter subscriptions. If you would like to withdraw your support, go to PayPal and cancel your subscription. You will not be billed the following year.
fr: Nous avons une politique de non-remboursement sur les souscriptions de soutien. Si vous souhaitez arrêter votre soutien, allez sur Paypal et annulez votre souscription. Vous ne serez pas débité l'année suivante.

source: Being an Elgg Supporter does not give an individual or organization the right to impersonate, trade as or imply they are connected to the Elgg project. They can, however, mention that they support the Elgg project.
fr: Être un soutien de Elgg ne donne en aucun cas le droit à un individu ou à une organisation le droit de parler au nom du projet Elgg, de commercialiser en son nom, ou de laisser entendre qu'ils sont liés au projet Elgg. Ils peuvent toutefois mentionner le fait qu'ils sont soutien du projet Elgg.

source: If you have any questions about this disclaimer, email info@elgg.org.
fr: Si vous avez des questions à propos de cet avertissement, écrivez à info@elgg.org.

source: We reserve the right to remove or refuse a listing without any prior warning at our complete discretion. There is no refund policy.
fr: Nous nous réservons le droit de retirer ou refuser une souscription sans avertissement préalable à notre entière discrétion. Il n'y a pas de politique de remboursement.

source: If there is no obvious use of Elgg, your site will be linked to with "nofollow" set.
fr: S'il n'y a pas d'utilisation évidente de Elgg, votre site sera relié avec l'attribut "nofollow".

source: Sign up
fr: S'inscrire

source: If you would like to become an Elgg supporter:
fr: Si vous souhaitez devenir un sponsor de Elgg:

source: read the disclaimer_ above
fr: lisez l'avertissement_ ci-dessus

source: on the supporters page, `subscribe via PayPal`__
fr: sur la page des soutiens, `souscrivez via Paypal`__

source: send an email to info@elgg.org with:
fr: envoyez un e-mail à info@elgg.org avec :

source: the date you subscribed
fr: la date de votre souscription

source: your name (and organization name, if applicable)
fr: votre nom (et le nom de l'organisation, s'il y a lieu)

source: your website
fr: votre site web

source: your Elgg community profile
fr: votre profil sur la communauté Elgg

source: Once all the details have been received, we will add you to the appropriate list. Thanks for your support!
fr: Une fois que tous les détails ont été reçus, nous vous ajouterons à la liste appropriée. Merci pour votre soutien !

source: Adding a Service to Elgg
fr: Ajouter un Service à Elgg

source: The :doc:`services guide </guides/services>` has general information about using Elgg services.
fr: Le :doc:`guide sur les services </guides/services>` présente des informations générales sur l'utilisation des services Elgg.

source: To add a new service object to Elgg:
fr: Pour ajouter un nouvel objet de service à Elgg :

source: Annotate your class as ``@internal``.
fr: Annotez votre classe comme ``@internal``.

source: Open the class ``Elgg\Di\ServiceProvider``.
fr: Ouvrez la classe ``Elgg\Di\ServiceProvider``.

source: Add a ``@property-read`` annotation for your service at the top. This allows IDEs and static code analyzers to understand the type of the property.
fr: Ajoutez une annotation ``@property-read`` pour votre service au tout début. Ceci permet aux EDIs et aux analyseurs de code statique de comprendre le type de la propriété.

source: To the constructor, add code to tell the service provider what to return. See the class ``Elgg\Di\DiContainer`` for more information on how Elgg's DI container works.
fr: Pour le constructeur, ajoutez le code qui indique quoi retourner au fournisseur de service. Voyez la classe ``Elgg\Di\DiContainer`` pour plus d'informations sur comment le conteneur DI d'injection de dépendances de Elgg fonctionne.

source: At this point your service will be available from the service provider object, but will not yet be accessible to plugins.
fr: A ce stade votre service sera disponible depuis l'objet fournisseur de service, mais ne sera pas encore accessible aux plugins.

source: Inject your dependencies
fr: Injectez vos dépendances

source: Design your class constructor to *ask for* the necessary dependencies rather than creating them or using ``_elgg_services()``. The service provider's ``setFactory()`` method provides access to the service provider instance in your factory method.
fr: Concevez votre constructeur de classe de sorte qu'il *demande* les dépendances nécessaires plutôt que de les créer ou d'utiliser ``_elgg_services()``. La méthode ``setFactory()`` du fournisseur de service fournit l'accès à l'instance du fournisseur de service dans la méthode de votre fabrique.

source: Here's an example of a ``foo`` service factory, injecting the ``config`` and ``db`` services into the constructor:
fr: Voici un exemple de fabrique de service ``foo``, qui injecte les services ``config`` et ``db`` dans le constructeur :

source: The full list of internal services can be seen in the ``@property-read`` declarations at the top of ``Elgg\Di\ServiceProvider``.
fr: La liste complète des services internes peut être vue dans les déclarations ``@property-read`` au début de ``Elgg\Di\ServiceProvider``.

source: Avoid performing work in your service constructor, particularly if it requires database queries. Currently PHPUnit tests cannot perform them.
fr: Évitez de faire des opérations dans le constructeur de votre service, en particulier si cela requiert des requêtes sur la base de données. Actuellement les tests PHPUnit tests ne peuvent pas les effectuer.

source: Making a service part of the public API
fr: Faire qu'un service fasse partie de l'API publique

source: If your service is meant for use by plugin developers:
fr: Si votre service est conçu pour être utilisé par des développeurs de plugins :

source: Make an interface ``Elgg\Services\<Name>`` that contains only those methods needed in the public API.
fr: Faites une interface ``Elgg\Services\<Name>`` qui ne contient que ces méthodes nécessaires dans l'API publique.

source: Have your service class implement that interface.
fr: Faites que la classe de votre service implémente cette interface.

source: For methods that are in the interface, move the documentation to the interface. You can simply use ``{@inheritdoc}`` in the PHPDocs of the concrete class methods.
fr: Pour les méthodes qui sont dans l'interface, déplacez la documentation dans l'interface. Vous pouvez simplement utiliser ``{@inheritdoc}`` dans les PHPDocs des méthodes de votre classe.

source: Document your service in ``docs/guides/services.rst`` (this file).
fr: Documentez votre service dans ``docs/guides/services.rst`` (ce fichier)

source: Open the PHPUnit test ``Elgg\ApplicationTest`` and add your service key to the ``$names`` array in ``testServices()``.
fr: Ouvrez le test PHPUnit ``Elgg\ApplicationTest`` et ajoutez la clef de votre service au tableau ``$names`` dans ``testServices()``.

source: Open the class ``Elgg\Application``.
fr: Ouvrez la classe ``Elgg\Application``.

source: Add ``@property-read`` declaration to document your service, but use your **interface** as the type, *not* your service class name.
fr: Ajoutez une déclaration ``@property-read`` pour documenter votre service, mais utilisez votre **interface** pour le type, et *pas* le nom de la classe de votre service.

source: Add your service key to the array in the ``$public_services`` property, e.g. ``'foo' => true,``
fr: Ajoutez la clef de votre service au tableau dans la propriété ``$public_services``, par ex. ``'foo' => true,``

source: Now your service will be available via property access on the ``Elgg\Application`` instance:
fr: Désormais votre service sera disponible via l'accès à la propriété sur l'instance ``Elgg\Application`` :

source: For examples, see the ``config`` service, including the interface ``Elgg\Services\Config`` and the concrete implementation ``Elgg\Config``.
fr: Pour des exemples, voyez le service ``config``, qui comprend l'interface ``Elgg\Services\Config`` et la classe d'implémentation effective ``Elgg\Config``.

source: Service Life Cycle and Factories
fr: Cycle de vie d'un Service et Fabriques - "Factories"

source: By default, services registered on the service provider are "shared", meaning the service provider will store the created instance for the rest of the request, and serve that same instance to all who request the property.
fr: Par défaut, les services enregistrés sur le fournisseur de service sont partagés - "shared", ce qui signifie que le fournisseur de service va conserver l'instance créée pour le reste de la requête, et servir la même instance à tous ceux qui demandent la propriété.

source: If you need developers to be able to construct objects that are pre-wired to Elgg services, you may need to add a public factory method to ``Elgg\Application``. Here's an example that returns a new instance using internal Elgg services:
fr: Si vous avez besoin que les développeurs puissent construire des objets qui soient pré-câblés aux services Elgg, vous pouvez avoir besoin d'ajouter une méthode de fabrique publique à ``Elgg\Application``. Voici un exemple qui retourne une nouvelle instance en utilisant les services internes de Elgg :

source: Writing tests
fr: Écrire des tests

source: We want to *make manual testing unnecessary* for core developers, plugin authors, and site administrators by promoting and enabling fast, automated testing at every level of the Elgg stack.
fr: Nous voulons *rendre les tests manuels inutiles* pour les développeurs du noyau, les auteurs de plugins, et les administrateurs de sites en rendant possible et en faisant la promotion de tests rapides et automatisés à tous les niveaux de Elgg.

source: We look forward to a world where the core developers do not need to do any manual testing to verify the correctness of code contributed to Elgg. Similarly, we envision a world where site administrators can upgrade and install new plugins with confidence that everything works well together.
fr: Nous avons hâte d'un monde dans lequel les développeurs du noyau n'ont pas besoin de faire de tests manuels pour vérifier la correction du code contribué à Elgg. De manière similaire, nous envisageons un monde dans lequel les administrateurs de site peuvent mettre à niveau et installer de nouveaux plugins avec la certitude que tout fonctionne bien ensemble.

source: Running Tests
fr: Effectuer les tests

source: Elgg Core Test Suite
fr: Suite de tests du noyau Elgg

source: Currently our tests are split in two pieces:
fr: Actuellement nos tests se partagent en deux parties :

source: PHPUnit tests are located in ``/tests/phpunit`` -- these are split between unit tests and integration tests.
fr: Les tests PHPUnit sont situés dans ``/tests/phpunit`` -- ceux-ci sont répartis entre les tests unitaires et les tests d’intégration.

source: Since we have a ``phpunit.xml`` configuration at the root of Elgg, testing should be as easy as:
fr: Dans la mesure où il existe un fichier de configuration ``phpunit.xml`` à la racine de Elgg, les tests devraient être aussi simples que :

source: Plugin tests
fr: Tests des plugins
