Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/design.po
Languages: fr

source: Actions are the primary way users interact with an Elgg site.
fr: Les actions sont la première modalité d'interaction des utilisateurs avec un site Elgg.

source: Overview
fr: Aperçu

source: An action in Elgg is the code that runs to make changes to the database when a user does something. For example, logging in, posting a comment, and making a blog post are actions. The action script processes input, makes the appropriate modifications to the database, and provides feedback to the user about the action.
fr: Dans Elgg, une action est le code qui est exécuté pour faire des modifications dans la base de données quand un utilisateur effectue quelque chose. Par exemple, le fait de se connecter, de publier un commentaire, ou de créer un article de blog sont des actions. Le script d'action traite le processus d'entrée, effectue les modifications appropriées dans la base de données, et fournit un retour à l'utilisateur à propos de l'action.

source: Action Handler
fr: Gestionnaire d'action

source: Actions are registered during the boot process by calling ``elgg_register_action()``. All actions URLs start with ``action/`` and are served by Elgg's front end controller through the action service. This approach is different from traditional PHP applications that send information to a specific file. The action service performs :doc:`CSRF security checks </design/security>`, and calls the registered action script file, then optionally forwards the user to a new page. By using the action service instead of a single script file, Elgg automatically provides increased security and extensibility.
fr: Les actions sont enregistrées durant le processus de démarrage (boot) en appelant ``elgg_register_action()``. Toutes les URLs d'action commencent par ``action/`` et sont servies par le contrôleur front end d'Elgg à travers le service action. Cette approche est différente d'application PHP traditionnelles qui envoient l'information à un fichier spécifique. Le service action réalise des :doc:`CSRF vérifications de sécurité </design/security>`, et appelle le fichier de script d'action enregistré, puis renvoient éventuellement l'utilisateur vers une nouvelle page. En utilisant le service action au lieu d'un seul fichier de script, Elgg fournit automatiquement une sécurité et une extensibilité améliorées.

source: See :doc:`/guides/actions` for details on how to register and construct an action. To look at the core actions, check out the directory /actions.
fr: Voyez :doc:`/guides/actions` pour plus de détails sur comment enregistrer et construire une action. Pour regarder les actions du noyau, regardez dans le répertoire /actions.

source: There are two JavaScript system in Elgg: the deprecated 1.8 system, and the newer `AMD (Asynchronous Module Definition) <http://requirejs.org/docs/whyamd.html>`_ compatible system introduced in 1.9.
fr: Il existe deux systèmes JavaScript dans Elgg : le système 1.8 devenu obsolète, et le nouveau système compatible `AMD (Asynchronous Module Definition) <http://requirejs.org/docs/whyamd.html>`_ introduit dans la 1.9.

source: This discusses the benefits of using AMD in Elgg.
fr: Discussions au sujet des bénéfices de l'utilisation d'AMD dans Elgg.

source: Why AMD?
fr: Pourquoi AMD ?

source: We have been working hard to make Elgg's JavaScript more maintainable and useful. We made some strides in 1.8 with the introduction of the "``elgg``" JavaScript object and library, but have quickly realized the approach we were taking was not scalable.
fr: Nous avons beaucoup travaillé pour rendre le JavaScript d'Elgg plus maintenable et plus utile. Nous avons fait quelques grands pas dans la 1.8 en introduisant l'objet et la bibliothèque JavaScript "``elgg``", mais avons rapidement réalisé que l'approche que nous prenions n'était pas susceptible de passer à l'échelle.

source: The size of `JS on the web is growing <http://httparchive.org/trends.php?s=All&minlabel=Feb+11+2011&maxlabel=Feb+1+2013#bytesJS&reqJS>`_ quickly, and JS in Elgg is growing too. We want Elgg to be able to offer a solution that makes JS development as productive and maintainable as possible going forward.
fr: La taille du `JS sur le web est rapidement croissante <http://httparchive.org/trends.php?s=All&minlabel=Feb+11+2011&maxlabel=Feb+1+2013#bytesJS&reqJS>`_, et le JS dans Elgg s’accroît également. Nous voulons qu'Elgg soit capable d'offrir une solution qui rende le développement JS aussi productif et maintenable que possible pour aller plus loin.

source: The `reasons to choose AMD <http://requirejs.org/docs/whyamd.html>`_ are plenteous and well-documented. Let's highlight just a few of the most relevant reasons as they relate to Elgg specifically.
fr: Les `raisons de choisir AMD <http://requirejs.org/docs/whyamd.html>`_ sont nombreuses et bien documentées. Mettons en avant seulement les raisons les plus pertinentes dans la mesure où elles sont liées à Elgg spécifiquement.

source: 1. Simplified dependency management
fr: 1. Gestion des dépendances simplifiée

source: AMD modules load asynchronously and execute as soon as their dependencies are available, so this eliminates the need to specify "priority" and "location" when registering JS libs in Elgg. Also, you don't need to worry about explicitly loading a module's dependencies in PHP. The AMD loader (RequireJS in this case) takes care of all that hassle for you. It's also possible have `text dependencies <http://requirejs.org/docs/api.html#text>`_ with the RequireJS text plugin, so client-side templating should be a breeze.
fr: Les modules AMD se chargent de manière asynchrone et s'exécutent dès que leurs dépendances sont disponibles, ce qui élimine le besoin de préciser des "priorités" et des emplacements "location" lorsqu'on enregistre une bibliothèque JS dans Elgg. De plus, vous n'avez pas besoin de vous soucier de charger explicitement les dépendances d'un module dans PHP. Le chargeur AMD (RequireJS en l'occurrence) prend soin de tous ces tracas pour vous. Il est également possible d'avoir des `dépendances texte <http://requirejs.org/docs/api.html#text>`_ avec le plugin text de RequireJS, de sorte que le templating côté client devrait être un plaisir.

source: 2. AMD works in all browsers. Today.
fr: 2. AMD fonctionne dans tous les navigateurs. Dès maintenant.

source: Elgg developers are already writing lots of JavaScript. We know you want to write more. We cannot accept waiting 5-10 years for a native JS modules solution to be available in all browsers before we can organize our JavaScript in a maintainable way.
fr: Les développeurs Elgg ont déjà écrit beaucoup de JavaScript. Nous savons que vous voulez en écrire plus. Nous ne pouvons pas accepter d'attendre 5-10 ans pour qu'une solution native de modules JS soit disponible dans tous les navigateurs avant que nous puissions organiser notre JavaScript d'une manière maintenable.

source: 3. You do not need a build step to develop in AMD.
fr: 3. Vous n'avez pas besoin d'une étape de build pour développer avec AMD.

source: We like the edit-refresh cycle of web development. We wanted to make sure everyone developing in Elgg could continue experiencing that joy. Synchronous module formats like Closure or CommonJS just weren't an option for us. But even though AMD doesn't require a build step, *it is still very build-friendly*. Because of the ``define()`` wrapper, it's possible to concatenate multiple modules into a single file and ship them all at once in a production environment. [#]_
fr: Nous apprécions le cycle édition-mise à jour ("edit-refresh")du web. Nous voulions faire en sorte que toute personne qui développe avec Elgg puisse continuer à expérimenter ce plaisir. Des formats de modules synchrones comme Closure ou CommonJS n'étaient tout simplement pas une option pour nous. Mais même si AMD n'a pas besoin d'une étape de build, *il reste cependant très adapté pour le build*. A cause du wrapper ``define()``, il est possible de concaténer de multiples modules dans un seul fichier et de livrer l'ensemble en une seule fois dans un environnement de production. [#]_

source: AMD is a battle-tested and well thought out module loading system for the web today. We're very thankful for the work that has gone into it, and are excited to offer it as the standard solution for JavaScript development in Elgg starting with Elgg 1.9.
fr: AMD est un système de chargement de modules largement éprouvé et bien pensé pour le web d'aujourd'hui. Nous avons beaucoup de gratitude pour le travail qui a été mis dedans, et sommes excités de l'offrir comme la solution standard pour le développement JavaScript dans Elgg à partir de Elgg 1.9.

source: This is not currently supported by Elgg core, but we'll be looking into it since reducing round-trips is critical for a good first-view experience, especially on mobile devices.
fr: Ceci n'est pas encore supporté par le noyau Elgg, mais nous sommes en train de nous pencher dessus dans la mesure où la réduction des allers-retours est critique pour une bonne première expérience, particulièrement sur les appareils mobiles.

source: Database
fr: Base de données

source: A thorough discussion of Elgg's data model design and motivation.
fr: Une discussion solide sur le design du modèle de données Elgg et ses motivations.

source: In Elgg, everything runs on a unified data model based on atomic units of data called entities.
fr: Dans Elgg, tout fonctionne sur un modèle de données unifié construit sur des unités atomiques de données appelées entités

source: Plugins are discouraged from interacting directly with the database, which creates a more stable system and a better user experience because content created by different plugins can be mixed together in consistent ways. With this approach, plugins are faster to develop, and are at the same time much more powerful.
fr: Il est recommandé que les plugins n'interagissent pas directement avec la base de données, afin de créer un système plus stable et une meilleure expérience utilisateur parce que les contenus créés par différents plugins peut être mélangés ensemble de manières cohérentes. Avec cette approche, les plugins sont plus rapides à développer, et sont en même temps plus puissants.

source: Every entity in the system inherits the ``ElggEntity`` class. This class controls access permissions, ownership, containment and provides consistent API for accessing and updating entity properties.
fr: Chaque entité dans le système hérite de la classe ``ElggEntity``. Cette classe contrôle les permissions d'accès, la propriété, le conteneur, et fournit une API cohérente pour accéder aux propriétés des entités et les modifier.

source: You can extend entities with extra information in two ways:
fr: Vous pouvez étendre les entités avec des informations supplémentaires de deux manières :

source: ``Metadata``: This information describes the entity, it is usually
fr: ``Metadata`` : Ces informations décrivent l'entité, elles sont habituellement

source: added by the author of the entity when the entity is created or updated. Examples of metadata include tags, ISBN number or a third-party ID, location, geocoordinates etc. Think of metadata as a simple key-value storage.
fr: ajoutées par l'auteur de l'entité quand l'entité est créée ou modifiée. Des exemples de métadonnées incluent les tags, un numéro ISBN ou un ID tierce-partie, une adresse, des coordonnées géographiques, etc. Imaginez les métadonnées comme un simple système de stockage clef-valeur.

source: ``Annotations``: This information extends the entity with properties usually
fr: ``Annotations`` : Ces informations étendent l'entité avec des propriétés, habituellement

source: added by a third party. Such properties include ratings, likes, and votes.
fr: ajoutées par une tierce-partie. De telles propriétés comprennent les notations, likes et votes.

source: The main differences between metadata and annotations:
fr: La principale différence entre métadonnées et annotations :

source: metadata does not have owners, while annotations do
fr: les métadonnées n'ont pas de propriétaire, alors que les annotations en ont

source: metadata is not access controlled, while annotations are
fr: les métadonnées ne disposent pas de contrôle d'accès, alors que les annotations en disposent

source: metadata is preloaded when entity is constructed, while annotations are only loaded on demand
fr: les métadonnées sont préchargées lorsque l'entité est construite, alors que les annotations ne sont chargées que sur demande

source: These differences might have implications for performance and your business logic, so consider carefully, how you would like to attach data to your entities.
fr: Ces différences peuvent avoir des implications sur les performances et votre logique applicative, aussi considérez avec soin la manière dont vous souhaiter attacher des données à vos entités.

source: In certain cases, it may be benefitial to avoid using metadata and annotations and create new entities instead and attaching them via ``container_guid`` or a relationship.
fr: Dans certains cas, il peut être préférable d'éviter d'utiliser ces métadonnées et annotations et de créer de nouvelles entités à la place, puis de les attacher via ``container_guid`` ou une relation.

source: Datamodel
fr: Modèle de données (datamodel)

source: The Elgg data model diagram
fr: Le diagramme du modèle de données d'Elgg

source: Entities
fr: Entités

source: ``ElggEntity`` is the base class for the Elgg data model and supports a common set of properties and methods.
fr: ``ElggEntity`` est la classe de base pour le modèle de données d'Elgg et supporte un jeu de propriétés et méthodes communes.

source: A numeric Globally Unique IDentifier (See `GUIDs`_).
fr: Un identifiant global unique (Globally Unique IDentifier - Voir `GUIDs`_).

source: Access permissions. (When a plugin requests data, it never gets to touch data that the current user doesn't have permission to see.)
fr: Permissions d'accès . (Quand un plugin demande des données, il n'accède jamais à des données que l'utilisateur actuel n'a pas la permission de voir.)

source: An arbitrary subtype (more below).
fr: Un sous-type arbitraire (plus d'informations ci-dessous).

source: An owner.
fr: Un propriétaire (owner).

source: The site that the entity belongs to.
fr: Le site auquel appartient cette entité.

source: A container, used to associate content with a group or a user.
fr: Un conteneur, utilisé pour associer le contenu avec un groupe ou un utilisateur.

source: *Actual* entities will be instances of four different subclasses, each having a distinct **type** property and their own additional properties and methods.
fr: Les *véritables* entités seront des instances de quatre sous-classes différentes, chacune ayant une propriété **type** distincte et leur propres propriétés et méthodes additionnelles.

source: PHP class
fr: Classe PHP

source: Represents
fr: Représente

source: object
fr: objet

source: Most user-created content, like blog posts, uploads, and bookmarks.
fr: Les plupart des contenus créés par les utilisateurs, tels que des articles de blog, des chargements de fichiers, et des signets.

source: group
fr: groupe

source: An organized group of users with its own profile page
fr: Un groupe organisé d'utilisateurs avec sa propre page de profil

source: user
fr: utilisateur

source: A user of the system
fr: Un utilisateur du système

source: The site served by the Elgg installation
fr: Le site servi par l'installation Elgg

source: Each type has its own extended API. E.g. users can be friends with other users, group can have members, while objects can be liked and commented on.
fr: Chaque type a sa propre API étendue. Par ex. les utilisateurs peuvent être en contact avec d'autres utilisateurs, un groupe peut avoir des membres, tandis que les objets peuvent être "likés" et commentés.

source: Subtypes
fr: Sous-types (subtypes)

source: Each entity must define a **subtype**, which plugins use to further specialize the entity. Elgg makes it easy to query specific for entities of a given subtype(s), as well as assign them special behaviors and views.
fr: Chaque entité doit définir un **sous-type** (subtype), que les plugins utilisent pour spécialiser encore l'entité. Elgg rend facile le fait de rechercher des entités spécifiques d'un ou de plusieurs sous-types donnés, ainsi que de leur assigner des comportements et vues spéciales.

source: Subtypes are most commonly given to instances of ``ElggEntity`` to denote the kind of content created. E.g. the blog plugin creates objects with subtype ``"blog"``.
fr: Les sous-types sont communément donnés aux instances de ``ElggEntity`` pour définir le type de contenu créé. Par ex. le plugin blog crée des objets avec le sous-type ``"blog"``.

source: By default, users, groups and sites have the the subtypes of ``user``, ``group`` and ``site`` respectively.
fr: Par défaut, les utilisateurs, les groupes et les sites ont respectivement le sous-type ``user``, ``group`` et ``site``.

source: Plugins can use custom entity classes that extend the base type class. To do so, they need to register their class at runtime (e.g. in the ``'init','system'`` handler), using ``elgg_set_entity_class()``. For example, the blog plugin could use ``elgg_set_entity_class('object', 'blog', \ElggBlog::class)``.
fr: Les plugins peuvent utiliser des classes d'entités personnalisées qui étendent l classe de base du type. Pour cela, ils doivent enregistrer leur classe au démarrage (par ex. dans le gestionnaire ``'init','system'``), en utilisant ``elgg_set_entity_class()``. Par exemple, le plugin blog pourraity utiliser ``elgg_set_entity_class('object', 'blog', \ElggBlog::class)``.

source: Plugins can use ``elgg-plugin.php`` to define entity class via shortcut ``entities`` parameter.
fr: Les plugins peuvent utiliser ``elgg-plugin.php`` pour définir une classe d'entité via le paramètre raccourci ``entities``.

source: Subtype Gotchas
fr: Trucs à savoir sur les sous-types

source: Before an entity's ``save()`` method is called, the subtype must be set by writing a string to the ``subtype`` property.
fr: Avant que la méthode ``save()`` d'une entité soit appelée, le sous-type doit être défini en écrivant une chaîne de caractère dans la propriété ``subtype``.

source: *Subtype cannot be changed after saving.*
fr: *Le sous-type ne peut pas être changé après l'enregistrement.*

source: A GUID is an integer that uniquely identifies every entity in an Elgg installation (a Globally Unique IDentifier). It's assigned automatically when the entity is first saved and can never be changed.
fr: Un GUID est un entier qui définit de manière unique chaque entité dans une installation Elgg (un IDentifiant Global Unique - Globally Unique IDentifier). Il est assigné automatiquement la première fois qu'une entité est enregistré, et ne peut jamais être changé.

source: Some Elgg API functions work with GUIDs instead of ``ElggEntity`` objects.
fr: Certaines fonctions de l'API Elgg focntionnenet avec des GUIDs au lieu d'objets ``ElggEntity``.

source: The ``ElggObject`` entity type represents arbitrary content within an Elgg install; things like blog posts, uploaded files, etc.
fr: Le type d'entité ``ElggObject`` représente un type de contenu arbitraire au sein d'une installation Elgg ; des choses telles que des articles de blog, des fichiers, etc.

source: Beyond the standard ElggEntity properties, ElggObjects also support:
fr: Au-delà des propriétés standards de ElggEntity, ElggObjects supporte également :

source: ``title`` The title of the object (HTML escaped text)
fr: ``title`` Le titre de l'objet (texte sans HTML)

source: ``description`` A description of the object (HTML)
fr: ``description`` Une description de l'objet (HTML)

source: Most other data about the object is generally stored via metadata.
fr: La plupart des autrse données à propos de l'objet sont généralement stockées via des métadonnées.

source: The ``ElggUser`` entity type represents users within an Elgg install. These will be set to disabled until their accounts have been activated (unless they were created from within the admin panel).
fr: Le type d'entité ``ElggUser`` représente les utilisateurs au sien d'une installation Elgg. Il seront définis comme désactivés jusqu'à-ce que leur compte ait été activé (à moins qu'ils n'aient été créés à partir du panneau d'administration).

source: Beyond the standard ElggEntity properties, ElggUsers also support:
fr: Au-delà des propriétés standards de ElggEntity, ElggUsers supporte également :

source: ``name`` The user's plain text name. e.g. "Hugh Jackman"
fr: ``name`` Le nom de l'utilisateur en texte brut. Par ex. "Hugh Jackman"

source: ``username`` Their login name. E.g. "hjackman"
fr: ``username`` Leur nom d'utilisateur. Par ex. "hjackman"

source: ``password`` A hashed version of their password
fr: ``password`` Une version hachée de leur mot de passe

source: ``email`` Their email address
fr: ``email`` Leur adresse email

source: ``language`` Their default language code.
fr: ``language`` Leur code de langue par défaut.

source: ``code`` Their session code (moved to a separate table in 1.9).
fr: ``code`` Leur code de session (déplacé vers une table séparée dans la 1.9).

source: ``last_action`` The UNIX timestamp of the last time they loaded a page
fr: ``last_action`` Le timestamp UNIX de la dernière fois qu'ils ont chargé une page

source: ``prev_last_action`` The previous value of ``last_action``
fr: ``prev_last_action`` La précédente valeur de ``last_action``

source: ``last_login`` The UNIX timestamp of their last log in
fr: ``last_login`` Le timestamp UNIX de leur dernière connexion

source: ``prev_last_login`` the previous value of ``last_login``
fr: ``prev_last_login`` la précédente valeur de ``last_login``

source: The ``ElggSite`` entity type represents your Elgg installation (via your site URL).
fr: Le type d'entité ``ElggSite`` représente votre installation Elgg (via l'URL de votre site).

source: Beyond the standard ElggEntity properties, ElggSites also support:
fr: Au-delà des propriétés standards de ElggEntity, ElggSites supporte également :

source: ``name`` The site name
fr: ``name`` Le nom du site

source: ``description`` A description of the site
fr: ``description`` Une description du site

source: ``url`` The address of the site
fr: ``url`` L'adresse du site

source: The ``ElggGroup`` entity type represents an association of Elgg users. Users can join, leave, and post content to groups.
fr: Le type d'entité ``ElggGroup`` représente une association d'utilisateurs Elgg. Les utilisateurs peuvent rejoindre, quitter les groupes, et y publier du contenu.

source: Beyond the standard ElggEntity properties, ElggGroups also support:
fr: Au-delà des propriétés standards de ElggEntity, ElggGroups supporte également :

source: ``name`` The group's name (HTML escaped text)
fr: ``name`` Le nom du groupe (texte sans HTML)

source: ``description`` A description of the group (HTML)
fr: ``description`` Une description du groupe (HTML)

source: ``ElggGroup`` has addition methods to manage content and membership.
fr: ``ElggGroup`` a des méthodes additionnelles pour gérer le contenu et les adhésions.

source: The Groups plugin
fr: Le plugin Groups

source: Not to be confused with the entity type ``ElggGroup``, Elgg comes with a plugin called "Groups" that provides a default UI/UX for site users to interact with groups. Each group is given a discussion forum and a profile page linking users to content within the group.
fr: A ne pas confondre avec le type d'entité ``ElggGroup``, Elgg vient avec un plugin appelé "Groups" qui fournit une UI/UX par défaut pour que les utilisateurs du site interagissent avec les groupes. Chaque groupe dispose d'un forum de discussion et d'une page de profil qui relient les utilisateurs au contenu dans le groupe..
