Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/design.po
Languages: fr

source: All data retrieval functions above the database layer - for example ``elgg_get_entities`` will only return items that the current user has access to see. It is not possible to retrieve items that the current user does not have access to. This makes it very hard to create a security hole for retrieval.
fr: Toutes les récupérations de données fonctionnent au-dessus de la couche de la base de données - par exemple ``elgg_get_entities`` ne retournera que les éléments que l'utilisateur actuel a l'autorisation de voir. Il n'est pas possible de récupérer des éléments auxquels l’utilisateur actuel n'a pas accès. Ceci rend très difficile de créer un trou de sécurité pour récupérer des données.

source: Write access
fr: Accès en écriture

source: The following rules govern write access:
fr: Les règles suivantes gouvernent les accès en écriture :

source: The owner of an entity can always edit it
fr: Le propriétaire d'une entité peut toujours la modifier

source: The owner of a container can edit anything therein (note that this does not mean that the owner of a group can edit anything therein)
fr: Le propriétaire d'un conteneur peut modifier tout ce qui est dedans (notez que cela ne signifie pas que le propriétaire d'un groupe peut modifier toutes les publications dans ce groupe)

source: Admins can edit anything
fr: Les administrateurs peuvent tout éditer

source: You can override this behaviour using a :ref:`plugin hook <design/events#plugin-hooks>` called ``permissions_check``, which passes the entity in question to any function that has announced it wants to be referenced. Returning ``true`` will allow write access; returning ``false`` will deny it. See :ref:`the plugin hook reference for permissions\_check <guides/hooks-list#permission-hooks>` for more details.
fr: Vous pouvez surcharger ce comportement en utilisant un :ref:`hook plugin <design/events#plugin-hooks>` appelé ``permissions_check``, qui passe l'entité en question à toute focntion qui a annoncé qu'elles veut être référencée. Retourner ``true`` va autoriser l'accès en écriture ; retourner ``false`` va l'interdire. Voyez :ref:`les références des plugin hook pour les permissions\_check <guides/hooks-list#permission-hooks>` pour plus de détails.

source: Schema
fr: Schéma

source: The database contains a number of primary and secondary tables. You can follow schema changes in ``engine/schema/migrations/``
fr: La base de données contient un certain nombre de tables primaires et secondaires. Vous pouvez suivre les évolutions du schéma dans ``engine/schema/migrations/``

source: Main tables
fr: Tables principales

source: This is a description of the main tables. Keep in mind that in a given Elgg installation, the tables will have a prefix (typically "elgg\_").
fr: Voici la description des tables principales. Gardez à l'esprit que pour une installation d'Elgg données les tables vont avoir un préfixe (typiquement "elgg\_").

source: Table: entities
fr: Table : entities (entités)

source: This is the main `Entities`_ table containing Elgg users, sites, objects and groups. When you first install Elgg this is automatically populated with your first site.
fr: Ceci est la table principale `Entities`_ qui contient les utilisateurs, sites, objets et groupes Elgg. Quand vous installez Elgg la première fois elle est automatiquement peuplée avec votre premier site.

source: It contains the following fields:
fr: Elles contient les champs suivants :

source: **guid** An auto-incrementing counter producing a GUID that uniquely identifies this entity in the system
fr: **guid** Un compteur auto-incrémenté qui poduit un GUID qui identifie de manière unique cette entité dans le système

source: **type** The type of entity - object, user, group or site
fr: **type** Le type d'entity - object, user, group ou site

source: **subtype** A subtype of entity
fr: **subtype** Le sous-type d'entité

source: **owner\_guid** The GUID of the owner's entity
fr: **owner\_guid** Le GUID de l'entité du propriétaire

source: **container\_guid** The GUID this entity is contained by - either a user or a group
fr: **container\_guid** Le GUID dans laquelle cette entité est contenue - soit un utilisateur (user) soit un groupe (group)

source: **access\_id** Access controls on this entity
fr: **access\_id** Contrôles d'accès sur cette entité

source: **time\_created** Unix timestamp of when the entity is created
fr: **time\_created** Le timestamp Unix de création de l'entité

source: **time\_updated** Unix timestamp of when the entity was updated
fr: **time\_updated** Le timestamp Unix de la dernière modification de l'entité

source: **enabled** If this is 'yes' an entity is accessible, if 'no' the entity has been disabled (Elgg treats it as if it were deleted without actually removing it from the database)
fr: **enabled** Si oui ('yes') l'entité est accessible, si non ('no') l'entité a été désactivée (Elgg traite cela comme si elle avait été supprimée sans toutefois la supprimer réellement de la base de données)

source: This table contains `Metadata`_, extra information attached to an entity.
fr: Cette table contient des métadonnées `Metadata`_, des informations supplémentaires attachées à une entité.

source: **id** A unique IDentifier
fr: **id** Un IDentifiant unique

source: **entity\_guid** The entity this is attached to
fr: **entity\_guid** L'entité à laquelle cette métadonnée est attachée

source: **name** The name string
fr: **name** Le nom de la chaîne

source: **value** The value string
fr: **value** La valeur de la chaîne

source: **value\_type** The value class, either text or an integer
fr: **value\_type** La classe de la valeur, soit texte (text) ou un entier (integer)

source: **time\_created** Unix timestamp of when the metadata is created
fr: **time\_created** Le timestamp Unix de la date de création de la métadonnée

source: **enabled** If this is 'yes' an item is accessible, if 'no' the item has been disabled
fr: **enabled** Si oui ('yes') l'élément est accessible, si non ('no') l'élément a été désactivé

source: This table contains `Annotations`_, this is distinct from `Metadata`_.
fr: Cette table contient les `Annotations`_, ce qui est distinct des `Metadata`_.

source: **owner\_guid** The owner GUID of the owner who set this annotation
fr: **owner\_guid** Le GUID du propriétaire qui a défini cette annotation

source: **access\_id** An Access controls on this annotation
fr: **access\_id** Un Contrôle d'Accès sur cette annotation

source: **time\_created** Unix timestamp of when the annotation is created.
fr: **time\_created** Le timestamp Unix de la date de création de l'annotation.

source: Table: relationships
fr: Table : relationships (relations)

source: This table defines `Relationships`_, these link one entity with another.
fr: Cette table définit les `Relationships`_, qui relient une entité avec une autre.

source: **guid\_one** The GUID of the subject entity.
fr: **guid\_one** Le GUID de l'entité sujet.

source: **relationship** The type of the relationship.
fr: **relationship** Le type de relation.

source: **guid\_two** The GUID of the target entity.
fr: **guid\_two** Le GUID de l'entité cible.

source: Secundairy tables
fr: Tables secondaires

source: This table defines Access Collections, which grant users access to `Entities`_ or `Annotations`_.
fr: Cette table définit les Collections d'Accès, qui donnent accès aux utilisateurs aux `Entités`_ ou aux `Annotations`_.

source: ***name** The name of the access collection
fr: ***name** Le nom de la collection d'accès

source: **owner_guid** The GUID of the owning entity (eg. a user or a group)
fr: **owner_guid** Le GUID de l'entité propriétaire (par ex. un utilisateur ou un groupe)

source: **subtype** the subtype of the access collection (eg. `friends` or `group_acl`)
fr: **subtype** le sous-type de la collection d'accès (par ex. `friends` ou `group_acl`)

source: Events and Plugin Hooks
fr: Événements et Hooks des plugins

source: Elgg has an event system that can be used to replace or extend core functionality.
fr: Elgg a un événement système qui peut être utilisé pour remplacer ou étendre les fonctionnalités du noyau.

source: Plugins influence the system by creating handlers (`callables <http://php.net/manual/en/language.types.callable.php>`_ such as functions and methods) and registering them to handle two types of events: :ref:`design/events#events` and :ref:`design/events#plugin-hooks`.
fr: Les plugins influencent le système en créant des gestionnaires ou handlers (`appelables <http://php.net/manual/en/language.types.callable.php>`_ tels que des fonctions et des méthodes) et en les enregistrant pour gérer deux types d'événements : :ref:`design/events#events` et :ref:`design/events#plugin-hooks`.

source: When an event is triggered, a set of handlers is executed in order of priority. Each handler is passed arguments and has a chance to influence the process. After execution, the "trigger" function returns a value based on the behavior of the handlers.
fr: Quand un événement est déclenché, un jeu des gestionnaires (handlers) est exécuté par ordre de priorité. Les arguments sont passés à chaque gestionnaire qui peut influencer le processus. Après exécution, la fonction déclencheuse ("trigger") retourne une valeur qui dépend du comportement des gestionnaires.

source: Elgg Events vs. Plugin Hooks
fr: Evénements Elgg (Events) vs. Hooks des Plugins

source: The main differences between :ref:`design/events#events` and :ref:`design/events#plugin-hooks` are:
fr: Les principales différences entre :ref:`design/events#events` et :ref:`design/events#plugin-hooks` sont :

source: Most Elgg events can be cancelled; unless the event is an "after" event, a handler that returns `false` can cancel the event, and no more handlers are called.
fr: La majorité des événements Elgg peuvent être annulé ; à moins que l'événement soit un événement "after", un gestionnaire qui retourne `false` peut annuler l'événement, et plus aucun autre gestionnaire n'est appelé.

source: Plugin hooks cannot be cancelled; all handlers are always called.
fr: Les hooks plugin ne peuvent pas être annulé ; tous les gestionnaires sont toujours appelés.

source: Plugin hooks pass an arbitrary value through the handlers, giving each a chance to alter along the way.
fr: Les hooks lugin passent une valeur arbitraire à travers les gestionnaires, leur donnant à chacun une chance de la modifier en cours de route.

source: Elgg Events
fr: Evénements Elgg (Events)

source: Elgg Events are triggered when an Elgg object is created, updated, or deleted; and at important milestones while the Elgg framework is loading. Examples: a blog post being created or a user logging in.
fr: Les événements Elgg Events sont déclenchés quand un objet Elgg est créé, modifié ou supprimé ; et à différentes étapes importantes du chargement du framework Elgg. Exemples : lors de la création d'un article de blog ou de l'identification d'un utilisateur.

source: Unlike :ref:`design/events#plugin-hooks`, *most Elgg events can be cancelled*, halting the execution of the handlers, and possibly cancelling an some action in the Elgg core.
fr: Contrairement aux :ref:`design/events#plugin-hooks`, *la plupart des événements Elgg peuvent être annulé*, ce qui interrompt l'exécution des gestionnaires, et potentiellement annulent certaines actions dans le noyau d'Elgg.

source: Each Elgg event has a name and an object type (system, user, object, relationship name, annotation, group) describing the type of object passed to the handlers.
fr: Chaque événement Elgg a un nom et un type d'objet (system, user, object, nom de relation, annotation, group) qui décrit le type d'objet passé aux gestionnaires.

source: Before and After Events
fr: Événements Avant (Before) et Après (After)

source: Some events are split into "before" and "after". This avoids confusion around the state of the system while in flux. E.g. Is the user logged in during the [login, user] event?
fr: Certains événements sont séparés en "before" (avant) et "after" (après). Ceci évite la confusion autour de l'état fluctuant du système. Par ex. Est-ce que l'utilisateur est identifié au cours de l'événement [login, user]?

source: Before Events have names ending in ":before" and are triggered before something happens. Like traditional events, handlers can cancel the event by returning ``false``.
fr: Les événements Avant ont des noms qui se terminent par ":before" et sont exécutés avant qu'il ne se passe quelque chose. Comme pour les événements traditionnels, les gestionnaires peuvent annuler l'événement en retournant ``false``.

source: After Events, with names ending in ":after", are triggered after something happens. Unlike traditional events, handlers *cannot* cancel these events; all handlers will always be called.
fr: Les événements Après, avec des noms qui se terminent par ":after", sont exécutés après qu'il se soit passé quelque chose. Au contraire des événements traditionnels, ces gestionnaires *ne peuvent pas* annuler ces événements ; tous les gestionnaires seront toujours appelés.

source: Where before and after events are available, developers are encouraged to transition to them, though older events will be supported for backwards compatibility.
fr: Là où des événements :before et :after sont disponibles, les développeurs sont encouragés à faire la transition vers eux, même si d'anciens événements resteront supportés pour des raisons de compatibilité descendante.

source: Elgg Event Handlers
fr: Gestionnaires d'événement Elgg (Event Handlers)

source: Elgg event handlers are callables with one of the following prototypes:
fr: Les gestionnaires d'événement Elgg sont appelables avec l'un des prototypes suivants :

source: In ``event_handler1``, the ``Event`` object has various methods for getting the name, object type, and object of the event. See the ``Elgg\Event`` interface for details.
fr: Dans ``event_handler1``, l'objet ``Event`` a diverses méthodes pour récupérer le nom, le type d'objet, et l'objet de l'événement. Voyez l'interface ``Elgg\Event`` pour plus de détails.

source: In both cases, if a handler returns ``false``, the event is cancelled, preventing execution of the other handlers. All other return values are ignored.
fr: Dans tous les cas, si un gestionnaire retourne ``false``, l'événement est annulé, ce qui empêche l'exécution des autres gestionnaires. Toutes les autres valeurs de retour sont ignorées.

source: If the event type is "object" or "user", use type hint ``\Elgg\ObjectEvent`` or ``\Elgg\UserEvent`` instead, which clarify the return type of the ``getObject()`` method.
fr: Si le type d'événement est "object" ou "user", utilisez le type de données ``\Elgg\ObjectEvent`` ou ``\Elgg\UserEvent`` à la place, ce qui clarifie le type de retour de la méthode ``getObject()``.

source: Register to handle an Elgg Event
fr: Enregistrez un gestionnaire d'événement (Elgg Event)

source: Register your handler to an event using ``elgg_register_event_handler``:
fr: Enregistrez votre gestionnaire pour un événement en utilisant ``elgg_register_event_handler`` :

source: Parameters:
fr: Paramètres :

source: **$event** The event name.
fr: **$event** Le nom de l'événement.

source: **$object_type** The object type (e.g. "user" or "object") or 'all' for all types on which the event is fired.
fr: **$object_type** Le type d'objet (par ex. "user" ou "object") ou 'all' pour tous les types pour lesquels l'événement est déclenché.

source: **$handler** The callback of the handler function.
fr: **$handler** Le callback ou la fonction gestionnaire.

source: **$priority** The priority - 0 is first and the default is 500.
fr: **$priority** La priorité - 0 en premier et la valeur par défaut est 500.

source: **Object** here does not refer to an ``ElggObject`` but rather a string describing any object in the framework: system, user, object, relationship, annotation, group.
fr: **Objet** ne fait pas ici référence à un ``ElggObject`` mais plutôt à une chaîne de caractères qui décrit n'importe quel objet dans le framework : le système, un utilisateur, un objet, une relation, une annotation, un groupe.

source: Example:
fr: Exemple :

source: If you handle the "update" event on an object, avoid calling ``save()`` in your event handler. For one it's probably not necessary as the object is saved after the event completes, but also because ``save()`` calls another "update" event and makes ``$object->getOriginalAttributes()`` no longer available.
fr: Si vous gérez l'événement "update" d'un objet, évitez d'appeler ``save()`` dans votre gestionnaire d'événement. Tout d'abord ce n'est probablement pas nécessaire car l'objet est enregistré après que l'événement soit terminé, mais aussi parce que ``save()`` appelle un autre événement "update" et ne rend plus disponible ``$object->getOriginalAttributes()``.

source: Invokable classes as handlers
fr: Classes invocables comme gestionnaires

source: You may use a class with an ``__invoke()`` method as a handler. Just register the class name and it will be instantiated (with no arguments) for the lifetime of the event (or hook).
fr: Vous pouvez utiliser une classe avec une méthode ``__invoke()`` comme gestionnaire. Enregistrez simplement le nom de la classe et elle sera instanciée (sans argument) pour toute la durée de vie de l'événement (ou du hook).

source: Trigger an Elgg Event
fr: Déclencher un événement (Elgg Event)

source: You can trigger a custom Elgg event using ``elgg_trigger_event``:
fr: Vous pouvez déclencher un événement personnalisé en utilisant ``elgg_trigger_event`` :

source: For events with ambiguous states, like logging in a user, you should use :ref:`before-after` by calling ``elgg_trigger_before_event`` or ``elgg_trigger_after_event``. This makes it clear for the event handler what state to expect and which events can be cancelled.
fr: Pour les événements avec des états ambigus, tels que l'identification d'un utilisateur, vous devriez utiliser :ref:`before-after` en appelant ``elgg_trigger_before_event`` ou ``elgg_trigger_after_event``. Ceci clarifie pour le gestionnaire d'événement l'état auquel attendre et quels événements peuvent être annulés.

source: **$object_type** The object type (e.g. "user" or "object").
fr: **$object_type** Le type d'objet (par ex. "user" ou "object").

source: **$object** The object (e.g. an instance of ``ElggUser`` or ``ElggGroup``)
fr: **$object** L'objet (par ex. une instance de ``ElggUser`` ou ``ElggGroup``)

source: The function will return ``false`` if any of the selected handlers returned ``false`` and the event is stoppable, otherwise it will return ``true``.
fr: La fonction va retourner ``false`` si n'importe lequel des gestionnaires sélectionnés retourne ``false`` et si l'événement est interruptible, sinon elle retournera ``true``.

source: Plugin Hooks
fr: Hooks des plugins

source: Plugin Hooks provide a way for plugins to collaboratively determine or alter a value. For example, to decide whether a user has permission to edit an entity or to add additional configuration options to a plugin.
fr: Les Hooks Plugin fournissent un moyen pour les plugins de déterminer ou de modifier collaborativement une valeur. Par exemple, pour décider si un utilisateur a la permission de modifier une entité ou d'ajouter des options de configurations supplémentaires à un plugin.

source: A plugin hook has a value passed into the trigger function, and each handler has an opportunity to alter the value before it's passed to the next handler. After the last handler has completed, the final value is returned by the trigger.
fr: Un hook plugin a une valeur passée à la fonction déclencheuse ("trigger"), et chaque gestionnaire a la possibilité de modifier cette valeur avant qu'elle soit passée au prochain gestionnaire. Après que le dernier gestionnaire a été exécuté, la valeur finale est retournée par le trigger.

source: Plugin Hook Handlers
fr: Gestionnaires des Hooks plugin

source: Hook handlers are callables with one of the following prototypes:
fr: Les gestionnaires de hooks sont appelables avec l'un des prototypes suivants :

source: In ``plugin_hook_handler1``, the ``Hook`` object has various methods for getting the name, type, value, and parameters of the hook. See the ``Elgg\Hook`` interface for details.
fr: Dans ``plugin_hook_handler1``, l'objet ``Hook`` a diverses méthodes pour récupérer le nom, le type, la valeur et les paramètres du hook. Voyez l'interface ``Elgg\Hook`` pour plus de détails.

source: In both cases, if the handler returns no value (or ``null`` explicitly), the plugin hook value is not altered. Otherwise the returned value becomes the new value of the plugin hook, and it will then be available as ``$hook->getValue()`` (or ``$value``) in the next handler.
fr: Dans les deux cas, si le gestionnaire ne retourne aucune valeur (ou explicitement la valeur ``null``), la valeur du hook plugin n'est pas modifiée. Dans le cas contraire, la valeur retournée devient la nouvelle valeur du hook plugin, et il deviendra alors disponible via ``$hook->getValue()`` (ou ``$value``) dans le prochain gestionnaire.

source: Register to handle a Plugin Hook
fr: Enregistrez un gestionnaire de Hook plugin

source: Register your handler to a plugin hook using ``elgg_register_plugin_hook_handler``:
fr: Enregistrez votre gestionnaire pour un hook plugin en utilisant ``elgg_register_plugin_hook_handler`` :

source: **$hook** The name of the plugin hook.
fr: **$hook** Le nom du hook plugin.

source: **$type** The type of the hook or 'all' for all types.
fr: **$type** Le type de hook, ou 'all' pour tous les types.

source: **Type** can vary in meaning. It may mean an Elgg entity type or something specific to the plugin hook name.
fr: **Type** peut avoir des sens différents. Cela peut signifier un type d'entité Elgg ou quelque chose de spécifique au nom du hook plugin.

source: Trigger a Plugin Hook
fr: Déclencher un Hook plugin

source: You can trigger a custom plugin hook using ``elgg_trigger_plugin_hook``:
fr: Vous pouvez déclencher un plugin hook personnalisé en utilisant ``elgg_trigger_plugin_hook`` :

source: **$params** Arbitrary data passed from the trigger to the handlers.
fr: **$params** Des données arbitraires passées par le déclencheur aux gestionnaires.

source: **$value** The initial value of the plugin hook.
fr: **$value** La valeur initiale du hook plugin.

source: The `$params` and `$value` arguments are reversed between the plugin hook handlers and trigger functions!
fr: Les arguments `$params` et `$value` sont inversés entre les gestionnaires de hook plugin et les focntions de déclenchement !

source: Unregister Event/Hook Handlers
fr: Dé-enregistrer des gestionnaires d'événement ou de hook

source: The functions ``elgg_unregister_event_handler`` and ``elgg_unregister_plugin_hook_handler`` can be used to remove handlers already registered by another plugin or Elgg core. The parameters are in the same order as the registration functions, except there's no priority parameter.
fr: Les fonctions ``elgg_unregister_event_handler`` et ``elgg_unregister_plugin_hook_handler`` peuvent être utilisées pour retirer des gestionnaires déjà enregistrés par un autre plugin ou le noyau d'Elgg. Les paramètres sont dans le même ordre que pour les fonctions d'enregistrement, excepté qu'il n'y a pas de paramètre de priorité.

source: Anonymous functions or invokable objects cannot be unregistered, but dynamic method callbacks can be unregistered by giving the static version of the callback:
fr: Les fonctions anonymes ou les objets invocables ne peuvent pas être enregistrés, mais des fonctions de rappel (callback) de méthode dynamique peuvent être dé-enregistrés en donnant la version statique de la fonction de rappel :
