Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/design.po
Languages: fr

source: Even though the event handler references a dynamic method call, the code above will successfully remove the handler.
fr: Même si le gestionnaire d'événement référence un appel à une méthode dynamique, le code ci-dessus va bien supprimer le gesitonnaire.

source: Handler Calling Order
fr: Ordre d'appel des gestionnaires

source: Handlers are called first in order of priority, then registration order.
fr: Les gestionnaires sont d'abord appelés par ordre de priorité, puis par ordre d'enregistrement.

source: Before Elgg 2.0, registering with the ``all`` keywords caused handlers to be called later, even if they were registered with lower priorities.
fr: Avant Elgg 2.0, l'enregistrement avec le mot-clef ``all`` provoquait un appel tardif des gestionnaires, même s'ils avaient été enregistrés avec des priorités plus faibles.

source: Internationalization
fr: Internationalisation

source: Elgg 1.0+ departs from previous versions in that it uses a custom text array rather than gettext. This improves system performance and reliability of the translation system.
fr: Elgg 1.0 et supérieur diffèrent des versions précédentes dans le sens où ces versions utilisent un tableau de valeur texte personnalisé plutôt que gettext. Ceci améliore la performance du système et la fiabilité du système de traduction.

source: TODO: more plz
fr: TODO : plus svp

source: Design Docs
fr: Docs de conception

source: Gain a deep understanding of how Elgg works and why it's built the way it is.
fr: Acquérez une compréhension profonde de comment fonctionne Elgg et de pourquoi il est construit de cette manière.

source: Loggable is an interface inherited by any class that wants events relating to its member objects to be saved to the system log. ``ElggEntity`` and ``ElggExtender`` both inherit ``Loggable``.
fr: Loggable iest une interface héritée par toute classe qui veut que les événements liés à ses objets membres soient enregistrés dans le journal système. ``ElggEntity`` et ``ElggExtender`` héritent tous deux de ``Loggable``.

source: Loggable defines several class methods that are used in saving to the default system log, and can be used to define your own (as well as for other purposes):
fr: Loggable définit plusieurs méthodes de classe qui sont utilisées pour l'enregistrement du journal système par défaut, et peuvent être utilisées pour définir vos propres journaux (ainsi que pour d'autres objectifs) :

source: ``getSystemLogID()`` Return a unique identifier for the object for storage in the system log. This is likely to be the object's GUID
fr: ``getSystemLogID()`` Retourne un identifiant unique pour l'objet à des fins de conservation dans le journal système. C'est généralement le GUID de l'objet

source: ``getClassName()`` Return the class name of the object
fr: ``getClassName()`` Retourne le nom de la classe de l'objet

source: ``getType()`` Return the object type
fr: ``getType()`` Retournr le type d'objet

source: ``getSubtype()`` Get the object subtype
fr: ``getSubtype()`` Récupère le sous-type de l'objet

source: ``getObjectFromID($id)`` For a given ID, return the object associated with it
fr: ``getObjectFromID($id)`` Pour un ID donné, retourne l'objet qui lui est associé

source: Database details
fr: Détails de la base de données

source: The default system log is stored in the ``system_log`` :doc:`database table <database>`. It contains the following fields:
fr: Le journal système par défaut est enregistré dans la table ``system_log`` de la :doc:`base de données <database>`. Il contient les champs suivants :

source: **id** - A unique numeric row ID
fr: **id** - Un identifiant numérique unique de la ligne

source: **object_id** - The GUID of the entity being acted upon
fr: **object_id** - Le GUID de l'entité sur laquelle l'action est effectuée

source: **object_class** - The class of the entity being acted upon (eg ElggObject)
fr: **object_class** - La classe de l'entitésur laquelle l'action est effectuée (par ex. ElggObject)

source: **object_type** - The type of the entity being acted upon (eg object)
fr: **object_type** - Le type d'entité sur laquelle l'action est effectuée (par ex. object)

source: **object_subtype** - The subtype of the entity being acted upon (eg blog)
fr: **object_subtype** - Le sous-type d'entité sur laquelle l'action est effectuée (par ex. blog)

source: **event** - The event being logged (eg create or update)
fr: **event** - L'événement enregistré (par ex. create ou update)

source: **performed_by_guid** - The GUID of the acting entity (the user performing the action)
fr: **performed_by_guid** - Le GUID de l'entité agissante (l'utilisateur qui réalise l'action)

source: **owner_guid** - The GUID of the user which owns the entity being acted upon
fr: **owner_guid** - Le GUID de l'utilisateur à qui appartient l'entité sur laquelle l'action est effectuée

source: **access_id** - The access restriction associated with this log entry
fr: **access_id** - Le niveau d'accès associé avec cette entrée de journal

source: **time_created** - The UNIX epoch timestamp of the time the event took place
fr: **time_created** - Le timestamp UNIX de la date de l'événement

source: Security
fr: Sécurité

source: Elgg's approach to the various security issues common to all web applications.
fr: L'approche d'Elgg pour les diverses questions de sécurité est commune à toutes les applications web.

source: To report a potential vulnerability in Elgg, email security@elgg.org.
fr: Pour signaler une vulnérabilité potentielle dans Elgg, envoyez un email à security@elgg.org.

source: Passwords
fr: Mots de passe

source: Password validation
fr: Validation du mot de passe

source: The only restriction that Elgg places on a password is that it must be at least 6 characters long by default, though this may be changed in ``/elgg-config/settings.php``. Additional criteria can be added by a plugin by registering for the ``registeruser:validate:password`` plugin hook.
fr: La seule restriction qu'Elgg impose sur le mot de passe est qu'il doit comporter au moins 6 caractères par défaut, quoique ceci puisse être changé dans ``/elgg-config/settings.php``. Des critères additionnels peuvent être ajoutés en enregistrant un plugin hook pour ``registeruser:validate:password``.

source: Password hashing
fr: Hachage du mot de passe

source: Passwords are never stored in plain text, only salted hashes produced with bcrypt. This is done via the standard ``password_hash()`` function. On older systems, the ``password-compat`` polyfill is used, but the algorithm is identical.
fr: Les mots de passe ne sont jamais stockés en clair, seulement sous forme de valeur de hachage avec sel produit par bcrypt. Ceci est effectué via la fonction standard ``password_hash()``. Sur des systèmes plus anciens, le polyfill ``password-compat`` est utilisé, mais l'algorithme est identique.

source: Elgg installations created before version 1.10 may have residual "legacy" password hashes created using salted MD5. These are migrated to bcrypt as users log in, and will be completely removed when a system is upgraded to Elgg 3.0. In the meantime we're happy to assist site owners to manually remove these legacy hashes, though it would force those users to reset their passwords.
fr: Les installations Elgg créées avant la version peuvent avoir des chaînes de hachage de mot de passe "historiques" résiduelles créées en utilisant MD5 avec sel. Elles ont été migrées vers bcrypt lorsque les utilisateurs se connectent, et seront totalement retirées lorsque le système est mis à niveau vers Elgg 3.0. Dans le même temps, nous sommes heureux d'assister les propriétaires de sites à retirer manuellement ces chaînes de hachage historique, même si cela force ces utilisateurs à réinitialiser leur mot de passe.

source: Password throttling
fr: Mitigation du mot de passe

source: Elgg has a password throttling mechanism to make dictionary attacks from the outside very difficult. A user is only allowed 5 login attempts over a 5 minute period.
fr: Elgg a un mécanisme de mitigation des mots de passe qui rend les attaques par dictionnaire depuis l'extérieur très difficiles. Un utilisateur n'est autorisé qu'à 5 tentatives de connexion par période de 5 minutes.

source: Password resetting
fr: Réinitialisation du mot de passe

source: If a user forgets his password, a new random password can be requested. After the request, an email is sent with a unique URL. When the user visits that URL, a new random password is sent to the user through email.
fr: Si un utilisateur oublie son mot de passe, la génération d'un nouveau mot de passe aléatoire peut être demandée. Après la demande, un email est envoyé avec une URL unique. Quand l'utilisateur visite cette URL, un nouveau mot de passe est envoyé par email à l'utilisateur.

source: Elgg uses PHP's session handling with custom handlers. Session data is stored in the database. The session cookie contains the session id that links the user to the browser. The user's metadata is stored in the session including GUID, username, email address.
fr: Elgg utilise la gestion des session PHP avec des gestionnaires personnalisés. Les données de sessions sont stockées dans la base de données. Le cookie de session contient l'id de session qui lie l’utilisateur au navigateur. Les métadonnées de l'utilisateur sont conservées dans la session, notamment le GUID, le nom d'utilisateur et l'adresse email.

source: The session's lifetime is controlled through the server's PHP configuration and additionally through options in the ``/elgg-config/settings.php``.
fr: La durée de vie de la session est contrôlée par la configuraiton PHP du serveur et additionnellement à travers les options dans le fichier ``/elgg-config/settings.php``.

source: Session fixation
fr: Fixation de session

source: Elgg protects against session fixation by regenerating the session id when a user logs in.
fr: Elgg protège contre la fixation de session en régénérant l'id de session lorsqu'un utilisateur se déconnecte.

source: "Remember me" cookie
fr: Cookie "Se souvenir de moi"

source: To allow users to stay logged in for a longer period of time regardless of whether the browser has been closed, Elgg uses a cookie (default called ``elggperm``) that contains what could be considered a super session identifier. This identifier is stored in a cookies table. When a session is being initiated, Elgg checks for the presence of the ``elggperm`` cookie. If it exists and the session code in the cookie matches the code in the cookies table, the corresponding user is automatically logged in.
fr: Afin de permettre aux utilisateurs de rester identifiés pour une période plus longue que le navigateur ait été fermé ou pas, Elgg utilise un cookie (nommé par défaut ``elggperm``) qui contient ce qui peut être considéré comme un super identifiant de session. Cet identifiant est conservé dans la tabel des cookies. Quand une session est initiée, Elgg vérifie la présence du cookie ``elggperm``. S'il existe et que le code de session dans le cookie correspond au code dans la table des cookies, l'utilisateur correspondant est automatiquement connecté.

source: When a user changes their password all existing permanent cookie codes are removed from the database.
fr: Lorsqu'un utilisateur change son mot de passe tous les cookies permanents sont supprimés de la base de données.

source: The lifetime of the persistent cookie can be controlled in the `/elgg-config/settings.php` file. The default lifetime is 30 days. The database records for the persistent cookies will be removed after the lifetime expired.
fr: La durée de vie des cookies persistants peut être contrôlée dans le fichier `/elgg-config/settings.php`. La durée de vie par défaut est de 30 jours. Les entrées de la base de données pour les cookies persistants seront supprimées après l'expiration de la durée de vie.

source: Alternative authentication
fr: Authentification alternative

source: This section is very hand-wavy
fr: Cette section est très lacunaire

source: To replace Elgg's default user authentication system, a plugin could replace the default ``login`` action with its own. Better would be to register a PAM handler using ``register_pam_handler()`` which handles the authentication of the user based on the new requirements.
fr: Pour remplacer le système d'authentification par défaut des utilisateurs d'Elgg, un plugin pourrait remplacer l'action par défaut ``login`` par sa propre action. Une meilleure alternative est d'enregistrer un gestionnaire d'authentification (PAM) en utilisant ``register_pam_handler()`` qui gère l'authentification des utilisateurs sur la base de nouvelles exigences.

source: You must enable SSL support on your server for any of these techniques to work.
fr: Vous devez activer le support de SSL sur votre serveur pour que chacune de ces techniques fonctionne.

source: You can serve your whole site over SSL by changing the site URL to include "https" instead of just "http".
fr: Vous pouvez servir l'ensemble de votre site par SSL en changeant l'URL du site pour inclure "https" au lieu de seulement "http".

source: Filtering is used in Elgg to make XSS attacks more difficult. The purpose of the filtering is to remove Javascript and other dangerous input from users.
fr: Le filtrage est utilisé dans Elgg pour rendre les attaques XSS plus difficiles. L'objectif du filtrage est de supprimer les JavaScript et autres saisies dangereuses des utilisateurs.

source: Filtering is performed through the function ``filter_tags()``. This function takes in a string and returns a filtered string. It triggers a ``validate, input`` plugin hook.
fr: Le filtrage est assuré à travers la fonction ``filter_tags()``. Cette fonction prend une chaîne de caractères et retourne une chaîne filtrée. Elle déclenche le hook plugin ``validate, input``.

source: By default Elgg comes with the htmLawed filtering code. Developers can drop in any additional or replacement filtering code as a plugin.
fr: Par défaut Elgg est fourni avec le code de filtrage htmLawed. Les développeurs peuvent ajouter n'importe quel code additionnel ou de remplacement sous forme de plugin.

source: The ``filter_tags()`` function is called on any user input as long as the input is obtained through a call to ``get_input()``. If for some reason a developer did not want to perform the default filtering on some user input, the ``get_input()`` function has a parameter for turning off filtering.
fr: La fonction ``filter_tags()`` est appelée pour chaque saisie utilisateur dès lors que la saisie est obtenue à travers un appel à ``get_input()``. Si pour quelque raison un développeur souhaite ne pas appliquer le filtrage par défaut sur certaines saisies utilisateur, la fonction ``get_input()`` a un paramètre pour désactiver le filtrage.

source: Elgg generates security tokens to prevent `cross-site request forgery`_. These are embedded in all forms and state-modifying AJAX requests as long as the correct API is used. Read more in the :doc:`/guides/actions` developer guide.
fr: Elgg génère des jetons de sécurité pour empêcher `la contrefaçon de requêtes inter-sites`_. Ceux-ci sont intégrés dans tous les formulaires et les requêtes AJAX modificatrices d'état dès lors que la bonne API est utilisée. Lisez-en plus dans le guide de développement :doc:`/guides/actions`.

source: Signed URLs
fr: URLs signées

source: It's possible to protect URLs with a unique signature. Read more in the :doc:`/guides/actions` developer guide.
fr: Il est possible de protéger les URLs avec une signature unique. Lisez-en plus dans le the :doc:`/guides/actions` Guide de dévelopement.

source: SQL Injection
fr: Injection SQL

source: Elgg's API sanitizes all input before issuing DB queries. Read more in the :doc:`/design/database` design doc.
fr: L'API d'Elgg's assainit toutes les entrées avant d'effectuer des requêtes en base de données. Lisez-en plus dans la documentation de design :doc:`/design/database`.

source: Privacy
fr: Vie privée

source: Elgg uses an ACL system to control which users have access to various pieces of content. Read more in the :doc:`/design/database` design doc.
fr: Elgg utilise un système d'ACL pour contrôler quels utilisateurs ont accès à divers éléments de contenu. Lisez-en plus dans la :doc:`/design/database` documentation de design.

source: Hardening
fr: Sécurisation

source: Site administrators can configure settings which will help with hardening the website. Read more in the Administrator guide :doc:`/admin/security`.
fr: Les administrateurs du site peuvent configurer les paramètres qui vont aider à sécuriser le site. Lisez-en plus dans le Guide d'administration :doc:`/admin/security`.
