Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/design.po
Languages: fr

source: You can alter the user experience via the traditional means of extending plugins or completely replace the Groups plugin with your own.
fr: Vous pouvez modifier l'expérience utilisateur via les moyens traditionnels d'extension de plugin, ou remplacer complètement le plugin Groups par votre propre plugin.

source: Writing a group-aware plugin
fr: Écrire un plugin conscient des groupes

source: Plugin owners need not worry too much about writing group-aware functionality, but there are a few key points:
fr: Les développeurs de plugins ne devraient pas trop s'inquiéter d'écrire une fonctionnalité consciente des groupes, mais il y a quelques points clefs :

source: Adding content
fr: Ajouter du contenu

source: By passing along the group as ``container_guid`` via a hidden input field, you can use a single form and action to add both user and group content.
fr: En passant le groupe en tant que ``container_guid`` via un champ de saisie caché, vous pouvez utiliser un seul formulaire et une seule action pour ajouter du contenu à la fois pour un utilisateur ou pour un groupe.

source: Use ``ElggEntity->canWriteToContainer()`` to determine whether or not the current user has the right to add content to a group.
fr: Utilisez ``ElggEntity->canWriteToContainer()`` pour déterminer si l'utilisateur actuel a ou n'a pas le droit d'ajouter du contenu dans un groupe.

source: Be aware that you will then need to pass the container GUID or username to the page responsible for posting and the accompanying value, so that this can then be stored in your form as a hidden input field, for easy passing to your actions. Within a "create" action, you'll need to take in this input field and save it as a property of your new element (defaulting to the current user's container):
fr: Soyez attentif au fait que vous allez devoir passer le GUID du conteneur ou le nom d'utilisateur à la page responsable de la publication et la valeur associée, de sorte que ceci puisse être ensuite conservé dans votre formulaire sous forme de champ de saisie caché, pour un passage plus aisé vers vos actions. Au sein d'une action "create", vous allez avoir besoin de récupérer ce champ de saisie et de l'enregistrer sous forme de propriété de votre nouvel élément (la valeur par défaut est le conteneur actuel de l'utilisateur) :

source: Juggling users and groups
fr: Jongler entre utilisateurs et groupes

source: In fact, ``[[Engine/DataModel/Entities/ElggGroup|ElggGroup]]`` simulates most of the methods of ``[[Engine/DataModel/Entities/ElggUser|ElggUser]]``. You can grab the icon, name etc using the same calls, and if you ask for a group's friends, you'll get its members. This has been designed specifically for you to alternate between groups and users in your code easily.
fr: En fait, ``[[Engine/DataModel/Entities/ElggGroup|ElggGroup]]`` simule la plupart des méthodes de ``[[Engine/DataModel/Entities/ElggUser|ElggUser]]``. Vous pouvez récupérer l'icône, le nom, etc. en utilisant les mêmes appels, et si vous demandez les contacts du groupe, vous récupérez ses membres. Ceci a été designé spécifiquement pour que vous puissiez alterner entre groupes et utilisateurs aisément dans votre code.

source: Ownership
fr: Propriété

source: Entities have a ``owner_guid`` GUID property, which defines its owner. Typically this refers to the GUID of a user, although sites and users themselves often have no owner (a value of 0).
fr: Les entités ont une propriété GUID ``owner_guid``, qui définit son propriétaire. Typiquement ceci renvoie au GUID d'un utilisateur, quoique les sites et les utilisateurs eux-même n'ont souvent pas de propriétaire (valeur de 0).

source: The ownership of an entity dictates, in part, whether or not you can access or edit that entity.
fr: La propriété d'une entité détermine, d'une part, si vous pouvez ou non accéder à, ou modifier cette entité.

source: Containers
fr: Conteneurs (containers)

source: In order to easily search content by group or by user, content is generally set to be "contained" by either the user who posted it, or the group to which the user posted. This means the new object's ``container_guid`` property will be set to the GUID of the current ElggUser or the target ElggGroup.
fr: Afin de rechercher aisément du contenu par groupe ou utilisateur, le contenu est généralement défini comme "contenu" soit par l'utilisateur qui l'a publié, soit par le groupe dans lequel l'utilisateur l'a publié. Ceci signifie que la propriété ``container_guid`` des nouveaux objets sera définie avec la valeur du ElggUser actuel ou du ElggGroup cible.

source: E.g., three blog posts may be owned by different authors, but all be contained by the group they were posted to.
fr: Par ex., trois articles de blog peuvent avoir des propriétaires différentes, mais être tous contenus dans le groupe où ils ont été publiés.

source: Note: This is not always true. Comment entities are contained by the object commented upon, and in some 3rd party plugins the container may be used to model a parent-child relationship between entities (e.g. a "folder" object containing a file object).
fr: Note : Ceci n'est pas toujours vrai. Les entités Commentaires sont contenues par l'objet commenté, et dans certains plugins tierce-partie la conteneur peut être utilisé pour modéliser des relations parents-enfants entre entités (par ex. un objet "dossier" qui contient un objet fichier).

source: Annotations are pieces of data attached to an entity that allow users to leave ratings, or other relevant feedback. A poll plugin might register votes as annotations.
fr: Les annotations sont des éléments de données attachées à une entité qui permet aux utilisateurs de laisser des évaluations, ou d'autres types de réactions pertinentes. Un plugin de sondage pourrait enregistrer des votes sous forme d'annotations.

source: Annotations are stored as instances of the ``ElggAnnotation`` class.
fr: Les annotations sont stockées sous formes d'instances de la classe ``ElggAnnotation``.

source: Each annotation has:
fr: Chaque annotation dispose de :

source: An internal annotation type (like *comment*)
fr: Un type d'annotation interne (tel que *comment*)

source: A value (which can be a string or integer)
fr: Une valeur (qui peut être une chaîne de caractères ou un entier)

source: An access permission distinct from the entity it's attached to
fr: Un niveau d'accès distinct de celui de l'entité à laquelle il est attaché

source: An owner
fr: Un propriétaire

source: Like metadata, values are stored as strings unless the value given is a PHP integer (``is_int($value)`` is true), or unless the ``$vartype`` is manually specified as ``integer``.
fr: Comme pour les métadonnées, les valeurs sont stockées sous forme de chaines de caractères à moins que la valeur donnée soit un entier PHP (``is_int($value)`` vaut true), ou à moins que ``$vartype`` soit spécifié manuellement comme ``integer``.

source: Adding an annotation
fr: Ajouter une annotation

source: The easiest way to annotate is to use the ``annotate`` method on an entity, which is defined as:
fr: La manière la plus simple d'ajouter une annotation est d'utiliser la méthode ``annotate`` sur une entité, qui est définie comme :

source: For example, to leave a rating on an entity, you might call:
fr: Par exemple, pour donner une notation à une entité, vous pouvez appeler :

source: Reading annotations
fr: Lire les annotations

source: To retrieve annotations on an object, you can call the following method:
fr: Pour récupérer les annotations d'une entité, vous pouvez appeler la méthode suivante :

source: If your annotation type largely deals with integer values, a couple of useful mathematical functions are provided:
fr: Si votre type d'annotation utilise largement des valeurs entières, plusieurs fonctions mathématiques utiles sont fournies :

source: Useful helper functions
fr: Fonctions d'aide utiles

source: Comments
fr: Commentaires

source: If you want to provide comment functionality on your plugin objects, the following function will provide the full listing, form and actions:
fr: Si vous souhaitez fournir une fonctionnalité de commentaire sur les objets de votre plugin, la fonction suivante va fournir le listing complet, le formulaire et les actions :

source: Metadata
fr: Métadonnées

source: Metadata in Elgg allows you to store extra data on an ``entity`` beyond the built-in fields that entity supports. For example, ``ElggObjects`` only support the basic entity fields plus title and description, but you might want to include tags or an ISBN number. Similarly, you might want users to be able to save a date of birth.
fr: Les métadonnées dans Elgg vous permettent de stocker les données supplémentaires d'une ``entité`` au-delà des champs pré-définis que cette entité supporte. Par exemple, ``ElggObjects`` ne supporte que les champs d'entités basiques plus un titre et une description, mais vous pouvez souhaiter inclure également des tags ou un numéro ISBN. De manière similaire, vous pourriez souhaiter que les utilisateurs puissent enregistrer une date de naissance.

source: Under the hood, metadata is stored as an instance of the ``ElggMetadata`` class, but you don't need to worry about that in practice (although if you're interested, see the ``ElggMetadata`` class reference). What you need to know is:
fr: Sous le capot, les métadonnées sont stockées sous forme d'instance de la classe ``ElggMetadata``, mais vous n'avez pas à vous soucier de cela en pratique (quoique si vous êtes intéressé, voyez la référence de la classe ``ElggMetadata``). Ce que vous avez besoin de savoir :

source: Metadata has an owner, which may be different to the owner of the entity it's attached to
fr: Une métadonnée a un propriétaire, qui peut être différent du propriétaire de l'entité à laquelle elle est attachée

source: You can potentially have multiple items of each type of metadata attached to a single entity
fr: Vous pouvez potentiellement avoir plusieurs éléments de chaque type de métadonnée attachés à la même entité

source: Like annotations, values are stored as strings unless the value given is a PHP integer (``is_int($value)`` is true), or unless the ``$value_type`` is manually specified as ``integer`` (see below).
fr: Comme pour les annotations, les valeurs sont stockées sous forme de chaîne de caractères à moins que la valeur donnée soit un entier PHP (``is_int($value)`` vaut true), ou à moins que le ``$value_type`` soit défini manuellement comme ``integer`` (voyez ci-dessous).

source: As of Elgg 3.0, metadata no longer have ``access_id``.
fr: A partir de Elgg 3.0, les métadonnées n'ont plus d'``access_id``.

source: The simple case
fr: Le cas simple

source: Adding metadata
fr: Ajouter des métadonnées

source: To add a piece of metadata to an entity, just call:
fr: Pour ajouter une métadonnée à une entité, appelez simplement :

source: For example, to add a date of birth to a user:
fr: Par exemple, pour ajouter une date d'anniversaire à un utilisateur :

source: Or to add a couple of tags to an object:
fr: Ou pour ajouter des tags à un objet :

source: When adding metadata like this:
fr: Lorsque vous ajoutez une métadonnée de cette manière :

source: The owner is set to the currently logged-in user
fr: Le propriétaire est assigné à l'utilisateur actuellement identifié

source: Reassigning a piece of metadata will overwrite the old value
fr: Réassigner une métadonnée va remplacer l'ancienne valeur

source: This is suitable for most purposes. Be careful to note which attributes are metadata and which are built in to the entity type that you are working with. You do not need to save an entity after adding or updating metadata. You do need to save an entity if you have changed one of its built in attributes. As an example, if you changed the access id of an ElggObject, you need to save it or the change isn't pushed to the database.
fr: Ceci convient pour la plupart des objectifs. Faites attention à bien noter quels attributs sont des métadonnées et lesquels sont natifs au type d'entité avec lequel vous travaillez. Vous n'avez pas besoin d'enregistrer une entité après avoir ajouté ou modifié des métadonnées. Vous devez enregistrer une entité si vous avez changé l'un des ses attributs natifs. A titre d'exemple, si vous avez changé l'id d'accès d'un ElggObject, vous devez l'enregistrer, faute de quoi la modification ne sera pas conservée dans la base de données.

source: As of Elgg 3.0, metadata's ``access_id`` property is ignored.
fr: A partir de Elgg 3.0, la propriété ``access_id`` des métadonnées est ignorée

source: Reading metadata
fr: Lire les métadonnées

source: To retrieve metadata, treat it as a property of the entity:
fr: Pour récupérer une métadonnée, traitez-la comme une propriété d'une entité :

source: Note that this will return the absolute value of the metadata. To get metadata as an ElggMetadata object, you will need to use the methods described in the *finer control* section below.
fr: Notez que ceci va retourner la valeur absolue de la métadonnée. Pour récupérer des métadonnées sous forme d'objet ElggMetadata, vous aurez besoin d'utiliser les méthodes décrites dans la section *contrôle plus fin* ci-dessous.

source: If you stored multiple values in this piece of metadata (as in the "tags" example above), you will get an array of all those values back. If you stored only one value, you will get a string or integer back. Storing an array with only one value will return a string back to you. E.g.
fr: Si vous stockez de multiples valeurs dans cette métadonnée (comme dans l'exemple "tags" ci-dessus), vous obtiendrez un tableau de toutes ces valeurs. Si vous stockez seulement une valeur, vous récupérerez une chaîne de caractères ou un entier. Stocker un tableau avec seulement une valeur vous retournera une chaîne de caractères. Par ex.

source: To always get an array back, simply cast to an array;
fr: Pour récupérer toujours un tableau, castez simplement vers un tableau :

source: Reading metadata as objects
fr: Lire des métadonnées comme des objets

source: ``elgg_get_metadata`` is the best function for retrieving metadata as ElggMetadata objects:
fr: ``elgg_get_metadata`` est la meilleure fonction pour récupérer les métadonénes sous forme d'objets ElggMetadata :

source: E.g., to retrieve a user's DOB
fr: Par ex., pour récupérer la date de naissance d'un utilisateur

source: Or to get all metadata objects:
fr: Ou pour récupérer toutes les objets des métadonnées :

source: Common mistakes
fr: Erreurs courantes

source: "Appending" metadata
fr: "Ajouter" des métadonnées

source: Note that you cannot "append" values to metadata arrays as if they were normal php arrays. For example, the following will not do what it looks like it should do.
fr: Notez que vous ne pouvez pas "ajouter" des valeurs aux tableaux de métadonnées comme si c'étaient des tableaux php normaux. Par exemple, le code suivant ne fera pas ce qu'il semblerait qu'il devrait faire.

source: Trying to store hashmaps
fr: Essayer de stocker des tableaux indexés

source: Elgg does not support storing ordered maps (name/value pairs) in metadata. For example, the following does not work as you might first expect it to:
fr: Elgg ne supporte pas le stockage de tableaux indexés (paires clef/valeur) dans les métadonnées. Par exemple, le code suivant ne fonctionne pas comme vous pourriez le penser de prime abord :

source: You can instead store the information like so:
fr: Au lieu de cela, vous pouvez conserver cette information de cette manière :

source: Storing GUIDs in metadata
fr: Conserver des GUIDs dans des métadonnées

source: Though there are some cases to store entity GUIDs in metadata, `Relationships`_ are a much better construct for relating entities to each other.
fr: Quoiqu'il existe certains cas pour stocker les GUIDs d'entités dans des métadonnées, les relations `Relationships`_ sont une construction bien plus adaptée pour relier les entités les unes aux autres.

source: Relationships
fr: Relations

source: Relationships allow you to bind entities together. Examples: an artist has fans, a user is a member of an organization, etc.
fr: Les relations vous permettent d'associer des entités ensemble. Exemples : un artiste a des fans, un utilisateur est membre d'une organisation, etc.

source: The class ``ElggRelationship`` models a directed relationship between two entities, making the statement:
fr: La classe ``ElggRelationship`` modélise une relation directe entre deux entités, en faisant la déclaration :

source: "**{subject}** is a **{noun}** of **{target}**."
fr: "**{subject}** est un **{noun}** de **{target}**."

source: API name
fr: Nom de l'API

source: Models
fr: Modèles

source: The subject
fr: Le sujet

source: Which entity is being bound
fr: Quelle entité est reliée

source: The noun
fr: Le nom

source: The type of relationship
fr: Le type de relation

source: The target
fr: La cible

source: The entity to which the subject is bound
fr: L'entité à laquelle le sujet est relié

source: The type of relationship may alternately be a verb, making the statement:
fr: Le type de relation peut également être un verbe, faisant la déclaration :

source: "**{subject}** **{verb}** **{target}**."
fr: "**{sujet}** **{verbe}** **{cible}**."

source: E.g. User A "likes" blog post B
fr: Par ex. Utilisateur A "aime" l'article de blog B

source: **Each relationship has direction.** Imagine an archer shoots an arrow at a target; The arrow moves in one direction, binding the subject (the archer) to the target.
fr: **Chaque relation a une direction.** Imaginez un archer qui tire une flèche vers une cible ; la flèche se déplace dans une direction, en reliant le sujet (l'archer) à à la cible.

source: **A relationship does not imply reciprocity**. **A** follows **B** does not imply that **B** follows **A**.
fr: **Une relation n'implique pas de réciprocité**. **A** suit **B** n'implique pas que **B** suive **A**.

source: **Relationships_ do not have access control.** They're never hidden from view and can be edited with code at any privilege level, with the caveat that *the entities* in a relationship may be invisible due to access control!
fr: Les **Relations_ n'ont pas de contrôle d'accès.** Elles ne sont jamais cachées d'une vue et peuvent être modifiées par le code à n'importe quel niveau de privilège, avec l'avertissement que *les entités* d'une relation peuvent être invisible en raison du contrôle d'accès !

source: Working with relationships
fr: Travailler avec des relations

source: Creating a relationship
fr: Créer une relation

source: E.g. to establish that "**$user** is a **fan** of **$artist**" (user is the subject, artist is the target):
fr: Par exemple pour établir que "**$utilisateur** est un **fan** de **$artiste**" (utilisateur est le sujet, artiste est la cible):

source: This triggers the event [create, relationship], passing in the created ``ElggRelationship`` object. If a handler returns ``false``, the relationship will not be created and ``$success`` will be ``false``.
fr: Ceci déclenche l'événement [create, relationship], en lui passant l'objet ``ElggRelationship`` créé. Si un gestionnaire retourne ``false``, la relation ne sera pas créée et ``$success`` vaudra ``false``.

source: Verifying a relationship
fr: Vérifier une relation

source: E.g. to verify that "**$user** is a **fan** of **$artist**":
fr: Par exemple pour vérifier que "**$utilisateur** est un **fan** de **$artiste**":

source: Note that, if the relationship exists, ``check_entity_relationship()`` returns an ``ElggRelationship`` object:
fr: Notez que si la relation existe, ``check_entity_relationship()`` retourne un objet ``ElggRelationship`` :

source: Deleting a relationship
fr: Supprimer une relation

source: E.g. to be able to assert that "**$user** is no longer a **fan** of **$artist**":
fr: Par exemple pour pouvoir affirmer que "**$utilisateur** n'est désormais plus un **fan** de **$artiste**":

source: This triggers the event [delete, relationship], passing in the associated ``ElggRelationship`` object. If a handler returns ``false``, the relationship will remain, and ``$was_removed`` will be ``false``.
fr: Ceci déclenche l'événement [delete, relationship], en lui passant l'objet ``ElggRelationship`` associé. Si un gestionnaire retourne ``false``, la relation sera conservée, ``$was_removed`` vaudra ``false``.

source: Other useful functions:
fr: Autres fonctions utiles :

source: ``delete_relationship()`` : delete by ID
fr: ``delete_relationship()`` : supprimer par ID

source: ``remove_entity_relationships()`` : delete those relating to an entity
fr: ``remove_entity_relationships()`` : supprime ceux qui sont liés à une entité

source: Finding relationships and related entities
fr: Trouver des relations et des entités associées

source: Below are a few functions to fetch relationship objects and/or related entities. A few are listed below:
fr: Voici ci-dessous quelques fonctions pour récupérer des relations entre objets et/ou des entités reliées :

source: ``get_entity_relationships()`` : fetch relationships by subject or target entity
fr: ``get_entity_relationships()`` : récupère les relations par entité sujet ou entité cible

source: ``get_relationship()`` : get a relationship object by ID
fr: ``get_relationship()`` : récupère un objet relation par ID

source: ``elgg_get_entities()`` : fetch entities in relationships in a variety of ways
fr: ``elgg_get_entities()`` : récupère les entités dans les relations de différentes manières

source: E.g. retrieving users who joined your group in January 2014.
fr: Par ex. retrouver les utilisateurs qui ont rejoint votre groupe en janvier 2014.

source: Access Control
fr: Contrôle d'accès

source: Granular access controls are one of the fundamental design principles in Elgg, and a feature that has been at the centre of the system throughout its development. The idea is simple: a user should have full control over who sees an item of data he or she creates.
fr: Les contrôle d'accès granulaires sont l'un des principes de design fondamentaux dans Elgg, et une fonctionnalité qui a été au cœur du système tout au long de son développement. L'idée est simple : un utilisateur devrait avoir un contrôle total sur qui peut voir un élément de donnée qu'il ou elle a créé.

source: Access controls in the data model
fr: Niveau d'accès dans le modèle de données

source: In order to achieve this, every entity and annotation contains an ``access_id`` property, which in turn corresponds to one of the pre-defined access controls or an entry in the ``access_collections`` database table.
fr: Pour parvenir à cela, chaque entité et annotation contient une propriété ``access_id``, qui correspond à l'un des niveau d'accès prédéfinis ou à une entrée dans la table ``access_collections`` de la base de données.

source: Pre-defined access controls
fr: Niveaux d'accès pré-définis

source: ``ACCESS_PRIVATE`` (value: 0) Private.
fr: ``ACCESS_PRIVATE`` (valeur : 0) Privé.

source: User defined access controls
fr: Niveaux d'accès définis par l'utilisateur

source: You may define additional access groups and assign them to an entity, or annotation. A number of functions have been defined to assist you; see the :doc:`/guides/access` for more information.
fr: Vous pouvez définir des groupes d'accès additionnels et les assigner à une entité, ou une annotation. Un certain nombre de fonctions ont été définies pour vous y aider ; voyez :doc:`/guides/access` pour plus d'informations.

source: How access affects data retrieval
fr: Comment les accès affectent la récupération de données
