Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: A helper page has been added which can be linked (for example in an email footer) to manage muting based on a notification.
fr: Une page d'aide a été ajoutée qui peut être liée (par exemple dans un pied de page d'e-mail) pour gérer la désactivation d'une notification particulière.

source: The page is required to be signed and use the route ``notifications:mute`` which needs: - ``entity_guid`` the entity the notification is about - ``recipient_guid`` the recipient of the notification
fr: La page doit être obligatoirement signée et utiliser la route ``notifications:mute`` qui nécessite : - ``entity_guid`` l'entité sur laquelle porte la notification - ``recipient_guid`` le destinataire de la notification

source: Temporarily disable notifications
fr: Désactiver temporairement les notifications

source: Users can temporarily disable all notifications by going to the Notification settings and set a start and end date for the period they don't wish to receive any notifications.
fr: Les utilisateurs peuvent désactiver temporairement toutes les notifications en accédant aux paramètres de notification et en définissant une date de début et de fin pour la période pour laquelle ils ne souhaitent pas recevoir de notifications.

source: Notification settings
fr: Paramètres de notification

source: You can store and retreive notification settings of users with ``\ElggUser::setNotificationSetting()`` and ``\ElggUser::getNotificationSettings()``.
fr: Vous pouvez stocker et récupérer les paramètres de notification des utilisateurs avec ``\ElggUser::setNotificationSetting()`` et ``\ElggUser::getNotificationSettings()``.

source: When a user has no setting yet for a non default purpose the system will fallback to the 'default' notification setting.
fr: Lorsqu'un utilisateur n'a pas encore de paramètre distinct de celui par défaut, le système revient au paramètre de notification 'default'.

source: Notification management
fr: Gestion des notifications

source: A generic menu event handler is provided to manage notification subscription and muting. If you wish to make it easy for users to subscribe to your entities register a menu event on ``register`` ``menu:<menu name>:<entity type>:<entity subtype>`` with the callback ``Elgg\Notifications\RegisterSubscriptionMenuItemsHandler`` make sure an ``\ElggEntity`` in ``$params['entity']`` is provided. This will work for most ``elgg_view_menu()`` calls.
fr: Un gestionnaire d'événements de menu générique est fourni pour gérer l'abonnement aux notifications et la mise en sourdine. Si vous souhaitez permettre aux utilisateurs de s'abonner facilement à vos entités, enregistrez un événement de menu sur ``register`` ``menu:<menu name>:<entity type>:<entity subtype>`` avec le callback ``Elgg\Notifications\RegisterSubscriptionMenuItemsHandler`` assurez-vous de fournir un ``\ ElggEntity`` dans ``$params['entity']``. Cela fonctionnera pour la plupart des appels ``elgg_view_menu()``.

source: Page ownership
fr: Propriété de la page

source: One recurring task of any plugin will be to determine the page ownership in order to decide which actions are allowed or not. Elgg has a number of functions related to page ownership and also offers plugin developers flexibility by letting the plugin handle page ownership requests as well. Determining the owner of a page can be determined with ``elgg_get_page_owner_guid()``, which will return the GUID of the owner. Alternatively, ``elgg_get_page_owner_entity()`` will retrieve the whole page owner entity. If the page already knows who the page owner is, but the system doesn't, the page can set the page owner by passing the GUID to ``elgg_set_page_owner_guid($guid)``.
fr: Une tâche récurrente de tout plugin sera de déterminer qui est propriétaire de la page afin de décider quelles actions sont autorisées ou non. Elgg dispose de plusieurs fonctions liées à la propriété de la page et offre également aux développeurs de plugin une flexibilité en laissant le plugin gérer également les demandes de propriété de page. La détermination du propriétaire d’une page peut être déterminée avec ``elgg_get_page_owner_guid()``, qui renverra le GUID du propriétaire. Alternativement, ``elgg_get_page_owner_entity()`` récupérera l’entité complète du propriétaire de la page. Si la page sait déjà qui est le propriétaire de la page, mais pas le système, la page peut définir le propriétaire de la page en passant son GUID à ``elgg_set_page_owner_guid($guid)``.

source: The page owner entity can be any ``ElggEntity``. If you wish to only apply some setting in case of a user or a group make sure you check that you have the correct entity.
fr: L’entité propriétaire de la page peut être n’importe quelle ``ElggEntity``. Si vous souhaitez appliquer des paramètres particuliers selon que c'est un utilisateur ou un groupe, assurez-vous de vérifier que vous avez l’entité correcte.

source: Page owner detection
fr: Détection du propriétaire de la page

source: Based on the route definition:
fr: Sur la base de la définition de la route :

source: If the name starts with ``view`` or ``edit`` the parameters ``username`` and ``guid`` are checked
fr: Si le nom commence par ``view`` ou ``edit`` les paramètres ``username`` et ``guid`` sont vérifiés

source: If the name starts with ``add`` or ``collection`` the parameters ``username``, ``guid`` and ``container_guid`` are checked
fr: Si le nom commence par ``add`` ou ``collection`` les paramètres ``username``, ``guid`` et ``container_guid`` sont vérifiés

source: If in the route definition the value ``detect_page_owner`` is set to ``true`` the parameters ``username``, ``guid`` and ``container_guid`` are checked
fr: Si dans la définition de la route la valeur ``detect_page_owner`` est définie sur ``true`` les paramètres ``username``, ``guid`` et ``container_guid`` sont vérifiés

source: Permissions Check
fr: Vérification des permissions

source: As stated in the page, this method works **only** for granting **write** access to entities. You **cannot** use this method to retrieve or view entities for which the user does not have read access.
fr: Comme indiqué dans la page, cette méthode fonctionne **seulement** pour accorder le droit d'accès en **écriture** sur les entités. Vous **ne pouvez pas** utiliser cette méthode pour récupérer ou afficher des entités pour lesquelles l’utilisateur n’a pas d'accès en lecture.

source: Elgg provides a mechanism of overriding write permissions check through the :ref:`permissions_check event <guides/events-list#permissions>` . This is useful for allowing plugin write to all accessible entities regardless of access settings. Entities that are hidden, however, will still be unavailable to the plugin.
fr: Elgg fournit un mécanisme permettant de remplacer la vérification des autorisations d'écriture via l'événement :ref:`permissions_check <guides/events-list#permissions>` . Ceci est utile pour permettre l'écriture du plugin sur toutes les entités accessibles, quels que soient les paramètres d'accès. Cependant, les entités masquées ne seront toujours pas disponibles pour le plugin.

source: Extending permissions_check
fr: Étendre permissions_check

source: In your plugin, you must register the event for ``permissions_check``.
fr: Dans votre plugin, vous devez enregistrer l'événement pour ``permissions_check``.

source: The override function
fr: La fonction de substitution

source: Now create the function that will be called by the permissions check event. In this function we determine if the entity (in parameters) has write access. Since it is important to keep Elgg secure, write access should be given only after checking a variety of situations including page context, logged in user, etc. Note that this function can return 3 values: true if the entity has write access, false if the entity does not, and null if this plugin doesn't care and the security system should consult other plugins.
fr: Créez maintenant la fonction qui sera appelée par l'événement de vérification des autorisations. Dans cette fonction, nous déterminons si l'entité (dans les paramètres) a un accès en écriture. Puisqu'il est important de garantir la sécurité de Elgg, l'accès en écriture ne doit être accordé qu'après avoir vérifié diverses situations, notamment le contexte de la page, l'utilisateur connecté, etc. Notez que cette fonction peut renvoyer 3 valeurs : true si l'entité a un accès en écriture, false si l'entité ne l'a pas, et null si ce plugin ne s'en préoccupe pas et que le système de sécurité devrait consulter d'autres plugins.

source: Full Example
fr: Exemple complet

source: This is a full example using the context to determine if the entity has write access.
fr: Voici un exemple complet utilisant le contexte pour déterminer si l’entité dispose d'un accès en écriture.

source: Plugins must provide a ``composer.json`` file in the plugin root in order to be recognized by Elgg.
fr: Les plugins doivent fournir un fichier ``composer.json`` situé dans la racine du plugin afin d’être reconnus par Elgg.

source: ``elgg-plugin.php`` is a static plugin configuration file. It is read by Elgg to configure various services, and must return an array if present. It should not be included by plugins and is not guaranteed to run at any particular time. Besides magic constants like ``__DIR__``, its return value should not change. The currently supported sections are:
fr: ``elgg-plugin.php`` est un fichier statique de configuration du plugin. Il est lu par Elgg pour configurer différents services, et doit retourner un tableau s’il est présent. Il ne doit pas être inclus par les plugins et n’est pas destiné à être exécuté. A l'exception des constantes magiques comme ``__DIR__``, sa valeur de retour ne doit pas changer. Les sections actuellement prises en charge sont :

source: ``plugin`` - defines plugin information and dependencies
fr: ``plugin`` - définit les informations et les dépendances du plugin

source: ``bootstrap`` - defines a class used to bootstrap the plugin
fr: ``bootstrap`` - définit une classe utilisée pour initialiser le plugin

source: ``entities`` - defines entity types and classes, and optionally registers them for search
fr: ``entities`` - définit les types et les classes d’entités du plugin, et les enregistre éventuellement pour la recherche

source: ``actions`` - eliminates the need for calling ``elgg_register_action()``
fr: ``actions`` - élimine la nécessité d’appeler ``elgg_register_action()``

source: ``routes`` - eliminates the need for calling ``elgg_register_route()``
fr: ``routes`` - élimine la nécessité d’appeler ``elgg_register_route()``

source: ``settings`` - eliminates the need for setting default values on each call to ``elgg_get_plugin_setting()``
fr: ``settings`` - élimine la nécessité de définir des valeurs par défaut sur chaque appel à ``elgg_get_plugin_setting()``

source: ``user_settings`` - eliminates the need for setting default values on each call to ``elgg_get_plugin_user_setting()``
fr: ``user_settings`` - élimine la nécessité de définir des valeurs par défaut sur chaque appel à ``elgg_get_plugin_user_setting()``

source: ``views`` - allows plugins to alias vendor assets to a path within the Elgg's view system
fr: ``views`` - permet aux plugins de créer des alias des actifs vers un chemin d’accès dans le système de vue de Elgg

source: ``widgets`` - eliminates the need for calling ``elgg_register_widget_type()``
fr: ``widgets`` - élimine la nécessité d’appeler ``elgg_register_widget_type()``

source: ``events`` - eliminates the need for calling ``elgg_register_event_handler()``
fr: ``events`` - élimine la nécessité d’appeler ``elgg_register_event_handler()``

source: ``cli_commands`` - an array of ``Elgg/Cli/Command`` classes to extend the feature of ``elgg-cli``
fr: ``cli_commands`` - un tableau de classes ``Elgg/Cli/Command`` pour étendre les fonctionnalités de ``elgg-cli``

source: ``view_extensions`` - eliminates the need for calling ``elgg_extend_view()`` or ``elgg_unextend_view()``
fr: ``view_extensions`` - élimine la nécessité d’appeler ``elgg_extend_view()`` ou ``elgg_unextend_view()``

source: ``theme`` - an array of theme variables
fr: ``thème`` - un tableau de variables pour les thèmes

source: ``group_tools`` - an array of available group tool options
fr: ``group_tools`` - un tableau d'options des outils de groupe disponibles

source: ``view_options`` - an array of views with extra options
fr: ``view_options`` - un tableau de vues avec des options supplémentaires

source: ``notifications`` - an array of notification events
fr: ``notifications`` - un tableau d'événements de notification

source: ``web_services`` - an array of exposed web service (used by the Web Services plugin)
fr: ``web_services`` - un tableau de webservices exposés (utilisés par le plugin Web Services)

source: Bootstrap class
fr: Classe d'initialisation - Bootstrap

source: As of Elgg 3.0 the recommended way to bootstrap you plugin is to use a bootstrap class. This class must implement the ``\Elgg\PluginBootstrapInterface`` interface. You can register you bootstrap class in the ``elgg-plugin.php``.
fr: À partir de Elgg 3.0, la manière recommandée pour initialiser votre plugin est d’utiliser une classe bootstrap. Cette classe doit implémenter l’interface ``\Elgg\PluginBootstrapInterface``. Vous pouvez inscrire votre classe bootstrap dans ``elgg-plugin.php``.

source: The bootstrap interface defines several function to be implemented which are called during different events in the system booting process.
fr: L’interface d'initialisation - bootstrap - définit plusieurs fonctions à implémenter qui sont appelées lors de différents événements dans le processus de démarrage du système.

source: For more information about the different functions defined in the ``\Elgg\PluginBootstrapInterface`` please read :doc:`plugins/bootstrap`
fr: Pour plus d’informations sur les différentes fonctions définies dans ``\Elgg\PluginBootstrapInterface`` veuillez lire :doc:`plugins/bootstrap`

source: Plugins can attach their services to Elgg's public DI container by providing PHP-DI definitions in ``elgg-services.php`` in the root of the plugin directory.
fr: Les plugins peuvent attacher leurs services au conteneur public DI de Elgg en fournissant des définitions PHP-DI dans ``elgg-services.php``, situé à la racine du répertoire du plugin.

source: This file must return an array of PHP-DI definitions. Services will by available via ``elgg()``.
fr: Ce fichier doit renvoyer un tableau de définitions PHP-DI. Les services seront disponibles via ``elgg()``.

source: Plugins can then use PHP-DI API to autowire and call the service:
fr: Les plugins peuvent ensuite utiliser l’API PHP-DI pour s'auto-câbler et appeler le service :

source: See `PHP-DI documentation <http://php-di.org>`_ for a comprehensive list of definition and invocation possibilities.
fr: Voyez la `documentation PHP-DI <https://php-di.org/>`_ pour une liste complète des possibilités de définition et d’invocation.

source: Since Elgg supports being installed as a `Composer`_ dependency, having your plugins also support Composer makes for easier installation by site administrators. In order to make your plugin compatible with Composer you need to at least have a ``composer.json`` file in the root of your plugin.
fr: Depuis que Elgg prend en charge l’installation en tant que dépendance `Composer`_ , le fait que vos plugins prennent également en charge Composer facilite l’installation par des administrateurs de site. Afin de rendre votre plugin compatible avec Composer, vous devez au moins avoir un fichier ``composer.json`` dans la racine de votre plugin.

source: Here is an example of a ``composer.json`` file:
fr: Voici un exemple de fichier ``composer.json`` :

source: Read more about the ``composer.json`` format on the `Composer`_ website.
fr: Apprenez-en plus sur le format de ``composer.json`` sur le site de `Composer`_.

source: Important parts in the ``composer.json`` file are:
fr: Les parties importantes du fichier ``composer.json`` sont :

source: ``name``: the name of your plugin, keep this inline with the name of your plugin folder to ensure correct installation
fr: ``name`` : le nom de votre plugin, utilisez le même que le nom de dossier de votre plugin pour assurer une installation correcte

source: ``type``: this will tell Composer where to install your plugin, ALWAYS keep this as ``elgg-plugin``
fr: ``type`` : indique à Composer où installer votre plugin, laissez TOUJOURS ceci sur ``elgg-plugin``

source: As a suggestion, include a ``conflict`` rule with any Elgg version below your minimal required version, this will help prevent the accidental installation of your plugin on an incompatible Elgg version.
fr: À titre de suggestion, incluez une règle ``conflict`` avec toute version d'Elgg inférieure à votre version minimale requise, cela aidera à empêcher l'installation accidentelle de votre plugin sur une version d'Elgg incompatible.

source: After adding a ``composer.json`` file to your plugin project, you need to register your project on `Packagist`_ in order for other people to be able to install your plugin.
fr: Après avoir ajouté un fichier ``composer.json`` à votre projet de plugin, vous devez enregistrer votre projet sur `Packagist`_ afin que d’autres personnes puissent installer votre plugin.

source: It's encouraged to create PHPUnit test for your plugin. All tests should be located in ``tests/phpunit/unit`` for unit tests and ``tests/phpunit/integration`` for integration tests.
fr: Il est recommandé de créer des tests PHPUnit pour votre plugin. Tous les tests devraient être situés dans ``tests/phpunit/unit`` pour les tests unitaires et ``tests/phpunit/integration`` pour les tests d'intégration.

source: Unit tests should extend the ``Elgg\UnitTestCase`` class. Integration tests should extend the ``Elgg\Plugins\IntegrationTestCase``.
fr: Les tests unitaires devraient étendre la classe ``Elgg\UnitTestCase``. Les tests d'intégration devraient étendre ``Elgg\Plugins\IntegrationTestCase``.

source: There are a set of global plugin integration tests that run on all active plugins. These tests are:
fr: Il existe un ensemble de tests d'intégration de plugins globaux qui s'exécutent sur tous les plugins actifs. Ces tests sont :

source: ``Elgg\Plugins\ActionRegistrationIntegrationTest`` will test all registered actions of the plugin without supplying data
fr: ``Elgg\Plugins\ActionRegistrationIntegrationTest`` testera toutes les actions enregistrées du plugin sans fournir de données

source: ``Elgg\Plugins\ComposerIntegrationTest`` will test if the ``composer.json`` is considered valid
fr: ``Elgg\Plugins\ComposerIntegrationTest`` va tester si ``composer.json`` est considéré comme valide

source: ``Elgg\Plugins\StaticConfigIntegrationTest`` will test the sections of the ``elgg-plugin.php`` and check for the correct format
fr: ``Elgg\Plugins\StaticConfigIntegrationTest`` testera les sections de ``elgg-plugin.php`` et vérifiera que le format est correct

source: ``Elgg\Plugins\TranslationsIntegrationTest`` will test all language files for the correct format and encoding
fr: ``Elgg\Plugins\TranslationsIntegrationTest`` testera tous les fichiers de langue pour le format et l'encodage corrects

source: ``Elgg\Plugins\ViewStackIntegrationTest`` will test all views of the plugin if there are any PHP parsing errors
fr: ``Elgg\Plugins\ViewStackIntegrationTest`` testera toutes les vues du plugin s'il y a des erreurs d'analyse PHP

source: Related
fr: Connexe

source: Plugin bootstrap
fr: Initialisation - bootstrap - d'un plugin

source: In order to bootstrap your plugin as of Elgg 3.0 you can use a bootstrap class. This class must implement the ``\Elgg\PluginBootstrapInterface`` interface, but it's recommended you extend the ``\Elgg\PluginBootstrap`` abstract class as some preparations have already been done.
fr: Afin d'initialiser votre plugin à partir de Elgg 3.0, vous pouvez utiliser une classe bootstrap. Cette classe doit implémenter l’interface abstraite ``\Elgg\PluginBootstrapInterface``, mais il est recommandé d’étendre la classe abstraite ``\Elgg\PluginBootstrap``, car certaines préparations ont déjà été faites.

source: If you only need a limited subset of the bootstrap functions your class can also extend the ``\Elgg\DefaultPluginBootstrap`` class, this class already has all the functions of ``\Elgg\PluginBootstrapInterface`` implemented. So you can overload only the functions you need.
fr: Si vous n’avez besoin que d’un sous-ensemble limité des fonctions d'initialisation, votre classe peut également étendre la classe ``\Elgg\DefaultPluginBootstrap``, cette classe a déjà implémenté toutes les fonctions de ``\Elgg\PluginBootstrapInterface``. Ainsi, vous pouvez surcharger uniquement les fonctions dont vous avez besoin.

source: Registering the bootstrap class
fr: Enregistrement de la classe "bootstrap" d'initialisation

source: You must register your bootstrap class in the ``elgg-plugin.php`` file.
fr: Vous devez enregistrer votre classe d'initialisation dans le fichier ``elgg-plugin.php``.

source: Available functions
fr: Fonctions disponibles

source: Executed during ``plugins_load``, ``system`` event
fr: Exécuté lors de l’événement ``plugins_load``, ``system``

source: Allows the plugin to require additional files, as well as configure services prior to booting the plugin.
fr: Permet au plugin de requérir des fichiers supplémentaires, ainsi que de configurer des services avant le démarrage du plugin.

source: Executed during ``plugins_boot:before``, ``system`` event
fr: Exécuté lors de l’événement ``plugins_boot:before``, ``system``

source: Allows the plugin to register handlers for ``plugins_boot``, ``system`` and ``init``, ``system`` events, as well as implement boot time logic.
fr: Permet au plugin d’enregistrer des gestionnaires pour les événements ``plugins_boot``, ``system`` et ``init``, ``system``, ainsi que de mettre en œuvre la logique de démarrage.

source: Executed during ``init``, ``system`` event
fr: Exécuté lors de l’événement ``init``, ``system``

source: Allows the plugin to implement business logic and register all other handlers.
fr: Permet au plugin d’implémenter la logique métier et d’enregistrer tous les autres gestionnaires.

source: Executed during ``ready``, ``system`` event
fr: Exécuté lors de l’événement ``ready``, ``system``

source: Allows the plugin to implement logic after all plugins are initialized.
fr: Permet au plugin d’implémenter sa logique après que tous les plugins ont été initialisés.

source: Executed during ``shutdown``, ``system`` event
fr: Exécuté lors de l’événement ``shutdown``, ``system``

source: Allows the plugin to implement logic during shutdown.
fr: Permet au plugin d’implémenter sa logique pendant l’arrêt.

source: Executed when plugin is activated, after ``activate``, ``plugin`` event.
fr: Exécuté lorsque le plugin est activé, après l'événement ``activate``, ``plugin``.

source: Executed when plugin is deactivated, after ``deactivate``, ``plugin`` event.
fr: Exécuté lorsque le plugin est désactivé, après l'événement ``deactivate``, ``plugin``.

source: Registered as handler for ``upgrade``, ``system`` event
fr: Enregistré en tant que gestionnaire pour l’événement ``upgrade``, ``system``

source: Allows the plugin to implement logic during system upgrade.
fr: Permet au plugin d’implémenter sa logique pendant la mise à niveau du système.

source: Available helper functions
fr: Fonctions d’assistance disponibles

source: This assumes your bootstrap class extends the ``\Elgg\PluginBootstrap`` abstract class or the ``\Elgg\DefaultPluginBootstrap`` class.
fr: Ceci suppose que votre classe bootstrap étend la classe abstraite ``\Elgg\PluginBootstrap`` ou la classe ``\Elgg\DefaultPluginBootstrap``.
