Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Only applied if menu params contain - params['entity'] with an ``\ElggEntity`` (``<type>`` is ``\ElggEntity::type`` and ``<subtype>`` is ``\ElggEntity::subtype``) or - params['annotation'] with an ``\ElggAnnotation`` (``<type>`` is ``\ElggAnnotation::getType()`` and ``<subtype>`` is ``\ElggAnnotation::getSubtype()``) or - params['relationship'] with an ``\ElggRelationship`` (``<type>`` is ``\ElggRelationship::getType()`` and ``<subtype>`` is ``\ElggRelationship::getSubtype()``)
fr: Uniquement appliqué si les paramètres de menu contiennent - params['entity'] avec un ``\ElggEntity`` (``<type>`` est ``\ElggEntity::type`` et ``<subtype>`` est ``\ElggEntity::subtype` `) ou - params['annotation'] avec un ``\ElggAnnotation`` (``<type>`` est ``\ElggAnnotation::getType()`` et ``<subtype>`` est ``\ElggAnnotation::getSubtype() ``) ou - params['relationship'] avec un ``\ElggRelationship`` (``<type>`` est ``\ElggRelationship::getType()`` et ``<subtype>`` est ``\ElggRelationship::getSubtype( )``)

source: Triggered after the ``init, system`` event. All plugins are fully loaded and the engine is ready to serve pages.
fr: Déclenché après l’événement ``init, system``. Tous les plugins sont entièrement chargés et le moteur est prêt à servir les pages.

source: Return false to cancel regenerating the site secret. You should also provide a message to the user.
fr: Renvoyez false pour annuler la régénération du secret du site. Vous devez également fournir un message à l’utilisateur.

source: Triggered after the site secret has been regenerated.
fr: Déclenché après que le secret du site a été régénéré.

source: Filters the initial list of menu items pulled from configuration, before the menu has been split into sections. Triggered by ``elgg_view_menu()`` and ``elgg()->menus->getMenu()``.
fr: Filtre la liste initiale des éléments de menu issus de la configuration, avant que le menu n’ait été divisé en sections. Déclenché par ``elgg_view_menu()`` et ``elgg()->menus->getMenu()``.

source: The ``$params`` array will contain parameters returned by ``parameters, menu:<menu_name>`` event.
fr: Le tableau ``$params`` contiendra les paramètres renvoyés par l'événement ``parameters, menu:<menu_name>``.

source: The return value is an instance of ``\Elgg\Menu\MenuItems`` containing ``\ElggMenuItem`` objects.
fr: La valeur de retour est une instance de ``\Elgg\Menu\MenuItems`` contenant des objets ``\ElggMenuItem``.

source: Event handlers can add/remove items to the collection using the collection API, as well as array access operations.
fr: Les gestionnaires d'événements peuvent ajouter/supprimer des éléments à la collection à l'aide de l'API collection, ainsi que des opérations d'accès au tableau.

source: More granular version of the menu event triggered before the **register, menu:<menu_name>** event.
fr: Version plus granulaire de l'événement de menu déclenché avant l'événement **prepare, menu:<menu_name>**.

source: Allows plugins to modify layout filter tabs on layouts that specify ``<filter_id>`` parameter. Parameters and return values are same as in ``register, menu:<menu_name>`` event.
fr: Permet aux plugins de modifier les onglets de filtre de mise en page sur les mises en page qui spécifient le paramètre ``<filter_id>``. Les paramètres et les valeurs de retour sont les mêmes que dans l'événement ``register, menu:<menu_name>``

source: If ``filter_id`` is ``filter`` (the default) then the ``all``, ``mine`` and ``friends`` tabs will be generated base on some provided information or be tried for routes similar to the current route.
fr: Si ``filter_id`` vaut ``filter`` (valeur par défaut), alors les onglets ``all``, ``mine`` et ``friends`` seront générés sur la base d'informations fournies, ou seront testés pour des routes similaires à la route actuelle.

source: params['all_link'] will be used for the ``all`` tab
fr: params['all_link'] sera utilisé pour l'onglet ``all``

source: params['mine_link'] will be used for the ``mine`` tab
fr: params['mine_link'] sera utilisé pour l'onglet ``mine``

source: params['friends_link'] will be used for the ``friend`` tab
fr: params['friends_link'] sera utilisé pour l'onglet ``friend``

source: If the above are not provided than a route will be tried based on ``params['entity_type']`` and ``params['entity_subtype']``. If not provided ``entity_type`` and ``entity_subtype`` will be based on route detection of the current route. For example if the current route is ``collection:object:blog:all`` ``entity_type`` will be ``object`` and ``entity_subtype`` will be ``blog``. - The ``all`` tab will be based on the route ``collection:<entity_type>:<entity_subtype>:all`` - The ``mine`` tab will be based on the route ``collection:<entity_type>:<entity_subtype>:owner`` - The ``friend`` tab will be based on the route ``collection:<entity_type>:<entity_subtype>:friends``
fr: Si ce qui précède n'est pas fourni, une route sera essayée en fonction de ``params['entity_type']`` et ``params['entity_subtype']``. S'il n'est pas fourni, ``entity_type`` et ``entity_subtype`` seront basés sur la détection de la route actuelle. Par exemple, si la route actuelle est ``collection:object:blog:all`` ``entity_type`` sera ``object`` et ``entity_subtype`` sera ``blog``. - L'onglet ``all`` sera basé sur la route ``collection:<entity_type>:<entity_subtype>:all`` - L'onglet ``mine`` sera basé sur la route ``collection:<entity_type>:<entity_subtype>:owner`` - L'onglet `` friend`` sera basé sur la route ``collection:<entity_type>:<entity_subtype>:friends``

source: If the routes aren't registered the tabs will not appear.
fr: Si les routes ne sont pas enregistrés, les onglets n'apparaîtront pas.

source: Filters site's registration URL. Can be used by plugins to attach invitation codes, referrer codes etc. to the registration URL. ``$params`` array contains an array of query elements added to the registration URL by the invoking script. The event must return an absolute URL to the registration page.
fr: Filtre l'URL d'inscription du site. Peut être utilisé par les plugins pour attacher des codes d'invitation, des codes de référence, etc. à l'URL d'inscription. Le tableau ``$params`` contient un tableau d'éléments de requête ajoutés à l'URL d'enregistrement par le script appelant. L'événement doit renvoyer une URL absolue vers la page d'inscription.

source: Triggered after the translations are (re)loaded.
fr: Déclenché après que les traductions ont été (re)chargées.

source: Filter GET and POST input. This is used by ``get_input()`` to sanitize user input.
fr: Filtre l'entrée GET et POST. Ceci est utilisé par ``get_input()`` pour assainir les entrées utilisateur.

source: Allows plugins to register their own database seeds. Seeds populate the database with fake entities for testing purposes. Seeds must extend ``\Elgg\Database\Seeds\Seed`` class to be executable via ``elgg-cli database:seed``.
fr: Permet aux plugins d’enregistrer leurs propres semences de base de données. Les graines remplissent la base de données avec de fausses entités à des fins de test. Les graines doivent étendre la classe ``\Elgg\Database\Seeds\Seed`` pour qu’elle soit exécutable via ``elgg-cli database:seed``.

source: Triggered before an HTTP response is sent. Handlers will receive an instance of `\Symfony\Component\HttpFoundation\Response` that is to be sent to the requester. Handlers can terminate the event and prevent the response from being sent by returning `false`.
fr: Déclenché avant l’envoi d’une réponse HTTP. Les gestionnaires recevront une instance de la réponse `\Symfony\Component\HttpFoundation\Response` qui doit être envoyée au demandeur. Les gestionnaires peuvent mettre fin à l’événement et empêcher l’envoi de la réponse en renvoyant `false`.

source: Triggered after an HTTP response is sent. Handlers will receive an instance of `\Symfony\Component\HttpFoundation\Response` that was sent to the requester.
fr: Déclenché après l’envoi d’une réponse HTTP. Les gestionnaires recevront une instance de la réponse `\Symfony\Component\HttpFoundation\Response` qui a été envoyée au demandeur.

source: Triggered after the page has been sent to the user. Expensive operations could be done here and not make the user wait.
fr: Déclenché après l’envoi de la page à l’utilisateur. Des opérations coûteuses pourraient être faites ici sans que cela fasse attendre l’utilisateur.

source: Depending upon your server configuration the PHP output might not be shown until after the process is completed. This means that any long-running processes will still delay the page load.
fr: Selon la configuration de votre serveur, la sortie PHP peut ne pas être affichée avant la fin du processus. Cela signifie que tous les processus longs retarderont toujours le chargement de la page.

source: This event is prefered above using ``register_shutdown_function`` as you may not have access to all the Elgg services (eg. database) in the shutdown function but you will in the event.
fr: Cet événement est préféré à l’utilisation de ``register_shutdown_function`` car vous n’avez peut-être pas accès à tous les services Elgg (par ex. la base de données) dans la fonction d’arrêt, alors que vous l'aurez dans l’événement.

source: The Elgg session is already closed before this event. Manipulating session is not possible.
fr: La session Elgg est déjà terminée avant cet événement. La manipulation de la session n’est plus possible.

source: Filters the view output for a ``/cache`` URL when simplecache is enabled.
fr: Filtre la sortie de la vue pour une URL ``/cache`` quand simplecache est activé.

source: Triggered after a system upgrade has finished. All upgrade scripts have run, but the caches are not cleared.
fr: Déclenché une fois la mise à niveau du système terminée. Tous les scripts de mise à niveau sont exécutés, mais les caches ne sont pas effacés.

source: Triggered when executing an ``ElggUpgrade``. The ``$object`` of the event is the ``ElggUpgrade``.
fr: Déclenché lors de l’exécution d’un ``ElggUpgrade``. L'objet ``$object`` de l’événement est le ``ElggUpgrade``.

source: User events
fr: Événements utilisateur

source: Triggered before a user is banned. Return false to prevent.
fr: Déclenché avant qu'un utilisateur ne soit banni. Retournez false pour l'éviter.

source: Triggered before the user email is changed. Allows plugins to implement additional logic required to change email, e.g. additional email validation. The event handler must return false to prevent the email from being changed right away.
fr: Déclenché avant la modification de l'adresse email de l'utilisateur. Permet aux plugins d'implémenter une logique supplémentaire requise pour modifier l'email, par ex. validation supplémentaire par email. Le gestionnaire d'événements doit renvoyer false pour empêcher que l'e-mail soit modifié immédiatement.

source: ``user`` - ``\ElggUser``, whose settings are being saved
fr: ``user`` - ``\ElggUser``, dont les paramètres ont été sauvegardés

source: ``email`` - Email address that passes sanity checks
fr: ``email`` - Adresse e-mail qui passe les vérifications sanitaires

source: ``request`` - ``\Elgg\Request`` to the action controller
fr: ``request`` - ``\Elgg\Request`` vers le contrôleur de l'action

source: Triggered when user's account validation has been revoked.
fr: Déclenché lorsque la validation du compte de l’utilisateur a été révoquée.

source: Filters the URL to which the user will be forwarded after login.
fr: Filtre l’URL vers laquelle l’utilisateur sera redirigé après la connexion.

source: Triggered after a successful login. Only if there is no previous login.
fr: Déclenché après une connexion réussie. Uniquement s'il n'y a pas de connexion précédente.

source: Triggered after the user logouts.
fr: Déclenché après que l'utilisateur se soit déconnecté.

source: Triggered during logout. Returning false should prevent the user from logging out.
fr: Déclenché pendant la déconnexion. Renvoyer false empêche l’utilisateur de se déconnecter.

source: Triggered before a user is promoted to an admin. Return false to prevent.
fr: Déclenché avant qu’un utilisateur ne soit promu administrateur. Retournez false pour l'éviter.

source: User has changed profile icon
fr: L'utilisateur a modifié son icône de profil

source: User has changed profile
fr: L'utilisateur a modifié son profil

source: Triggered by the ``register`` action after the user registers. Return ``false`` to delete the user. Note the function ``register_user`` does *not* trigger this event. Event handlers can throw ``\Elgg\Exceptions\Configuration\RegistrationException`` with an error message to be displayed to the user.
fr: Déclenché par l'action ``register`` après l'enregistrement de l'utilisateur. Renvoyez ``false`` pour supprimer l'utilisateur. Notez que la fonction ``register_user`` ne déclenche *pas* cet événement. Les gestionnaires d'événements peuvent lancer ``\Elgg\Exceptions\Configuration\RegistrationException`` avec un message d'erreur à afficher à l'utilisateur.

source: ``user`` - Newly registered user entity
fr: ``user`` - L'entité utilisateur nouvellement enregistrée

source: All parameters sent with the request to the action (incl. ``password``, ``friend_guid``, ``invitecode`` etc)
fr: Tous les paramètres envoyés avec la requête à l’action (comprend ``password``, ``friend_guid``, ``invitecode``, etc.)

source: Return boolean for if the string in ``$params['email']`` is valid for an email address. Event handler can throw ``\Elgg\Exceptions\Configuration\RegistrationException`` with an error message to be shown to the user.
fr: Renvoie un booléen si la chaîne dans ``$params['email']`` est une adresse email valide. Le gestionnaire d'événements peut lancer ``\Elgg\Exceptions\Configuration\RegistrationException`` avec un message d'erreur à afficher à l'utilisateur.

source: Return boolean for if the string in ``$params['password']`` is valid for a password. Event handler can throw ``\Elgg\Exceptions\Configuration\RegistrationException`` with an error message to be shown to the user.
fr: Renvoie un booléen si la chaîne dans ``$params['password']`` est un mot de passe valide. Le gestionnaire d'événements peut lancer une ``\Elgg\Exceptions\Configuration\RegistrationException`` avec un message d'erreur à afficher à l'utilisateur.

source: Return boolean for if the string in ``$params['username']`` is valid for a username. Event handler can throw ``\Elgg\Exceptions\Configuration\RegistrationException`` with an error message to be shown to the user.
fr: Renvoie un booléen si la chaîne dans ``$params['username']`` est un nom d'utilisateur valide. Le gestionnaire d'événements peut lancer une ``\Elgg\Exceptions\Configuration\RegistrationException`` avec un message d'erreur à afficher à l'utilisateur.

source: Triggered before a user is demoted from an admin. Return false to prevent.
fr: Déclenché avant que le rôle d'administrateur ne soit retiré à un utilisateur. Retournez false pour l'éviter.

source: Triggered before a user is unbanned. Return false to prevent.
fr: Déclenché avant qu’un utilisateur ne soit réintégré. Retournez false pour l'éviter.

source: Filters the string of blacklisted characters used to validate username during registration. The return value should be a string consisting of the disallowed characters. The default string can be found from ``$params['blacklist']``.
fr: Filtre la chaîne et supprime les caractères interdits pour valider le nom d’utilisateur lors de l’inscription. La valeur de retour doit être une chaîne composée des caractères refusés. La chaîne par défaut se trouve dans ``$params['blacklist']``.

source: Triggered in the aggregate action to save user settings. The event handler must return ``false`` to prevent sticky forms from being cleared (i.e. to indicate that some of the values were not saved). Do not return ``true`` from your event handler, as you will override other events' output, instead return ``null`` to indicate successful operation.
fr: Déclenché dans l'action globale pour enregistrer les paramètres utilisateur. Le gestionnaire d'événements doit retourner ``false`` pour empêcher que les formulaires persistants ne soient effacés (c'est-à-dire pour indiquer que certaines valeurs n'ont pas été enregistrées). Ne renvoyez pas ``true`` depuis votre gestionnaire d'événements, car vous écraseriez la sortie des autres événements, mais renvoyez plutôt ``null`` pour indiquer une opération réussie.

source: When a user registers, the user's account is disabled. This event is triggered to allow a plugin to determine how the user should be validated (for example, through an email with a validation link).
fr: Lorsqu’un utilisateur s’inscrit, le compte de l’utilisateur est désactivé. Cet événement est déclenché pour permettre à un plugin de déterminer comment l’utilisateur doit être validé (par exemple, par le biais d’un e-mail avec un lien de validation).

source: Triggered when user's account has been validated.
fr: Déclenché lorsque le compte utilisateur a été validé.

source: Relationship events
fr: Événements des relations

source: Triggered after a relationship has been created. Returning false deletes the relationship that was just created.
fr: Déclenché après la création d’une relation. Renvoyez false pour supprimer la relation qui vient d’être créée.

source: Triggered before a relationship is deleted. Return false to prevent it from being deleted.
fr: Déclenché avant la suppression d’une relation. Renvoyez false pour éviter qu’elle soit supprimée.

source: Triggered after the user ``$params['user']`` has joined the group ``$params['group']``.
fr: Déclenché après que l’utilisateur ``$params['user']`` a rejoint le groupe ``$params['group']``.

source: Triggered before the user ``$params['user']`` has left the group ``$params['group']``.
fr: Déclenché avant que l’utilisateur ``$params['user']`` n'ait quitté le groupe ``$params['group']``.

source: Entity events
fr: Événements des entités

source: Triggered in ``elgg_view_comments()``. If returning content, this overrides the ``page/elements/comments`` view.
fr: Déclenché dans ``elgg_view_comments()``. S'il renvoie du contenu, celui-ci remplace la vue ``page/elements/comments``.

source: Return the number of comments on ``$params['entity']``.
fr: Renvoie le nombre de commentaires sur ``$params['entity']``.

source: Triggered for user, group, object, and site entities after creation. Triggered just before the ``create:after`` event, mostly for BC reasons. The use of the ``create:after`` event is preferred.
fr: Déclenché pour les entités user, group, object et site après leur création. Déclenché juste avant l'événement ``create:after``, principalement pour des raisons de rétrocompatibilité. L'utilisation de l'événement ``create:after`` est préférable.

source: Triggered for user, group, object, and site entities after creation.
fr: Déclenché pour les entités user, group, object et site après la création.

source: Triggered for user, group, object, and site entities before creation. Return false to prevent creating the entity.
fr: Déclenché pour les entités user, group, object et site avant la création. Renvoyez false pour empêcher la création de l’entité.

source: Triggered before the entity is disabled. Return false to prevent disabling.
fr: Déclenché avant qu'une entité soit désactivée. Retournez false pour éviter la désactivation.

source: Triggered after the entity is disabled.
fr: Déclenché après qu'une entité a été désactivée.

source: Return false to prevent enabling.
fr: Retournez false pour éviter l'activation.

source: Triggered after the entity is enabled.
fr: Déclenché après qu'une entité a été activée.

source: Return the number of likes for ``$params['entity']``.
fr: Renvoie le nombre de mentions J’aime pour ``$params['entity']``.

source: Triggered before an update for the user, group, object, and site entities. Return false to prevent update. The entity method ``getOriginalAttributes()`` can be used to identify which attributes have changed since the entity was last saved.
fr: Déclenché avant une mise à jour pour les entités user, group, object et site. Renvoyez false pour empêcher la mise à jour. La méthode d’entité ``getOriginalAttributes()`` peut être utilisée pour identifier les attributs qui ont changé depuis la dernière fois que l’entité a été enregistrée.

source: Triggered after an update for the user, group, object, and site entities. The entity method ``getOriginalAttributes()`` can be used to identify which attributes have changed since the entity was last saved.
fr: Déclenché après une mise à jour pour les entités user, group, object et site. La méthode d’entité ``getOriginalAttributes()`` peut être utilisée pour identifier les attributs qui ont changé depuis la dernière fois que l’entité a été enregistrée.

source: Metadata events
fr: Événements des métadonnées

source: Called after the metadata has been created. Return false to delete the metadata that was just created.
fr: Appelé après qu'une métadonnée a été créée. Retournez false pour supprimer la métadonnée qui vient d'être créée.

source: Called before metadata is deleted. Return false to prevent deletion.
fr: Appelé avant que métadonnée soit supprimée. Retournez false pour éviter la suppression.

source: Called after the metadata has been updated. Return false to *delete the metadata.*
fr: Appelé après qu'une métadonnée a été modifiée. Retournez false pour *supprimer la métadonnée.*

source: Annotation events
fr: Événements des annotations

source: Called before the annotation has been created. Return false to prevent annotation of this entity.
fr: Appelé avant que l'annotation soit créée. Retournez false pour éviter l'annotation de cette entité.

source: Called after the annotation has been created. Return false to delete the annotation.
fr: Appelé après que l'annotation a été créée. Retournez false pour supprimer l'annotation.

source: Called before annotation is deleted. Return false to prevent deletion.
fr: Appelé avant que l'annotation soit supprimée. Retournez false pour éviter la suppression.

source: Called after the annotation has been updated. Return false to *delete the annotation.*
fr: Appelé après qu'une annotation a été modifiée. Retournez false pour *supprimer l'annotation.*

source: River events
fr: Événements de la rivière

source: Called after a river item is created.
fr: Appelé après qu'un élément de la rivière a été créé.

source: Called before the river item is saved to the database. Return ``false`` to prevent the item from being created.
fr: Appelé avant que l'élément river ne soit enregistré dans la base de données. Renvoie ``false`` pour empêcher la création de l'élément.

source: Triggered after a river item was deleted.
fr: Déclenché après qu'un élément de la rivière a été supprimé.

source: Triggered before a river item is deleted. Returning false cancels the deletion.
fr: Déclenché avant qu'un élément de la rivière soit supprimé. Renvoyer false annule la suppression.

source: Access events
fr: Événements des accès

source: Can be used to filter the URL of the access collection.
fr: Peut être utilisé pour filtrer l’URL de la collection d’accès.

source: Can be used to filter the display name (readable access level) of the access collection.
fr: Peut être utilisé pour filtrer le nom affiché (niveau d’accès lisible) de la collection d’accès.

source: Filters an array of access IDs that the user ``$params['user_id']`` can see.
fr: Filtre le tableau des IDs d’accès que l’utilisateur ``$params['user_id']`` peut voir.
