Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: In the example above, we have registered a new route that is accessible via ``http://yoursite/my_plugin/section/<guid>/<subsection>``. Whenever that route is accessed with a required ``guid`` segment and an optional ``subsection`` segment, the router will render the specified ``my_plugin/section`` resource view and pass the parameters extracted from the URL to your resource view with ``$vars``.
fr: Dans l’exemple ci-dessus, nous avons enregistré une nouvelle route qui est accessible via ``http://yoursite/my_plugin/section/<guid>/<subsection>``. Chaque fois que cette route est accédée avec le segment requis ``guid`` et un segment facultatif ``subsection``, le routeur va afficher la vue de la ressource spécifiée ``my_plugin/section`` et transmettre les paramètres extraits de l’URL à votre vue de ressource via ``$vars``.

source: Routes names
fr: Noms des routes

source: Route names can then be used to generate a URL:
fr: Les noms de routes peuvent ensuite être utilisés pour générer une URL :

source: The route names are unique across all plugins and core, so another plugin can override the route by registering different parameters to the same route name.
fr: Les noms d’itinéraires sont uniques pour l'ensemble des plugins et pour le noyau, de sorte qu’un autre plugin peut surcharger une route en enregistrant d'autres paramètres sur le même nom de route.

source: Route names follow a certain convention and in certain cases will be used to automatically resolve URLs, e.g. to display an entity.
fr: Les noms des routes respectent un certain formalisme et seront, dans certains cas, utilisés pour résoudre automatiquement les URLs, par exemple pour afficher une entité.

source: The following conventions are used in core and recommended for plugins:
fr: Les conventions suivantes sont utilisées dans le noyau et recommandées pour les plugins :

source: Maps to the entity profile page, e.g. ``view:user:user`` or ``view:object:blog`` The path must contain a ``guid``, or ``username`` for users
fr: Correspond à la page de profil de l’entité, par exemple ``view:user:user`` ou ``view:object:blog``. Le chemin d’accès doit contenir un ``guid``, ou un ``username`` pour les utilisateurs

source: Maps to the form to edit the entity, e.g. ``edit:user:user`` or ``edit:object:blog`` The path must contain a ``guid``, or ``username`` for users If you need to add subresources, use suffixes, e.g. ``edit:object:blog:images``, keeping at least one subresource as a default without suffix.
fr: Correspond au formulaire pour modifier l’entité, par exemple ``edit:user:user`` ou ``edit:object:blog``. Le chemin d’accès doit contenir un ``guid``, ou un ``username`` pour les utilisateurs. Si vous avez besoin d’ajouter des sous-ressources, utilisez des suffixes, par exemple ``edit:object:blog:images``, en gardant au moins une sous-ressource sans suffixe par défaut.

source: Maps to the form to add a new entity of a given type, e.g. ``add:object:blog`` The path, as a rule, contains ``container_guid`` parameter
fr: Correspond au formulaire pour ajouter une nouvelle entité d’un type donné, par exemple ``add:object:blog``. Le chemin d’accès, en règle générale, contient le paramètre ``container_guid``

source: Maps to listing pages. Common route names used in core are, as follows:
fr: Correspond aux pages de listes. Les noms de routes couramment utilisés dans le noyau sont les suivants :

source: ``collection:object:blog:all``: list all blogs
fr: ``collection:object:blog:all`` : liste tous les articles de blog

source: ``collection:object:blog:owner``: list blogs owned by a user with a given username
fr: ``collection:object:blog:owner`` : liste les articles de blog appartenant à un utilisateur avec un identifiant donné

source: ``collection:object:blog:friends``: list blogs owned by friends of the logged in user (or user with a given username)
fr: ``collection:object:blog:friends`` : liste les articles de blog appartenant à des contacts de l’utilisateur connecté (ou d'un utilisateur avec un identifiant donné)

source: ``collection:object:blog:group``: list blogs in a group
fr: ``collection:object:blog:group`` : liste les articles de blog dans un groupe

source: Maps to the default page for a resource, e.g. the path ``/blog``. Elgg happens to use the "all" collection for these routes.
fr: Fait correspondre à la page par défaut pour une ressource, par exemple pour le chemin d’accès ``/blog``. Elgg utilise la collection "all" pour ces routes.

source: ``default:object:blog``: handle the generic path ``/blog``.
fr: ``default:object:blog`` : gère le chemin générique ``/blog``.

source: ``<entity_subtype>`` can be omitted from route names to register global routes applicable to all entities of a given type. URL generator will first try to generate a URL using the subtype, and will then fallback to a route name without a subtype. For example, user profiles are routed to the same resource view regardless of user subtype.
fr: ``<entity_subtype>`` peut être omis des noms de routes pour enregistrer des routes globales applicables à toutes les entités d’un type donné. Le générateur d’URL va d'abord essayer de générer une URL à l’aide du sous-type, puis se replie sur un nom de route sans sous-type. Par exemple, les profils utilisateur sont acheminés vers la même vue de ressource quel que soit le sous-type utilisateur.

source: Route configuration
fr: Configuration du routage

source: Segments can be defined using wildcards, e.g. ``profile/{username}``, which will match all URLs that contain ``profile/`` followed by and arbitrary username.
fr: Les segments peuvent être définis à l’aide de jokers, par exemple ``profile/{username}``, qui correspond à toutes les URL qui contiennent ``profile/`` suivies d’un nom d’utilisateur arbitraire.

source: To make a segment optional you can add a ``?`` (question mark) to the wildcard name, e.g. ``profile/{username}/{section?}``. In this case the URL will be matched even if the ``section`` segment is not provided.
fr: Pour rendre un segment facultatif, vous pouvez ajouter un ``?`` (point d’interrogation) au nom du joker, par exemple ``profile/{username}/{section?}``. Dans ce cas, l’URL va correspondre même si le segment ``section`` n’est pas fourni.

source: You can further constrain segments using regex requirements:
fr: Vous pouvez contraindre davantage les segments en utilisant les exigences regex :

source: By default, Elgg will set the following requirements for named URL segments:
fr: Par défaut, Elgg va définir les exigences suivantes pour les segments d’URL nommés :

source: Plugin dependent routes
fr: Routes dépendant d'un plugin

source: If a route requires a specific plugin to be active this can be configured in the route configuration.
fr: Si une route a besoin qu'un plugin spécifique soit actif, cela peut être configuré dans la configuration de la route.

source: Route middleware
fr: Middleware de routage

source: Route middleware can be used to prevent access to a certain route, or to perform some business logic before the route is rendered. Middleware can be used, e.g. to implement a paywall, or to log analytics, or to set open graph metatags.
fr: Les middlewares de gestion du routage peuvent être utilisés pour empêcher l’accès à une certaine route, ou pour exécuter une certaine logique avant que la route ne soit rendue. Un middleware peut être utilisé, par exemple pour implémenter un système d'inscription payante, ou pour définir des métadonnées open graph.

source: Elgg core implements several middleware handlers. The following middleware can be found in the namespace ``\Elgg\Router\Middleware``:
fr: Le noyau de Elgg implémente plusieurs gestionnaires de middleware. Le middleware suivant se trouve dans l’espace de noms ``\Elgg\Router\Middleware`` :

source: This gatekeeper will prevent access by non-authenticated users.
fr: Ce gestionnaire d'accès empêchera l’accès des utilisateurs non authentifiés.

source: This gatekeeper will prevent access by non-admin users.
fr: Ce gestionnaire d'accès empêchera l’accès des utilisateurs non-administrateurs.

source: This gatekeeper will prevent access by authenticated users.
fr: Ce gestionnaire d'accès empêchera l’accès à tout utilisateur authentifié.

source: This gatekeeper will prevent access with non-xhr requests.
fr: Ce gestionnaire d'accès empêchera l’accès à toute demande non-XHR.

source: This gatekeeper will prevent access if there is no pageowner entity.
fr: Ce contrôleur d'accès empêchera l'accès s'il n'y a pas d'entité propriétaire de la page.

source: This gatekeeper extends the ``PageOwnerGatekeeper`` but also requires the pageowner to be a ``ElggGroup`` entity.
fr: Ce contrôleur d'accès étend ``PageOwnerGatekeeper`` et requiert également que le propriétaire de la page soit une entité ``ElggGroup``.

source: This gatekeeper extends the ``PageOwnerGatekeeper`` but also requires the pageowner to be an ``ElggUser`` entity.
fr: Ce contrôleur d'accès étend le ``PageOwnerGatekeeper`` et requiert également que le propriétaire de la page soit une entité ``ElggUser``.

source: This gatekeeper will prevent access if there is no pageowner detected and the pageowner can't be editted.
fr: Ce contrôleur d'accès bloquera l'accès si aucun propriétaire de page n'est détecté et que le propriétaire de la page ne peut pas être modifié.

source: This gatekeeper extends the ``PageOwnerCanEditGatekeeper`` but also requires the pageowner to be a ``ElggGroup`` entity.
fr: Ce gestionnaire d'accès étend ``PageOwnerCanEditGatekeeper`` mais exige également que le propriétaire de la page soit une entité ``ElggGroup``.

source: This gatekeeper extends the ``PageOwnerCanEditGatekeeper`` but also requires the pageowner to be an ``ElggUser`` entity.
fr: Ce gestionnaire d'accès étend ``PageOwnerCanEditGatekeeper`` mais exige également que le propriétaire soit une entité ``ElggUser``.

source: This middleware will prevent access without the correct CSRF tokens. This middleware will automatically be applied to actions.
fr: Ce middleware empêchera l’accès sans les jetons CSRF corrects. Ce middleware sera automatiquement appliqué aux actions.

source: This middleware will provide action related logic. This middleware will automatically be applied to actions.
fr: Ce middleware fournira une logique liée à l’action. Ce middleware sera automatiquement appliqué aux actions.

source: This gatekeeper will prevent access if the url has been tampered with. A secure URL can be generated using the ``elgg_http_get_signed_url`` function.
fr: Ce gestionnaire d'accès empêchera l’accès si l’URL a été trafiquée. Une URL sécurisée peut être générée à l’aide de la fonction ``elgg_http_get_signed_url``.

source: This gatekeeper will prevent access if the upgrade URL is secured and the URL is invalid.
fr: Ce gestionnaire d'accès empêchera l’accès si l’URL de mise à niveau est sécurisée et que l’URL n’est pas valide.

source: This middleware will prevent access to a route if the site is configured for authenticated users only and there is no authenticated user logged in. This middleware is automatically enabled for all routes. You can disable the walled garden gatekeeper with a :ref:`route config <guides/walled-garden#expose>` option.
fr: Ce middleware empêchera l’accès à une route si le site est configuré uniquement pour les utilisateurs authentifiés et qu’aucun utilisateur authentifié n’est connecté. Ce middleware est automatiquement activé pour toutes les routes. Vous pouvez désactiver le gardien du walled garden avec une option de :ref:`configuration de route <guides/walled-garden#expose>`.

source: Custom Middleware
fr: Middleware personnalisé

source: Middleware handlers can be set to any callable that receives an instance of ``\Elgg\Request``: The handler should throw an instance of ``\Elgg\Exceptions\HttpException`` to prevent route access. The handler can return an instance of ``\Elgg\Http\ResponseBuilder`` to prevent further implementation of the routing sequence (a redirect response can be returned to re-route the request).
fr: Les gestionnaires de middleware peuvent être définis par n'importe quelle fonction appellable qui reçoit une instance de ``\Elgg\Request`` : le gestionnaire devrait lancer une instance de ``\Elgg\Exceptions\HttpException`` pour empêcher l'accès à la route. Le gestionnaire peut renvoyer une instance de ``\Elgg\Http\ResponseBuilder`` pour empêcher la poursuite de la mise en œuvre de la séquence de routage (une réponse de redirection peut être renvoyée pour réacheminer la requête).

source: Route controllers
fr: Contrôleurs de routage

source: In certain cases, using resource views is not appropriate. In these cases you can use a controller - any callable that receives an instance of ``\Elgg\Request``:
fr: Dans certains cas, l’utilisation des vues de ressources n’est pas appropriée. Dans ces cas, vous pouvez utiliser un contrôleur - toute fonction appelable qui reçoit une instance de ``\Elgg\Request`` :

source: The ``route:rewrite`` event
fr: L'événement ``route:rewrite``

source: For URL rewriting, the ``route:rewrite`` event (with similar arguments as ``route``) is triggered very early, and allows modifying the request URL path (relative to the Elgg site).
fr: Pour la réécriture d'URL, l'événement ``route:rewrite`` (avec des arguments similaires à ``route``) est déclenché très tôt, et permet de modifier le chemin de l'URL de la requête (par rapport au site Elgg).

source: Here we rewrite requests for ``news/*`` to ``blog/*``:
fr: Ici, nous réécrivons les requêtes de ``news/*`` vers ``blog/*`` :

source: The event must be registered directly in your plugin Bootstrap ``boot`` function. The ``init`` function is too late.
fr: L'événement doit être enregistré directement dans la fonction ``boot`` du Bootstrap de votre plugin. La fonction ``init`` arrive trop tard.

source: Routing overview
fr: Aperçu du routage

source: For regular pages, Elgg's program flow is something like this:
fr: Pour les pages standard, le flux de programme de Elgg est quelque chose comme ceci :

source: A user requests ``http://example.com/news/owner/jane``.
fr: Un utilisateur demande ``http://example.com/news/owner/jane``.

source: Plugins are initialized.
fr: Les plugins sont initialisés.

source: Elgg parses the URL to identifier ``news`` and segments ``['owner', 'jane']``.
fr: Elgg analyse l’URL pour l'identificateur ``news`` et les segments ``['owner', 'jane']``.

source: Elgg triggers the event ``route:rewrite, news`` (see above).
fr: Elgg déclenche l'événement ``route:rewrite, news`` (voir ci-dessus).

source: Elgg finds a registered route that matches the final route path, and renders a resource view associated with it. It calls ``elgg_view_resource('blog/owner', $vars)`` where ``$vars`` contains the username.
fr: Elgg trouve une route enregistrée qui correspond au chemin d’accès final de la route, et affiche la vue de ressource qui lui est associée, en appellant ``elgg_view_resource('blog/owner', $vars)``, où ``$vars`` contient le nom d’utilisateur.

source: The ``resources/blog/owner`` view gets the username via ``$vars['username']``, and uses many other views and formatting functions like ``elgg_view_layout()`` and ``elgg_view_page()`` to create the entire HTML page.
fr: La vue ``resources/blog/owner`` obtient le nom d’utilisateur via ``$vars['username']`` et utilise de nombreuses autres vues et fonctions de mise en forme telles que ``elgg_view_layout()`` et ``elgg_view_page()`` pour créer la page HTML complète.

source: PHP invokes Elgg's shutdown sequence.
fr: PHP invoque la séquence d’arrêt de Elgg.

source: The user receives a fully rendered page.
fr: L’utilisateur reçoit une page complète.

source: Elgg's coding standards suggest a particular URL layout, but there is no syntax enforced.
fr: Les normes de codage de Elgg suggèrent une disposition d’URL particulière, mais il n’y a pas de syntaxe obligatoire.

source: Entity search
fr: Recherche d'entité

source: Elgg core provides flexible ``elgg_search()``, which prepares custom search clauses and utilizes ``elgg_get_entities()`` to fetch the results.
fr: Le noyau de Elgg fournit des ``elgg_search()`` flexibles, qui préparent des clauses de recherche personnalisées et utilisent ``elgg_get_entities()`` pour récupérer les résultats.

source: In addition to all parameters accepted by ``elgg_get_entities()``, ``elgg_search()`` accepts the following:
fr: Outre tous les paramètres acceptés par ``elgg_get_entities()``, ``elgg_search()`` accepte les paramètres suivants :

source: ``query`` Search query
fr: ``query`` Requête - Termes de la recherche

source: ``fields`` An array of names by property type to search in (see example below)
fr: ``fields`` Un tableau de noms par type de propriété à rechercher (voir l’exemple ci-dessous)

source: ``sort_by`` An array containing sorting options, including `property`, `property_type` and `direction`
fr: ``sort_by`` Un tableau contenant des options de tri, comprenant `property`, `property_type` et `direction`

source: ``type`` Entity type to search
fr: ``type`` Type d’entité à rechercher

source: ``subtype`` Optional entity subtype to search
fr: ``subtype`` Sous-type d’entité à rechercher - facultatif

source: ``search_type`` Custom search type (required if no ``type`` is provided)
fr: ``search_type`` Type de recherche personnalisé (requis si aucun ``type`` n’est fourni)

source: ``partial_match`` Allow partial matches
fr: ``partial_match`` Autorise les correspondances partielles

source: By default partial matches are allowed, meaning that ``elgg`` will be matched when searching for ``el`` Exact matches may be helpful when you want to match tag values, e.g. when you want to find all objects that are ``red`` and not ``darkred``
fr: Par défaut, les correspondances partielles sont autorisées, ce qui signifie que ``elgg`` sera trouvé lors de la recherche de ``el``. Les correspondances exactes peuvent être utiles lorsque vous souhaitez trouver les correspondances pour une métadonnée précise, par exemple lorsque vous voulez trouver tous les objets dont la couleur est ``red`` et non ``darkred``

source: ``tokenize`` Break down search query into tokens
fr: ``tokenize`` Décomposer la requête de recherche en jetons

source: By default search queries are tokenized, meaning that we will match ``elgg has been released`` when searching for ``elgg released``
fr: Par défaut, les requêtes de recherche utilisent des jetons - sont tokenisées, ce qui signifie que nous allons trouver ``elgg a été publié`` lors d'une recherche sur ``elgg publié``

source: Search fields
fr: Champs de recherche

source: You can customize search fields for each entity type/subtype, using ``search:fields`` event:
fr: Vous pouvez personnaliser les champs de recherche pour chaque type/sous-type d'entité, en utilisant l'événement ``search:fields`` :

source: Searchable types
fr: Entités pouvant être recherchées

source: To register an entity type for search, use ``elgg_entity_enable_capability($type, $subtype, 'searchable')``, or do so when defining an entity type in ``elgg-plugin.php``.
fr: Pour enregistrer un type d'entité pour la recherche, utilisez ``elgg_entity_enable_capability($type, $subtype, 'searchable')``, ou faites-le lors de la définition du type d'entité dans ``elgg-plugin.php``.

source: The search plugin uses the entity capability `searchable`. This capability defines if an entity is searchable.
fr: Le plugin de recherche utilise la capacité d'entité `searchable`. Cette capacité définit si une entité peut être recherchée.

source: To combine search results or filter how search results are presented in the search plugin, use ``'search:config', 'type_subtype_pairs'`` event.
fr: Pour combiner les résultats de recherche ou filtrer la façon dont les résultats de recherche sont présentés dans le plugin de recherche, utilisez l'événement ``'search:config', 'type_subtype_pairs'``.

source: Custom search types
fr: Types de recherches personnalisés

source: Elgg core only supports entity search. You can implement custom searches, e.g. using search query as a location and listing entities by proximity to that location.
fr: Le noyau de Elgg prend en charge uniquement la recherche d’entités. Vous pouvez implémenter des recherches personnalisées, par exemple en utilisant une requête de recherche comme un emplacement pour lister les entités à proximité de cet emplacement.

source: Autocomplete and livesearch endpoint
fr: Points de terminaison pour l'autocomplétion et la recherche en direct

source: Core provides a JSON endpoint for searching users and groups. These endpoints are used by ``input/autocomplete`` and ``input/entitypicker`` views.
fr: Le coeur de Elgg fournit un point de terminaison JSON pour rechercher des utilisateurs et des groupes. Ces points de terminaison sont utilisés par les vues ``input/autocomplete`` et ``input/entitypicker``.

source: You can add custom search types, by adding a corresponding resource view:
fr: Vous pouvez ajouter des types de recherche personnalisés en ajoutant une vue de ressource correspondante :

source: Elgg uses the ``Elgg\Application`` class to load and bootstrap Elgg. In future releases this class will offer a set of service objects for plugins to use.
fr: Elgg utilise la classe ``Elgg\Application`` pour charger et initialiser Elgg. Dans les versions futures cette classe offrira un ensemble d’objets de service à l'usage des plugins.

source: If you have a useful idea, you can :doc:`add a new service </contribute/services>`!
fr: Si vous avez une idée utile, vous pouvez :doc:`ajouter un nouveau service </contribute/services>` !

source: ``elgg()->menus`` provides low-level methods for constructing menus. In general, menus should be passed to ``elgg_view_menu`` for rendering instead of manual rendering.
fr: ``elgg()->menus`` fournit des méthodes de bas niveau pour la construction de menus. En général, les menus doivent être transmis à ``elgg_view_menu`` pour le rendu, plutôt qu'un rendu manuel.

source: Plugin settings
fr: Paramètres de plugin

source: You need to perform some extra steps if your plugin needs settings to be saved and controlled via the administration panel:
fr: Vous devez effectuer quelques étapes supplémentaires si votre plugin a besoin de paramètres qui doivent être enregistrés et contrôlés via le panneau d’administration :

source: Create a file in your plugin’s default view folder called ``plugins/your_plugin/settings.php``, where ``your_plugin`` is the name of your plugin’s directory in the ``mod`` hierarchy
fr: Créez un fichier dans le dossier des vues par défaut de votre plugin appelé ``plugins/your_plugin/settings.php``, où ``your_plugin`` est le nom du répertoire de votre plugin dans la hiérarchie ``mod``

source: Fill this file with the form elements you want to display together with :doc:`internationalised <i18n>` text labels
fr: Remplissez ce fichier avec les éléments de formulaire que vous souhaitez afficher avec les :doc:`traductions des <i18n>` étiquettes de texte

source: Set the name attribute in your form components to ``params[`varname`]`` where ``varname`` is the name of the variable. These will be saved as metadata attached to a plugin entity. So, if your variable is called ``params[myparameter]`` your plugin (which is also passed to this view as ``$vars['entity']``) will be called ``$vars['entity']->myparameter``
fr: Définissez l'attribut name dans vos composants de formulaire sur ``params[`varname`]`` où ``varname`` est le nom de la variable. Ceux-ci seront enregistrés sous forme de métadonnées attachées à une entité de plugin. Ainsi, si votre variable s'appelle ``params[myparameter]``, votre plugin (qui est également passé à cette vue sous le nom ``$vars['entity']``) s'appellera ``$vars['entity'] ->myparameter``

source: An example ``settings.php`` would look like:
fr: Un exemple de ``settings.php`` ressemblerait à :
