Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: It is strongly recommended to use entities wherever possible. However, Elgg supports custom SQL queries using the database API.
fr: Il est fortement recommandé d’utiliser des entités dans la mesure du possible. Toutefois, Elgg prend en charge les requêtes SQL personnalisées à l’aide de l’API de base de données.

source: This section need some attention and will contain outdated information
fr: Cette section requiert une certaine attention et risque de contenir des informations obsolètes

source: The default Elgg system log is a simple way of recording what happens within an Elgg system. It's viewable and searchable directly from the administration panel.
fr: Le journal système de Elgg par défaut est un moyen simple d’enregistrer ce qui se passe dans un système Elgg. Il est visible et consultable directement à partir du panneau d’administration.

source: System log storage
fr: Conservation du journal système

source: A system log row is stored whenever an event concerning an object whose class implements the :doc:`/design/loggable` interface is triggered. ``ElggEntity`` and ``ElggExtender`` implement :doc:`/design/loggable`, so a system log row is created whenever an event is performed on all objects, users, groups, sites, metadata and annotations.
fr: Une ligne de journal système est stockée chaque fois qu’un événement concernant un objet dont la classe implémente l’interface :doc:`/design/loggable` est déclenché. ``ElggEntity`` et ``ElggExtender`` implémentent :doc:`/design/loggable`, de sorte qu’une ligne de journal système est créée chaque fois qu’un événement est effectué sur tous les objets, utilisateurs, groupes, sites, métadonnées et annotations.

source: Common events include:
fr: Les événements courants comprennent :

source: Creating your own system log
fr: Création de votre propre journal système

source: There are some reasons why you might want to create your own system log. For example, you might need to store a full copy of entities when they are updated or deleted, for auditing purposes. You might also need to notify an administrator when certain types of events occur.
fr: Il y a quelques raisons pour lesquelles vous pouvez vouloir créer votre propre journal système. Par exemple, vous pourriez avoir besoin de stocker une copie complète des entités lorsqu’elles sont mises à jour ou supprimées, à des fins d’audit. Vous pourriez aussi avoir besoin d'aviser un administrateur lorsque certains types d’événements se produisent.

source: To do this, you can create a function that listens to all events for all types of object:
fr: Pour ce faire, vous pouvez créer une fonction qui écoute tous les événements pour tous les types d’objets :

source: Your function can then be defined as:
fr: Votre fonction peut alors être définie comme :

source: You can then use the extra methods defined by :doc:`/design/loggable` to extract the information you need.
fr: Vous pouvez ensuite utiliser les méthodes supplémentaires définies par :doc:`/design/loggable` pour extraire les informations dont vous avez besoin.

source: Don't Modify Core
fr: Ne modifiez pas le cœur

source: In general, you shouldn't modify non-config files that come with third-party software like Elgg.
fr: De manière générale, vous ne devriez pas modifier de fichier autre que ceux de configuration fournis avec des logiciels tiers comme Elgg.

source: The best way to customize the behavior of Elgg is to :doc:`install Elgg as a composer dependency</intro/install>` and use a :doc:`plugin<plugins>` to store modifications specific to your application, and alter behavior through the rich Elgg plugin API.
fr: Le meilleur moyen de personnaliser le comportement de Elgg est d' :doc:`installer Elgg en tant que dépendance composer</intro/install>` et d’utiliser un :doc:`plugin<plugins>` pour conserver les modifications spécifiques de votre application, et modifier le comportement à travers la riche API plugin de Elgg.

source: If you'd like to share customizations between sites or even publish your changes as a reusable package for the community, create a :doc:`plugin<plugins>` using the same plugin APIs and file structure.
fr: Si vous souhaitez partager des personnalisations entre les sites ou même publier vos modifications en tant que package réutilisable pour la communauté, créez un :doc:`plugin<plugins>` qui utilise la même API de plugin et la même structure de fichiers.

source: It makes it hard to get help
fr: Cela rend difficile d’obtenir de l’aide

source: When you don't share the same codebase as everyone else, it's impossible for others to know what is going on in your system and whether your changes are to blame. This can frustrate those who offer help because it can add considerable noise to the support process.
fr: Lorsque vous ne partagez pas la même base de code que tout le monde, il est impossible pour les autres de savoir ce qui se passe dans votre système et si vos modifications sont à blâmer. Cela peut frustrer ceux qui offrent de l’aide parce que cela complique considérablement le processus de soutien.

source: It makes upgrading tricky and potentially disastrous
fr: Cela rend la mise à niveau délicate et potentiellement désastreuse

source: You will certainly want or need to upgrade Elgg to take advantage of
fr: Vous voudrez certainement ou aurez besoin de mettre à niveau Elgg pour profiter de

source: security patches
fr: patchs de sécurité

source: new features
fr: nouvelles fonctionnalités

source: new plugin APIs
fr: nouvelles APIs de plugin

source: new stability improvements
fr: nouvelles améliorations de la stabilité

source: performance improvements
fr: amélioration des performances

source: If you've modified core files, then you must be very careful when upgrading that your changes are not overwritten and that they are compatible with the new Elgg code. If your changes are lost or incompatible, then the upgrade may remove features you've added and even completely break your site.
fr: Si vous avez modifié des fichiers du noyau, alors vous devez être très prudent lors de la mise à niveau afin que vos modifications ne soient pas remplacées et qu’elles soient compatibles avec le nouveau code de Elgg. Si vos modifications sont perdues ou incompatibles, la mise à niveau peut supprimer les fonctionnalités que vous avez ajoutées et même casser complètement votre site.

source: This can also be a slippery slope. Lots of modifications can lead you to an upgrade process so complex that it's practically impossible. There are lots of sites stuck running old versions software due to taking this path.
fr: Cela peut également être une pente glissante. Beaucoup de modifications peuvent vous conduire à un processus de mise à niveau si complexe qu’il en devient pratiquement impossible. Il existe beaucoup de sites coincés avec d'anciennes versions du logiciel à cause du choix de cette voie.

source: It may break plugins
fr: Cela peut casser des plugins

source: You may not realize until much later that your "quick fix" broke seemingly unrelated functionality that plugins depended on.
fr: Vous pourriez ne réaliser que beaucoup plus tard que votre "solution rapide" a cassé des fonctionnalités apparemment sans rapport dont les plugins dépendaient.

source: Summary
fr: Résumé

source: Resist the temptation
fr: Résistez à la tentation

source: Editing existing files is quick and easy, but doing so heavily risks the maintainability, security, and stability of your site.
fr: L’édition des fichiers existants est rapide et facile, mais cela compromet fortement la maintenance, la sécurité et la stabilité de votre site.

source: When receiving advice, consider if the person telling you to modify core will be around to rescue you if you run into trouble later!
fr: Lorsque vous recevez des conseils, considérez si la personne qui vous dit de modifier le noyau sera là pour vous sauver si vous rencontrez des ennuis plus tard !

source: Apply these principle to software in general.
fr: Appliquez ces principes aux logiciels en général.

source: If you can avoid it, don't modify third party plugins either, for the same reasons: Plugin authors release new versions, too, and you will want those updates.
fr: Si vous pouvez l’éviter, ne modifiez pas non plus les plugins tiers, pour les mêmes raisons : les auteurs de plugin publient également de nouvelles versions, et vous voudrez pouvoir utiliser ces mises à jour.

source: Elgg has the ability to send out emails. This can be done directly using functions like ``elgg_send_email()`` and ``notify_user()`` or indirectly through the notifications system. Below an overview of the feature of the email system.
fr: Elgg a la capacité d'envoyer des e-mails. Cela peut être fait directement en utilisant des fonctions comme ``elgg_send_email()`` et ``notify_user()`` ou indirectement via le système de notifications. Voici un aperçu des fonctionnalités du système de messagerie.

source: HTML Mail
fr: Courrier HTML

source: As an admin you can configure your site to have all outgoing emails to be HTML emails or just plain text emails. HTML emails are enabled by default. When enabled the email contents will be wrapped in HTML elements and some CSS will be applied. This allows theme developers to style the emails.
fr: En tant qu'administrateur, vous pouvez configurer votre site pour que tous les e-mails sortants soient des e-mails HTML ou simplement des e-mails en texte brut. Les e-mails HTML sont activés par défaut. Lorsqu'il est activé, le contenu de l'e-mail sera enveloppé dans des éléments HTML et du CSS sera appliqué. Cela permet aux développeurs de thèmes de styliser les e-mails.

source: The appropriate views to format and style the emails can be found in ``views/default/email``.
fr: Les vues appropriées pour formater et styliser les e-mails peuvent être trouvées dans ``views/default/email``.

source: The CSS will be inlined automatically so it will work in most email clients. If your email contains images, those images can be converted to inline base64 encoded images (default) or attachments. Converted images are the best way to have images show consistently in various clients.
fr: Le CSS sera automatiquement intégré afin qu'il fonctionne dans la plupart des clients de messagerie. Si votre e-mail contient des images, ces images peuvent être converties en images encodées en base64 (par défaut) ou en pièces jointes. Les images converties sont le meilleur moyen d'afficher les images de manière cohérente dans divers clients.

source: Instead of having the message converted automatically to a HTML, you can also provide your own ``html_message`` in the ``params`` of a notification. The ``html_message`` can be either a ``Elgg\Email\HtmlPart`` or a ``string``. If it is a ``string`` Elgg will automatically try to inline provided CSS present in the ``css`` param. If you do not want to inline CSS you will need to set the ``convert_css`` param to ``false``. Below an example of a custom HTML part.
fr: Au lieu de convertir automatiquement le message en HTML, vous pouvez également fournir votre propre ``html_message`` dans les ``params`` d'une notification. Le ``message_html`` peut être un ``Elgg\Email\HtmlPart`` ou une ``string``. S'il s'agit d'une ``string``, Elgg essaiera automatiquement d'insérer le CSS fourni présent dans le paramètre ``css``. Si vous ne voulez pas insérer de CSS, vous devrez définir le paramètre ``convert_css`` sur ``false``. Ci-dessous un exemple de partie HTML personnalisée.

source: Attachments
fr: Pièces jointes

source: ``notify_user()`` or enqueued notifications support attachments for e-mail notifications if provided in ``$params``. To add one or more attachments add a key ``attachments`` in ``$params`` which is an array of the attachments. An attachment should be in one of the following formats:
fr: ``notify_user()`` ou les notifications mises en file d'attente prennent en charge les pièces jointes pour les notifications par e-mail si elles sont fournies dans ``$params``. Pour ajouter une ou plusieurs pièces jointes, ajoutez une clef ``attachments`` dans ``$params``, avec pour valeur un tableau des pièces jointes. Une pièce jointe doit être dans l’un des formats suivants :

source: An ``ElggFile`` which points to an existing file
fr: Un ``ElggFile`` qui pointe vers un fichier existant

source: An array with the file contents
fr: Un tableau avec le contenu du fichier

source: An array with a filepath
fr: Un tableau avec le chemin

source: E-mail address formatting
fr: Formatage des adresses e-mail

source: Elgg has a helper class to aid in getting formatted e-mail addresses: ``\Elgg\Email\Address``.
fr: Elgg dispose d'une classe d'aide pour récupérer des adresses e-mail formatées : ``\Elgg\Email\Address``.

source: There are some helper functions available
fr: Il existe plusieurs fonctions d'aide disponibles

source: ``\Elgg\Email\Address::fromString($string)`` Will return an ``\Elgg\Email\Address`` class with e-mail and name set, provided a formatted string (eg. ``Example <example@elgg.org>``)
fr: ``\Elgg\Email\Address::fromString($string)`` Va retourner une classe ``\Elgg\Email\Address`` avec le nom et l'e-mail définis, à partir d'une chaîne formatée (par ex. ``Exemple <example@elgg.org>``)

source: ``\Elgg\Email\Address::fromEntity($entity)`` Will return an ``\Elgg\Email\Address`` class with e-mail and name set based on the entity
fr: ``\Elgg\Email\Address::fromEntity($entity)`` Va renvoyer une classe ``\Elgg\Email\Address`` avec l'e-mail et le nom définis en fonction de l'entité

source: ``\Elgg\Email\Address::getFormattedEmailAddress($email, $name)`` Will return a formatted string provided an e-mail address and optionaly a name
fr: ``\Elgg\Email\Address::getFormattedEmailAddress($email, $name)`` Va retourner une chaîne formatée à partir d'une adresse e-mail, et d'un nom optionnel

source: Error Handling
fr: Gestion des erreurs

source: Under the hood, Elgg uses Monolog_ for logging errors to the server's error log (and stdout for CLI commands).
fr: Sous le capot, Elgg utilise Monolog_ pour enregistrer les erreurs dans le journal d’erreur du serveur (et stdout pour les commandes CLI).

source: Monolog_ comes with a number of tools that can help administrators keep track of errors and debugging information.
fr: Monolog_ est livré avec un certain nombre d’outils qui peuvent aider les administrateurs à suivre les erreurs et le débogage des informations.

source: You can add custom handlers (see Monolog_ documentation for a full list of handlers):
fr: Vous pouvez ajouter des gestionnaires personnalisés (voir la documentation de Monolog_ pour une liste complète des gestionnaires) :

source: List of events in core
fr: Liste des événements dans le noyau

source: For more information on how events work visit :doc:`/design/events`.
fr: Pour plus d’informations sur le fonctionnement des événements, visitez :doc:`/design/events`.

source: Some events are marked with |results| this means those events allow altering the output of an event
fr: Certains événements sont marqués avec |results| cela signifie que ces événements permettent de modifier la sortie d'un événement

source: System events
fr: Événements système

source: Return false to prevent activation of the plugin.
fr: Renvoyez false pour empêcher l’activation du plugin.

source: Clear internal and external caches, by default including system_cache, simplecache, and memcache. One might use it to reset others such as APC, OPCache, or WinCache.
fr: Efface les caches internes et externes, par défaut, y compris system_cache, simplecache et memcache. Il est possible de l’utiliser pour réinitialiser d’autres caches comme APC, OPCache ou WinCache.

source: Filters the view output for a ``/cache`` URL when simplecache is disabled. Note this will be fired for every ``/cache`` request--no Expires headers are used when simplecache is disabled.
fr: Filtre la sortie de la vue pour une URL ``/cache`` quand simplecache est désactivé. Notez que cela sera déclenché pour chaque requête à ``/cache`` -- aucun entête Expires n'est utilisé quand simplecache est désactivé.

source: Invalidate internal and external caches.
fr: Invalide les caches internes et externes.

source: Purge internal and external caches. This is meant to remove old/stale content from the caches.
fr: Purge les caches internes et externes. Il s’agit de supprimer le contenu ancien/obsolète des caches.

source: Allows plugins to register their own commands executable via ``elgg-cli`` binary. Handlers must return an array of command class names. Commands must extend ``\Elgg\Cli\Command`` to be executable.
fr: Permet aux plugins d’enregistrer leurs propres commandes exécutables via le binaire ``elgg-cli``. Les gestionnaires doivent renvoyer un tableau de noms de classes de commande. Les commandes doivent étendre ``\Elgg\Cli\Command`` pour être exécutables.

source: Triggered by cron for each period.
fr: Déclenché par le cron pour chaque période.

source: The ``$params`` array will contain:
fr: Le tableau ``$params`` va contenir :

source: ``time`` - the timestamp of when the cron command was started
fr: ``time`` - l'horodatage du lancement de la commande cron

source: ``dt`` - the ``\DateTime`` object of when the cron command was started
fr: ``dt`` - l'objet ``\DateTime`` du moment où la commande cron a été lancée

source: ``logger`` - instance of ``\Elgg\Logger\Cron`` to log any information to the cron log
fr: ``logger`` - instance de ``\Elgg\Logger\Cron`` pour enregistrer toute information dans le journal cron

source: Allow the configuration of custom cron intervals
fr: Permet la configuration d’intervalles de cron personnalisés

source: Return false to prevent deactivation of the plugin.
fr: Renvoyez false pour éviter la désactivation du plugin.

source: Filter the output for the diagnostics report download.
fr: Filtre la sortie pour le téléchargement du rapport de diagnostic.

source: Formats the "friendly" title for strings. This is used for generating URLs.
fr: Formate un titre "sympathique" pour les chaînes de caractères. Ceci est utilisé pour générer des URLs.

source: Formats the "friendly" time for the timestamp ``$params['time']``.
fr: Formate une date "sympathique" pour le timestamp ``$params['time']``.

source: Filters a string to remove tags. The original string is passed as ``$params['original_string']`` and an optional set of allowed tags is passed as ``$params['allowed_tags']``.
fr: Filtre une chaîne pour supprimer les balises. La chaîne d’origine est passée par ``$params['original_string']`` et un ensemble facultatif de balises autorisées est passé par ``$params['allowed_tags']``.

source: Allows plugins to run garbage collection for ``$params['period']``.
fr: Autorise les plugins à exécuter la collecte des déchets - "garbage collection" - pour ``$params['period']``.

source: Allows plugins to generate new random cleartext passwords.
fr: Permet aux plugins de générer de nouveaux mots de passe textuels aléatoires.

source: Return false to override setting a cookie.
fr: Renvoyez false pour remplacer la définition d’un cookie.

source: Plugins tend to use this event for initialization (extending views, registering callbacks, etc.)
fr: Les plugins ont tendance à utiliser cet événement pour l’initialisation (extension des vues, enregistrement des rappels, etc.)

source: Allows plugins to add/remove languages from the configurable languages in the system.
fr: Permet aux plugins d'ajouter/supprimer des langues des langues configurables du système.

source: Called for all triggered events by ``system_log`` plugin. Used internally by ``Elgg\SystemLog\Logger::log()`` to populate the ``system_log`` table.
fr: Appelé pour tous les événements déclenchés par le plugin ``system_log``. Utilisé en interne par ``Elgg\SystemLog\Logger::log()`` pour remplir la table ``system_log``.

source: Filters site's login URL. ``$params`` array contains an array of query elements added to the login URL by the invoking script. The event must return an absolute URL of the login page.
fr: Filtre l'URL de connexion du site. Le tableau ``$params`` contient un tableau d'éléments de requête ajoutés à l'URL de connexion par le script appelant. L'événement doit renvoyer une URL absolue de la page de connexion.

source: In ``elgg_view_page()``, this filters ``$vars`` before it's passed to the page shell view (``page/<page_shell>``). To stop sending the X-Frame-Options header, unregister the handler ``Elgg\Page\SetXFrameOptionsHeaderHandler::class`` from this event.
fr: Dans ``elgg_view_page()``, ceci filtre ``$vars`` avant qu'il soit transmis à la vue de la coquille de la page (``page/<page_shell>``). Pour arrêter d'envoyer l'entête X-Frame-Options, désenregistrez le gestionnaire ``Elgg\Page\SetXFrameOptionsHeaderHandler::class`` de cet événement.

source: In ``elgg_view_page()``, this filters the output return value.
fr: Dans ``elgg_view_page()``, ceci filtre la valeur de retour renvoyée.

source: Triggered by ``elgg_view_menu()``. Used to change menu variables (like sort order) before rendering.
fr: Déclenché par ``elgg_view_menu()``. Utilisé pour modifier les variables de menu (comme l’ordre de tri) avant le rendu.

source: ``name`` - name of the menu
fr: ``name`` - nom du menu

source: ``sort_by`` - preferring sorting parameter
fr: ``sort_by`` - paramètre de tri préféré

source: other parameters passed to ``elgg_view_menu()``
fr: d'autres paramètres passés à ``elgg_view_menu()``

source: Triggered before the plugins are loaded. Rarely used. init, system is used instead. Can be used to load additional libraries.
fr: Déclenché avant que les plugins ne soient chargés. Rarement utilisé. init, system est utilisé à la place. Peut être utilisé pour charger des bibliothèques supplémentaires.

source: Triggered just after the plugins are loaded. Rarely used. init, system is used instead.
fr: Déclenché juste après le chargement des plugins. Rarement utilisé. init, system est utilisé à la place.

source: Triggered by ``elgg_format_html()`` and used to prepare untrusted HTML.
fr: Déclenché par ``elgg_format_html()`` et utilisé pour préparer du HTML non sûr.

source: The ``$return`` value is an array:
fr: La valeur ``$return`` est un tableau :

source: ``html`` - HTML string being prepared
fr: ``html`` - La chaîne de caractères HTML en train d'être préparée

source: ``options`` - Preparation options
fr: ``options`` - Options de préparation

source: Filters the array of menu sections before they're displayed. Each section is a string key mapping to an area of menu items. This is a good event to sort, add, remove, and modify menu items. Triggered by ``elgg_view_menu()`` and ``elgg()->menus->prepareMenu()``.
fr: Filtre le tableau des sections de menu avant leur affichage. Chaque section est une touche de chaîne mappée à une zone d'éléments de menu. Il s'agit d'un bon événement pour trier, ajouter, supprimer et modifier des éléments de menu. Déclenché par ``elgg_view_menu()`` et ``elgg()->menus->prepareMenu()``.

source: ``selected_item`` - ``ElggMenuItem`` selected in the menu, if any
fr: ``selected_item`` - ``ElggMenuItem`` sélectionné dans le menu, le cas échéant

source: The return value is an instance of ``\Elgg\Menu\PreparedMenu``. The prepared menu is a collection of ``\Elgg\Menu\MenuSection``, which in turn are collections of ``\ElggMenuItem`` objects.
fr: La valeur de retour est une instance de ``\Elgg\Menu\PreparedMenu``. Le menu préparé est une collection d’objets ``\Elgg\Menu\MenuSection``, qui sont à leur tour des collections d’objets ``\ElggMenuItem``.

source: More granular version of the menu event triggered before the **prepare, menu:<menu_name>** event.
fr: Version plus granulaire de l'événement de menu déclenché avant l'événement **prepare, menu:<menu_name>**.
