Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Triggered by ``elgg_get_icon_sizes()`` and sets entity type/subtype specific icon sizes. ``entity_subtype`` will be passed with the ``$params`` array to the callback.
fr: Déclenché par ``elgg_get_icon_sizes()``, définit le type d’entité/le sous-type de tailles d’icônes spécifiques. ``entity_subtype`` sera transmis dans le tableau ``$params`` à la fonction de rappel.

source: Allows filtering sizes for custom icon types, see ``entity:icon:sizes, <entity_type>``.
fr: Permet de filtrer les tailles pour les types d’icônes personnalisés, voir ``entity:icon:sizes, <entity_type>``.

source: The event must return an associative array where keys are the names of the icon sizes (e.g. "large"), and the values are arrays with the following keys:
fr: L'événement doit renvoyer un tableau associatif où les clés sont les noms des tailles d'icônes (par ex. "large") et les valeurs sont des tableaux avec les clés suivantes :

source: ``w`` - Width of the image in pixels
fr: ``w`` - Largeur de l’image en pixels

source: ``h`` - Height of the image in pixels
fr: ``h`` - Hauteur de l’image en pixels

source: ``square`` - Should the aspect ratio be a square (true/false)
fr: ``square`` - Le ratio devrait-il être carré (true/false)

source: ``upscale`` - Should the image be upscaled in case it is smaller than the given width and height (true/false)
fr: ``upscale`` - L'image doit-elle être agrandie si elle est plus petite que la largeur et la hauteur indiquées (true/false)

source: ``crop`` - Is cropping allowed on this image size (true/false, default: true)
fr: ``crop`` - Est-ce que le recadrage est autorisé sur cette taille d’image (true/false, par défaut : true)

source: If the configuration array for an image size is empty, the image will be saved as an exact copy of the source without resizing or cropping.
fr: Si le tableau de configuration d’une taille d’image est vide, l’image sera enregistrée en tant que copie exacte de la source sans redimensionnement ni recadrage.

source: Example:
fr: Exemple :

source: Triggered when entity icon URL is requested, see :ref:`entity icons <guides/database#entity-icons>`. Callback should return URL for the icon of size ``$params['size']`` for the entity ``$params['entity']``. Following parameters are available through the ``$params`` array:
fr: Déclenché lorsque l’URL de l’icône de l’entité est demandée, voir les :ref:`icônes des entités <guides/database#entity-icons>`. La fonction de rappel doit renvoyer l’URL de l’icône de dimension ``$params['size']`` pour l’entité ``$params['entity']``. Les paramètres suivants sont disponibles via le tableau ``$params`` :

source: Entity for which icon url is requested.
fr: Entité pour laquelle l’url de l’icône est demandée.

source: The type of :ref:`view <guides/views#listing-entities>` e.g. ``'default'`` or ``'json'``.
fr: Le type de :ref:`vue <guides/views#listing-entities>`, par exemple ``'default'`` ou ``'json'``.

source: Size requested, see :ref:`entity icons <guides/database#entity-icons>` for possible values.
fr: Dimension demandée, voir les :ref:`icônes des entités <guides/database#entity-icons>` pour les valeurs possibles.

source: Example on how one could default to a Gravatar icon for users that have not yet uploaded an avatar:
fr: Exemple sur comment mettre en place une icône par défaut Gravatar pour les utilisateurs qui n’ont pas encore téléchargé un avatar :

source: Allows filtering URLs for custom icon types, see ``entity:icon:url, <entity_type>``
fr: Permet de filtrer les URLs pour les types d’icônes personnalisés, voir ``entity:icon:url, <entity_type>``

source: Triggered by ``ElggEntity::getIcon()`` and allows plugins to provide an alternative ``ElggIcon`` object that points to a custom location of the icon on filestore. The handler must return an instance of ``ElggIcon`` or an exception will be thrown.
fr: Déclenché par ``ElggEntity::getIcon()``, et permet aux plugins de fournir un objet alternatif ``ElggIcon`` qui pointe vers un emplacement personnalisé de l’icône dans le répertoire de fichiers. Le gestionnaire doit renvoyer une instance de ``ElggIcon`` ou une exception sera lancée.

source: Allows filtering icon file object for custom icon types, see ``entity:icon:file, <entity_type>``
fr: Permet de filtrer l’objet du fichier d’icône pour les types d’icônes personnalisés ; voyez ``entity:icon:file, <entity_type>``

source: Triggered by ``ElggEntity::saveIcon*()`` methods and can be used to prepare an image from uploaded/linked file. This event can be used to e.g. rotate the image before it is resized/cropped, or it can be used to extract an image frame if the uploaded file is a video. The handler must return an instance of ``ElggFile`` with a `simpletype` that resolves to `image`. The ``$return`` value passed to the event is an instance of ``ElggFile`` that points to a temporary copy of the uploaded/linked file.
fr: Déclenché par les méthodes ``ElggEntity::saveIcon*()`` et peut être utilisé pour préparer une image à partir d'un fichier téléchargé ou lié. Cet événement peut être utilisé par ex. pour faire pivoter l'image avant qu'elle ne soit redimensionnée/recadrée, ou peut être utilisé pour extraire une image si le fichier téléchargé est une vidéo. Le gestionnaire doit renvoyer une instance de ``ElggFile`` avec un `simpletype` qui se résout en `image`. La valeur ``$return`` transmise à l'événement est une instance de ``ElggFile`` qui pointe vers une copie temporaire du fichier téléchargé ou lié.

source: The ``$params`` array contains:
fr: Le tableau ``$params`` contient :

source: ``entity`` - entity that owns the icons
fr: ``entity`` - entité propriétaire des icônes

source: ``file`` - original input file before it has been modified by other events
fr: ``file`` - fichier d'entrée original avant qu'il ne soit modifié par d'autres événements

source: Triggered by ``ElggEntity::saveIcon*()`` methods and can be used to apply custom image manipulation logic to resizing/cropping icons. The handler must return ``true`` to prevent the core APIs from resizing/cropping icons. The ``$params`` array contains:
fr: Déclenché par les méthodes ``ElggEntity:::saveIcon*()``, et qui peut être utilisé pour appliquer une logique de manipulation d’image personnalisée pour redimensionner/recadrer les icônes. Le gestionnaire doit renvoyer ``true`` pour empêcher les API du noyau de redimensionner/rogner les icônes. Le tableau ``$params`` contient :

source: ``file`` - ``ElggFile`` object that points to the image file to be used as source for icons
fr: ``file`` - objet ``ElggFile`` qui pointe vers le fichier image à utiliser comme source pour les icônes

source: ``x1``, ``y1``, ``x2``, ``y2`` - cropping coordinates
fr: ``x1``, ``y1``, ``x2``, ``y2`` - coordonnées de découpe

source: Triggered by ``ElggEntity::saveIcon*()`` methods once icons have been created. This event can be used by plugins to create river items, update cropping coordinates for custom icon types etc. The handler can access the created icons using ``ElggEntity::getIcon()``. The ``$params`` array contains:
fr: Déclenché par les méthodes ``ElggEntity::saveIcon*()`` une fois les icônes créées. Cet événement peut être utilisé par les plugins pour créer des éléments dans la rivière, mettre à jour les coordonnées de recadrage pour les types d'icônes personnalisés, etc. Le gestionnaire peut accéder aux icônes créées en utilisant ``ElggEntity::getIcon()``. Le tableau ``$params`` contient :

source: Triggered by ``ElggEntity::deleteIcon()`` method and can be used for clean up operations. This event is triggered before the icons are deleted. The handler can return ``false`` to prevent icons from being deleted. The ``$params`` array contains:
fr: Déclenché par la méthode ``ElggEntity::deleteIcon()`` et peut être utilisé pour les opérations de nettoyage. Cet événement est déclenché avant la suppression des icônes. Le gestionnaire peut renvoyer ``false`` pour empêcher la suppression des icônes. Le tableau ``$params`` contient :

source: Return the URL for the entity ``$params['entity']``. Note: Generally it is better to override the ``getUrl()`` method of ElggEntity. This event should be used when it's not possible to subclass (like if you want to extend a bundled plugin without overriding many views).
fr: Renvoie l'URL de l'entité ``$params['entity']``. Remarque : Généralement, il est préférable de remplacer la méthode ``getUrl()`` d'ElggEntity. Cet événement doit être utilisé lorsqu'il n'est pas possible de sous-classer (comme si vous souhaitez étendre un plugin fourni sans remplacer de nombreuses vues).

source: Return the URL for the annotation or metadata ``$params['extender']``.
fr: Renvoie l'URL de l'annotation ou les métadonnées ``$params['extender']``.

source: Return an array of fields usable for ``elgg_view_field()``. The result should be returned as an array of fields. It is required to provide ``name`` and ``#type`` for each field.
fr: Renvoie un tableau de champs utilisable par ``elgg_view_field()``. Le résultat doit être renvoyé sous la forme d'un tableau de champs. Il est nécessaire de fournir ``name`` et ``#type`` pour chaque champ.

source: Filters a list of default widgets to add for newly registered users. The list is an array of arrays in the format:
fr: Filtre une liste de widgets par défaut à ajouter pour les utilisateurs nouvellement enregistrés. La liste est un tableau de tableaux dans le format :

source: Triggered when a list of available widgets is needed. Plugins can conditionally add or remove widgets from this list or modify attributes of existing widgets like ``context`` or ``multiple``.
fr: Déclenché lorsqu’une liste de widgets disponibles est nécessaire. Les plugins peuvent ajouter ou supprimer des widgets de cette liste de manière conditionnelle, ou modifier des attributs de widgets existants comme ``context`` ou ``multiple``.

source: Return boolean if the URL ``$params['current_url']`` and the path ``$params['current_path']``
fr: Retourne un booléen si l'URL ``$params['current_url']`` et le chemin ``$params['current_path']``

source: is allowed during maintenance mode.
fr: sont autorisés pendant le mode de maintenance.

source: Can be used to change the value of the setting being saved
fr: Peut être utilisé pour modifier la valeur du paramètre en cours d'enregistrement

source: Params contains: - ``entity`` - The ``ElggEntity`` where the plugin setting is being saved - ``plugin_id`` - The ID of the plugin for which the setting is being saved - ``name`` - The name of the setting being saved - ``value`` - The original value of the setting being saved
fr: Params contient : - ``entity`` - L'``ElggEntity`` où le paramètre du plugin est enregistré - ``plugin_id`` - L'ID du plugin pour lequel le paramètre est enregistré - ``name`` - Le nom du paramètre en cours d'enregistrement - ``valeur`` - La valeur d'origine du paramètre en cours d'enregistrement

source: Return value should be a scalar in order to be able to save it to the database. An error will be logged if this is not the case.
fr: La valeur de retour doit être un scalaire afin de pouvoir l'enregistrer dans la base de données. Une erreur sera journalisée si ce n'est pas le cas.

source: Filters a list of URLs (paths) that can be seen by logged out users in a walled garden mode. Handlers must return an array of regex strings that will allow access if matched. Please note that system public routes are passed as the default value to the event, and plugins must take care to not accidentally override these values.
fr: Filtre une liste d'URLs (chemins) qui peuvent être vues par les utilisateurs déconnectés en mode jardin clos - walled garden. Les gestionnaires doivent renvoyer un tableau de chaînes regex qui autoriseront l'accès si elles correspondent. Veuillez noter que les routes publiques du système sont transmises comme valeur par défaut à l'événement et que les plugins doivent veiller à ne pas remplacer accidentellement ces valeurs.

source: ``url`` - URL of the page being tested for public accessibility
fr: ``url`` - URL de la page testée pour l’accessibilité publique

source: Filter the URL for the relationship object ``$params['relationship']``.
fr: Filtre l’URL pour l’objet de la relation ``$params['relationship']``.

source: Filter the robots.txt values for ``$params['site']``.
fr: Filtre les valeurs de robots.txt pour ``$params['site']``.

source: Filter plugin settings. ``$params`` contains:
fr: Filtre les paramètres du plugin. ``$params`` contient :

source: ``plugin`` - An ElggPlugin instance
fr: ``plugin`` - Une instance de ElggPlugin

source: ``plugin_id`` - The plugin ID
fr: ``plugin_id`` - L'ID du plugin

source: ``name`` - The name of the setting
fr: ``name`` - Le nom du paramètre

source: ``value`` - The value to set
fr: ``value`` - La valeur à définir

source: Converts the entity ``$params['entity']`` to a StdClass object. This is used mostly for exporting entity properties for portable data formats like JSON and XML.
fr: Convertit l’entité ``$params['entity']`` en objet StdClass. Ceci est utilisé principalement pour exporter des propriétés d’entité vers des formats de données portables comme JSON et XML.

source: Groups
fr: Groupes

source: Filters a collection of tools available within a specific group:
fr: Filtre une collection d’outils disponibles au sein d’un groupe spécifique :

source: The ``$return`` is ``\Elgg\Collections\Collection<\Elgg\Groups\Tool>``, a collection of group tools.
fr: Le retour ``$return`` est ``\Elgg\Collections\Collection<\Elgg\Groups\Tool>``, une collection d'outils de groupe.

source: Triggered when the ApiRegistrationService is constructed which allows to add/remove/edit webservice configurations
fr: Déclenché lors de la construction de l'ApiRegistrationService, ce qui permet d'ajouter/supprimer/modifier des configurations de webservice

source: Triggered by the web services rest handler. Plugins can set up their own authentication handlers, then return ``true`` to prevent the default handlers from being registered.
fr: Déclenché par le gestionnaire de webservices rest. Les plugins peuvent configurer leurs propres gestionnaires d’authentification, puis renvoyer ``true`` pour empêcher les gestionnaires par défaut d’être enregistrés.

source: Filter the result (and subsequently the output) of the API method
fr: Filtrer le résultat (et par la suite la sortie) de la méthode API

source: File System
fr: Système de fichier

source: Filestore
fr: Répertoire de fichiers

source: Location
fr: Emplacement

source: Elgg's filestore is located in the site's ``dataroot`` that is configured during installation, and can be modified via site settings in Admin interface.
fr: Le répertoire de fichiers de Elgg est situé dans le ``dataroot`` du site, configuré pendant l’installation, et qui peut être modifié via les paramètres du site dans l’interface Admin.

source: Directory Structure
fr: Structure du répertoire

source: The structure of the filestore is tied to file ownership by Elgg entities. Whenever the first file owned by an entity is written to the filestore, a directory corresponding to the entity GUID will be created within a parent bucket directory (buckets are bound to 5000 guids). E.g. files owned by user with guid 7777 will be located in ``5000/7777/``.
fr: La structure du répertoire de fichiers est liée à la propriété des fichiers par les entités Elgg. Chaque fois que le premier fichier appartenant à une entité est écrit dans le répertoire de fichiers, un répertoire correspondant au GUID de l’entité sera créé dans le répertoire bucket parent (les buckets sont de 5000 guids). Par exemple, les fichiers appartenant à l’utilisateur avec le guid 7777 seront situés dans ``5000/7777/``.

source: When files are created, filenames can contain subdirectory names (often referred to as `$prefix` throughout the code). For instance, avatars of the above user, can be found under ``5000/7777/profile/``.
fr: Lorsque des fichiers sont créés, les noms de fichiers peuvent contenir des noms de sous-répertoires (souvent appelés ``$prefix`` dans le code). Par exemple, les avatars de l’utilisateur ci-dessus, peuvent être trouvés dans ``5000/7777/profile/``.

source: File Objects
fr: Objets Fichier - File

source: Writing Files
fr: Écrire des fichiers

source: To write a file to the filestore, you would use an instance of ``ElggFile``. Even though ``ElggFile`` extends `ElggObject` and can be stored as an actual Elgg entity, that is not always necessary (e.g. when writing thumbs of an image).
fr: Pour écrire un fichier dans le répertoire de fichiers, vous utiliseriez une instance de ``ElggFile``. Même si ``ElggFile`` étend ``ElggObject`` et peut être stocké comme une entité Elgg réelle, ce n’est pas toujours nécessaire (par exemple pour la création des miniatures d’une image).

source: Reading Files
fr: Lire des fichiers

source: You can read file contents using instanceof of ``ElggFile``.
fr: Vous pouvez lire le contenu du fichier en utilisant une instance de ``ElggFile``.

source: Serving Files
fr: Servir des fichiers

source: You can serve files from filestore using ``elgg_get_inline_url()`` and ``elgg_get_download_url()``. Both functions accept 3 arguments:
fr: Vous pouvez servir des fichiers depuis le répertoire de fichiers en utilisant ``elgg_get_inline_url()`` et ``elgg_get_download_url()``. Les deux fonctions acceptent 3 arguments :

source: **``file``** An instance of ``ElggFile`` to be served
fr: **``file``** Une instance de ``ElggFile`` à servir

source: **``use_cookie``** If set to true, validity of the URL will be limited to current session
fr: **``use_cookie``** Si défini à true, la validité de l'URL sera limitée à la session actuelle

source: **``expires``** Expiration time of the URL
fr: **``expires``** Temps d'expiration de l'URL

source: You can use ``use_cookie`` and ``expires`` arguments as means of access control. For example, users avatars in most cases have a long expiration time and do not need to be restricted by current session - this will allows browsers to cache the images and file service will send appropriate ``Not Modified`` headers on consecutive requests.
fr: Vous pouvez utiliser les arguments ``use_cookie`` et ``expires`` comme moyen de contrôle d’accès. Par exemple, dans la plupart des cas, les avatars des utilisateurs ont un long délai d’expiration et n’ont pas besoin d’être limités à la session en cours - ce qui permettra aux navigateurs de mettre en cache les images. Le service de fichiers enverra les en-têtes ``Not Modified`` appropriés aux requêtes suivantes.

source: The default behaviour of ``use_cookie`` can be controlled on the admin security settings page.
fr: Le comportement par défaut de ``use_cookie`` peut être contrôlé sur la page des paramètres de sécurité de l’administrateur.

source: For entities that are under Elgg's access control, you may want to use cookies to ensure that access settings are respected and users do not share download URLs with somebody else.
fr: Pour les entités qui utilisent le contrôle d’accès de Elgg, vous pouvez utiliser des cookies pour vous assurer que les paramètres d’accès sont respectés et que les utilisateurs ne partagent pas les URLs de téléchargement avec d'autres personnes.

source: You can also invalidated all previously generated URLs by updating file's modified time, e.g. by using ``touch()``.
fr: Vous pouvez également invalider toutes les URLs précédemment générées en mettant à jour l’heure de modification du fichier, par exemple à l’aide de ``touch()``.

source: Embedding Files
fr: Intégrer des fichiers

source: Please note that due to their nature inline and download URLs are not suitable for embedding. Embed URLs must be permanent, whereas inline and download URLs are volatile (bound to user session and file modification time).
fr: Veuillez noter qu’en raison de leur nature, les URLs en ligne - inline - et de téléchargement ne sont pas adaptées à l’intégration - embed. Les URLs d’intégration doivent être permanentes, tandis que les URLs en ligne et de téléchargement sont volatiles (liées à la session utilisateur et à l'heure de modification des fichiers).

source: To embed an entity icon, use ``elgg_get_embed_url()``.
fr: Pour intégrer une icône d'entité, utilisez ``elgg_get_embed_url()``.

source: Handling File Uploads
fr: Gérer l'envoi de fichiers

source: In order to implement an action that saves a single file uploaded by a user, you can use the following approach:
fr: Pour implémenter une action qui enregistre un unique fichier envoyé par un utilisateur, vous pouvez utiliser l'approche suivante :

source: If your file input supports multiple files, you can iterate through them in your action:
fr: Si votre champ de saisie de fichiers supporte plusieurs fichiers, vous pouvez les parcourir dans votre action :

source: If images are uploaded their is an automatic attempt to fix the orientation of the image.
fr: Si des images sont chargées une tentative est faite pour corriger automatiquement l'orientation de l'image.

source: Temporary files
fr: Fichiers temporaires

source: If you ever need a temporary file you can use ``elgg_get_temp_file()``. You'll get an instance of an ``ElggTempFile`` which has all the file functions of an ``ElggFile``, but writes it's data to the systems temp folder.
fr: Si jamais vous avez besoin d'un fichier temporaire vous pouvez utiliser ``elgg_get_temp_file()``. Vous obtiendrez une instance de ``ElggTempFile`` qui a toutes les fonctions de ``ElggFile``, mais écrit ses données dans le répertoire temporaire du système.

source: It's not possible to save the ``ElggTempFile`` to the database. You'll get an ``Elgg\Exceptions\Filesystem\IOException`` if you try.
fr: Il n'est pas possible d'enregistrer ``ElggTempFile`` dans la base de données. Vous obtiendrez une ``Elgg\Exceptions\Filesystem\IOException`` si vous essayez.

source: Group Tools
fr: Outils du groupe

source: Elgg groups allow group administrators to enable/disable various tools available within a group. These tools are provided by other plugins like blog or file.
fr: Les groupes Elgg permettent aux administrateurs de groupe d’activer/désactiver divers outils disponibles au sein d’un groupe. Ces outils sont fournis par d’autres plugins tels que blog ou file.

source: Plugins can access group tool register via ``elgg()->group_tools``.
fr: Les plugins peuvent accéder au registre des outils du groupe via ``elgg()->group_tools``.

source: A registered tool will have an option to be toggled on the group edit form, and can have a profile view module associated with it. To add a profile module, simply add a corresponding view as ``groups/profile/module/<tool_name>``. This view will only be called if the tool is enabled.
fr: Un outil enregistré aura la possibilité d’être activé sur le formulaire d'édition d'un groupe, et peut avoir un module d’affichage de profil qui lui est associé. Pour ajouter un module de profil, il suffit d’ajouter une vue correspondante ``groups/profile/module/<tool_name>``. Cette vue ne sera appelée que si l’outil est activé.

source: If you simply wish to list some content in the group you can use the ``groups/profile/module`` view with some additional parameters.
fr: Si vous souhaitez simplement lister certains contenus dans le groupe, vous pouvez utiliser la vue ``groups/profile/module`` avec quelques paramètres supplémentaires.

source: ``entity_type``: in combination with the ``entity_subtype`` it can generate everything the module needs
fr: ``entity_type`` : en combinaison avec le ``entity_subtype``, il peut générer tout ce dont le module a besoin

source: ``entity_subtype``: in combination with the ``entity_type`` it can generate everything the module needs
fr: ``entity_subtype`` : en combinaison avec le ``entity_type``, il peut générer tout ce dont le module a besoin
