Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: This must return an integer representing the date the upgrade was added. It consists of eight digits and is in format ``yyyymmddnn`` where:
fr: Cela doit renvoyer un entier représentant la date à laquelle la mise à niveau a été ajoutée. La valeur se compose de huit chiffres au format ``yyyymmdnn`` où:

source: ``yyyy`` is the year
fr: ``yyyy`` représente l'année

source: ``mm`` is the month (with leading zero)
fr: ``mm`` représente le mois (avec le zéro initial)

source: ``dd`` is the day (with leading zero)
fr: ``dd`` représente le jour (avec le zéro initial)

source: ``nn`` is an incrementing number (starting from ``00``) that is used in case two separate upgrades have been added during the same day
fr: ``nn`` est un numéro d’incrément (à partir de ``00``) qui est utilisé au cas où deux mises à niveau distinctes auraient été ajoutées au cours de la même journée

source: This should return ``false`` unless the upgrade won't be needed.
fr: Cela devrait renvoyer ``false`` à moins que la mise à niveau ne soit pas nécessaire.

source: If ``true`` is returned the upgrade cannot be run later.
fr: Si ``true`` est renvoyé, la mise à niveau ne peut pas être exécutée plus tard.

source: If ``true``, your ``run()`` method will receive as ``$offset`` the number of items aready processed. This is useful if you are only modifying data, and need to use the ``$offset`` in a function like ``elgg_get_entities()`` to know how many you've already handled.
fr: Si ``true``, votre méthode ``run()`` recevra comme ``$offset`` le nombre d’éléments déjà traités. Ceci est utile si vous ne modifiez que des données et que vous devez utiliser le ``$offset`` dans une fonction comme ``elgg_get_entities()`` pour savoir combien d'éléments ont déjà été traités.

source: If ``false``, your ``run()`` method will receive as ``$offset`` the total number of failures. ``false`` should be used if your process deletes or moves data out of the way of the process. E.g. if you delete 50 objects on each ``run()``, you don't really need the ``$offset``.
fr: Si ``false``, votre méthode ``run()`` recevra comme ``$offset`` le nombre total d’échecs. ``false`` doit être utilisé si votre processus supprime ou déplace des données en dehors du processus. Par exemple, si vous supprimez 50 objets sur chaque ``run()``, vous n’avez pas vraiment besoin de ``$offset``.

source: Get the total number of items to process during the upgrade. If unknown, ``Batch::UNKNOWN_COUNT`` can be returned, but ``run()`` must manually mark the upgrade complete.
fr: Récupère le nombre total d’éléments à traiter pendant la mise à niveau. Si ce nombre est inconnu, ``Batch::UNKNOWN_COUNT`` peut être retourné, mais ``run()`` doit alors marquer manuellement la mise à niveau terminée.

source: This must perform a portion of the actual upgrade. And depending on how long it takes, it may be called multiple times during a single request.
fr: Cette fonction doit effectuer une partie de la mise à niveau effective. Et en fonction de la durée nécessaire, elle peut être appelée plusieurs fois au cours d’une seule demande.

source: It receives two arguments:
fr: Elle reçoit deux arguments :

source: ``$result``: An instance of ``Elgg\Upgrade\Result`` object
fr: ``$result`` : Une instance de l’objet ``Elgg\Upgrade\Result``

source: ``$offset``: The offset where the next upgrade portion should start (or total number of failures)
fr: ``$offset`` : Le décalage à partir duquel la prochaine portion de mise à niveau doit commencer (ou le nombre total de défaillances)

source: For each item the method processes, it must call either:
fr: Pour chaque élément que la méthode traite, elle doit appeler selon les cas :

source: ``$result->addSuccesses()``: If the item was upgraded successfully
fr: ``$result->addSuccesses()`` : Si l’élément a bien été mis à niveau

source: ``$result->addFailures()``: If it failed to upgrade the item
fr: ``$result->addFailures()`` : Si l’élément n’a pas pu être mis à niveau

source: Both methods default to one item, but you can optionally pass in the number of items.
fr: Les deux méthodes ont par défaut un seul élément, mais vous pouvez éventuellement passer le nombre d’éléments.

source: Additionally it can set as many error messages as it sees necessary in case something goes wrong:
fr: En outre, elle peut définir autant de messages d’erreur que nécessaire dans le cas où quelque chose ne va pas :

source: ``$result->addError("Error message goes here")``
fr: ``$result->addError("Le message d'erreur est indiqué ici")``

source: If ``countItems()`` returned ``Batch::UNKNOWN_COUNT``, then at some point ``run()`` must call ``$result->markComplete()`` to finish the upgrade.
fr: Si ``countItems()`` renvoie ``Batch::UNKNOWN_COUNT``, alors à un moment donné ``run()`` doit appeler ``$result->markComplete()`` pour terminer la mise à niveau.

source: In most cases your ``run()`` method will want to pass the ``$offset`` parameter to one of the ``elgg_get_entities()`` functions:
fr: Dans la plupart des cas, votre méthode ``run()`` voudra passer le paramètre ``$offset`` à l’une des fonctions ``elgg_get_entities()`` :

source: Use this function to get the related ``ElggUpgrade`` entity that is related to this upgrade.
fr: Utilisez cette fonction pour obtenir l'entité ``ElggUpgrade`` associée à cette mise à niveau.

source: Administration interface
fr: Interface d'administration

source: Each upgrade extending the ``Elgg\Upgrade\AsynchronousUpgrade`` class gets listed in the admin panel after triggering the site upgrade from the Administration dashboard.
fr: Chaque mise à niveau étendant la classe ``Elgg\Upgrade\AsynchronousUpgrade`` est répertoriée dans le panneau d'administration après avoir déclenché la mise à niveau du site depuis le tableau de bord d'administration.

source: While running the upgrades Elgg provides:
fr: Lors de l’exécution des mises à niveau, Elgg fournit :

source: Estimated duration of the upgrade
fr: Durée estimée de la mise à niveau

source: Count of processed items
fr: Nombre d’éléments traités

source: Number of errors
fr: Nombre d'erreurs

source: Possible error messages
fr: Messages d'erreur possibles

source: Views are responsible for creating output. They handle everything from:
fr: Les vues sont responsables de la création des sorties. Elles gèrent tout depuis :

source: the layout of pages
fr: la disposition / mise en page des pages

source: chunks of presentation output (like a footer or a toolbar)
fr: des morceaux de sortie d'affichage (comme un pied de page ou une barre d’outils)

source: individual links and form inputs.
fr: des liens individuels et des entrées de formulaire.

source: the images, js, and css needed by your web page
fr: des images, js, et css nécessaires pour votre page web

source: Using views
fr: Utiliser les vues

source: At their most basic level, the default views are just PHP files with snippets of html:
fr: À leur niveau le plus élémentaire, les vues par défaut ne sont que des fichiers PHP avec des extraits de html :

source: Assuming this view is located at ``/views/default/hello.php``, we could output it like so:
fr: En supposant que cette vue se trouve dans ``/views/default/hello.php``, nous pourrions l'afficher comme ceci :

source: For your convenience, Elgg comes with quite a lot of views by default. In order to keep things manageable, they are organized into subdirectories. Elgg handles this situation quite nicely. For example, our simple view might live in ``/views/default/hello/world.php``, in which case it would be called like so:
fr: Pour votre commodité, Elgg est livré avec un bon nombre de vues par défaut. Afin de garder les choses gérables, elles sont organisées en sous-répertoires. Elgg gère parfaitement cette organisation. Par exemple, notre vue simple peut être située dans ``/views/default/hello/world.php``, auquel cas elle sera appelée comme ceci :

source: The name of the view simply reflects the location of the view in the views directory.
fr: Le nom de la vue reflète simplement l’emplacement de la vue dans le répertoire des vues.

source: Views as templates
fr: Les vues comme modèles - templates

source: You can pass arbitrary data to a view via the ``$vars`` array. Our ``hello/world`` view might be modified to accept a variable like so:
fr: Vous pouvez transmettre des données arbitraires à une vue via le tableau ``$vars``. Notre vue ``hello/world`` pourrait être modifié pour accepter une variable comme ceci :

source: In this case, we can pass an arbitrary name parameter to the view like so:
fr: Dans ce cas, nous pouvons passer un paramètre de nom arbitraire à la vue :

source: which would produce the following output:
fr: qui produirait la sortie suivante :

source: Views don't do any kind of automatic output sanitization by default. You are responsible for doing the correct sanitization yourself to prevent XSS attacks and the like.
fr: Les vues ne font aucune sorte d’assainissement automatique de la sortie par défaut. Vous êtes responsable de faire par vous-même l’assainissement correct pour prévenir les attaques XSS et similaires.

source: Views as cacheable assets
fr: Les vues en tant qu’actifs pouvant être mis en cache

source: As mentioned before, views can contain JS, CSS, or even images.
fr: Comme mentionné précédemment, les vues peuvent contenir du JS, du CSS, ou même des images.

source: Asset views must meet certain requirements:
fr: Les actifs doivent correspondre à certaines exigences :

source: They *must not* take any ``$vars`` parameters
fr: Elles *ne doivent pas* utiliser de paramètre de ``$vars``

source: They *must not* change their output based on global state like
fr: Ils *ne doivent pas* modifier leur sortie en fonction de l’état global, tels que

source: who is logged in
fr: qui est connecté

source: the time of day
fr: l’heure de la journée

source: They *must* contain a valid file extension
fr: Ils *doivent* avoir une extension de fichier valide

source: Bad: ``my/cool/template``
fr: Mauvais : ``my/cool/template``

source: Good: ``my/cool/template.html``
fr: Bon : ``my/cool/template.html``

source: For example, suppose you wanted to load some CSS on a page. You could define a view ``mystyles.css``, which would look like so:
fr: Par exemple, supposons que vous vouliez charger certains CSS sur une page. Vous pouvez définir une vue ``mystyles.css``, qui ressemblerait à ceci :

source: Leave off the trailing ".php" from the filename and Elgg will automatically recognize the view as cacheable.
fr: Omettez l'extension ".php" du nom de fichier et Elgg reconnaîtra automatiquement la vue comme pouvant être mise en cache.

source: To get a URL to this file, you would use ``elgg_get_simplecache_url``:
fr: Pour obtenir une URL vers ce fichier, vous utiliseriez ``elgg_get_simplecache_url`` :

source: Elgg automatically adds the magic numbers you see there for cache-busting and sets long-term expires headers on the returned file.
fr: Elgg ajoute automatiquement les numéros magiques que vous voyez là pour le cache-busting et définit les entêtes Expires à long terme sur le fichier renvoyé.

source: Elgg may decide to change the location or structure of the returned URL in a future release for whatever reason, and the cache-busting numbers change every time you flush Elgg's caches, so the exact URL is not stable by design.
fr: Elgg pourrait décider de modifier l’emplacement ou la structure de l’URL retournée dans une version ultérieure pour une raison quelconque, et les numéros d'invalidation du cache "cache-busting" changent à chaque fois que vous videz les caches de Elgg, de sorte que l’URL exacte n’est pas stable par design.

source: With that in mind, here's a couple anti-patterns to avoid:
fr: Avec cela à l’esprit, voici quelques anti-modèles à éviter :

source: Don't rely on the exact structure/location of this URL
fr: Ne vous fiez pas à la structure/emplacement exacts de cette URL

source: Don't try to generate the URLs yourself
fr: N’essayez pas de générer les URLs vous-même

source: Don't store the returned URLs in a database
fr: Ne stockez pas les URLs renvoyées dans une base de données

source: On the page you want to load the css, call:
fr: Sur la page où vous souhaitez charger le css, appelez :

source: Views and third-party assets
fr: Vues et actifs tierce-partie - assets

source: The best way to serve third-party assets is through views. However, instead of manually copy/pasting the assets into the right location in ``/views/*``, you can map the assets into the views system via the ``"views"`` key in your plugin's ``elgg-plugin.php`` config file.
fr: La meilleure manière de servir des actifs tiers est par le biais des vues. Toutefois, au lieu de copier/coller manuellement les actifs au bon endroit dans ``/views/*``, vous pouvez mapper les actifs dans le système de vues via la clef ``"views"`` dans le fichier de configuration ``elgg-plugin.php`` de votre plugin.

source: The views value must be a 2 dimensional array. The first level maps a viewtype to a list of view mappings. The secondary lists map view names to file paths, either absolute or relative to the Elgg root directory.
fr: La valeur des vues doit être un tableau à 2 dimensions. Le premier niveau mappe un type de vue à une liste de mappage de vues. Le deuxième niveau associe les noms des vues à des chemins de fichiers, soit absolus, soit relatifs au répertoire racine de Elgg.

source: If you check your assets into source control, point to them like this:
fr: Si vous ajoutez vos actifs au suivi de version, pointez-les comme ceci :

source: To point to assets installed with composer, use install-root-relative paths by leaving off the leading slash:
fr: Pour pointer vers les actifs installés avec composer, utilisez les chemins install-root-relative en omettant le slash initial :

source: Elgg core uses this feature extensively, though the value is returned directly from ``/engine/views.php``.
fr: Le noyau de Elgg utilise cette fonctionnalité largement, cependant la valeur est retournée directement à partir de ``/engine/views.php``.

source: You don't have to use NPM, Composer Asset Plugin or any other script for managing your plugin's assets, but we highly recommend using a package manager of some kind because it makes upgrading so much easier.
fr: Vous n’avez pas besoin d’utiliser NPM, Composer Asset Plugin, ou n'importe quel autre script pour gérer les actifs de votre plugin, mais nous vous recommandons fortement d’utiliser un gestionnaire de package quel qu'il soit, car cela facilite grandement la mise à niveau.

source: Specifying additional views directories
fr: En spécifiant des répertoires supplémentaires pour les vues

source: In ``elgg-plugin.php`` you can also specify directories to be scanned for views. Just provide a view name prefix ending with ``/`` and a directory path (like above).
fr: Dans ``elgg-plugin.php`` vous pouvez également spécifier des répertoires à scanner pour les vues. Il suffit de fournir un préfixe de nom de vue se terminant par ``/`` et un chemin de répertoire (comme ci-dessus).

source: With the above, files found within the ``icons`` folder will be interpreted as views. E.g. the view ``file/icon/general.gif`` will be created and mapped to ``mod/file/graphics/icons/general.gif``.
fr: Avec ce qui précède, les fichiers trouvés dans le dossier ``icons`` seront interprétés comme des vues. Par exemple, la vue ``file/icon/general.gif`` sera créée et mappée vers ``mod/file/graphics/icons/general.gif``.

source: This is a fully recursive scan. All files found will be brought into the views system.
fr: Il s’agit d’un scan entièrement récursif. Tous les fichiers trouvés seront introduits dans le système de vues.

source: Multiple paths can share the same prefix, just give an array of paths:
fr: Plusieurs chemins peuvent partager le même préfixe, il suffit de donner un tableau de chemins :

source: Viewtypes
fr: Types de vues - Viewtypes

source: You might be wondering: "Why ``/views/default/hello/world.php`` instead of just ``/views/hello/world.php``?".
fr: Vous pouvez vous demandez : "Pourquoi avoir ``/views/default/hello/world.php`` au lieu de simplement ``/views/hello/world.php`` ?".

source: The subdirectory under ``/views`` determines the *viewtype* of the views below it. A viewtype generally corresponds to the output format of the views.
fr: Le sous-répertoire dans ``/views`` détermine le type de vue, ou *viewtype*, des vues qu'il contient. Un type de vue correspond généralement au format de sortie des vues.

source: The default viewtype is assumed to be HTML and other static assets necessary to render a responsive web page in a desktop or mobile browser, but it could also be:
fr: Le type de vue par défaut est supposé être HTML et d’autres actifs statiques nécessaires pour rendre une page Web réactive dans un navigateur de bureau ou mobile, mais il peut également être :

source: Mobile-optimized HTML
fr: HTML optimisé pour mobile

source: TV-optimized HTML
fr: HTML optimisé pour TV

source: Any number of other data formats
fr: De nombreux autres formats de données

source: You can force Elgg to use a particular viewtype to render the page by setting the ``view`` input variable like so: ``https://mysite.com/?view=rss``.
fr: Vous pouvez forcer Elgg à utiliser un type de vue particulier pour afficher la page en définissant la variable d’entrée ``view`` comme ceci : ``https://mysite.com/?view=rss``.

source: You could also write a plugin to set this automatically using the ``elgg_set_viewtype()`` function. For example, your plugin might detect that the page was accessed with an iPhone's browser string, and set the viewtype to ``iphone`` by calling:
fr: Vous pourriez également écrire un plugin pour définir ceci automatiquement à l’aide de la fonction ``elgg_set_viewtype()``. Par exemple, votre plugin peut détecter que la page a été consultée avec la chaîne de navigateur d’un iPhone, et définir le type de vue sur ``iphone`` en appelant :

source: The plugin would presumably also supply a set of views optimized for those devices.
fr: Le plugin fournirait probablement également un ensemble de vues optimisées pour ces appareils.

source: Altering views via plugins
fr: Modifier des vues via des plugins

source: Without modifying Elgg's core, Elgg provides several ways to customize almost all output:
fr: Sans modifier le noyau de Elgg, Elgg offre plusieurs manières de personnaliser quasiment toutes les sorties :

source: You can `override a view <#overriding-views>`_, completely changing the file used to render it.
fr: Vous pouvez `remplacer une vue <#overriding-vues>`_, en modifiant complètement le fichier utilisé pour l'afficher.

source: You can `extend a view <#extending-views>`_ by prepending or appending the output of another view to it.
fr: Vous pouvez `étendre une vue <#extending-vues>`_ en y insérant la sortie d’une autre vue avant ou après.

source: You can `alter a view's inputs <#altering-view-input>`_ by event.
fr: Vous pouvez `modifier les entrées d'une vue <#altering-view-input>`_ par événement.

source: You can `alter a view's output <#altering-view-output>`_ by event.
fr: Vous pouvez `modifier la sortie d'une vue <#altering-view-output>`_ via un événement.

source: Overriding views
fr: Surcharger les vues - "override"

source: Views in plugin directories always override views in the core directory; however, when plugins override the views of other plugins, :ref:`later plugins take precedent <admin/plugins#plugin-order>`.
fr: Les vues dans les répertoires des plugins remplacent toujours les vues du répertoire du noyau ; toutefois, quand les plugins remplacent les vues d’autres plugins, :ref:`les vues des derniers plugins remplacent celles des précédents <admin/plugins#plugin-order>`.

source: For example, if we wanted to customize the ``hello/world`` view to use an ``h2`` instead of an ``h1``, we could create a file at ``/mod/example/views/default/hello/world.php`` like this:
fr: Par exemple, si nous voulions personnaliser la vue ``hello/world`` pour utiliser un ``h2`` au lieu d’un ``h1``, nous pourrions créer un fichier ``mod/exemple/views/default/hello/world.php`` comme ceci :

source: When considering long-term maintenance, overriding views in the core and bundled plugins has a cost: Upgrades may bring changes in views, and if you have overridden them, you will not get those changes.
fr: Quand vous considérez la maintenance à long terme, la surcharge des vues du noyau et des plugins inclus a un coût : les mises à niveau peuvent apporter des changements dans les vues, et si vous les avez remplacées, vous n’obtiendrez pas ces changements ou devrez les réintégrer dans vos vues.

source: You may instead want to alter :ref:`the input <guides/views#altering-view-input>` or :ref:`the output <guides/views#altering-view-output>` of the view via events.
fr: Vous souhaiterez peut-être plutôt modifier :ref:`l'entrée input <guides/views#altering-view-input>` ou :ref:`la sortie output <guides/views#altering-view-output>` de la vue via des événements.

source: Elgg caches view locations. This means that you should disable the system cache while developing with views. When you install the changes to a production environment you must flush the caches.
fr: Elgg met en cache les chemins des vues. Cela signifie que vous devez désactiver le cache système quand vous développez avec des vues. Lorsque vous installez les modifications apportées dans un environnement de production, vous devez vider les caches.

source: Extending views
fr: Étendre les vues

source: There may be other situations in which you don't want to override the whole view, you just want to prepend or append some more content to it. In Elgg this is called *extending a view*.
fr: Il peut y avoir d’autres situations dans lesquelles vous ne voulez pas remplacer l’ensemble de la vue, et plutôt y ajouter un peu plus de contenu au début ou à la fin. Dans Elgg, c’est ce qu’on appelle *étendre une vue*.

source: For example, instead of overriding the ``hello/world`` view, we could extend it like so:
fr: Par exemple, au lieu de remplacer la vue ``hello/world``, nous pourrions l’étendre comme ceci :

source: If the contents of ``/views/default/hello/greeting.php`` is:
fr: Si le contenu de ``/views/default/hello/greeting.php`` est :

source: Then every time we call ``elgg_view('hello/world');``, we'll get:
fr: Ensuite, chaque fois que nous appelons ``elgg_view('hello/world');``, nous obtiendrons :

source: You can prepend views by passing a value to the 3rd parameter that is less than 500:
fr: Vous pouvez ajouter des choses avant la vue en transmettant au 3ème paramètre une valeur inférieure à 500 :

source: All view extensions should be registered in your plugin's ``elgg-plugin.php``.
fr: Toutes les extensions de vue doivent être enregistrées dans le ``elgg-plugin.php`` de votre plugin.

source: Altering view input
fr: Modifier l’entrée d'une vue

source: It may be useful to alter a view's ``$vars`` array before the view is rendered.
fr: Il peut être utile de modifier le tableau ``$vars`` d’une vue avant que la vue ne soit rendue.

source: Before each view rendering the ``$vars`` array is filtered by the :ref:`event <guides/events-list#views>` ``["view_vars", $view_name]``. Each registered handler function is passed these arguments:
fr: Avant le rendu de chaque vue, le tableau ``$vars`` est filtré par l' :ref:`événement <guides/events-list#views>` ``["view_vars", $view_name]``. Chaque fonction de gestionnaire enregistrée reçoit ces arguments :

source: ``$event`` - the string ``"view_vars"``
fr: ``$event`` - la chaîne ``"view_vars"``

source: ``$view_name`` - the view name being rendered (the first argument passed to ``elgg_view()``)
fr: ``$view_name`` - le nom de la vue (le premier argument est passé à ``elgg_view()``)
