Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Telling Elgg to load an existing module in the current page is easy:
fr: Il est aisé d'indiquer à Elgg de charger un module existant dans la page en cours :

source: Defining the Module
fr: Définir le Module

source: Passing settings to modules
fr: Passer des paramètres aux modules

source: The ``elgg.data`` events
fr: Les événements ``elgg.data``

source: The ``elgg`` module provides an object ``elgg.data`` which is populated from two server side events:
fr: Le module ``elgg`` fournit un objet ``elgg.data`` qui est renseigné à partir de deux événements côté serveur :

source: Let's pass some data to a module:
fr: Passons quelques données au module :

source: Setting the URL of a module
fr: Définir l'URL d'un module

source: You may have an AMD script outside your views you wish to make available as a module.
fr: Vous pouvez avoir un script AMD en dehors de vos vues que vous souhaitez mettre à disposition en tant que module.

source: The best way to accomplish this is by configuring the path to the file using the ``views`` section of the ``elgg-plugin.php`` file in the root of your plugin:
fr: La meilleure façon d’y parvenir est de configurer le chemin d’accès au fichier à l’aide de la section ``views`` du fichier ``elgg-plugin.php`` dans la racine de votre plugin :

source: If you've copied the script directly into your plugin instead of managing it with Composer, you can use something like this instead:
fr: Si vous avez copié le script directement dans votre plugin au lieu de le gérer avec Composer, vous pouvez utiliser quelque chose comme ceci à la place :

source: That's it! Elgg will now load this file whenever the "underscore" module is requested.
fr: Voilà ! Elgg chargera maintenant ce fichier chaque fois que le module "underscore" est requis.

source: Modules provided with Elgg
fr: Modules fournis avec Elgg

source: Normalize a URL relative to the elgg root:
fr: Normalise une URL par rapport à la racine de elgg :

source: Redirect to a new page.
fr: Redirige vers une nouvelle page.

source: This function automatically normalizes the URL.
fr: Cette fonction normalise automatiquement l’URL.

source: Parse a URL into its component parts:
fr: Analyse et découpe une URL en ses composants :

source: Returns the logged in user's guid.
fr: Renvoie le GUID de l’utilisateur connecté.

source: True if the user is logged in.
fr: Vrai si l’utilisateur est connecté.

source: True if the user is logged in and is an admin.
fr: Vrai si l’utilisateur est connecté et est administrateur.

source: There are a number of configuration values set in the elgg object:
fr: Un certain nombre de valeurs de configuration sont définies dans l’objet elgg :

source: See the :doc:`ajax` page for details.
fr: Voir la page :doc:`ajax` pour plus de détails.

source: The ``elgg/hooks`` module can be used to have plugins interact with eachother.
fr: Le module ``elgg/hooks`` peut être utilisé pour faire interagir les plugins entre eux.

source: Translate interface text
fr: Traduisez le texte de l’interface

source: The ``elgg/i18n`` module can be used to use translations.
fr: Le module ``elgg/i18n`` peut être utilisé pour utiliser les traductions.

source: The ``elgg/system_messages`` module can be used to show system messages to the user.
fr: Le module ``elgg/system_messages`` peut être utilisé pour afficher les messages système à l'utilisateur.

source: The ``elgg/security`` module can be used to add a security token to an object, URL, or query string:
fr: Le module ``elgg/security`` peut être utilisés pour ajouter un jeton de sécurité à un objet, une URL, ou une chaîne de requête :

source: The ``elgg/spinner`` module can be used to create an loading indicator fixed to the top of the window. This can be used to give users feedback that the system is performing a longer running task. Using ajax features from ``elgg/Ajax`` will do this by default. You can also use it in your own code.
fr: Le module ``elgg/spinner`` peut être utilisé pour créer un indicateur de chargement fixé en haut de la fenêtre. Cela peut être utilisé pour indiquer aux utilisateurs que le système exécute une tâche plus longue. L'utilisation des fonctionnalités ajax de ``elgg/Ajax`` le fait par défaut. Vous pouvez également l'utiliser dans votre propre code.

source: The ``elgg/popup`` module can be used to display an overlay positioned relatively to its anchor (trigger).
fr: Le module ``elgg/popup`` peut être utilisé pour afficher une superposition - overlay - placée relativement à son ancre (déclencheur - trigger).

source: The ``elgg/popup`` module is automatically loaded for content drawn using ``output/url`` with the ``class='elgg-popup'`` attribute and defining target module with a ``href`` (or ``data-href``) attribute. Popup module positioning can be defined with ``data-position`` attribute of the trigger element.
fr: Le module ``elgg/popup`` est automatiquement chargé pour le contenu dessiné en utilisant ``output/url`` avec l'attribut ``class='elgg-popup'`` et en définissant le module cible avec un attribut ``href`` (ou ``data-href``). Le positionnement du module contextuel peut être défini avec l'attribut ``data-position`` de l'élément déclencheur.

source: The ``elgg/popup`` module allows you to build out more complex UI/UX elements. You can open and close popup modules programmatically:
fr: Le module ``elgg/popup`` vous permet de créer des éléments d’interface utilisateur/UX plus complexes. Vous pouvez ouvrir et fermer les modules contextuels via le code :

source: You can use ``getOptions, ui.popup`` plugin hook to manipulate the position of the popup before it has been opened. You can use jQuery ``open`` and ``close`` events to manipulate popup module after it has been opened or closed.
fr: Vous pouvez utiliser le hook plugin ``getOptions, ui.popup`` pour manipuler la position du popup avant qu’il soit ouvert. Vous pouvez utiliser les événements jQuery ``open`` et ``close`` pour manipuler le module popup après son ouverture ou sa fermeture.

source: Open popup modules will always contain the following data that can be accessed via ``$.data()``:
fr: Les modules popups ouverts contiennent toujours les données suivantes auxquelles il est possible d'accéder via ``$.data()`` :

source: ``trigger`` - jQuery element used to trigger the popup module to open
fr: ``trigger`` - élément jQuery utilisé pour déclencher l’ouverture du module popup

source: ``position`` - An object defining popup module position that was passed to ``$.position()``
fr: ``position`` - Un objet définissant la position du module popup qui a été passé à ``$.position()``

source: By default, ``target`` element will be appended to ``$('body')`` thus altering DOM hierarchy. If you need to preserve the DOM position of the popup module, you can add ``.elgg-popup-inline`` class to your trigger.
fr: Par défaut, l’élément ``target`` sera ajouté à ``$('body')``, modifiant ainsi la hiérarchie DOM. Si vous devez conserver la position DOM du module popup, vous pouvez ajouter la classe ``.elgg-popup-inline`` à votre déclencheur.

source: Plugins that load a widget layout via Ajax should initialize via this module:
fr: Des plugins qui chargent une mise en page widget via Ajax devraient s'initialiser via ce module :

source: Elgg is distributed with the Colorbox jQuery library. Please go to http://www.jacklmoore.com/colorbox for more information on the options of this lightbox.
fr: Elgg est distribué avec la bibliothèque jQuery Colorbox. Veuillez consulter https://www.jacklmoore.com/colorbox/ pour plus d’informations sur les options de cette lightbox.

source: Use the following classes to bind your anchor elements to a lightbox:
fr: Utilisez les classes suivantes pour lier vos éléments d’ancrage à des boîtes surgissantes lightbox :

source: ``elgg-lightbox`` - loads an HTML resource
fr: ``elgg-lightbox`` - charge une ressource HTML

source: ``elgg-lightbox-photo`` - loads an image resource (should be used to avoid displaying raw image bytes instead of an ``img`` tag)
fr: ``elgg-lightbox-photo`` - charge une ressource de type image (devrait être utilisé pour éviter d’afficher les octets d’image bruts au lieu de la balise ``img``)

source: ``elgg-lightbox-inline`` - displays an inline HTML element in a lightbox
fr: ``elgg-lightbox-inline`` - affiche un élément HTML en ligne dans une boîte surgissante - lightbox

source: ``elgg-lightbox-iframe`` - loads a resource in an ``iframe``
fr: ``elgg-lightbox-iframe`` - charge une ressource dans une ``iframe``

source: You may apply colorbox options to an individual ``elgg-lightbox`` element by setting the attribute ``data-colorbox-opts`` to a JSON settings object.
fr: Vous pouvez appliquer des options de colorbox à un élément individuel ``elgg-lightbox`` en définissant l’attribut ``data-colorbox-opts`` avec un objet de paramètres JSON.

source: Use ``"getOptions", "ui.lightbox"`` plugin hook to filter options passed to ``$.colorbox()`` whenever a lightbox is opened.
fr: Utilisez le hook plugin ``"getOptions", "ui.lightbox"`` pour filtrer les options passées à ``$.colorbox()`` chaque fois qu’une lightbox est ouverte.

source: ``elgg/lightbox`` AMD module should be used to open and close the lightbox programmatically:
fr: Le module AMD ``elgg/lightbox`` devrait être utilisé pour ouvrir et fermer la lightbox de manière programmatique :

source: To support gallery sets (via ``rel`` attribute), you need to bind colorbox directly to a specific selector (note that this will ignore ``data-colorbox-opts`` on all elements in a set):
fr: Pour prendre en charge des ensembles de galerie (via l’attribut ``rel``), vous devez lier colorbox directement à un sélecteur spécifique (notez que cela ignorera ``data-colorbox-opts`` sur tous les éléments d’un ensemble) :

source: You can also resize the lightbox programmatically if needed:
fr: Vous pouvez également redimensionner la lightbox via le code si nécessaire :

source: If you wish your content to be loaded by the ``elgg/Ajax`` AMD module, which automaticly loads the JS dependencies, you can pass the option ``ajaxLoadWithDependencies``
fr: Si vous souhaitez que votre contenu soit chargé par le module AMD ``elgg/Ajax``, qui charge automatiquement les dépendances JS, vous pouvez passer l'option ``ajaxLoadWithDependencies``

source: This module can be used to add WYSIWYG editor to a textarea (requires ``ckeditor`` plugin to be enabled). Note that WYSIWYG will be automatically attached to all instances of ``.elgg-input-longtext``.
fr: Ce module peut être utilisé pour ajouter un éditeur WYSIWYG à un textarea (nécessite que le plugin ``ckeditor`` soit activé). Notez que le WYSIWYG sera automatiquement attaché à toutes les instances de ``.elgg-input-longtext``.

source: Inline tabs component
fr: Composant d’onglets en ligne

source: Inline tabs component fires an ``open`` event whenever a tabs is open and, in case of ajax tabs, finished loading:
fr: Le composant d'onglets en ligne déclenche un événement ``open`` chaque fois qu’un onglet est ouvert et, en cas d’onglets ajax, une fois le chargement terminé :

source: Traditional scripts
fr: Scripts traditionnels

source: Although we highly recommend using AMD modules, and there is no Elgg API for loading the scripts, you can register scripts in a event handler to add elements to the head links;
fr: Bien que nous recommandons fortement d'utiliser les modules AMD et qu'il n'y ait pas d'API Elgg pour charger les scripts, vous pouvez enregistrer des scripts dans un gestionnaire d'événements pour ajouter des éléments aux liens principaux ;

source: The JS engine has a hooks system similar to the PHP engine's events: hooks are triggered and plugins can register functions to react or alter information.
fr: Le moteur JS dispose d'un système de hooks similaire aux événements du moteur PHP : les hooks sont déclenchés et les plugins peuvent enregistrer des fonctions pour réagir ou modifier des informations.

source: Registering hook handlers
fr: Enregistrer des gestionnaires de hook

source: Handler functions are registered using ``hooks.register()``. Multiple handlers can be registered for the same hook.
fr: Les fonctions du gestionnaire sont enregistrées en utilisant ``hooks.register()``. Plusieurs gestionnaires peuvent être enregistrés pour le même hook.

source: The handler function
fr: La fonction gestionnaire - handler

source: The handler will receive 4 arguments:
fr: Le gestionnaire va recevoir 4 arguments :

source: **hook** - The hook name
fr: **hook** - Le nom du hook

source: **type** - The hook type
fr: **type** - Le type de hook

source: **params** - An object or set of parameters specific to the hook
fr: **params** - Un objet ou un ensemble de paramètres propres au hook

source: **value** - The current value
fr: **value** - La valeur actuelle

source: The ``value`` will be passed through each hook. Depending on the hook, callbacks can simply react or alter data.
fr: La valeur ``value`` passera par chaque hook. Selon le hook, les fonctions de rappel peuvent simplement réagir, ou modifier les données.

source: Triggering custom hooks
fr: Déclencher des hooks personnalisés

source: Plugins can trigger their own hooks:
fr: Les plugins peuvent déclencher leurs propres hooks :

source: Available hooks
fr: Hooks disponibles

source: Plugins should register their init functions for this hook. It is fired after Elgg's JS is loaded and all plugin boot modules have been initialized.
fr: Les plugins devraient enregistrer leurs fonctions d'initialisation via ce hook. Il est déclenché après que les JS de Elgg sont chargés, et une fois que tous les modules de démarrage - boot - des plugins sont initialisés.

source: This hook is fired for pop up displays (``"rel"="popup"``) and allows for customized placement options.
fr: Ce hook est déclenché pour les affichages surgissants - popups (``"rel"="popup"``) et permet des options de positionnement personnalisées.

source: This hook can be used to filter options passed to ``$.colorbox()``
fr: Ce hook peut être utilisé pour filtrer les options transmises à ``$.colorbox()``

source: This filters the CKEditor config object. Register for this hook in a plugin boot module. The defaults can be seen in the module ``elgg/ckeditor/config``.
fr: Cela filtre l’objet de configuration CKEditor. Enregistrez un gestionnaire pour ce hook dans le module de démarrage du plugin. Les valeurs par défaut sont visibles dans le module ``elgg/ckeditor/config``.

source: This hook can be used to decorate ``CKEDITOR`` global. You can use this hook to register new CKEditor plugins and add event bindings.
fr: Ce hook peut être utilisé pour modifier globalement ``CKEDITOR``. Vous pouvez utiliser ce hook pour enregistrer de nouveaux plugins CKEditor et ajouter des liaisons d’événements - event bindings.

source: This filters request data sent by the ``elgg/Ajax`` module. See :doc:`ajax` for details. The hook must check if the data is a plain object or an instanceof ``FormData`` to piggyback the values using correct API.
fr: Ceci filtre les demandes de données envoyées par le module ``elgg/Ajax``. Voir :doc:`ajax` pour plus de détails. Le hook doit vérifier si les données sont un objet simple ou une instance de ``FormData`` pour récupérer les valeurs à l’aide de la bonne API.

source: This filters the response data returned to users of the ``elgg/Ajax`` module. See :doc:`ajax` for details.
fr: Ceci filtre les données de réponse retournées aux utilisateurs par le module ``elgg/Ajax``. Voir :doc:`ajax` pour plus de détails.

source: Third-party assets
fr: Actifs tierce-partie - assets

source: We recommend managing third-party scripts and styles with Composer. Elgg's composer.json is configured to install dependencies from the **NPM** or **Yarn** package repositories using Composer command-line tool. Core configuration installs the assets from `Asset Packagist <https://asset-packagist.org>`_ (a repository managed by the Yii community).
fr: Nous vous recommandons de gérer des scripts et des styles tiers avec Composer. Le composer.json de Elgg est configuré pour installer des dépendances à partir des référentiels de packages **NPM** ou **Yarn** à l’aide de l’outil de ligne de commande Composer. La configuration de base installe les actifs à partir de `Asset Packagist <https://asset-packagist.org>`_ (un référentiel géré par la communauté Yii).

source: Alternatively, you can install ``fxp/composer-asset-plugin`` globally to achieve the same results, but the installation and update takes much longer.
fr: Alternativement, vous pouvez installer ``fxp/composer-asset-plugin`` globalement pour obtenir les mêmes résultats, mais l’installation et la mise à jour prennent beaucoup plus de temps.

source: For example, to include jQuery, you could run the following Composer commands:
fr: Par exemple, pour inclure jQuery, vous pouvez exécuter les commandes composer suivantes :

source: If you are using a starter-project, or pulling in Elgg as a composer dependency via a custom composer project, update your ``composer.json`` with the following configuration:
fr: Si vous utilisez un projet de démarrage - starter-project - ou que vous utilisez Elgg sous forme de dépendance d'un projet composer personnalisé, mettez à jour votre ``composer.json`` avec la configuration suivante :

source: You can find additional information at `Asset Packagist <https://asset-packagist.org>`_ website.
fr: Vous pouvez trouver des informations supplémentaires sur le site de `Asset Packagist <https://asset-packagist.org>`_.

source: Elgg contains helper code to build menus throughout the site.
fr: Elgg propose des fonctions d'aide pour créer des menus sur tout le site.

source: Every single menu requires a name, as does every single menu item. These are required in order to allow easy overriding and manipulation, as well as to provide events for theming.
fr: Chaque menu nécessite un nom, tout comme chaque élément de menu. Ceux-ci sont nécessaires pour permettre un remplacement et une manipulation faciles, ainsi que pour fournir des événements pour les thèmes.

source: Basic usage
fr: Utilisation simple

source: Basic functionalities can be achieved through these two functions:
fr: Les fonctionnalités de base peuvent être réalisées grâce à ces deux fonctions :

source: ``elgg_register_menu_item()`` to add an item to a menu
fr: ``elgg_register_menu_item()`` pour ajouter un élément à un menu

source: ``elgg_unregister_menu_item()`` to remove an item from a menu
fr: ``elgg_unregister_menu_item()`` pour supprimer un élément d’un menu

source: You normally want to call them from your plugin's init function.
fr: Vous voudrez normalement les appeler à partir de la fonction d'initialisation de votre plugin.

source: Examples
fr: Exemples

source: Admin menu
fr: Menu admin

source: You can also register ``page`` menu items to the admin backend menu. When registering for the admin menu you can set the context of the menu items to ``admin`` so the menu items only show in the ``admin`` context. There are 3 default sections to add your menu items to.
fr: Vous pouvez également enregistrer des éléments du menu ``page`` dans le menu de l'interface d’administration. Lorsque vous enregistrez des éléments pour le menu d'administration, vous pouvez définir le contexte des éléments de menu sur ``admin`` afin que les éléments du menu ne s’affichent que dans le contexte ``admin``. Il existe 3 sections par défaut auxquelles ajouter vos éléments de menu.

source: ``administer`` for daily tasks, user management and other actionable tasks
fr: ``administer`` pour les tâches quotidiennes, la gestion des utilisateurs et d’autres tâches pratiques

source: ``configure`` for settings, configuration and utilities that configure stuff
fr: ``configure`` pour des paramètres, des éléments de configuration et des utilitaires qui configurent diverses choses

source: ``information`` for statistics, overview of information or status
fr: ``information`` pour des statistiques, une vue d’ensemble d'informations ou de statuts

source: Advanced usage
fr: Utilisation avancée

source: Headers
fr: Entêtes

source: For accessibility reasons each menu will get an ``aria-label`` which defaults to the menu name, but can be translated by making sure the language key ``menu:<menu name>:header`` is available.
fr: Pour des raisons d'accessibilité, chaque menu recevra un ``aria-label`` qui par défaut est le nom du menu, mais peut être traduit en s'assurant que la clef de traduction ``menu:<menu name>:header`` est disponible.

source: It's also possible to show menu section headers by setting ``show_section_headers`` to ``true`` in ``elgg_view_menu()``
fr: Il est également possible d'afficher les entêtes des sections de menu en définissant ``show_section_headers`` sur ``true`` dans ``elgg_view_menu()``

source: The headers have a magic language key available ``menu:<menu name>:header:<section name>`` in order to be able to translate the headers.
fr: Les entêtes utilisent une clé de langage magique disponible ``menu:<menu name>:header:<section name>`` afin de pouvoir traduire les entêtes.

source: Events
fr: Événements

source: You can get more control over menus by using :doc:`events </design/events>` and the public methods provided by the ``ElggMenuItem`` class.
fr: Vous pouvez obtenir plus de contrôle sur les menus en utilisant :doc:`events </design/events>` et les méthodes publiques fournies par la classe ``ElggMenuItem``.

source: There are three events that can be used to modify a menu:
fr: Trois événements peuvent être utilisés pour modifier un menu :

source: ``'parameters', 'menu:<menu name>'`` to add or modify parameters use for the menu building (eg. sorting)
fr: ``'parameters', 'menu:'`` pour ajouter ou modifier les paramètres utilisés pour construire le menu (par exemple l'ordre de tri)

source: ``'register', 'menu:<menu name>'`` to add or modify items (especially in dynamic menus)
fr: ``'register', 'menu:'`` pour ajouter ou modifier des éléments (en particulier dans les menus dynamiques)

source: ``'prepare', 'menu:<menu name>'`` to modify the structure of the menu before it is displayed
fr: ``'prepare', 'menu:'`` pour modifier la structure du menu avant qu’il soit affiché

source: When you register an event handler, replace the ``<menu name>`` part with the internal name of the menu.
fr: Lorsque vous enregistrez un gestionnaire d'événements, remplacez la partie ``<menu name>`` par le nom interne du menu.

source: The third parameter passed into a menu handler contains all the menu items that have been registered so far by Elgg core and other enabled plugins. In the handler we can loop through the menu items and use the class methods to interact with the properties of the menu item.
fr: Le troisième paramètre passé au gestionnaire de menu contient tous les éléments de menu qui ont été enregistrés jusqu’à présent par le noyau de Elgg et d’autres plugins activés. Dans le gestionnaire, nous pouvons faire une boucle à travers les éléments de menu et utiliser les méthodes de classe pour interagir avec les propriétés de l’élément de menu.

source: In some cases a more granular version of the ``register`` and ``prepare`` menu events exist with ``menu:<menu name>:<type>:<subtype>``, this applies when the menu gets provided an ``\ElggEntity`` in ``$params['entity']`` or an ``\ElggAnnotation`` in ``$params['annotation']`` or an ``\ElggRelationship`` in ``$params['relationship']``.
fr: Dans certains cas, une version plus granulaire des événements de menu ``register`` et ``prepare`` existe avec ``menu:<menu name>:<type>:<subtype>``, cela s'applique lorsque le menu reçoit un ``\ElggEntity`` dans `` $params['entity']`` ou un ``\ElggAnnotation`` dans ``$params['annotation']`` ou un ``\ElggRelationship`` dans ``$params['relationship']``.
