Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: From the Advanced Settings page, find the option labelled "Restrict pages to logged-in users." Enable this option, then click "Save" to switch your site into Walled Garden mode.
fr: Dans la page Paramètres avancés, recherchez l’option libellée "Restreindre les pages aux utilisateurs connectés". Activez cette option, puis cliquez sur "Enregistrer" pour basculer votre site en mode Walled Garden.

source: Exposing pages through Walled Gardens
fr: Exposer des pages à travers le Walled Garden

source: Many plugins extend Elgg by adding pages. Walled Garden mode will prevent these pages from being viewed by logged out users. Elgg uses :doc:`events </design/events>` to manage which pages are visible through the Walled Garden.
fr: De nombreux plugins étendent Elgg en ajoutant des pages. Le mode Walled Garden empêchera ces pages d’être consultées par les utilisateurs déconnectés. Elgg utilise :doc:`events </design/events>` pour gérer quelles pages sont visibles à travers le Walled Garden.

source: Plugin authors must register pages as public if they should be viewable through Walled Gardens:
fr: Les auteurs de plugins doivent enregistrer les pages comme publiques si elles doivent être visibles à travers le walled garden :

source: by setting ``'walled' => false`` in route configuration
fr: en définissant ``'walled' => false`` dans la configuration des routes

source: by responding to the ``public_pages``, ``walled_garden`` event. The returned value is an array of regexp expressions for public pages.
fr: en répondant à l'événement ``public_pages``, ``walled_garden``. La valeur renvoyée est un tableau d'expressions rationnelles regexp pour les pages publiques.

source: The following code shows how to expose http://example.org/my_plugin/public_page through a Walled Garden. This assumes the plugin has registered a :doc:`route </guides/routing>` for ``my_plugin/public_page``.
fr: Le code suivant montre comment exposer http://exemple.org/mon_plugin/public_page à travers le walled garden. Cela suppose que le plugin a enregistré une :doc:`route </guides/routing>` pour ``mon_plugin/public_page``.

source: Build an HTTP API for your site.
fr: Construisez une API HTTP pour votre site.

source: Elgg provides a powerful framework for building web services. This allows developers to expose functionality to other web sites and desktop applications along with doing integrations with third-party web applications. While we call the API RESTful, it is actually a REST/RPC hybrid similar to the APIs provided by sites like Flickr and Twitter.
fr: Elgg fournit un framework puissant pour la création de services web. Cela permet aux développeurs d’exposer des fonctionnalités à d’autres sites Web et applications de bureau, ainsi que des intégrations avec des applications web tierces. Bien que nous appelions l’API RESTful, il s’agit en fait d’un hybride REST/RPC similaire aux API fournies par des sites comme Flickr et Twitter.

source: To create an API for your Elgg site, you need to do 4 things:
fr: Pour créer une API pour votre site Elgg, vous devez effectuer 4 choses :

source: enable the web services plugin
fr: activer le plugin web services

source: expose methods
fr: exposer des méthodes

source: setup API authentication
fr: mettre en place l'authentification de l'API

source: setup user authentication
fr: mettre en place l'authentification utilisateur

source: Additionally, you may want to control what types of authentication are available on your site. This will also be covered.
fr: De plus, vous pourriez vouloir contrôler quels types d’authentification sont disponibles sur votre site. Cela sera également traité.

source: It is crucial that the web services are consumed via secure protocols. Do not enable web services if your site is not served via HTTPs. This is especially important if you allow API key only authentication.
fr: Il est essentiel que les services web soient utilisés via des protocoles sécurisés. N’activez pas les services web si votre site n’est pas servi par HTTPS. Ceci est particulièrement important si vous autorisez l’authentification par clef d'API uniquement.

source: If you are using third-party tools that expose API methods, make sure to carry out a thorough security audit. You may want to make sure that API authentication is required for ALL methods, even if they require user authentication. Methods that do not require API authentication can be easily abused to spam your site.
fr: Si vous utilisez des outils tiers qui exposent des méthodes d’API, assurez-vous d’effectuer un audit de sécurité approfondi. Vous pouvez vouloir vous assurer que l’authentification API est requise pour TOUTES les méthodes, même si elles nécessitent l’authentification de l’utilisateur. Les méthodes qui ne nécessitent pas d’authentification API peuvent être facilement utilisées pour spammer votre site.

source: Ensure that the validity of API keys is limited and provide mechanisms for your API clients to renew their keys.
fr: Assurez-vous que la validité des clefs d'API est limitée et fournissez à vos clients API des mécanismes pour renouveler leurs clefs.

source: Exposing methods
fr: Exposer des méthodes

source: API methods can be exposed in one of two ways: - using the ``web_services`` section in the ``elgg-plugin.php`` file of your plugin - during the ``'register', 'api_methods'`` event
fr: Les méthodes API peuvent être exposées de l'une des deux manières : - en utilisant la section ``web_services`` dans le fichier ``elgg-plugin.php`` de votre plugin - ou lors de l'événement ``'register', 'api_methods'``

source: As an example, let's assume you want to expose a function that echos text back to the calling application. The function could look like this
fr: À titre d'exemple, supposons que vous souhaitiez exposer une fonction qui renvoie du texte à l'application appelante. La fonction pourrait ressembler à ceci

source: Since we are providing this function to allow developers to test their API clients, we will require neither API authentication nor user authentication. This call registers the function with the web services API framework:
fr: Puisque nous fournissons cette fonction pour permettre aux développeurs de tester leurs clients d'API, nous n’aurons besoin ni d’authentification API ni d’authentification utilisateur. Cet appel enregistre la fonction avec le framework API des services web :

source: If no ``description`` is provided in the API method definition the system will check for the existence of the language key ``web_services:api_methods:<method>:<http call method>:description``
fr: Si aucune ``description`` n'est fournie dans la définition de la méthode API, le système vérifiera l'existence de la clé de langage ``web_services:api_methods:<method>:<http call method>:description``

source: If you add this code to a plugin and then go to http://yoursite.com/services/api/rest/json/?method=system.api.list, you should now see your ``test.echo`` method listed as an API call. Further, to test the exposed method from a web browser, you could hit the url: http://yoursite.com/services/api/rest/json/?method=test.echo&string=testing and you should see JSON data like this:
fr: Si vous ajoutez ce code à un plugin puis allez sur http://yoursite.com/services/api/rest/json/?method=system.api.list, vous devriez maintenant voir votre méthode ``test.echo`` répertoriée comme un appel API. De plus, pour tester la méthode exposée à partir d'un navigateur Web, vous pouvez accéder à l'URL : http://yoursite.com/services/api/rest/json/?method=test.echo&string=testing et vous devriez voir des données JSON comme celles-ci :

source: Plugins can filter the output of individual API methods by registering a handler for ``'rest:output',$method`` event.
fr: Les plugins peuvent filtrer la sortie de méthodes API individuelles en enregistrant un gestionnaire pour l'événement ``'rest:output',$method``.

source: Response formats
fr: Formats de réponse

source: JSON is the default format, however XML and serialized PHP can be fetched by enabling the ``data_views`` plugin and substituting ``xml`` or ``php`` in place of ``json`` in the above URLs.
fr: JSON est le format par défaut, mais il est possible de récupérer du XML et du PHP sérialisé en activant le plugin ``data_views`` et en remplaçant ``json`` par ``xml`` ou ``php`` dans les URL ci-dessus.

source: You can also add additional response formats by defining new view types.
fr: Vous pouvez également ajouter des formats de réponse supplémentaires en définissant de nouveaux types de vues.

source: Parameters
fr: Paramètres

source: Parameters expected by each method should be listed as an associative array, where the key represents the parameter name, and the value contains an array with ``type``, ``default`` and ``required`` fields.
fr: Les paramètres attendus par chaque méthode doivent être répertoriés comme un tableau associatif, où la clef représente le nom du paramètre, et la valeur contient un tableau avec les champs ``type``, ``default`` et ``required``.

source: Values submitted with the API request for each parameter should match the declared type. API will throw on exception if validation fails.
fr: Les valeurs soumises pour chaque paramètre de la requête API devraient correspondre au type déclaré. L'API renverra une exception si la validation échoue.

source: Recognized parameter types are:
fr: Les types de paramètres reconnus sont :

source: ``integer`` (or ``int``)
fr: ``integer`` (ou ``int``)

source: ``boolean`` (or ``bool``) ``'false'``, ``0`` and ``'0'`` will evaluate to ``false`` the rest will evaluate to ``true``
fr: ``boolean`` (ou ``bool``) ``'false'``, ``0`` et ``'0'`` seront évalués comme ``false``, le reste sera évalué comme ``true``

source: Unrecognized types will throw an API exception.
fr: Les types non reconnus lancent une exception d’API.

source: You can use additional fields to describe your parameter, e.g. ``description``.
fr: Vous pouvez utiliser des champs supplémentaires pour décrire votre paramètre, par exemple ``description``.

source: If a missing parameter has no default value, the argument will be ``null``. Before Elgg v2.1, a bug caused later arguments to be shifted left in this case.
fr: Si un paramètre manquant n’a pas de valeur par défaut, l’argument sera ``null``. Avant Elgg v2.1, un bogue provoquait le décalage vers la gauche des arguments ultérieurs dans ce cas.

source: Receive parameters as associative array
fr: Recevoir des paramètres sous forme de tableau associatif

source: If you have a large number of method parameters, you can force the execution script to invoke the callback function with a single argument that contains an associative array of parameter => input pairs (instead of each parameter being a separate argument). To do that, set ``$assoc`` to ``true`` in ``elgg_ws_expose_function()``.
fr: Si vous avez un grand nombre de paramètres de méthode, vous pouvez forcer le script d’exécution à invoquer la fonction de rappel avec un seul argument qui contient un tableau associatif de paires de paramètre => valeur (au lieu que chaque paramètre soit un argument distinct). Pour ce faire, définissez ``$assoc`` sur ``true`` dans ``elgg_ws_expose_function()``.

source: If a missing parameter has no default value, ``null`` will be used.
fr: Si un paramètre manquant n’a pas de valeur par défaut, ``null`` sera utilisé.

source: API authentication
fr: API d'authentification

source: You may want to control access to some of the functions that you expose. Perhaps you are exposing functions in order to integrate Elgg with another open source platform on the same server. In that case, you only want to allow that other application access to these methods. Another possibility is that you want to limit what external developers have access to your API. Or maybe you want to limit how many calls a developer can make against your API in a single day.
fr: Vous pouvez souhaiter contrôler l’accès à certaines des fonctions que vous exposez. Peut-être que vous exposez des fonctions afin d’intégrer Elgg avec une autre plateforme open source sur le même serveur. Dans ce cas, vous souhaitez seulement permettre à cette autre application d’accéder à ces méthodes. Une autre possibilité est que vous souhaitez limiter ce à quoi des développeurs externes ont accès via votre API. Ou peut-être voulez-vous limiter le nombre d’appels qu’un développeur peut passer auprès de votre API en une seule journée.

source: In all of these cases, you can use Elgg's API authentication functions to control access. Elgg provides two built-in methods to perform API authentication: key based and HMAC signature based. You can also add your own authentication methods. The key based approach is very similar to what Google, Flickr, or Twitter. Developers can request a key (a random string) and pass that key with all calls that require API authentication. The keys are stored in the database and if an API call is made without a key or a bad key, the call is denied and an error message is returned.
fr: Dans tous ces cas, vous pouvez utiliser les fonctions d’authentification de l'API de Elgg pour contrôler l’accès. Elgg fournit deux méthodes intégrées pour effectuer l’authentification auprès de l'API : la première basée sur la clef, et la signature HMAC. Vous pouvez également ajouter vos propres méthodes d’authentification. L’approche basée sur les clefs est très similaire à ce que font Google, FlickR, ou Twitter. Les développeurs peuvent demander une clef (une chaîne aléatoire) et transmettre cette clef avec tous les appels nécessitant l’authentification auprès de l'API. Les clefs sont stockées dans la base de données et si un appel API est effectué sans clef ou avec une mauvaise clef, l’appel est refusé et un message d’erreur est renvoyé.

source: Key-based authentication
fr: Authentification par clef

source: As an example, let's write a function that returns the number of users that have registered on your site since a certain timestamp.
fr: A titre d'exemple, écrivons une fonction qui renvoie le nombre d'utilisateurs qui se sont inscrits sur votre site depuis un certain horodatage.

source: Now, let's expose it and make the number of minutes a required parameter:
fr: Maintenant, exposons-le et faisons du nombre de minutes un paramètre obligatoire :

source: This function is now available and if you check ``system.api.list``, you will see that it requires API authentication. If you hit the method with a web browser, it will return an error message about failing the API authentication. To test this method, you need an API key. As of Elgg 3.2 API keys can be generated by the webservices plugin. It will return a public and private key and you will use the public key for this kind of API authentication. Grab a key and then do a GET request with your browser on this API method passing in the key string as the parameter ``api_key``. It might look something like this: http://yoursite.com/services/api/rest/xml/?method=users.active&api_key=1140321cb56c71710c38feefdf72bc462938f59f.
fr: Cette fonction est maintenant disponible, et si vous cochez ``system.api.list``, vous verrez qu’elle nécessite l’authentification API. Si vous testez la méthode avec un navigateur Web, cela renvoie un message d’erreur concernant l’échec de l’authentification API. Pour tester cette méthode, vous avez besoin d’une clef API. À partir de Elgg 3.2 les clefs API peuvent être générées par le plugin webservices. Il permet de créer une clef publique et privée, et vous devrez utiliser la clef publique pour ce type d’authentification API. Prenez une clef, puis effectuez une requête GET avec votre navigateur sur cette méthode d'API en passant dans la chaîne de paramètre la clef ``api_key``. Cela pourrait ressembler à quelque chose comme ceci: http://yoursite.com/services/api/rest/xml/?method=users.active&api_key=1140321cb56c71710c38feefdf72bc462938f59f.

source: Signature-based authentication
fr: Authentification par signature

source: The :doc:`web-services/hmac` is similar to what is used with OAuth or Amazon's S3 service. This involves both the public and private key. If you want to be very sure that the API calls are coming from the developer you think they are coming from and you want to make sure the data is not being tampered with during transmission, you would use this authentication method. Be aware that it is much more involved and could turn off developers when there are other sites out there with key-based authentication.
fr: Le :doc:`web-services/hmac` est similaire à ce qui est utilisé avec OAuth ou le service S3 d’Amazon. Il s’agit d'utiliser à la fois une clef publique et une clef privée. Si vous voulez vous assurer que les appels à l'API proviennent du développeur dont vous pensez qu’ils viennent, et que vous voulez vous assurer que les données ne sont pas altérées pendant la transmission, vous devriez utiliser cette méthode d’authentification. Soyez conscient que cela demande beaucoup plus de travail et que cela pourrait décourager des développeurs quand il existe d’autres sites qui n'utilisent qu'une simple authentification basée sur les clefs.

source: User authentication
fr: Authentification utilisateur

source: So far you have been allowing developers to pull data out of your Elgg site. Now we'll move on to pushing data into Elgg. In this case, it is going to be done by a user. Maybe you have created a desktop application that allows your Users to post to the wire without going to the site. You need to expose a method for posting to the wire and you need to make sure that a user cannot post using someone else's account. Elgg provides a token-based approach for user authentication. It allows a user to submit their username and password in exchange for a token using the method ``auth.gettoken``. This token can then be used for some amount of time to authenticate all calls to the API before it expires by passing it as the parameter ``auth_token``. If you do not want to have your users trusting their passwords to 3rd-party applications, you can also extend the current capability to use an approach like OAuth.
fr: Jusqu’à présent, vous avez permis aux développeurs d'extraire des données de votre site Elgg. Maintenant, nous allons comment pousser des données dans Elgg. Dans ce cas, cela va être fait par un utilisateur. Par exemple vous pouvez avoir créé une application de bureau qui permet à vos utilisateurs de poster sur le fil sans aller sur le site. Vous allez devoir exposer une méthode pour afficher sur le fil et vous assurer qu’un utilisateur ne peut pas publier à l’aide du compte de quelqu’un d’autre. Elgg fournit une approche basée sur des jetons pour l’authentification utilisateur. Cela permet à un utilisateur de soumettre son nom d’utilisateur et son mot de passe afin d'obtenir en échange un jeton, en utilisant la méthode ``auth.gettoken``. Ce jeton peut ensuite être utilisé pendant un certain temps comme paramètre ``auth_token`` pour authentifier tous les appels à l’API, jusqu'à-ce qu’il expire. Si vous ne voulez pas que vos utilisateurs fassent confiance à leurs mots de passe pour des applications tierces, vous pouvez également étendre la capacité actuelle d’utiliser une approche comme OAuth.

source: Let's write our wire posting function:
fr: Écrivons notre fonction de publication sur le Fil :

source: Exposing this function is the same as the previous except we require user authentication and we're going to make this use POST rather than GET HTTP requests.
fr: Exposer cette fonction est la même chose qu'auparavant, sauf que nous avons besoin de l’authentification de l'utilisateur et que nous allons faire cela via des requêtes POST plutôt que des requêtes HTTP.

source: Please note that you will not be able to test this using a web browser as you did with the other methods. You need to write some client code to do this.
fr: Veuillez noter que vous ne pourrez pas tester ceci à l’aide d’un navigateur Web comme vous l’avez fait avec les autres méthodes. Vous devez écrire du code client pour ce faire.

source: Building out your API
fr: Créer votre propre API

source: As soon as you feel comfortable with Elgg's web services API framework, you will want to step back and design your API. What sort of data are you trying to expose? Who or what will be API users? How do you want them to get access to authentication keys? How are you going to document your API? Be sure to take a look at the APIs created by popular Web 2.0 sites for inspiration. If you are looking for 3rd party developers to build applications using your API, you will probably want to provide one or more language-specific clients.
fr: Dès que vous vous sentirez à l’aise avec le framework d'API des web services de Elgg, vous voudrez prendre du recul et concevoir votre API. Quel type de données essayez-vous d’exposer ? Qui ou qu'est-ce qui seront les utilisateurs de l’API ? Comment voulez-vous qu’ils aient accès aux clef d’authentification ? Comment allez-vous documenter votre API ? N’oubliez pas de jeter un œil aux API créées par les sites Web populaires 2.0 pour l’inspiration. Si vous attendez que des développeurs tiers créent des applications à l’aide de votre API, vous voudrez probablement fournir un ou plusieurs clients dans un langage spécifique.

source: Determining the authentication available
fr: Déterminer l'authentification disponible

source: Elgg's web services API uses a type of `pluggable authentication module (PAM)`_ architecture to manage how users and developers are authenticated. This provides you the flexibility to add and remove authentication modules. Do you want to not use the default user authentication PAM but would prefer using OAuth? You can do this.
fr: L’API des services Web de Elgg utilise un type d’architecture de `module d’authentification enfichable "pluggable authentication module (PAM)"`_ pour gérer la manière dont les utilisateurs et les développeurs sont authentifiés. Cela vous donne la flexibilité d’ajouter et de supprimer des modules d’authentification. Vous ne voulez pas utiliser le PAM gestionnaire d'authentification utilisateur par défaut, mais préférez utiliser OAuth ? Vous pouvez le faire.

source: The first step is registering a callback function for the ``'rest', 'init'`` event:
fr: La première étape consiste à enregistrer une fonction de rappel pour l'événement ``'rest', 'init'`` :

source: Then in the callback function, you register the PAMs that you want to use:
fr: Ensuite, dans la fonction de rappel, vous enregistrez les PAMs que vous souhaitez utiliser :

source: HMAC Authentication
fr: Authentification HMAC

source: Elgg's RESTful API framework provides functions to support a `HMAC`_ signature scheme for API authentication. The client must send the HMAC signature together with a set of special HTTP headers when making a call that requires API authentication. This ensures that the API call is being made from the stated client and that the data has not been tampered with.
fr: Le framework d’API RESTful de Elgg fournit des fonctions pour prendre en charge un schéma de signature `HMAC`_ pour l’authentification API. Le client doit envoyer la signature HMAC ainsi qu’un ensemble d’en-têtes HTTP spéciaux lors de l’exécution d’un appel qui nécessite l’authentification API. Cela garantit que l’appel API est effectué à partir du client déclaré et que les données n’ont pas été falsifiées.

source: The HMAC must be constructed over the following data:
fr: Le HMAC doit être construit à partir des données suivantes :

source: The public API key identifying you to the Elgg api server as provided by the APIAdmin plugin
fr: La clef d'API publique qui vous identifie auprès du serveur api de Elgg, tel que fourni par le plugin APIAdmin
