Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: ``no_results``: custom no results found text
fr: ``no_results`` : texte personnalisé si aucun résultat n'est trouvé

source: The following will be automaticly generated:
fr: Les éléments suivants seront générés automatiquement :

source: ``title``: based on the language key ``collection:<entity_type>:<entity_subtype>:group``
fr: ``title`` : basé sur la clef de traduction ``collection:<entity_type>:<entity_subtype>:group``

source: ``content``: ``elgg_list_entities()`` based on given type/subtype
fr: ``content`` : ``elgg_list_entities()`` basé sur un type/sous-type donné

source: ``all_link``: based on the route name ``collection:<entity_type>:<entity_subtype>:group``
fr: ``all_link`` : basé sur le nom de route ``collection:<entity_type>:<entity_subtype>:group``

source: ``add_link``: based on the route name ``add:<entity_type>:<entity_subtype>:group`` and with a permissions check to the given type/subtype
fr: ``add_link`` : basé sur le nom de route ``add:<entity_type>:<entity_subtype>:group`` et avec une vérification des autorisations pour un type/sous-type donné

source: Alternatively you can generate your own title and content
fr: Vous pouvez également générer votre propre titre et contenu

source: You can programmically enable and disable tools for a given group:
fr: Vous pouvez activer et désactiver des outils de manière programmatique pour un groupe donné :

source: If you want to allow a certain feature in a group only if the group tool option is enabled, you can check this using ``\ElggGroup::isToolEnabled($tool_option)``.
fr: Si vous voulez autoriser une certaine fonctionnalité dans un groupe seulement si l'option du groupe pour cet outil est activée, vous pouvez vérifier en utilisant ``\ElggGroup::isToolEnabled($tool_option)``.

source: It is also a possibility to use a gatekeeper function to prevent access to a group page based on an enabled tool.
fr: Il est également possible d'utiliser une fonction gardienne - gatekeeper - pour éviter l'accès à une page d'un groupe sur la base d'un outil activé.

source: Read more about gatekeepers here: :ref:`authentication-gatekeepers`
fr: Lisez-en plus sur les gardiens - gatekeepers - ici : :ref:`authentication-gatekeepers`

source: If you need the configured group tool options for a specific group you can use the ``elgg()->group_tools->group($group)`` function.
fr: Si vous avez besoin des options d'un outil de groupe configurées pour un groupe spécifique, vous pouvez utiliser la fonction ``elgg()->group_tools->group($group)``.

source: Plugin coding guidelines
fr: Recommandations pour le développement de plugins

source: In addition to the Elgg Coding Standards, these are guidelines for creating plugins. Core plugins are being updated to this format and all plugin authors should follow these guidelines in their own plugins.
fr: En plus des Standards de Développement Elgg - Elgg Coding Standards -, voici des recommandations pour créer des plugins. Les plugins du noyau sont mis à jour vers ce format et tous les auteurs de plugins devraient suivre ces recommandations pour leurs propres plugins.

source: Be sure to follow the :doc:`plugins/plugin-skeleton` for your plugin's layout.
fr: Assurez-vous de suivre :doc:`plugins/plugin-skeleton` pour la structure de votre plugin.

source: Use standardized routing with page handlers
fr: Utilisez le routage standardisé avec vos gestionnaires de pages

source: Example: Bookmarks plugin
fr: Exemple : plugin des signets - Bookmarks

source: Page handlers should accept the following standard URLs:
fr: Les gestionnaires de pages devraient accepter le standard d'URLs suivant :

source: Purpose
fr: Objectif

source: All
fr: Tout

source: User
fr: Utilisateur

source: User friends'
fr: Contacts du membre

source: Single entity
fr: Entité unique

source: Add
fr: Ajout

source: Edit
fr: Modification

source: Group list
fr: Liste du groupe

source: Include page handler scripts from the page handler. Almost every page handler should have a page handler script. (Example: ``bookmarks/all`` => ``mod/bookmarks/views/default/resources/bookmarks/all.php``)
fr: Incluez les scripts du gestionnaire de page à partir du gestionnaire de page. Presque tous les gestionnaires de page doivent avoir un script de gestionnaire de page. (Exemple : ``bookmarks/all`` => ``mod/bookmarks/views/default/resources/bookmarks/all.php``)

source: Pass arguments like entity guids to the resource view via ``$vars`` in ``elgg_view_resource()``.
fr: Passez des arguments tels que des guids d’entités à la vue de la ressource via ``$vars`` dans ``elgg_view_resource()``.

source: Call ``elgg_gatekeeper()`` and ``elgg_admin_gatekeeper()`` in the page handler function if required.
fr: Appelez ``elgg_gatekeeper()`` et ``elgg_admin_gatekeeper()`` dans la fonction du gestionnaire de page si nécessaire.

source: The group URL should use views like ``resources/groups/*.php`` to render pages.
fr: L’URL d'un groupe doit utiliser des vues telles que ``resources/groups/*.php`` pour afficher des pages.

source: Page handlers should not contain HTML.
fr: Les gestionnaires de pages ne devraient pas contenir de HTML.

source: Use standardized page handlers and scripts
fr: Utilisez les gestionnaires de pages standardisés et les scripts

source: Store page functionality in ``mod/<plugin>/views/default/resources/<page_handler>/<page_name>.php``
fr: Enregistrez les fonctionnalités des pages dans ``mod/<plugin>/views/default/resources/<page_handler>/<page_name>.php``

source: Use ``elgg_view_resource('<page_handler>/<page_name>')`` to render that.
fr: Utilisez ``elgg_view_resource('<page_handler>/<page_name>')`` pour les afficher.

source: Use the default page layout in page handler scripts: ``$content = elgg_view_layout('default', $options);``
fr: Utilisez la disposition de page par défaut dans les scripts du gestionnaire de pages : ``$content = elgg_view_layout('default', $options);``

source: Page handler scripts should not contain HTML
fr: Les scripts de gestionnaires de pages ne devraient pas contenir de HTML

source: Call ``elgg_push_entity_breadcrumbs()`` or ``elgg_push_collection_breadcrumbs()`` in the page handler scripts.
fr: Appelle ``elgg_push_entity_breadcrumbs()`` ou ``elgg_push_collection_breadcrumbs()`` dans les scripts du gestionnaire de page.

source: No need to worry about setting the page owner if the URLs are in the standardized format
fr: Nul besoin de s'inquiéter de définir le propriétaire de la page si les URLs sont dans le format standardisé

source: For group content, check the ``container_guid`` by using ``elgg_get_page_owner_entity()``
fr: Pour le contenu du groupe, vérifiez le conteneur ``container_guid`` en utilisant ``elgg_get_page_owner_entity()``

source: The object/<subtype> view
fr: La vue object/<subtype>

source: Make sure there are views for ``$vars['full_view'] == true`` and ``$vars['full_view'] == false``
fr: Assurez-vous qu'il existe bien des vues pour ``$vars['full_view'] == true`` et ``$vars['full_view'] == false``

source: Check for the object in ``$vars['entity']`` . Use ``elgg_instance_of()`` to make sure it's the type entity you want. Return ``true`` to short circuit the view if the entity is missing or wrong.
fr: Recherchez l'objet dans ``$vars['entity']`` . Utilisez ``elgg_instance_of()`` pour vous assurer qu'il s'agit du type d'entité que vous souhaitez. Renvoyez ``true`` pour court-circuiter la vue si l'entité est manquante ou erronée.

source: Use the new list body and list metadata views to help format. You should use almost no markup in these views.
fr: Utilisez les nouvelles vues de liste du corps et de liste des métadonnées pour aider au formatage. Vous devriez n'utiliser quasiment aucun balisage dans ces vues.

source: Update action structure - Example: Bookmarks plugin.
fr: Mettez à jour la structure pour les actions - Exemple : le plugin Bookmarks.

source: Namespace action files and action names (example: ``mod/blog/actions/blog/save.php`` => ``action/blog/save``)
fr: Fichiers d’action et noms d’action de l’espace de noms (exemple : ``mod/blog/actions/blog/save.php`` => ``action/blog/save``)

source: Use the following action URLs:
fr: Utilisez les URLs d'action suivantes :

source: Delete
fr: Suppression

source: Make the delete action accept ``action/<handler>/delete?guid=<guid>`` so the metadata entity menu has the correct URL by default
fr: Faites que l'action de suppression accepte ``action/<handler>/delete?guid=<guid>`` de sorte que le menu des métadonnées de l'entité ait la bonne URL par défaut

source: Actions are transient states to perform an action such as updating the database or sending a notification to a user. Used correctly, actions provide a level of access control and prevent against CSRF attacks.
fr: Les actions sont des états transitoires pour effectuer une action telle que la mise à jour de la base de données ou l’envoi d’une notification à un utilisateur. Utilisées correctement, les actions fournissent un niveau de contrôle d’accès et de prévention contre les attaques CSRF.

source: Actions require action (CSRF) tokens to be submitted via GET/POST, but these are added automatically by elgg_view_form() and by using the ``is_action`` argument of the ``output/url`` view.
fr: Les actions nécessitent que les jetons d’action (CSRF) soient soumis via GET/POST, mais ceux-ci sont ajoutés automatiquement par elgg_view_form(), et à l’aide de l’argument ``is_action`` de la vue ``output/url``.

source: Action best practices
fr: Bonnes pratiques pour les actions

source: Action files are included within Elgg's action system; like views, they are *not* regular scripts executable by users. Do not boot the Elgg core in your file and direct users to load it directly.
fr: Les fichiers d’action sont inclus dans le système d’action de Elgg ; comme les vues, ce *ne sont pas* des scripts classiques exécutables par les utilisateurs. Ne démarrez pas le noyau de Elgg dans votre fichier et ne renvoyez pas les utilisateurs directement vers ce fichier.

source: Because actions are time-sensitive they are not suitable for links in emails or other delayed notifications. An example of this would be invitations to join a group. The clean way to create an invitation link is to create a page handler for invitations and email that link to the user. It is then the page handler's responsibility to create the action links for a user to join or ignore the invitation request.
fr: Parce que les actions sont sensibles au temps, elles ne conviennent pas aux liens dans les e-mails ou autres notifications retardées. Un exemple de cela serait des invitations à rejoindre un groupe. Une manière propre de créer un lien d’invitation est de créer un gestionnaire de page pour les invitations et les e-mails qui serait lié à l’utilisateur. Il incombe alors au gestionnaire de page de créer les liens d’action pour qu’un utilisateur accepte ou ignore la demande d’invitation.

source: Consider that actions may be submitted via XHR requests, not just links or form submissions.
fr: Considérez que les actions peuvent être soumises par le biais de requêtes XHR, pas seulement par des liens ou des envois de formulaires.

source: Directly calling a file
fr: Appeler directement un fichier

source: This is an easy one: **Don't do it**. With the exception of 3rd party application integration, there is not a reason to directly call a file in mods directory.
fr: C’est très simple : **Ne le faites pas**. À l’exception de l’intégration d'applications tierces, il n’y a pas de raison d’appeler directement un fichier dans le répertoire des plugins.

source: Recommended
fr: Recommandé

source: These points are good ideas, but are not yet in the official guidelines. Following these suggestions will help to keep your plugin consistent with Elgg core.
fr: Ces points sont de bonnes idées, mais ne sont pas encore dans les recommandations officielles. Suivre ces suggestions aidera à garder votre plugin compatible avec le noyau de Elgg.

source: Update the widget views (see the blog or file widgets)
fr: Mettez à jour les vues du widget (voir les widgets des plugins blog ou file)

source: Update the group profile 'widget' using blog or file plugins as example
fr: Mettez à jour le 'widget' du profil de groupe en utilisant des plugins de blog ou de fichiers comme exemple

source: Update the forms
fr: Mettre à jour les formulaires

source: Move form bodies to ``/forms/<handler>/<action>`` to use Evan's new ``elgg_view_form()``
fr: Déplacez les corps de formulaire vers la vue ``forms/<handler>/<action>`` pour utiliser le nouveau ``elgg_view_form()`` d’Evan

source: Use input views in form bodies rather than html
fr: Utilisez les vues de saisie dans le corps des formulaires, plutôt que du html

source: Add a function that prepares the form (see ``mod/file/lib/file.php`` for example)
fr: Ajoutez une fonction qui prépare le formulaire (voyez ``mod/file/lib/file.php`` pour un exemple)

source: Integrate sticky forms (see the file plugin's upload action and form prepare function)
fr: Rendez vos formulaires persistants (voyez l’action de téléchargement du plugin file et la fonction de préparation du formulaire)

source: Clean up CSS/HTML
fr: Nettoyez le CSS/HTML

source: Should be able to remove almost all CSS (look for patterns that can be moved into core if you need CSS)
fr: Devrait être en mesure de supprimer presque tous les CSS (recherchez des motifs qui peuvent être déplacés dans le noyau si vous avez besoin de CSS)

source: Use hyphens rather than underscores in classes/ids
fr: Utilisez les traits- d'union plutôt que les traits de soulignement - underscores - dans les classes/ids

source: Do not use the ``bundled`` category with your plugins. That is for plugins distributed with Elgg
fr: N'utilisez pas la catégorie ``bundled`` avec vos plugins. Elle est réservée aux plugins distribués avec Elgg

source: Don't use ``register_shutdown_function`` as you may not have access to certain Elgg parts anymore (eg database). Instead use the ``shutdown`` ``system`` event
fr: N'utilisez pas ``register_shutdown_function`` car vous pourriez ne plus avoir accès à certaines parties de Elgg (par ex. la base de données). Utilisez plutôt l'événement ``shutdown`` ``system``

source: Input and output
fr: Entrées et sorties

source: ``get_input($name)`` Grabs information from a form field (or any variable passed using GET or POST). Also sanitises input, stripping Javascript etc.
fr: ``get_input($name)`` Récupère des informations depuis un champ de formulaire (ou toute variable passée en utilisant GET ou POST). Se charge également d'assainir l'entrée, en retirant le Javascript, etc.

source: ``set_input($name, $value)`` Forces a value to a particular variable for subsequent retrieval by ``get_input()``
fr: ``set_input($name, $value)`` Force une valeur pour une variable particulière destinée à être récupérée par la suite par ``get_input()``

source: Entity methods
fr: Méthode des entités

source: ``$entity->getURL()`` Returns the URL of any entity in the system
fr: ``$entity->getURL()`` Renvoie l'URL de n'importe quelle entité dans le système

source: ``$entity->getGUID()`` Returns the GUID of any entity in the system
fr: ``$entity->getGUID()`` Renvoie le GUID de n'importe quelle entité dans le système

source: ``$entity->canEdit()`` Returns whether or not the current user can edit the entity
fr: ``$entity->canEdit()`` Indique si l'utilisateur courant est autorisé ou non à modifier l'entité

source: ``$entity->getOwnerEntity()`` Returns the ElggUser owner of a particular entity
fr: ``$entity->getOwnerEntity()`` Retourne le propriétaire ElggUser d'une entité particulière

source: Entity and context retrieval
fr: Récupération de l'entité et du contexte

source: ``elgg_get_logged_in_user_entity()`` Returns the ElggUser for the current user
fr: ``elgg_get_logged_in_user_entity()`` Retourne le ElggUser de l'utilisateur courant

source: ``elgg_get_logged_in_user_guid()`` Returns the GUID of the current user
fr: ``elgg_get_logged_in_user_guid()`` Retourne le GUID de l'utilisateur courant

source: ``elgg_is_logged_in()`` Is the viewer logged in
fr: ``elgg_is_logged_in()`` Est-ce que le visiteur est identifié

source: ``elgg_is_admin_logged_in()`` Is the view an admin and logged in
fr: ``elgg_is_admin_logged_in()`` Est-ce que le visiteur est un admin identifié

source: ``elgg_gatekeeper()`` Shorthand for checking if a user is logged in. Forwards user to front page if not
fr: ``elgg_gatekeeper()`` Raccourci pour vérifier si un utilisateur est identifié. Redirige sur la page d'accueil du site si ce n'est pas le cas

source: ``elgg_admin_gatekeeper()`` Shorthand for checking the user is logged in and is an admin. Forwards user to front page if not
fr: ``elgg_admin_gatekeeper()`` Raccourci pour vérifier si un utilisateur est identifié et est admin. Redirige sur la page d'accueil du site si ce n'est pas le cas

source: ``get_user($user_guid)`` Given a GUID, returns a full ElggUser entity
fr: ``get_user($user_guid)`` A partir d'un GUID, retourne l'entité ElggUser complète

source: ``elgg_get_page_owner_guid()`` Returns the GUID of the current page owner, if there is one
fr: ``elgg_get_page_owner_guid()`` Retourne le GUID du propriétaire actuel, s'il y en a un

source: ``elgg_get_page_owner_entity()`` Like elgg_get_page_owner_guid() but returns the full entity
fr: ``elgg_get_page_owner_entity()`` Comme elgg_get_page_owner_guid() mais retourne l'entité complète

source: ``elgg_get_context()`` Returns the current page's context - eg "blog" for the blog plugin, "thewire" for the wire, etc. Returns "main" as default
fr: ``elgg_get_context()`` Retourne le contexte courant de la page - par ex. "blog" pour le plugin blog, "thewire" pour le Fil, etc. Retourne "main" comme valeur par défaut

source: ``elgg_set_context($context)`` Forces the context to be a particular value
fr: ``elgg_set_context($context)`` Force le contexte pour une valeur particulière

source: ``elgg_push_context($context)`` Adds a context to the stack
fr: ``elgg_push_context($context)`` Ajoute un contexte à la pile de contextes

source: ``elgg_pop_context()`` Removes the top context from the stack
fr: ``elgg_pop_context()`` Retire le dernier contexte de la pile

source: ``elgg_in_context($context)`` Checks if you're in a context (this checks the complete stack, eg. 'widget' in 'groups')
fr: ``elgg_in_context($context)`` Vérifie si vous êtes dans un contexte (ceci vérifie la pile complète, par ex. 'widget' dans 'groups')

source: ``elgg_is_active_plugin($plugin_id)`` Check if a plugin is installed and enabled
fr: ``elgg_is_active_plugin($plugin_id)`` Vérifie si un plugin est installé et activé

source: Interface and annotations
fr: Interface et annotations

source: ``elgg_view_image_block($icon, $info)`` Return the result in a formatted list
fr: ``elgg_view_image_block($icon, $info)`` Retourne le résultat dans un élément de liste formaté

source: ``elgg_view_comments($entity)`` Returns any comments associated with the given entity
fr: ``elgg_view_comments($entity)`` Retourne tous les commentaires associés à une entité donnée

source: ``elgg_get_friendly_time($unix_timestamp)`` Returns a date formatted in a friendlier way - "18 minutes ago", "2 days ago", etc.
fr: ``elgg_get_friendly_time($unix_timestamp)`` Retourne une date formatée de manière relative - "il y a 18 minutes", "il y a 2 jours", etc.

source: ``elgg_register_success_message($message)`` Registers a success message
fr: ``elgg_register_success_message($message)`` Enregistre un message de succès

source: ``elgg_register_error_message($message)`` Registers an error message
fr: ``elgg_register_error_message($message)`` Enregistre un message d'erreur

source: ``elgg_view_message($type, $message)`` Outputs a message
fr: ``elgg_view_message($type, $message)`` Affiche un message

source: Internationalization
fr: Internationalisation

source: Make your UI translatable into many different languages.
fr: Rendre votre interface utilisateur traduisible dans de nombreuses langues différentes.

source: If you’d like to contribute translations to Elgg, see :doc:`the contributors' guide </contribute/i18n>`.
fr: Si vous souhaitez contribuer à des traductions pour Elgg, consultez :doc:`le guide des contributeurs </contribute/i18n>`.

source: The default language is ``en`` for English. Elgg uses a fallback system for languages:
fr: La langue par défaut est ``en`` pour l’anglais. Elgg utilise un système de secours pour les langues :

source: The language of the user
fr: La langue de l'utilisateur

source: The site language
fr: La langue du site

source: English
fr: Anglais

source: Translations are stored in PHP files in the ``/languages`` directory of your plugin. Each file corresponds to a language. The format is ``/languages/{language-code}.php`` where ``{language-code}`` is the ISO 639-1 short code for the language. For example:
fr: Les traductions sont stockées dans des fichiers PHP dans le répertoire ``/languages`` de votre plugin. Chaque fichier correspond à une langue. Le format est ``/languages/{language-code}.php`` où ``{language-code}`` est le code court ISO 639-1 pour la langue. Par exemple :

source: To override an existing translation, include it in your plugin's language file, and make sure your plugin is ordered later on the Admin > Plugins page:
fr: Pour remplacer une traduction existante, incluez-la dans le fichier de traduction de votre plugin et assurez-vous que votre plugin est situé après sur la page Admin > Plugins :

source: Unless you are overriding core's or another plugin's language strings, it is good practice for the language keys to start with your plugin name. For example: ``yourplugin:success``, ``yourplugin:title``, etc. This helps avoid conflicts with other language keys.
fr: A moins que vous ne remplaciez les chaînes de traduction du noyau ou d’un autre plugin, c'est une bonne pratique pour les clefs de traduction de commencer par le nom de votre plugin. Par exemple : ``yourplugin:success``, ``yourplugin:title``, etc. Cela aide à éviter les conflits avec d’autres clefs de traduction.

source: Server-side API
fr: API côté serveur

source: Output the translation of the key in the current language.
fr: Génère et renvoie la traduction de la clef dans la langue actuelle.

source: It also supports variable replacement using ``vsprintf`` syntax:
fr: Elle prend également en charge le remplacement des variables à l’aide de la syntaxe `` vsprintf`` :

source: To force which language should be used for translation, set the third parameter:
fr: Pour forcer la langue qui doit être utilisée pour la traduction, définissez le troisième paramètre :

source: To first test whether ``elgg_echo()`` can find a translation:
fr: Pour tester d’abord si ``elgg_echo()`` peut trouver une traduction :

source: Some APIs allow creating translations for new keys. Translators should always include an English translation as a fallback. This makes ``elgg_language_key_exists($key)`` a reliable way to predict whether ``elgg_echo($key)`` will succeed.
fr: Certaines API permettent de créer des traductions pour de nouvelles clefs. Les traducteurs doivent toujours inclure une traduction anglaise comme solution de repli. Ceci fait de ``elgg_language_key_exists($key)`` un moyen fiable de prédire si ``elgg_echo($key)`` va réussir.

source: Javascript API
fr: API Javascript

source: This function is like ``elgg_echo`` in PHP.
fr: Cette fonction est équivalente à ``elgg_echo`` en PHP.

source: Developer Guides
fr: Guides de développement

source: Customize Elgg's behavior with plugins.
fr: Personnalisez le comportement de Elgg avec des plugins.

source: JavaScript Modules
fr: Modules JavaScript

source: Executing a module in the current page
fr: Exécuter un module dans la page en cours
