Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: ``input/objectpicker`` - renders an Elgg object autocomplete
fr: ``input/objectpicker`` - affiche un sélecteur d'objet Elgg par autocomplétion

source: ``input/location`` renders an Elgg location input
fr: ``input/location`` affiche une entrée de type adresse

source: Files and images
fr: Fichiers et images

source: Use the ``input/file`` view in your form’s content view.
fr: Utilisez la vue ``input/file`` dans la vue du contenu de votre formulaire.

source: If you wish to upload an icon for entity you can use the helper view ``entity/edit/icon``. This view shows a file input for uploading a new icon for the entity, an thumbnail of the current icon and the option to remove the current icon.
fr: Si vous souhaitez télécharger une icône pour l’entité, vous pouvez utiliser la vue ``entity/edit/icon``. Cette vue affiche une entrée de fichier pour le téléchargement d’une nouvelle icône pour l’entité, une miniature de l’icône actuelle et l’option de supprimer l’icône actuelle.

source: The view supports some variables to control the output
fr: La vue prend en charge quelques variables pour contrôler la sortie

source: ``entity`` - the entity to add/remove the icon for. If provided based on this entity the thumbnail and remove option wil be shown
fr: ``entity`` - l’entité pour laquelle ajouter ou supprimer l’icône. Si elle est fournie, la miniature et l’option de suppression s’affichent en fonction de cette entité

source: ``entity_type`` - the entity type for which the icon will be uploaded. Plugins could find this useful, maybe to validate icon sizes
fr: ``entity_type`` - le type d’entité pour lequel l’icône sera téléchargée. Des plugins pourraient trouver cela utile, peut-être pour valider les dimensions d’icônes

source: ``entity_subtype`` - the entity subtype for which the icon will be uploaded. Plugins could find this useful, maybe to validate icon sizes
fr: ``entity_subtype`` - le sous-type d’entité pour lequel l’icône sera téléchargée. Des plugins pourraient trouver cela utile, peut-être pour valider les dimensions d’icônes

source: ``icon_type`` - the type of the icon (default: icon)
fr: ``icon_type`` - le type de l’icône (par défaut : icon)

source: ``name`` - name of the input/file (default: icon)
fr: ``name`` - le nom du champ input/file (par défaut : icon)

source: ``remove_name`` - name of the remove icon toggle (default: $vars['name'] . '_remove')
fr: ``remove_name`` - nom de la bascule de suppression de l'icône (par défaut : $vars['name'] . '_remove')

source: ``required`` - is icon upload required (default: false)
fr: ``required`` - est-ce que le téléchargement d'une icône est requis (par défaut : false)

source: ``cropper_enabled`` - is icon cropping allowed (default: true)
fr: ``cropper_enabled`` - le recadrage des icônes est-il autorisé (par défaut : true)

source: ``show_remove`` - show the remove icon option (default: true)
fr: ``show_remove`` - affiche l’option pour supprimer l’icône (par défaut : true)

source: ``show_thumb`` - show the thumb of the entity if available (default: true)
fr: ``show_thumb`` - afficher la miniature de l’entité si elle est disponible (par défaut : true)

source: ``thumb_size`` - the icon size to use as the thumb (default: medium)
fr: ``thumb_size`` - la taille de l’icône à utiliser pour la miniature (par défaut : medium)

source: If using the helper view you can use the following code in you action to save the icon to the entity or remove the current icon.
fr: Si vous utilisez la vue, vous pouvez utiliser le code suivant dans votre action pour enregistrer l’icône dans l’entité ou supprimer l’icône actuelle.

source: Set the enctype of the form to ``multipart/form-data``:
fr: Définissez le type d'encodage du formulaire sur ``multipart/form-data`` :

source: The ``enctype`` of all forms that use the method ``POST`` defaults to ``multipart/form-data``.
fr: Le type d'encodage ``enctype`` de tous les formulaires qui utilisent la méthode ``POST`` est par défaut ``multipart/form-data``.

source: In your action file, use ``elgg_get_uploaded_file('your-input-name')`` to access the uploaded file:
fr: Dans votre fichier d’action, utilisez ``elgg_get_uploaded_file('nom-de-votre-input')`` pour accéder au fichier téléchargé :

source: Sticky forms
fr: Formulaires persistants

source: Sticky forms are forms that retain user input if saving fails. They are "sticky" because the user's data "sticks" in the form after submitting, though it was never saved to the database. This greatly improves the user experience by minimizing data loss. Elgg includes helper functions so you can make any form sticky.
fr: Les formulaires persistants sont des formulaires qui conservent les entrées de l’utilisateur en cas d’échec de l’enregistrement. Ils sont "persistants" parce que les données de l’utilisateur "persistent" dans le formulaire après soumission, bien qu’elles n’aient jamais été enregistrées dans la base de données. Cela améliore considérablement l’expérience utilisateur en minimisant la perte de données. Elgg inclut des fonctions d’assistance afin que vous puissiez rendre n’importe quel formulaire persistant.

source: Helper functions
fr: Fonctions d'assistance

source: Sticky forms are implemented in Elgg by the following functions:
fr: Les formulaires persistants sont implémentés dans Elgg par les fonctions suivantes :

source: ``elgg_make_sticky_form($name)`` - Tells the engine to make all input on a form sticky.
fr: ``elgg_make_sticky_form($name)`` - Indique au moteur de persister les valeurs de toutes les entrées d'un formulaire.

source: ``elgg_clear_sticky_form($name)`` - Tells the engine to discard all sticky input on a form.
fr: ``elgg_clear_sticky_form($name)`` - Indique au moteur de supprimer toutes les valeurs d'un formulaire.

source: ``elgg_is_sticky_form($name)`` - Checks if ``$name`` is a valid sticky form.
fr: ``elgg_is_sticky_form($name)`` - Vérifie si ``$name`` est un formulaire persistant valide.

source: ``elgg_get_sticky_values($name)`` - Returns all sticky values saved for ``$name`` by ``elgg_make_sticky_form($name)``.
fr: ``elgg_get_sticky_values($name)`` - Renvoie toutes les valeurs persistantes enregistrées pour ``$name`` par ``elgg_make_sticky_form($name)``.

source: Overview
fr: Aperçu

source: The basic flow of using sticky forms is:
fr: Le déroulement de l’utilisation des formulaires persistants est :

source: Call ``elgg_make_sticky_form($name)`` at the top of actions for forms you want to be sticky.
fr: Appelez ``elgg_make_sticky_form($name)`` au début des actions des formulaires que vous voulez rendre persistants.

source: Use ``elgg_is_sticky_form($name)`` and ``elgg_get_sticky_values($name)`` to get sticky values when rendering a form view.
fr: Utilisez ``elgg_is_sticky_form($name)`` et ``elgg_get_sticky_values($name)`` pour obtenir des valeurs persistantes lors du rendu d’une vue de formulaire.

source: Call ``elgg_clear_sticky_form($name)`` after the action has completed successfully or after data has been loaded by ``elgg_get_sticky_values($name)``.
fr: Appelez ``elgg_clear_sticky_form($name)`` une fois l’action terminée avec succès ou après que les données ont été chargées par ``elgg_get_sticky_values($name)``.

source: As of Elgg 5.0 forms rendered with ``elgg_view_form()`` can set the ``$form_vars['sticky_enabled'] = true`` flag to automatically get sticky form support. The submitted values to the action will automatically be filled in the ``$body_vars`` when an error occured in the action.
fr: Depuis Elgg 5.0, les formulaires rendus avec ``elgg_view_form()`` peuvent définir l'indicateur ``$form_vars['sticky_enabled'] = true`` pour obtenir automatiquement la prise en charge des formulaires persistants. Les valeurs soumises à l'action seront automatiquement renseignées dans ``$body_vars`` lorsqu'une erreur survient dans l'action.

source: ``elgg_view_form()`` supports the following ``$form_vars`` to help with sticky form support:
fr: ``elgg_view_form()`` prend en charge les ``$form_vars`` suivants pour faciliter la prise en charge des formulaires persistants :

source: ``sticky_enabled``: a ``bool`` to enable automatic sticky form support
fr: ``sticky_enabled`` : un ``bool`` pour activer la prise en charge automatique de formulaire persistant

source: ``sticky_form_name``: an optional ``string`` to set where the sticky form values are saved. This defaults to the ``$action_name`` and should only be changed if the ``$action_name`` is different from the actual action
fr: ``sticky_form_name`` : une ``string`` facultative pour définir l'endroit où les valeurs du formulaire collant sont enregistrées. La valeur par défaut est ``$action_name`` et ne doit être modifiée que si ``$action_name`` est différent de l'action réelle

source: ``sticky_ignored_fields``: an ``array`` with the names fo the form fields that should be saved. For example password fields
fr: ``sticky_ignored_fields`` : un ``array`` avec les noms des champs du formulaire qui doivent être enregistrés. Par exemple les champs de mot de passe

source: Example: User registration
fr: Exemple : Inscription d'un utilisateur

source: Simple sticky forms require little logic to determine the input values for the form. This logic is placed at the top of the form body view itself.
fr: Les formulaires persistants simples nécessitent peu de logique pour déterminer les valeurs d’entrée du formulaire. Cette logique est placée en haut de la vue du corps de formulaire.

source: The registration form view first sets default values for inputs, then checks if there are sticky values. If so, it loads the sticky values before clearing the sticky form:
fr: L’affichage du formulaire d’inscription définit d’abord les valeurs par défaut pour les entrées, puis vérifie s’il y a des valeurs persistantes. Si c’est le cas, il charge les valeurs persistantes avant de supprimer le formulaire persistant :

source: The registration action sets creates the sticky form and clears it once the action is completed:
fr: Les ensembles d’action d’inscription créent le formulaire persistant et l’effacent une fois l’action terminée :

source: The function ``elgg_make_sticky_form()`` supports an optional second argument ``$ignored_field_names``. This needs to be an ``array`` of the field names you don't wish to be made sticky. This is usefull for fields which contain sensitive data, like passwords.
fr: La fonction ``elgg_make_sticky_form()`` supporte un second argument optionnel ``$ignored_field_names``. Cela doit être un ``array`` des noms de champs que vous ne souhaitez pas rendre persistants. Ceci est utile pour les champs qui contiennent des données sensibles, comme les mots de passe.

source: Example: Bookmarks
fr: Exemple : Signets - Bookmarks

source: The bundled plugin Bookmarks' save form and action is an example of a complex sticky form.
fr: Le formulaire et l’action d’enregistrement du plugin "Bookmarks" inclus est un exemple de formulaire persistant complexe.

source: The form view for the save bookmark action uses ``elgg_extract()`` to pull values from the ``$vars`` array:
fr: La vue du formulaire pour l’action d'enregistrement d'un signet utilise ``elgg_extract()`` pour extraire des valeurs du tableau ``$vars`` :

source: The page handler scripts enables sticky form support by passing the correct values to ``elgg_view_form()``:
fr: Les scripts du gestionnaire de page activent le support des formulaires persistants en passant les valeurs correctes à ``elgg_view_form()`` :

source: Similarly, ``mod/bookmarks/pages/edit.php`` uses the same sticky support, but passes the entity that is being edited:
fr: De même, ``mod/bookmarks/pages/edit.php`` utilise le même support persistant, mais transmet l'entité qui est en cours d'édition :

source: The plugin has an event listener on the ``'form:prepare:fields', 'bookmarks/save'`` event and the handler does 2 things:
fr: Le plugin a un écouteur d'événement sur l'événement ``'form:prepare:fields', 'bookmarks/save'`` et le gestionnaire fait 2 choses :

source: Defines the input names and default values for form inputs.
fr: Définit les noms et les valeurs par défaut pour les champs de formulaire.

source: Extracts the values from a bookmark object if it's passed.
fr: Extrait les valeurs d’un objet bookmark s’il est passé.

source: The save action doesn't need to do anything with sticky form support as this is all handled by the system.
fr: L'action de sauvegarde n'a pas besoin de faire quoi que ce soit avec la prise en charge des formulaires persistants car tout est géré par le système.

source: See the :doc:`Ajax guide</guides/ajax>` for instructions on calling actions from JavaScript.
fr: Voir le :doc:`guide Ajax</guides/ajax>` pour savoir comment appeler les actions depuis JavaScript.

source: Security
fr: Sécurité

source: For enhanced security, all actions require an CSRF token. Calls to action URLs that do not include security tokens will be ignored and a warning will be generated.
fr: Pour une sécurité renforcée, toutes les actions nécessitent un jeton CSRF. Les appels aux URLs d’action qui n’incluent pas les jetons de sécurité seront ignorés et un avertissement sera généré.

source: A few views and functions automatically generate security tokens:
fr: Quelques vues et fonctions génèrent automatiquement des jetons de sécurité :

source: In rare cases, you may need to generate tokens manually:
fr: Dans de rares cas, vous devrez peut-être générer des jetons manuellement :

source: You can also access the tokens from javascript:
fr: Vous pouvez aussi accéder aux jetons depuis JavaScript :

source: These are refreshed periodically so should always be up-to-date.
fr: Ces jetonsci sont rafraîchis périodiquement aussi ils devraient être à jour.

source: Security Tokens
fr: Jetons de sécurité

source: On occasion we need to pass data through an untrusted party or generate an "unguessable token" based on some data. The industry-standard `HMAC <http://security.stackexchange.com/a/20301/4982>`_ algorithm is the right tool for this. It allows us to verify that received data were generated by our site, and were not tampered with. Note that even strong hash functions like SHA-2 should *not* be used without HMAC for these tasks.
fr: À l’occasion, nous devons transmettre des données par l’intermédiaire d’une tierce partie non digne de confiance ou générer un ``jeton impossible à deviner`` basé sur certaines données. L’algorithme `HMAC <https://security.stackexchange.com/a/20301>`_ est le bon outil pour cela. Il nous permet de vérifier que les données reçues ont été générées par notre site, et n’ont pas été trafiquées. Notez que même les fonctions de hachage fortes comme SHA-2 ne devraient *pas* être utilisés sans HMAC pour ces tâches.

source: Elgg provides ``elgg_build_hmac()`` to generate and validate HMAC message authentication codes that are unguessable without the site's private key.
fr: Elgg fournit ``elgg_build_hmac()`` pour générer et valider des codes d’authentification des messages HMAC qui ne puissent pas être devinés sans la clé privée du site.

source: Note: If you use a non-string as HMAC data, you must use types consistently. Consider the following:
fr: Remarque : si vous utilisez une non-chaîne comme données HMAC, vous devez utiliser les types de manière cohérente. Considérez ce qui suit :

source: Signed URLs
fr: URLs signées

source: Signed URLs offer a limited level of security for situations where action tokens are not suitable, for example when sending a confirmation link via email. URL signatures verify that the URL has been generated by your Elgg installation (using site secret) and that the URL query elements were not tampered with.
fr: Les URL signées offrent un niveau de sécurité limité pour les situations où les jetons d’action ne conviennent pas, par exemple lors de l’envoi d’un lien de confirmation par e-mail. Les signatures de l'URL vérifient que l’URL a été générée par votre installation Elgg (en utilisant le secret du site) et que les éléments de l'URL de requête n’ont pas été trafiqués.

source: URLs a signed with an unguessable SHA-256 HMAC key. See `Security Tokens`_ for more details.
fr: URLs signées avec une clef SHA-256 HMAC impossible à deviner. Pour plus de détails, consultez `Jetons de Sécurité`_ .

source: Signed URLs do not offer CSRF protection and should not be used instead of action tokens.
fr: Les URL signées n’offrent pas de protection CSRF et ne doivent pas être utilisées à la place des jetons d’action.

source: All the ajax methods perform the following:
fr: Toutes les méthodes ajax effectuent ce qui suit :

source: Client-side, the ``data`` option (if given as an object) is filtered by the hook ``ajax_request_data``.
fr: Côté client, l’option ``data`` (si elle est donnée en tant qu’objet) est filtrée par le hook ``ajax_request_data``.

source: The request is made to the server, either rendering a view or a form, calling an action, or loading a path.
fr: La requête est faite au serveur, que ce soit en affichant une vue ou un formulaire, en appelant une action, ou en chargeant un chemin d’accès.

source: The method returns a ``jqXHR`` object, which can be used as a Promise.
fr: La méthode renvoie un objet ``jqXHR``, qui peut être utilisé comme promesse - Promise.

source: Server-echoed content is turned into a response object (``Elgg\Services\AjaxResponse``) containing a string (or a JSON-parsed value).
fr: Le contenu généré par le serveur est transformé en objet de réponse (``Elgg\Services\AjaxResponse``) contenant une chaîne (ou une valeur parsée en JSON).

source: The response object is filtered by the event ``ajax_response``.
fr: L'objet de réponse est filtré par l'événement ``ajax_response``.

source: The response object is used to create the HTTP response.
fr: L’objet de réponse est utilisé pour créer la réponse HTTP.

source: Client-side, the response data is filtered by the hook ``ajax_response_data``.
fr: Côté client, les données de réponse sont filtrées par le hook ``ajax_response_data``.

source: The ``jqXHR`` promise is resolved and any ``success`` callbacks are called.
fr: La promesse - promise - ``jqXHR`` est résolue et toutes les fonctions de rappel ``success`` sont appelées.

source: More notes:
fr: Plus de notes :

source: All hooks have a type depending on the method and first argument. See below.
fr: Tous les hooks ont un type en fonction de la méthode et du premier argument. Voyez ci-dessous.

source: By default the ``elgg/spinner`` module is automatically used during requests.
fr: Par défaut, le module ``elgg/spinner`` est automatiquement utilisé lors des requêtes.

source: User messages generated by ``elgg_register_success_message()`` and ``elgg_register_error_message()`` are collected and displayed on the client.
fr: Les messages utilisateur générés par ``elgg_register_success_message()`` et ``elgg_register_error_message()`` sont collectés et affichés sur le client.

source: Elgg gives you a default error handler that shows a generic message if output fails.
fr: Elgg intègre un gestionnaire d’erreurs par défaut qui affiche un message générique en cas d’échec de la sortie.

source: PHP exceptions or denied resource return HTTP error codes, resulting in use of the client-side error handler.
fr: Les exceptions PHP ou les codes d’erreur HTTP d'accès refusé, ce qui entraîne l’utilisation du gestionnaire d’erreurs côté client.

source: The default HTTP method is ``POST`` for actions, otherwise ``GET``. You can set it via ``options.method``.
fr: La méthode HTTP par défaut est ``POST`` pour les actions, sinon ``GET``. Vous pouvez changer cela via ``options.method``.

source: If a non-empty ``options.data`` is given, the default method is always ``POST``.
fr: Si une valeur ``options.data`` non vide est donnée, la méthode par défaut est toujours ``POST``.

source: For client caching, set ``options.method`` to ``"GET"`` and ``options.data.elgg_response_ttl`` to the max-age you want in seconds.
fr: Pour la mise en cache côté client, définissez la méthode ``options.method`` sur ``GET`` et ``options.data.elgg_response_ttl`` sur l’âge maximal que vous souhaitez en secondes.

source: To save system messages for the next page load, set ``options.data.elgg_fetch_messages = 0``. You may want to do this if you intent to redirect the user based on the response.
fr: Pour enregistrer des messages système pour le chargement de la page suivante, définissez ``options.data.elgg_fetch_messages = 0``. Vous pourriez vouloir faire cela si vous avez l’intention de rediriger l’utilisateur en fonction de la réponse.

source: All methods accept a query string in the first argument. This is passed on to the fetch URL, but does not appear in the hook types.
fr: Toutes les méthodes acceptent une chaîne de requête comme premier argument. Cette chaîne est transmise à l’URL de récupération, mais n’apparaît pas dans les types de hooks.

source: Performing actions
fr: Effectuer des actions

source: Consider this action:
fr: Considérez cette action :

source: To execute it, use ``ajax.action('<action_name>', options)``:
fr: Pour l’exécuter, utilisez ``ajax.action('<action_name>', options)`` :

source: Notes for actions:
fr: Notes pour les actions :

source: All hooks have type ``action:<action_name>``. So in this case, three hooks will be triggered:
fr: Tous les hooks ont le type ``action:<action_name>``. Donc, dans ce cas, trois hooks seront déclenchés :

source: client-side ``"ajax_request_data", "action:do_math"`` to filter the request data (before it's sent)
fr: côté client ``"ajax_request_data", "action:do_math"`` pour filtrer les données de la requête (avant qu’elle soit envoyée)

source: server-side ``"ajax_response", "action:do_math"`` to filter the response (after the action runs)
fr: côté serveur ``"ajax_response", "action:do_math"`` pour filtrer la réponse (après que l'action a été exécutée)

source: client-side ``"ajax_response_data", "action:do_math"`` to filter the response data (before the calling code receives it)
fr: côté client ``"ajax_response_data", "action:do_math"`` pour filtrer les données de la réponse (avant que le code appelant ne les reçoive)

source: CSRF tokens are added to the request data.
fr: Les jetons CSRF sont ajoutés aux données de la requête.

source: The default method is ``POST``.
fr: La méthode par défaut est ``POST``.

source: An absolute action URL can be given in place of the action name.
fr: Une URL d’action absolue peut être donnée à la place du nom d’action.

source: When setting ``data``, use ``ajax.objectify($form)`` instead of ``$form.serialize()``. Doing so allows the ``ajax_request_data`` plugin hook to fire and other plugins to alter/piggyback on the request.
fr: Lorsque vous définissez ``data``, utilisez ``ajax.objectify($form)`` au lieu de ``$form.serialize()``. Cela permet au hook de plugin ``ajax_request_data`` d'être déclenché, et à d'autres plugins de modifier / réagir à la requête.

source: Fetching data
fr: Récupérer des données

source: Consider this PHP script that runs at ``http://example.org/myplugin_time``.
fr: Considérez ce script PHP qui s’exécute à ``http://example.org/myplugin_time``.

source: To fetch its output, use ``ajax.path('<url_path>', options)``.
fr: Pour récupérer sa sortie, utilisez ``ajax.path('<url_path>', options)``.

source: Notes for paths:
fr: Notes pour les chemins :

source: The 3 hooks (see Actions above) will have type ``path:<url_path>``. In this case, "path:myplugin_time".
fr: Les 3 hooks (voyez les Actions ci-dessus) auront le type ``path:<url_path>``. Dans ce cas, "path:myplugin_time".

source: If the page handler echoes a regular web page, ``output`` will be a string containing the HTML.
fr: Si le gestionnaire de page renvoie une page Web normale, ``output`` sera une chaîne contenant le HTML de la page.
