Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: The handler needs to either not use parts of the API that use the access system (triggering the event again) or to ignore the second call. Otherwise, an infinite loop will be created.
fr: Le gestionnaire doit soit ne pas utiliser les parties de l'API qui utilisent le système d'accès (déclenchant à nouveau l'événement), soit ignorer le deuxième appel. Sinon, une boucle infinie sera créée.

source: Filters an array of access IDs that the user ``$params['user_id']`` can write to. In ``elgg_get_write_access_array()``, this event filters the return value, so it can be used to alter the available options in the ``input/access`` view. For core plugins, the value "input_params" has the keys "entity" (ElggEntity|false), "entity_type" (string), "entity_subtype" (string), "container_guid" (int) are provided. An empty entity value generally means the form is to create a new object.
fr: Filtre un tableau d'IDs d'accès sur lesquels l'utilisateur ``$params['user_id']`` peut écrire. Dans ``elgg_get_write_access_array()``, cet événement filtre la valeur de retour, afin qu'il puisse être utilisé pour modifier les options disponibles dans la vue ``input/access``. Pour les plugins principaux, la valeur "input_params" a les clés "entity" (ElggEntity|false), "entity_type" (string), "entity_subtype" (string), "container_guid" (int) fournies. Une valeur d'entité vide signifie généralement que le formulaire doit créer un nouvel objet.

source: Returns an array of access collection subtypes to be used when retrieving access collections owned by a user as part of the ``elgg_get_write_access_array()`` function.
fr: Renvoie un tableau de sous-types de collection d’accès à utiliser lors de la récupération des collections d’accès appartenant à un utilisateur, dans le cadre de la fonction ``elgg_get_write_access_array()``.

source: Triggered before adding user ``$params['user_id']`` to collection ``$params['collection_id']``. Return false to prevent adding.
fr: Déclenché avant d’ajouter l’utilisateur ``$params['user_id']`` à la collection ``$params['collection_id']``. Retournez false pour éviter l’ajout.

source: Triggered before removing user ``$params['user_id']`` to collection ``$params['collection_id']``. Return false to prevent removal.
fr: Déclenché avant de supprimer l’utilisateur ``$params[’user_id']`` de la collection ``$params['collection_id']``. Renvoyez false pour éviter la suppression.

source: Triggered during the creation of an ``ElggAccessCollection``.
fr: Déclenché durant la création d'une ``ElggAccessCollection``.

source: Triggered during the deletion of an ``ElggAccessCollection``.
fr: Déclenché durant la suppression d'une ``ElggAccessCollection``.

source: Filters SQL clauses restricting/allowing access to entities and annotations.
fr: Filtre les clauses SQL limitant/autorisant l’accès aux entités et aux annotations.

source: **The event is triggered regardless if the access is ignored**. The handlers may need to check if access is ignored and return early, if appended clauses should only apply to access controlled contexts.
fr: **L'événement est déclenché même si l'accès est ignoré**. Les gestionnaires devront peut-être vérifier si l'accès est ignoré et retourner une réponse plus tôt, si les clauses ajoutées ne doivent s'appliquer qu'à des contextes à accès contrôlé.

source: ``$return`` value is a nested array of ``ands`` and ``ors``.
fr: La valeur ``$return`` est un tableau imbriqué de ``ands`` et de ``ors``.

source: ``$params`` includes:
fr: ``$params`` comprend :

source: ``table_alias`` - alias of the main table used in select clause
fr: ``table_alias`` - alias de la table principale utilisée dans la clause de sélection

source: ``ignore_access`` - whether ignored access is enabled
fr: ``ignore_access`` - selon que les accès sont ignorés ou activés

source: ``use_enabled_clause`` - whether disabled entities are shown/hidden
fr: ``use_enabled_clause`` - selon que les entités désactivées sont affichées/cachées

source: ``access_column`` - column in the main table containing the access collection ID value
fr: ``access_column`` - colonne de la table principale contenant l'ID de la collection d’accès

source: ``owner_guid_column`` - column in the main table referencing the GUID of the owner
fr: ``owner_guid_column`` - colonne de la table principale faisant référence au GUID du propriétaire

source: ``guid_column`` - column in the main table referencing the GUID of the entity
fr: ``guid_column`` - colonne de la table principale faisant référence au GUID de l’entité

source: ``enabled_column`` - column in the main table referencing the enabled status of the entity
fr: ``enabled_column`` - colonne de la table principale faisant référence à l’état activé de l’entité

source: ``query_builder`` - an instance of the ``QueryBuilder``
fr: ``query_builder`` - une instance de ``QueryBuilder``

source: Triggered during the update of an ``ElggAccessCollection``.
fr: Déclenché durant la mise à jour d'une ``ElggAccessCollection``.

source: Permission events
fr: Événements des permissions

source: Triggered by ``ElggEntity:canWriteToContainer()`` before triggering ``permissions_check`` and ``container_permissions_check`` events. Unlike permissions events, logic check can be used to prevent certain entity types from being contained by other entity types, e.g. discussion replies should only be contained by discussions. This event can also be used to apply status logic, e.g. do disallow new replies for closed discussions.
fr: Déclenché par ``ElggEntity:canWriteToContainer()`` avant de déclencher les événements ``permissions_check`` et ``container_permissions_check``. Contrairement aux événements des permissions, la vérification logique peut être utilisée pour empêcher certains types d'entités d'être contenus par d'autres types d'entités, par ex. les réponses aux discussions ne doivent être contenues que par les discussions. Cet événement peut également être utilisé pour appliquer une logique d'état, par ex. pour interdire les nouvelles réponses pour les discussions fermées.

source: The handler should return ``false`` to prevent an entity from containing another entity. The default value passed to the event is ``null``, so the handler can check if another event has modified the value by checking if return value is set. Should this event return ``false``, ``container_permissions_check`` and ``permissions_check`` events will not be triggered.
fr: Le gestionnaire devrait renvoyer ``false`` pour empêcher une entité de contenir une autre entité. La valeur par défaut transmise à l'événement est ``null``, donc le gestionnaire peut vérifier si un autre événement a modifié la valeur en vérifiant si la valeur de retour est définie. Si cet événement renvoie ``false``, les événements ``container_permissions_check`` et ``permissions_check`` ne seront pas déclenchés.

source: ``container`` - An entity that will be used as a container
fr: ``container`` - Une entité qui sera utilisée comme conteneur

source: ``user`` - User who will own the entity to be written to container
fr: ``user`` - L'utilisateur qui sera propriétaire de l’entité à écrire dans le conteneur

source: ``subtype`` - Subtype of the entity to be written to container (entity type is assumed from event type)
fr: ``subtype`` - Subtype de l'entité à écrire dans le conteneur (le type d'entité est déduit à partir du type d'événement)

source: Return boolean for if the user ``$params['user']`` can use the entity ``$params['container']`` as a container for an entity of ``<entity_type>`` and subtype ``$params['subtype']``.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut utiliser l’entité ``$params['container']`` comme conteneur pour une entité ``<entity_type>`` et le sous-type ``$params['subtype']``.

source: In the rare case where an entity is created with neither the ``container_guid`` nor the ``owner_guid`` matching the logged in user, this event is called *twice*, and in the first call ``$params['container']`` will be the *owner*, not the entity's real container.
fr: Dans les rares cas où une entité est créée sans le ``container_guid`` ni le ``owner_guid`` correspondant à l'utilisateur connecté, cet événement est appelé *deux fois*, et lors du premier appel ``$params['container ']`` sera le *propriétaire*, et pas le véritable conteneur de l'entité.

source: Return boolean for if the user ``$params['user']`` can edit the entity ``$params['entity']``.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut modifier l’entité ``$params['entity']``.

source: Return boolean for if the user ``$params['user']`` can delete the entity ``$params['entity']``. Defaults to ``$entity->canEdit()``.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut supprimer l’entité ``$params['entity']``. Vaut par défaut ``$entity->canEdit()``.

source: Return boolean for if the user ``$params['user']`` can delete the river item ``$params['item']``. Defaults to ``true`` for admins and ``false`` for other users.
fr: Renvoyez un booléen pour indiquer si l’utilisateur ``$params['user']`` peut supprimer l’élément de la rivière ``$params['item']``. Par défaut à ``true`` pour les administrateurs et ``false`` pour les autres utilisateurs.

source: Return boolean for if the user ``$params['user']`` can download the file in ``$params['entity']``.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut télécharger le fichier dans ``$params['entity']``.

source: ``entity`` - Instance of ``ElggFile``
fr: ``entity`` - Instance de ``ElggFile``

source: ``user`` - User who will download the file
fr: ``user`` - Utilisateur qui va télécharger le fichier

source: Return boolean for if ``$params['user']`` can edit the widgets in the context passed as ``$params['context']`` and with a page owner of ``$params['page_owner']``.
fr: Renvoie un booléen pour indiquer si ``$params['user']`` peut modifier les widgets dans le contexte passé par ``$params['context']`` et avec le propriétaire de page ``$params['page_owner']``.

source: Return boolean for if the user ``$params['user']`` can comment on the entity ``$params['entity']``.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut commenter l’entité ``$params['entity']``.

source: Return boolean for if the user ``$params['user']`` can create an annotation ``<annotation_name>`` on the entity ``$params['entity']``. If logged in, the default is true.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut créer une annotation ``<annotation_name>`` sur l’entité ``$params['entity']``. Si l'utilisateur est connecté, la valeur par défaut est true.

source: This is called before the more general ``permissions_check:annotate`` event, and its return value is that event's initial value.
fr: Ceci est appelé avant l'événement plus général ``permissions_check:annotate``, et sa valeur de retour est la valeur initiale de cet événement.

source: Return boolean for if the user ``$params['user']`` can create an annotation ``$params['annotation_name']`` on the entity ``$params['entity']``. if logged in, the default is true.
fr: Renvoie un booléen pour indiquer si l’utilisateur ``$params['user']`` peut créer une annotation ``$params['annotation_name']`` sur l’entité ``$params['entity']``. Si l'utilisateur est connecté, la valeur par défaut est true.

source: Triggered in the class ``\Elgg\WebServices\PAM\API\APIKey``. Returning false prevents the key from being authenticated.
fr: Déclenché dans la classe ``\Elgg\WebServices\PAM\API\APIKey``. Renvoyer false empêche l'authentification de la clef.

source: Filters the result of ``elgg_entity_gatekeeper()`` to prevent or allow access to an entity that user would otherwise have or not have access to. A handler can return ``false`` or an instance of ``\Elgg\Exceptions\HttpException`` to prevent access to an entity. A handler can return ``true`` to override the result of the gatekeeper. **Important** that the entity received by this event is fetched with ignored access and including disabled entities, so you have to be careful to not bypass the access system.
fr: Filtre le résultat de ``elgg_entity_gatekeeper()`` pour bloquer ou autoriser l'accès à une entité à laquelle l'utilisateur aurait ou n'aurait pas accès autrement. Un gestionnaire peut renvoyer ``false`` ou une instance de ``\Elgg\Exceptions\HttpException`` pour empêcher l'accès à une entité. Un gestionnaire peut retourner ``true`` pour remplacer le résultat du gatekeeper. **Important** l'entité reçue par cet événement est récupérée en ignorant les accès, et en incluant les entités désactivées, vous devez donc faire attention à ne pas contourner le système d'accès.

source: ``$params`` array includes:
fr: le tableau ``$params`` comprend :

source: ``entity`` - Entity that is being accessed
fr: ``entity`` - Entité à laquelle on accède

source: ``user`` - User accessing the entity (``null`` implies logged in user)
fr: ``user`` - L’utilisateur qui accède à l’entité (``null`` implique l’utilisateur connecté)

source: Notifications events
fr: Événements des notifications

source: Called when an ElggData object is removed from the notifications queue to be processed
fr: Appelé lorsqu'un objet ElggData est supprimé de la file d'attente des notifications pour être traité

source: Called when an ElggData object is being added to the notifications queue
fr: Appelé lorsqu'un objet ElggData est en train d'être ajouté à la file d'attente des notifications

source: The following events are listed chronologically in the lifetime of the notification event. Note that not all events apply to instant notifications.
fr: Les événements suivants sont répertoriés chronologiquement au cours de la durée de vie de l'événement de notification. Notez que tous les événements ne s'appliquent pas aux notifications instantanées.

source: Can be used to prevent a notification event from sending **subscription** notifications. Event handler must return ``false`` to prevent a subscription notification event from being enqueued.
fr: Peut être utilisé pour empêcher un événement de notification d'envoyer des notifications **subscription**. Le gestionnaire d'événements doit renvoyer ``false`` pour empêcher qu'un événement de notification d'abonnement ne soit mis en file d'attente.

source: ``object`` - object of the notification event
fr: ``object`` - objet de l’événement de notification

source: ``action`` - action that triggered the notification event. E.g. corresponds to ``publish`` when ``elgg_trigger_event('publish', 'object', $object)`` is called
fr: ``action`` - action qui a déclenché l’événement de notification. Par exemple, correspond à ``publish`` quand ``elgg_trigger_event('publish', 'object', $object)`` est appelé

source: Filters subscribers of the notification event. Applies to **subscriptions** and **instant** notifications. In case of a subscription event, by default, the subscribers list consists of the users subscribed to the container entity of the event object. In case of an instant notification event, the subscribers list consists of the users passed as recipients to ``notify_user()``
fr: Filtre les abonnés de l’événement de notification. S’applique aux notifications d'abonnement **subscriptions** et instantanées **instant**. Lors d'un événement d’abonnement, par défaut, la liste des abonnés se compose des utilisateurs abonnés à l’entité conteneur de l’objet de l'événement. En cas d’événement de notification instantanée, la liste des abonnés se compose des utilisateurs précédemment passés en tant que destinataires à ``notify_user()``

source: **IMPORTANT** Always validate the notification event, object and/or action types before adding any new recipients to ensure that you do not accidentally dispatch notifications to unintended recipients. Consider a situation, where a mentions plugin sends out an instant notification to a mentioned user - any event acting on a subject or an object without validating an event or action type (e.g. including an owner of the original wire thread) might end up sending notifications to wrong users.
fr: **IMPORTANT** Validez toujours les types d'événement, d'objet et/ou d'action de notification avant d'ajouter de nouveaux destinataires pour vous assurer que vous n'envoyez pas accidentellement des notifications à des destinataires inattendus. Prenons une situation dans laquelle un plugin de mentions envoie une notification instantanée à un utilisateur mentionné - tout événement agissant sur un sujet ou un objet sans valider un événement ou un type d'action (par exemple inclure un propriétaire du fil de discussion d'origine) pourrait finir par envoyer des notifications aux mauvais utilisateurs.

source: ``event`` - ``\Elgg\Notifications\NotificationEvent`` instance that describes the notification event
fr: ``event`` - instance de ``\Elgg\Notifications\NotificationEvent`` qui décrit l’événement de notification

source: ``origin`` - ``subscriptions_service`` or ``instant_notifications``
fr: ``origin`` - ``subscriptions_service`` ou ``instant_notifications``

source: ``methods_override`` - delivery method preference for instant notifications
fr: ``methods_override`` - préférence de méthode de remise pour les notifications instantanées

source: Handlers must return an array in the form:
fr: Les gestionnaires doivent renvoyer un tableau de la forme :

source: Triggered before the notification event queue is processed. Can be used to terminate the notification event. Applies to **subscriptions** and **instant** notifications.
fr: Déclenché avant le traitement de la file d’attente des événements de notification. Peut être utilisé pour mettre fin à l’événement de notification. S’applique aux notifications d'abonnement **subscriptions** et instantanées **instant**.

source: ``subscriptions`` - a list of subscriptions. See ``'get', 'subscriptions'`` event for details
fr: ``subscriptions`` - une liste d'abonnements. Voir l'événement ``'get', 'subscriptions'`` pour plus de détails

source: A high level event that can be used to alter an instance of ``\Elgg\Notifications\Notification`` before it is sent to the user. Applies to **subscriptions** and **instant** notifications. This event is triggered before a more granular ``'prepare', 'notification:<action>:<entity_type>:<entity_subtype>'`` and after ``'send:before', 'notifications``. Event handler should return an altered notification object.
fr: Un événement de haut niveau qui peut être utilisé pour modifier une instance de ``\Elgg\Notifications\Notification`` avant qu'elle ne soit envoyée à l'utilisateur. S'applique aux **abonnements** et aux notifications **instantanées**. Cet événement est déclenché avant une ``'prepare', 'notification:<action>:<entity_type>:<entity_subtype>'`` plus granulaire et après ``'send:before', 'notifications``. Le gestionnaire d'événements doit renvoyer un objet de notification modifié.

source: ``$params`` may vary based on the notification type and may include:
fr: ``$params`` peut varier en fonction du type de notification et peut comprendre :

source: ``object`` - object of the notification ``event``. Can be ``null`` for instant notifications
fr: ``object`` - objet de la notification ``event``. Peut être ``null`` pour les notifications instantanées

source: ``action`` - action that triggered the notification ``event``. May default to ``notify_user`` for instant notifications
fr: ``action`` - action qui a déclenché la notification ``event``. Peut avoir pour valeur par défaut ``notify_user`` pour les notifications instantanées

source: ``method`` - delivery method (e.g. ``email``, ``site``)
fr: ``method`` - méthode d'envoi (par ex. ``email``, ``site``)

source: ``sender`` - sender
fr: ``sender`` - expéditeur

source: ``recipient`` - recipient
fr: ``recipient`` - destinataire

source: ``language`` - language of the notification (recipient's language)
fr: ``language`` - langue de la notification (langue du destinataire)

source: A granular event that can be used to filter a notification ``\Elgg\Notifications\Notification`` before it is sent to the user. Applies to **subscriptions** and **instant** notifications. In case of instant notifications that have not received an object, the event will be called as ``'prepare', 'notification:<action>'``. In case of instant notifications that have not received an action name, it will default to ``notify_user``.
fr: Un événement granulaire qui peut être utilisé pour filtrer une notification ``\Elgg\Notifications\Notification`` avant qu'elle ne soit envoyée à l'utilisateur. S'applique aux **subscriptions** et aux notifications **instant**. En cas de notifications instantanées qui n'ont pas reçu d'objet, l'événement sera appelé ``'prepare', 'notification:<action>'``. Dans le cas de notifications instantanées qui n'ont pas reçu de nom d'action, il sera par défaut ``notify_user``.

source: ``$params`` include:
fr: ``$params`` comprend :

source: This event can be used to format a notification before it is passed to the ``'send', 'notification:<method>'`` event. Applies to **subscriptions** and **instant** notifications. The event handler should return an instance of ``\Elgg\Notifications\Notification``. The event does not receive any ``$params``. Some of the use cases include:
fr: Cet événement peut être utilisé pour formater une notification avant qu'elle soit transmise à l'événement ``'send', 'notification:<method>'``. S'applique aux notifications **subscriptions** et **instant**. Le gestionnaire d'événement doit renvoyer une instance de ``\Elgg\Notifications\Notification``. L'événement ne reçoit aucun ``$params``. Quelques cas d'utilisation :

source: Strip tags from notification title and body for plaintext email notifications
fr: Supprime les balises du titre et du corps de la notification pour les notifications par e-mail en texte brut

source: Inline HTML styles for HTML email notifications
fr: Styles HTML en ligne pour les e-mails de notification HTML

source: Wrap notification in a template, add signature etc.
fr: Envelopper la notification dans un modèle, ajouter une signature, etc.

source: Delivers a notification. Applies to **subscriptions** and **instant** notifications. The handler must return ``true`` or ``false`` indicating the success of the delivery.
fr: Délivre une notification. S’applique aux notifications d'abonnement **subscriptions** et instantanées **instant**. Le gestionnaire doit retourner ``true`` ou ``false`` pour indiquer le résultat de la remise.

source: ``notification`` - a notification object ``\Elgg\Notifications\Notification``
fr: ``notification`` - un objet de notification ``\Elgg\Notifications\Notification``

source: Triggered after all notifications in the queue for the notifications event have been processed. Applies to **subscriptions** and **instant** notifications.
fr: Déclenché après que toutes les notifications dans la file d’attente pour l’événement notifications ont été traitées. S’applique aux notifications d'abonnement **subscriptions** et instantanées **instant**.

source: ``deliveries`` - a matrix of delivery statuses by user for each delivery method
fr: ``deliveries`` - une matrice des statuts de remise par utilisateur pour chaque méthode de livraison
