Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: ``$returnvalue`` - the modified ``$vars`` array
fr: ``$returnvalue`` - le tableau modifié ``$vars``

source: ``$params`` - an array containing:
fr: ``$params`` - un tableau contenant :

source: ``vars`` - the original ``$vars`` array, unaltered
fr: ``vars`` - le tableau original ``$vars``, inchangé

source: ``view`` - the view name
fr: ``view`` - le nom de la vue

source: ``viewtype`` - The :ref:`viewtype <guides/views#viewtypes>` being rendered
fr: ``viewtype`` - Le :ref:`type de vue <guides/views#viewtypes>` en train d'être affiché

source: Altering view input example
fr: Exemple de modification des entrées d'une vue

source: Here we'll alter the default pagination limit for the comments view:
fr: Ici, nous allons modifier la limite de pagination par défaut pour la vue des commentaires :

source: Altering view output
fr: Modification de la sortie d'une vue

source: Sometimes it is preferable to alter the output of a view instead of overriding it.
fr: Parfois, il est préférable de modifier la sortie d’une vue au lieu de la remplacer.

source: The output of each view is run through the :ref:`event <guides/events-list#views>` ``["view", $view_name]`` before being returned by ``elgg_view()``. Each registered handler function is passed these arguments:
fr: La sortie de chaque vue est exécutée via l':ref:`événement <guides/events-list#views>` ``["view", $view_name]`` avant d'être renvoyée par ``elgg_view()``. Chaque fonction de gestionnaire enregistrée reçoit ces arguments :

source: ``$event`` - the string ``"view"``
fr: ``$event`` - la chaîne ``"view"``

source: ``$result`` - the modified output of the view
fr: ``$result`` - la sortie modifiée de la vue

source: To alter the view output, the handler just needs to alter ``$returnvalue`` and return a new string.
fr: Pour modifier le rendu de la vue, le gestionnaire n’a qu’à modifier ``$returnvalue`` et renvoyer une nouvelle chaîne.

source: Altering view output example
fr: Exemple de modification de la sortie d'une vue

source: Here we'll eliminate breadcrumbs that don't have at least one link.
fr: Ici, nous allons éliminer le fil d'Ariane lorsqu'il ne contient aucun lien.

source: Replacing view output completely
fr: Remplacer complètement le rendu d'une vue

source: You can pre-set the view output by setting ``$vars['__view_output']``. The value will be returned as a string. View extensions will not be used and the ``view`` event will not be triggered.
fr: Vous pouvez prédéfinir la sortie de la vue en définissant ``$vars['__view_output']``. La valeur sera renvoyée sous forme de chaîne. Les extensions de vue ne seront pas utilisées et l'événement ``view`` ne sera pas déclenché.

source: For ease of use you can also use a already existing default event callback to prevent output ``\Elgg\Values::preventViewOutput``
fr: Pour plus de facilité d'utilisation, vous pouvez également utiliser un callback d'événement par défaut déjà existant pour bloquer la sortie ``\Elgg\Values::preventViewOutput``

source: If you don't know what an entity is, :doc:`check this page out first </design/database>`.
fr: Si vous ne savez pas ce qu’est une entité, :doc:`commencez par lire cette page </design/database>`.

source: The following code will automatically display the entity in ``$entity``:
fr: Le code suivant affiche automatiquement l’entité dans ``$entity`` :

source: As you'll know from the data model introduction, all entities have a *type* (object, site, user or group), and optionally a subtype (which could be anything - 'blog', 'forumpost', 'banana').
fr: Comme vous le savez après la lecture de l’introduction au modèle de données, toutes les entités ont un *type* (object, site, user ou group), et éventuellement un sous-type (qui pourrait être n’importe quoi - 'blog', 'forumpost', 'banane').

source: ``elgg_view_entity`` will automatically look for a view called ``type/subtype``; if there's no subtype, it will look for ``type/type``. Failing that, before it gives up completely it tries ``type/default``.
fr: ``''elgg_view_entity`` va automatiquement rechercher une vue appelée ``type/subtype`` ; s’il n’y a pas de sous-type, elle recherchera ``type/type``. À défaut, elle essaiera ``type/default`` avant de renoncer.

source: RSS feeds in Elgg generally work by outputting the ``object/default`` view in the 'rss' viewtype.
fr: Les flux RSS de Elgg fonctionnent généralement en affichant la vue ``object/default`` du type de vue 'rss'.

source: For example, the view to display a blog post might be ``object/blog``. The view to display a user is ``user/default``.
fr: Par exemple, la vue pour afficher un article de blog peut être ``object/blog``. La vue pour afficher un utilisateur est ``user/default``.

source: Full and partial entity views
fr: Vues partielle et complète des entités

source: ``elgg_view_entity`` actually has a number of parameters, although only the very first one is required. The first three are:
fr: ``elgg_view_entity`` dispose en fait de plusieurs paramètres, bien que seul le tout premier soit nécessaire. Les trois premiers sont :

source: ``$entity`` - The entity to display
fr: ``$entity`` - L'entité à afficher

source: ``$viewtype`` - The viewtype to display in (defaults to the one we're currently in, but it can be forced - eg to display a snippet of RSS within an HTML page)
fr: ``''$viewtype`` - Le type de vue à afficher (par défaut celui qui est utilisé actuellement, mais il peut être forcé - par exemple pour afficher un extrait RSS dans une page HTML)

source: ``$full_view`` - Whether to display a *full* version of the entity. (Defaults to ``true``.)
fr: ``$full_view`` - Détermine s'il faut afficher la version *complète* de l’entité. (Par défaut à ``true``.)

source: This last parameter is passed to the view as ``$vars['full_view']``. It's up to you what you do with it; the usual behaviour is to only display comments and similar information if this is set to true.
fr: Ce dernier paramètre est transmis à la vue via ``$vars['full_view']``. C’est à vous de déterminer comment vous souhaitez l'utiliser ; le comportement habituel consiste à afficher uniquement des commentaires et des informations de ce type si cela est défini sur true.

source: Listing entities
fr: Lister des entités

source: This is then used in the provided listing functions. To automatically display a list of blog posts (:doc:`see the full tutorial </tutorials/blog>`), you can call:
fr: Ceci est ensuite utilisé dans les fonctions de liste fournies. Pour afficher automatiquement une liste d'articles de blog (:doc:`voir le tutoriel complet </tutorials/blog>`), vous pouvez appeler :

source: This function checks to see if there are any entities; if there are, it first displays the ``navigation/pagination`` view in order to display a way to move from page to page. It then repeatedly calls ``elgg_view_entity`` on each entity before returning the result.
fr: Cette fonction vérifie s’il y a des entités ; s’il y en a, elle affiche d’abord la vue ``navigation/pagination`` afin d’afficher un moyen de passer d’une page à l’autre. Elle appelle ensuite successivement ``elgg_view_entity`` sur chaque entité avant de renvoyer le résultat.

source: Note that ``elgg_list_entities`` allows the URL to set its ``limit`` and ``offset`` options, so set those explicitly if you need particular values (e.g. if you're not using it for pagination).
fr: Notez que ``elgg_list_entities`` permet à l’URL de définir ses options ``limit`` et ``offset``, aussi définissez-les explicitement si vous avez besoin de valeurs particulières (par exemple si vous ne les utilisez pas pour la pagination).

source: Elgg knows that it can automatically supply an RSS feed on pages that use ``elgg_list_entities``. It initializes the ``["head","page"]`` event (which is used by the header) in order to provide RSS autodiscovery, which is why you can see the orange RSS icon on those pages in some browsers.
fr: Elgg sait qu'il peut fournir automatiquement un flux RSS sur les pages qui utilisent ``elgg_list_entities``. Il initialise l'événement ``["head","page"]`` (qui est utilisé par l'entête) afin de fournir une découverte automatique RSS, c'est pourquoi vous pouvez voir l'icône RSS orange sur ces pages dans certains navigateurs.

source: Entity listings will default try to load entity owners and container owners. If you want to prevent this you can turn this off.
fr: Les listes d’entités tenteront par défaut de charger les propriétaires des entités et les propriétaires de leur conteneur. Si vous voulez éviter ce comportement, vous pouvez le désactiver.

source: See also :doc:`this background information on Elgg's database </design/database>`.
fr: Voyez aussi :doc:`ces informations de contexte sur la base de données de Elgg </design/database>`.

source: If you want to show a message when the list does not contain items to list, you can pass a ``no_results`` message or ``true`` for the default message. If you want even more controle over the ``no_results`` message you can also pass a Closure (an anonymous function).
fr: Si vous souhaitez afficher un message lorsque la liste ne contient pas d’élément à répertorier, vous pouvez transmettre un message avec ``no_results``, ou ``true`` pour le message par défaut. Si vous voulez encore plus de contrôle sur le message le message ``no_results`` peut également passer une Closure (une fonction anonyme).

source: Rendering a list with an alternate view
fr: Rendu d’une liste avec une autre vue

source: You can define an alternative view to render list items using ``'item_view'`` parameter.
fr: Vous pouvez définir une autre vue pour afficher des éléments de liste à l’aide du paramètre ``item_view``.

source: In some cases, default entity views may be unsuitable for your needs. Using ``item_view`` allows you to customize the look, while preserving pagination, list's HTML markup etc.
fr: Dans certains cas, les vues d’entité par défaut peuvent ne pas convenir à vos besoins. L’utilisation de ``item_view`` vous permet de personnaliser l’apparence, tout en préservant la pagination, le balisage HTML de la liste, etc.

source: Consider these two examples:
fr: Prenons les deux exemples suivants :

source: In the first example, we are displaying a list of groups a user is a member of using the default group view. In the second example, we want to display a list of groups the user was invited to.
fr: Dans le premier exemple, nous affichons une liste de groupes dont un utilisateur est membre à l’aide de la vue de groupe par défaut. Dans le deuxième exemple, nous voulons afficher une liste de groupes dans lesquels l’utilisateur a été invité.

source: Since invitations are not entities, they do not have their own views and can not be listed using ``elgg_list_*``. We are providing an alternative item view, that will use the group entity to display an invitation that contains a group name and buttons to access or reject the invitation.
fr: Étant donné que les invitations ne sont pas des entités, elles n’ont pas leurs propres vues et ne peuvent pas être répertoriées à l’aide de ``elgg_list_ *``. Nous fournissons une vue d’élément alternative, qui utilisera l’entité de groupe pour afficher une invitation qui contient un nom de groupe et des boutons pour accéder ou rejeter l’invitation.

source: Rendering a list as a table
fr: Rendu d’une liste sous forme de tableau

source: Since 2.3 you can render lists as tables. Set ``$options['list_type'] = 'table'`` and provide an array of TableColumn objects as ``$options['columns']``. The service ``elgg()->table_columns`` provides several methods to create column objects based around existing views (like ``page/components/column/*``), properties, or methods.
fr: Depuis Elgg 2.3, vous pouvez afficher les listes sous forme de tableaux. Définissez ``$options[`list_type'] = 'table'`` et fournissez un tableau d’objets TableColumn dans ``$options['columns']``. Le service ``elgg()->table_columns`` fournit plusieurs méthodes pour créer des objets de colonnes basés sur des vues (comme ``page/components/column/*`` ), des propriétés, ou des méthodes.

source: In this example, we list the latest ``my_plugin`` objects in a table of 3 columns: entity icon, the display name, and a friendly format of the time.
fr: Dans cet exemple, nous répertorions les derniers objets ``mon_plugin`` dans un tableau de 3 colonnes : icône de l’entité, nom d’affichage, et la date dans un format convivial.

source: See the ``Elgg\Views\TableColumn\ColumnFactory`` class for more details on how columns are specified and rendered. You can add or override methods of ``elgg()->table_columns`` in a variety of ways, based on views, properties/methods on the items, or given functions.
fr: Consultez la classe ``Elgg\Views\TableColumn\ColumnFactory`` pour plus d’informations sur la façon dont les colonnes sont spécifiées et rendues. Vous pouvez ajouter ou remplacer les méthodes de ``elgg()->table_columns`` de diverses façons, en fonction des vues, des propriétés/méthodes sur les éléments, ou des fonctions données.

source: Elgg has support for two kind of icons: generic icons to help with styling (eg. show delete icon) and Entity icons (eg. user avatar).
fr: Elgg supporte deux types d’icônes : les icônes génériques qui aident pour le style des pages (par exemple, afficher l’icône de suppression) et les icônes des Entités (par exemple l'avatar d'un utilisateur).

source: Generic icons
fr: Icônes génériques

source: As of Elgg 2.0 the generic icons are based on the FontAwesome_ library. You can get any of the supported icons by calling ``elgg_view_icon($icon_name, $vars);`` where:
fr: À partir de Elgg 2.0, les icônes génériques sont basées sur la bibliothèque FontAwesome_. Vous pouvez obtenir n’importe laquelle des icônes prises en charge en appelant ``elgg_view_icon($icon_name, $vars);`` où :

source: ``$icon_name`` is the FontAwesome name (without ``fa-``) for example ``user``
fr: ``$icon_name`` est le nom de l'icône FontAwesome (sans ``fa-``) par exemple ``user``

source: ``$vars`` is optional, for example you can set an additional class
fr: ``$vars`` est facultatif, par exemple vous pouvez définir une classe supplémentaire

source: ``elgg_view_icon()`` calls the view ``output/icon`` with the given icon name and outputs all the correct classes to render the FontAwesome icon. If you wish to replace an icon with another icon you can write a ``view_vars``, ``output/icon`` event to replace the icon name with your replacement.
fr: ``elgg_view_icon()`` appelle la vue ``output/icon`` avec le nom d'icône donné et affiche toutes les classes correctes pour restituer l'icône FontAwesome. Si vous souhaitez remplacer une icône par une autre icône, vous pouvez écrire un événement ``view_vars``, ``output/icon`` pour remplacer le nom de l'icône par votre remplacement.

source: For backwards compatibility some older Elgg icon names are translated to a corresponding FontAwesome icon.
fr: A des fins de rétro-compatibilité, certains anciens noms d’icônes Elgg sont traduits en une icône FontAwesome correspondante.

source: Entity icons
fr: Icônes des entités

source: To view an icon belowing to an Entity call ``elgg_view_entity_icon($entity, $size, $vars);`` where:
fr: Pour afficher une icône appartenant à une Entité appelez ``elgg_view_entity_icon($entity, $size, $vars);`` où :

source: ``$entity`` is the ``ElggEntity`` you wish to show the icon for
fr: ``$entity`` est l'``ElggEntity`` dont vous voulez afficher l'icône

source: ``$size`` is the requestes size. Default Elgg supports ``large``, ``medium``, ``small``, ``tiny`` and ``topbar`` (``master`` is also available, but don't use it)
fr: ``$size`` est la dimension demandée. Par défaut Elgg supporte ``large``, ``medium``, ``small``, ``tiny`` et ``topbar`` (``master`` est également disponible, mais ne l'utilisez pas)

source: ``$vars`` in order to pass additional information to the icon view
fr: ``$vars`` pour passer des informations additionnelles à la vue de l'icône

source: ``elgg_view_entity_icon()`` calls a view in the order:
fr: ``elgg_view_entity_icon()`` appelle une vue dans l'ordre :

source: So if you wish to customize the layout of the icon you can overrule the corresponding view.
fr: Ainsi si vous souhaitez personnaliser la mise en page de l'icône, vous pouvez surcharger la vue correspondante.

source: An example of displaying a user avatar is
fr: Un exemple d'affichage d'un avatar utilisateur est

source: ``page/elements/footer`` is the content that goes inside this part of the page:
fr: ``page/elements/footer`` est le contenu qui s'affiche dans cette partie de la page :

source: Its content is visible to end users and usually where you would put a sitemap or other secondary global navigation, copyright info, powered by elgg, etc.
fr: Son contenu est visible des utilisateurs finaux, et c'est habituellement l'endroit où vous mettriez un plan du site ou une autre navigation secondaire, les mentions légales, l'indication propulsé par elgg, etc.

source: ``page/elements/foot`` is inserted just before the ending ``</body>`` tag and is mostly meant as a place to insert scripts that don't already work with ``elgg_import_esm('my/module');``. In other words, you should never override this view and probably don't need to extend it either. Just use the ``elgg_*_esm`` functions instead
fr: ``page/elements/foot`` est inséré juste avant la balise de fin ``</body>`` et est principalement destiné à insérer des scripts qui ne fonctionnent pas déjà avec ``elgg_import_esm('amd/module');`` . En d'autres termes, vous ne devriez jamais remplacer cette vue et vous n'avez probablement pas besoin de l'étendre non plus. Utilisez simplement les fonctions ``elgg_*_esm`` à la place

source: Page structure best practice
fr: Recommandations pour la structure d'une page

source: Elgg pages have an overall pageshell, a main layout and several page elements. It's recommended to always use the ``default`` layout as all page elements can be controlled using that layout.
fr: Les pages Elgg utilisent un pageshell - coquille HTML - global, une disposition ou mise en page principale et plusieurs éléments de page. Il est recommandé d’utiliser toujours la disposition ``default`` car tous les éléments de la page peuvent être contrôlés en utilisant de cette disposition.

source: If you're not using the ``default`` layout you can call
fr: Si vous n'utilisez pas la disposition ``default`` vous pouvez appeler

source: The different page elements are passed as an ``array`` in the second parameter. The array keys correspond to elements in the layout. The array values contain the html that should be displayed in those areas:
fr: Les différents éléments de la page sont passés sous la forme d’un ``array`` dans le deuxième paramètre. Les clefs du tableau correspondent à des éléments de la disposition. Les valeurs de tableau contiennent le html qui devrait être affiché dans ces zones :

source: You can then, ultimately, pass this into the ``elgg_view_page`` function:
fr: Vous pouvez ensuite, finalement, passer ceci dans la fonction ``elgg_view_page`` :

source: If you're using the ``default`` layout you can also pass the array with page elements directly to ``elgg_view_page``:
fr: Si vous utilisez la disposition ``default``, vous pouvez également passer le tableau avec les éléments de page directement à ``elgg_view_page`` :

source: You can control many of the page elements:
fr: Vous pouvez contrôler de nombreux éléments de la page :

source: Have a look at the ``page/layouts/default`` view to find out more information about the supported page elements
fr: Regardez la vue ``page/layouts/default`` pour obtenir plus d’informations sur les éléments de page pris en charge

source: Simplecache
fr: Simplecache - Cache simple

source: The Simplecache is a mechanism designed to alleviate the need for certain views to be regenerated dynamically. Instead, they are generated once, saved as a static file, and served in a way that entirely bypasses the Elgg engine.
fr: Le Simplecache est un mécanisme conçu pour atténuer la nécessité de régénérer dynamiquement certaines vues. Au lieu de cela, elles sont générées une seule fois, enregistrées comme un fichier statique, et servies d’une manière qui contourne entièrement le moteur Elgg.

source: If Simplecache is turned off (which can be done from the administration panel), these views will be served as normal, with the exception of site CSS.
fr: Si Simplecache est désactivé (ce qui peut être fait à partir du panneau d’administration), ces vues seront servies comme d’habitude, à l’exception des CSS du site.

source: The criteria for whether a view is suitable for the Simplecache is as follows:
fr: Les critères pour savoir si une vue convient pour Simplecache sont les suivants :

source: The view must not change depending on who or when it is being looked at
fr: La vue ne doit pas changer en fonction de qui la regarde ou de quand elle est affichée

source: The view must not depend on variables fed to it (except for global variables like site URL that never change)
fr: La vue ne doit pas dépendre des variables qui lui sont transmises (à l’exception des variables globales comme l’URL du site qui ne changent jamais)

source: Regenerating the Simplecache
fr: Régénérer le Simplecache

source: You can regenerate the Simplecache at any time by:
fr: Vous pouvez régénérer la Simplecache à tout moment en :

source: Loading ``/upgrade.php``, even if you have nothing to upgrade
fr: Chargement de ``/upgrade.php``, même si vous n’avez rien à mettre à niveau

source: In the admin panel click on 'Flush the caches'
fr: Dans le panneau d’administration, cliquez sur 'Vider les caches'

source: Enabling or disabling a plugin
fr: Activation ou désactivation d’un plugin

source: Reordering your plugins
fr: Réordonner vos plugins

source: Using the Simplecache in your plugins
fr: Utiliser le Simplecache dans vos plugins

source: **Registering views with the Simplecache**
fr: **Enregistrer des vues avec Simplecache**

source: You can register a view with the Simplecache with the following function at init-time:
fr: Vous pouvez enregistrer une vue dans Simplecache avec la fonction suivante lors de la phase d'initialisation :

source: **Accessing the cached view**
fr: **Accéder à la vue mise en cache**

source: If you registered a JavaScript or CSS file with Simplecache and put in the view folder as ``your_view.js`` or ``your_view.css`` you can very easily get the url to this cached view by calling ``elgg_get_simplecache_url($view)``. For example:
fr: Si vous avez enregistré un fichier JavaScript ou CSS avec Simplecache et que vous l'avez mis dans le dossier des vues sous la forme ``votre_vue.js`` ou ``votre_vue.css``, vous pouvez très facilement obtenir l’URL de cette vue mise en cache en appelant ``elgg_get_simplecache_url($vue)``. Par exemple :

source: Walled Garden
fr: Réseau privé - "Walled Garden"

source: Elgg supports a "Walled Garden" mode. In this mode, almost all pages are restricted to logged in users. This is useful for sites that don't allow public registration.
fr: Elgg prend en charge un mode ``Walled Garden`` - jardin clos, ou réseau privé. Dans ce mode, presque toutes les pages ne sont accessible qu'aux seuls utilisateurs connectés. Ceci est utile pour les sites qui n’autorisent pas l’inscription publique.

source: Activating Walled Garden mode
fr: Activer le mode réseau privé - Walled Garden

source: To activate Walled Garden mode in Elgg, go to the Administration section. On the right sidebar menu, under the "Configure" section, expand "Settings," then click on "Advanced."
fr: Pour activer le mode Walled Garden dans Elgg, accédez à la section Administration. Dans le menu de la barre latérale droite, sous la section "Configurer", développez "Paramètres" puis cliquez sur "Avancé".
