Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Access Control Lists
fr: Listes de Contrôle d'Accès

source: An Access Control List (or ACL) can grant one or more users access to an entity or annotation in the database.
fr: Une Liste de Contrôle d'Accès (ACL - Access Control Lists) permet d'octroyer à un ou plusieurs utilisateurs l'accès à une entité ou à une annotation dans la base de données.

source: Contents
fr: Contenu

source: Creating an ACL
fr: Créer une ACL

source: An access collection can be create by using the function ``elgg_create_access_collection()``.
fr: Une collection d'accès peut être créée en utilisant la fonction ``elgg_create_access_collection()``.

source: ACL subtypes
fr: Sous-types d'ACL

source: ACLs can have a subtype, this is to help differentiate between the usage of the ACL. It's higly recommended to set a subtype for an ACL.
fr: Les ACLs peuvent avoir un sous-type, ceci permet de différencier différents usages de l'ACL. Il est fortement recommandé de définir un sous-type pour une ACL.

source: Elgg core has three examples of subtype usage
fr: Le noyau de Elgg a trois exemples d'usage de sous-types

source: ``group_acl`` an ACL owned by an ``ElggGroup`` which grants group members access to content shared with the group
fr: ``group_acl`` une ACL qui appartient à un ``ElggGroup`` qui donne aux membres du groupe l'accès aux contenus partagés dans le groupe

source: ``friends`` an ACL owned by an ``ElggUser`` which grant friends of a user access to content shared with friends
fr: ``friends`` une ACL détenue par un ``ElggUser`` qui donne aux contacts de l'utilisateur l'accès aux contenus partagés avec les contacts

source: ``friends_collection`` an ACL owned by an ``ElggUser`` which grant specific friends access to content shared with the ACL
fr: ``friends_collection`` une ACL qui appartient à un ``ElggUser`` qui donne à des contacts spécifiques l'accès aux contenus partagés avec cette ACL

source: Adding users to an ACL
fr: Ajouter des membres à une ACL

source: If you have an ACL you still need to add users to it in order to grant those users access to content with the `access_id` of the ACLs `id`.
fr: Si vous avez une ACL vous devez encore lui ajouter des utilisateurs pour donner accès à ces utilisateurs au contenu avec l'`access_id` de l'ACL `id`.

source: Removing users from an ACL
fr: Retirer des membres d'une ACL

source: If you no longer wish to allow access for a given user in an ACL you can easily remove that user from the list.
fr: Si vous souhaitez ne plus donner l'accès à un utilisateur donné dans une ACL, vous pouvez facilement retirer cet utilisateur de la liste.

source: Retrieving an ACL
fr: Récupérer une ACL

source: In order to manage an ACL, or add the ID of an ACL to an access list there are several functions available to retrieve an ACL from the database.
fr: Afin de gérer une ACL, ou ajouter l'ID d'une ACL à une liste d'accès il existe plusieurs fonctions disponibles pour récupérer une ACL depuis la base de données.

source: Read access
fr: Accès en lecture

source: The access system of Elgg automaticly adds all the ACLs a user is a member of to the access checks. For example a user is a member of a group and is friends with 3 other users, all the corresponding ACLs are added in order to check access to entities when retrieving them (eg. listing all blogs).
fr: Le système d’accès de Elgg ajoute automatiquement toutes les ACL dont un utilisateur est membre aux contrôles d’accès. Par exemple, si un utilisateur est membre d’un groupe et est en contact avec 3 autres utilisateurs, toutes les ACL correspondantes sont ajoutées afin de vérifier l’accès aux entités lors de leur récupération (par exemple, la liste de tous les articles de blog).

source: Ignoring access
fr: Ignorer l’accès

source: If for some case you need entities retrieved ignoring the access rules you can wrap your code in ``elgg_call``. There are different flags you can use.
fr: Si dans certains cas vous avez besoin d’entités récupérées en ignorant les règles d’accès, vous pouvez envelopper votre code dans ``elgg_call``. Il existe différents drapeaux que vous pouvez utiliser.

source: ELGG_IGNORE_ACCESS: no access rules are applied
fr: ELGG_IGNORE_ACCESS : aucune règle d’accès n’est appliquée

source: ELGG_ENFORCE_ACCESS: access rules are forced to be applied
fr: ELGG_ENFORCE_ACCESS : les règles d’accès sont forcées à être appliquées

source: ELGG_SHOW_DISABLED_ENTITIES: will retrieve entities that are disabled
fr: ELGG_SHOW_DISABLED_ENTITIES : récupérera les entités désactivées

source: ELGG_HIDE_DISABLED_ENTITIES: will never retrieve entities that are disabled
fr: ELGG_HIDE_DISABLED_ENTITIES : ne récupérera jamais les entités désactivées

source: You can also combine flags.
fr: Vous pouvez également combiner des drapeaux.

source: Accessibility
fr: Accessibilité

source: This page aims to list and document accessibility rules and best practices, to help core and plugins developpers to make Elgg the most accessible social engine framework that everyone dreams of.
fr: Cette page a pour but d'énumérer et de documenter les règles d'accessibilité et les meilleures pratiques pour aider les développeur du noyau et des plugins à faire de Elgg le meilleur framework applicatif de moteur social dont tout le monde rêve.

source: This is an ongoing work, please contribute on `Github <https://github.com/Elgg/Elgg>`_ if you have some skills in this field!
fr: Il s'agit d'un travail en cours, veuillez contribuer sur `Github <https://github.com/Elgg/Elgg>`_ si vous avez des compétences dans ce domaine !

source: Resources + references
fr: Ressources + références

source: `Official WCAG Accessibility Guidelines Overview <https://www.w3.org/WAI/standards-guidelines/wcag/glance/>`_
fr: `Aperçu des guides d'accessibilité officiels WCAG <https://www.w3.org/WAI/standards-guidelines/wcag/glance/fr>`_

source: `Official WCAG Accessibility Guidelines <https://www.w3.org/TR/WCAG/>`_
fr: `Guides d'accessibilité officiels WCAG <https://www.w3.org/TR/WCAG/>`_

source: `Resources for planning and implementing for accessibility <https://www.w3.org/WAI/planning/>`_
fr: `Ressources pour planifier et implémenter l'accessibilité <https://www.w3.org/WAI/planning/fr>`_

source: `Practical tips from the W3C for improving accessibility <https://www.w3.org/WAI/planning/interim-repairs/>`_
fr: `Astuces pratiques du W3C pour améliorer l'accessibilité <https://www.w3.org/WAI/planning/interim-repairs/>`_

source: `Preliminary review of websites for accessibility <https://www.w3.org/WAI/test-evaluate/preliminary/>`_
fr: `Tests et vérifications préliminaires pour évaluer l'accessibilité d'un site <https://www.w3.org/WAI/test-evaluate/preliminary/>`_

source: `Tools for checking the accessibility of websites <https://www.w3.org/WAI/ER/tools/>`_
fr: `Outils pour vérifier l'accessibilité des sites web <https://www.w3.org/WAI/ER/tools/>`_

source: `List of practical techniques for implementing accessibility <https://www.w3.org/TR/WCAG20-TECHS/Overview.html#contents>`_ (It would be great if someone could go through this and filter out all the ones that are relevant to Elgg)
fr: `Liste de techniques pratiques pour implémenter l'accessibilité <https://www.w3.org/TR/WCAG20-TECHS/Overview.html#contents>`_ (Ce serait génial si quelqu'un pouvait les examiner et filtrer celles qui sont pertinentes pour Elgg)

source: Tips for implementing accessibility
fr: Astuces pour implémenter l'accessibilité

source: All accessibility-related tickets reported to trac should be tagged with "a11y", short for "accessibility"
fr: Tous les tickets relatifs à l'accessibilité devraient être tagués avec "a11y", raccourci pour accessibilité - "accessibility"

source: Use core views such as ``output/*``, and ``input/*`` to generate markup, since we can bake a11y concerns into these views
fr: Utilisez les vues du noyau telles que ``output/*``, et ``input/*`` pour générer le balisage, dans la mesure où nous pouvons intégrer les règles d'accessibilité dans ces vues

source: All images should have a descriptive ``alt`` attribute. Spacer or purely decorative graphics should have blank ``alt`` attributes
fr: Toutes les images doivent avoir un attribut descriptif ``alt``. Les graphiques d'espacement ou purement décoratifs doivent avoir un attribut ``alt`` vide

source: All ``<a>`` tags should have text or an accessible image inside. Otherwise screen readers will have to read the URL, which is a poor experience ``<a>`` tags should contain descriptive text, if possible, as opposed to generic text like "Click here"
fr: Toutes les balises ``<a>`` doivent avoir du texte ou une image accessible à l’intérieur. Sinon, les lecteurs d’écran devront lire l’URL, ce qui est une mauvaise expérience. Les balises ``<a>`` devraient contenir du texte descriptif, si possible, par opposition a un texte générique comme "Cliquez ici"

source: Markup should be valid
fr: Le balisage devrait être valide

source: Themes should not reset "outline" to nothing. ``:focus`` deserves a special visual treatment so that handicapped users can know where they are
fr: Les thèmes de doivent pas réinitialiser "outline" à rien. ``:focus`` mérite un traitement visuel spécial afin que les utilisateurs handicapés puissent savoir où ils se trouvent

source: Tips for testing accessibility
fr: Astuces pour tester l'accessibilité

source: Use the tools linked to from the resources section. `Example report for community.elgg.org on June 16, 2012 <http://try.powermapper.com/Reports/a6276098-0883-4d04-849e-8c05999812f2/report/map.htm>`_
fr: Utilisez les outils disponibles à partir de la section ressources. `Exemple de rapport pour community.elgg.org du 16 juin 2012 <http://try.powermapper.com/Reports/a6276098-0883-4d04-849e-8c05999812f2/report/map.htm>`_

source: Try different font-size/zoom settings in your browser and make sure the theme remains usable
fr: Essayez différentes configurations de taille de police et de zoom dans votre navigateur pour être sûr que votre thème reste utilisable

source: Turn off css to make sure the sequential order of the page makes sense
fr: Désactivez css pour vous assurer que l'ordre séquentiel de la page est logique

source: Documentation objectives and principles
fr: Objectifs et principes de la documentation

source: Main accessibility rules
fr: Principales règles d'accessibilité

source: collect and document best practices
fr: collecter et documenter les bonnes pratiques

source: Provide code examples
fr: Fournir des exemples de code

source: Keep the document simple and usable
fr: Conserver le document simple et utilisable

source: Make it usable for both beginner developpers and experts (from most common and easiest changes to elaborate techniques)
fr: Le rendre utilisable à la fois pour les développeurs débutants et les experts (des changements les plus courants et les plus faciles aux techniques élaborées)

source: Forms + Actions
fr: Formulaires + Actions

source: Create, update, or delete content.
fr: Créer, mettre à jour, ou supprimer du contenu.

source: Elgg forms submit to actions. Actions define the behavior for form submission.
fr: Les formulaires Elgg sont envoyés aux actions. Les actions définissent le comportement pour l'envoi des formulaires.

source: This guide assumes basic familiarity with:
fr: Ce guide suppose une familiarité de base avec :

source: Registering actions
fr: Enregistrer des actions

source: Actions must be registered before use.
fr: Les actions doivent être enregistrées avant de pouvoir être utilisées.

source: There are two ways to register actions:
fr: Il existe deux manières d'enregistrer des actions :

source: Using ``elgg_register_action()``
fr: Utiliser ``elgg_register_action()``

source: The ``mod/example/actions/example.php`` script will now be run whenever a form is submitted to ``http://localhost/elgg/action/example``.
fr: Le fichier de script ``mod/example/actions/example.php`` sera maintenant utilisé à chaque fois qu'un formulaire est envoyé vers ``http://localhost/elgg/action/example``.

source: Use ``elgg-plugin.php``
fr: Utilisez ``elgg-plugin.php``

source: A stumbling point for many new developers is the URL for actions. The URL always uses ``/action/`` (singular) and never ``/actions/`` (plural). However, action script files are usually saved under the directory ``/actions/`` (plural) and always have an extension. Use ``elgg_generate_action_url()`` to avoid confusion.
fr: Un point d’achoppement pour de nombreux nouveaux développeurs est l’URL pour les actions. L’URL utilise toujours ``/action/`` (singulier) et jamais ``/actions/`` (pluriel). Toutefois, les fichiers de script d’action sont généralement enregistrés dans le répertoire ``/actions/`` (pluriel) et ont toujours une extension. Utilisez ``elgg_generate_action_url()`` pour éviter toute confusion.

source: Registering actions using plugin config file
fr: Enregistrement des actions en utilisant le fichier de configuration du plugin

source: You can also register actions via the :doc:`elgg-plugin</guides/plugins>` config file. To do this you need to provide an action section in the config file. The location of the action files are assumed to be in the plugin folder ``/actions``.
fr: Vous pouvez également enregistrer des actions via le fichier de configuration :doc:`elgg-plugin</guides/plugins>`. Pour cela vous devez fournir une section action dans le fichier de configuration. L’emplacement des fichiers d’action est situé dans le dossier ``/actions`` du plugin.

source: By default, actions are only available to logged in users.
fr: Par défaut, les actions ne sont accessibles qu'aux utilisateurs connectés.

source: To make an action available to logged out users, pass ``"public"`` as the third parameter:
fr: Pour qu'une action soit disponible pour des utilisateurs non identifiés, passez ``"public"`` comme troisième argument :

source: To restrict an action to only administrators, pass ``"admin"`` for the last parameter:
fr: Pour restreindre l'action aux seuls administrateurs, passez ``"admin"`` en dernier paramètre :

source: To restrict an action to only logged out users, pass ``"logged_out"`` for the last parameter:
fr: Pour restreindre une action aux seuls utilisateurs non-connectés, passez ``"logged_out"`` en dernier paramètre :

source: Writing action files
fr: Écrire des fichiers d'action

source: Use the ``get_input()`` function to get access to request parameters:
fr: Utilisez la fonction ``get_input()`` pour accéder aux paramètres de la requête :

source: You can then use the :doc:`database` api to load entities and perform actions on them accordingly.
fr: Vous pouvez ensuite utiliser l'api de la :doc:`database` pour charger des entités et effectuer des actions dessus.

source: To indicate a successful action, use ``elgg_ok_response()``. This function accepts data that you want to make available to the client for XHR calls (this data will be ignored for non-XHR calls)
fr: Pour indiquer une action réussie, utilisez ``elgg_ok_response()``. Cette fonction accepte comme paramètre les données que vous souhaitez mettre à la disposition du client pour les appels XHR (ces données seront ignorées pour les appels non XHR)

source: To indicate an error, use ``elgg_error_response()``
fr: Pour indiquer une erreur utilisez ``elgg_error_response()``

source: Customizing actions
fr: Personnaliser des actions

source: Before executing any action, Elgg triggers an event:
fr: Avant d'exécuter chaque action, Elgg déclenche un événement :

source: Where ``$action`` is the action being called. If the event returns ``false`` then the action will not be executed. Don't return anything if your validation passes.
fr: Où ``$action`` est l'action appelée. Si l'événement renvoie ``false`` alors l'action ne sera pas exécutée. Ne renvoyez rien si votre validation réussit.

source: Example: Captcha
fr: Exemple : Captcha

source: The captcha module uses this to intercept the ``register`` and ``user/requestnewpassword`` actions and redirect them to a function which checks the captcha code. This check returns ``false`` if the captcha validation fails (which prevents the associated action from executing).
fr: Le module captcha utilise ceci pour intercepter les actions ``register`` et ``user/requestnewpassword`` et les rediriger vers une fonction qui vérifie le code captcha. Cette vérification renvoie ``false`` si la validation captcha échoue (ce qui bloque l’exécution de l’action associée).

source: This is done as follows:
fr: Ceci est fait comme suit :

source: This lets a plugin extend an existing action without the need to replace the whole action. In the case of the captcha plugin it allows the plugin to provide captcha support in a very loosely coupled way.
fr: Cela permet à un plugin d'étendre une action existante sans qu'il soit nécessaire de remplacer l'ensemble de l'action. Dans le cas du plugin captcha, cela permet de proposer un support captcha couplé de façon souple.

source: Actions available in core
fr: Actions disponibles dans le noyau

source: If your plugin does not implement any custom logic when deleting an entity, you can use bundled delete action
fr: Si votre plugin n’implémente aucune logique personnalisée lors de la suppression d’une entité, vous pouvez utiliser l’action de suppression intégrée

source: You can customize the success message keys for your entity type and subtype, using ``"entity:delete:$type:$subtype:success"`` and ``"entity:delete:$type:success"`` keys.
fr: Vous pouvez personnaliser les clefs du message de succès pour votre type d’entité et votre sous-type, en utilisant les clefs ```"entity:delete:$type:$subtype:success"`` et ``"entity:delete:$type:success"``.

source: Forms
fr: Formulaires

source: To output a form, use the elgg_view_form function like so:
fr: Pour afficher un formulaire, utilisez la fonction elgg_view_form comme ceci :

source: Doing this generates something like the following markup:
fr: Faire ceci génère quelque chose comme le balisage suivant :

source: Elgg does some things automatically for you when you generate forms this way:
fr: Elgg fait automatiquement plusieurs choses pour vous quand vous générez un formulaire de cette manière :

source: It sets the action to the appropriate URL based on the name of the action you pass to it
fr: Il définit l'action vers l'URL appropriée, sur la base du nom de l'action que vous lui avez passé

source: It adds some anti-csrf tokens (``__elgg_ts`` and ``__elgg_token``) to help keep your actions secure
fr: Il ajoute des jetons anti-csrf (``__elgg_ts`` et ``__elgg_token``) pour aider à garder vos actions sûres

source: It automatically looks for the body of the form in the ``forms/example`` view.
fr: Il recherche automatiquement le corps du formulaire dans la vue ``forms/example``.

source: Put the content of your form in your plugin’s ``forms/example`` view:
fr: Ajoutez le contenu de votre formulaire dans la vue ``forms/example`` de votre plugin :

source: Now when you call ``elgg_view_form('example')``, Elgg will produce:
fr: Désormais quand vous appelez ``elgg_view_form('example')``, Elgg va produire :

source: Inputs
fr: Entrées

source: To render a form input, use one of the bundled input views, which cover all standard HTML input elements. See individual view files for a list of accepted parameters.
fr: Pour rendre une entrée de formulaire, utilisez l’une des vues d’entrée intégrées, qui couvrent tous les éléments d’entrée HTML standard. Voyez les fichiers individuels des vues pour une liste complète des paramètres acceptés.

source: The above example will render a dropdown select input:
fr: L’exemple ci-dessus va afficher une liste déroulante :

source: To ensure consistency in field markup, use ``elgg_view_field()``, which accepts all the parameters of the input being rendered, as well as ``#label`` and ``#help`` parameters (both of which are optional and accept HTML or text).
fr: Pour assurer la cohérence du balisage du champ, utilisez ``elgg_view_field()``, qui accepte tous les paramètres de l’entrée à afficher, ainsi que les paramètres ``#label`` et ``#help`` (qui sont tous deux facultatifs et acceptent du HTML ou du texte).

source: The above will generate the following markup:
fr: Ce qui précède générera le balisage suivant :

source: Input types
fr: Types d'entrées

source: A list of bundled input types/views:
fr: Une liste des types/vues de saisie inclus :

source: ``input/text`` - renders a text input ``<input type="text">``
fr: ``input/text`` - afficher une entrée texte ``<input type="text">``

source: ``input/plaintext`` - renders a textarea ``<textarea></textarea>``
fr: ``input/plaintext`` - affiche une zone de texte brut ``<textarea></textarea>``

source: ``input/longtext`` - renders a WYSIWYG text input
fr: ``input/longtext`` - affiche une zone de texte riche - avec éditeur WYSIWYG

source: ``input/url`` - renders a url input ``<input type="url">``
fr: ``input/url`` - affiche une entrée d'adresse web - URL ``<input type="url">``

source: ``input/email`` - renders an email input ``<input type="email">``
fr: ``input/email`` - affiche un champ de saisie de type e-mail ``<input type="email">``

source: ``input/checkbox`` - renders a single checkbox ``<input type="checkbox">``
fr: ``input/checkbox`` - affiche une case à cocher ``<input type="checkbox">``

source: ``input/checkboxes`` - renders a set of checkboxes with the same name
fr: ``input/checkboxes`` - affiche un jeu de cases à cocher portant le même nom

source: ``input/radio`` - renders one or more radio buttons ``<input type="radio">``
fr: ``input/radio`` - affiche un ou plusieurs bouton radio ``<input type="radio">``

source: ``input/submit`` - renders a submit button ``<button type="submit">``
fr: ``input/submit`` - affiche un bouton d'envoi ``<button type="submit">``

source: ``input/button`` - renders a button ``<button></button>``
fr: ``input/button`` - affiche un bouton ``<button></button>``

source: ``input/file`` - renders a file input ``<input type="file">``
fr: ``input/file`` - affiche un sélecteur de fichier ``<input type="file">``

source: ``input/select`` - renders a select input ``<select></select>``
fr: ``input/select`` - affiche une liste déroulante ``<select></select>``

source: ``input/hidden`` - renders a hidden input ``<input type="hidden">``
fr: ``input/hidden`` - affiche une entrée invisible ``<input type="hidden">``

source: ``input/password`` - renders a password input ``<input type="password">``
fr: ``input/password`` - affiche une entrée de type mot de passe ``<input type="password">``

source: ``input/number`` - renders a number input ``<input type="number">``
fr: ``input/number`` - affiche une entrée de type nombre ``<input type="number">``

source: ``input/date`` - renders a jQuery datepicker
fr: ``input/date`` - affiche un sélecteur de date jQuery

source: Elgg offers some helper input types
fr: Elgg offre quelques types de saisies facilitées

source: ``input/access`` - renders an Elgg access level select
fr: ``input/access`` - affiche une liste de niveaux d'accès Elgg

source: ``input/tags`` - renders an Elgg tags input
fr: ``input/tags`` - affiche une entrée de type tags

source: ``input/autocomplete`` - renders an Elgg entity autocomplete
fr: ``input/autocomplete`` - affiche un sélecteur d'entités Elgg

source: ``input/captcha`` - placeholder view for plugins to extend
fr: ``input/captcha`` - vue destinée à être étendue par des plugins

source: ``input/friendspicker`` - renders an Elgg friend autocomplete
fr: ``input/friendspicker`` - affiche un sélecteur de contact Elgg par autocomplétion

source: ``input/userpicker`` - renders an Elgg user autocomplete
fr: ``input/userpicker`` - affiche un sélecteur d'utilisateur Elgg avec autocomplétion

source: ``input/grouppicker`` - renders an Elgg group autocomplete
fr: ``input/grouppicker`` - affiche un sélecteur de groupe Elgg par autocomplétion
