Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: An absolute URL can be given in place of the path name.
fr: Une URL absolue peut être donnée à la place du nom du chemin.

source: Fetching views
fr: Récupérer des vues

source: Consider this view:
fr: Considérez cette vue :

source: Since it's a PHP file, we must register it for Ajax first:
fr: Comme il s’agit d’un fichier PHP, nous devons d’abord l’enregistrer pour Ajax :

source: To fetch the view, use ``ajax.view('<view_name>', options)``:
fr: Pour récupérer la vue, utilisez ``ajax.view('<view_name>', options)`` :

source: Notes for views:
fr: Notes pour les vues :

source: The 3 hooks (see Actions above) will have type ``view:<view_name>``. In this case, "view:myplugin/get_link".
fr: Les 3 hooks (voyez les Actions ci-dessus) auront le type ``view:<view_name>``. Dans ce cas, "view:myplugin/get_link".

source: ``output`` will be a string with the rendered view.
fr: ``output`` sera une chaîne avec le contenu de la vue générée.

source: The request data are injected into ``$vars`` in the view.
fr: Les données de la requête sont injectées dans la vue à l'intérieur de ``$vars``.

source: If the request data contains ``guid``, the system sets ``$vars['entity']`` to the corresponding entity or ``false`` if it can't be loaded.
fr: Si les données de la requête contiennent ``guid``, le système définit ``$vars['entity']`` à l’entité correspondante ou à ``false`` si elle ne peut pas être chargée.

source: In ajax views and forms, note that ``$vars`` can be populated by client input. The data is filtered like ``get_input()``, but may not be the type you're expecting or may have unexpected keys.
fr: Dans les vues et les formulaires ajax, notez que ``$vars`` peut être peuplé par les saisies du client. Les données sont filtrées comme avec ``get_input()``, mais peuvent ne pas avoir le type que vous attendez ou peuvent avoir des clefs inattendues.

source: Fetching forms
fr: Récupérer des formulaires

source: Consider we have a form view. We register it for Ajax:
fr: Considérez que nous avons une vue de formulaire. Nous l’enregistrons pour Ajax :

source: To fetch this using ``ajax.form('<action_name>', options)``.
fr: Pour récupérer ceci utilisez ``ajax.form('<action_name>', options)``.

source: Notes for forms:
fr: Notes pour les formulaires :

source: The 3 hooks (see Actions above) will have type ``form:<action_name>``. In this case, "form:myplugin/add".
fr: Les 3 hooks (voir Actions ci-dessus) auront le type ``form:<action_name>``. Dans ce cas, "form:myplugin/add".

source: The request data are injected into ``$vars`` in your form view.
fr: Les données de la requête sont injectées dans ``$vars`` dans la vue de votre formulaire.

source: Only the request data are passed to the requested form view (i.e. as a third parameter accepted by ``elgg_view_form()``). If you need to pass attributes or parameters of the form element rendered by the ``input/form`` view (i.e. normally passed as a second parameter to ``elgg_view_form()``), use the server-side event ``view_vars, input/form``.
fr: Seules les données de la requête sont transmises à la vue du formulaire demandé (c'est-à-dire en tant que troisième paramètre accepté par ``elgg_view_form()``). Si vous devez transmettre des attributs ou des paramètres de l'élément de formulaire rendus par la vue ``input/form`` (c'est-à-dire normalement passés comme deuxième paramètre à ``elgg_view_form()``), utilisez l'événement côté serveur ``view_vars , input/form``.

source: Submitting forms
fr: Envoyer des formulaires

source: To submit a form using Ajax, simply pass ``ajax`` parameter with form variables:
fr: Pour envoyer un formulaire avec Ajax, il suffit de passer le paramètre ``ajax`` avec des variables de formulaire :

source: Redirects
fr: Redirections

source: Use ``ajax.forward()`` to start a spinner and redirect the user to a new destination.
fr: Utilisez ``ajax.forward()`` pour démarrer une animation d'attente - spinner - et rediriger l’utilisateur vers une nouvelle destination.

source: Piggybacking on an Ajax request
fr: Réagir - "piggybacking" - lors d'une requête Ajax

source: The client-side ``ajax_request_data`` hook can be used to append or filter data being sent by an ``elgg/Ajax`` request.
fr: Le hook ``ajax_request_data`` côté client peut être utilisé pour ajouter ou filtrer les données envoyées par une demande ``elgg/Ajax``.

source: Let's say when the view ``foo`` is fetched, we want to also send the server some data:
fr: Supposons que lorsque la vue ``foo`` est récupérée, nous voulons également envoyer au serveur quelques données :

source: This data can be read server-side via ``get_input('bar');``.
fr: Ces données peuvent être lues côté serveur via ``get_input('bar');``.

source: If data was given as a string (e.g. ``$form.serialize()``), the request hooks are not triggered.
fr: Si les données ont été fournies sous forme de chaîne (par ex. ``$form.serialize()``), les hooks de requête ne sont pas déclenchés.

source: The form will be objectified as ``FormData``, and the request content type will be determined accordingly.
fr: Le formulaire sera transformé en objet nommé ``FormData``, et le type de contenu de la requête sera déterminé en conséquence.

source: Piggybacking on an Ajax response
fr: Réagir à une réponse Ajax

source: The server-side ``ajax_response`` event can be used to append or filter response data (or metadata).
fr: L'événement ``ajax_response`` côté serveur peut être utilisé pour ajouter ou filtrer les données de réponse (ou métadonnées).

source: Let's say when the view ``foo`` is fetched, we want to also send the client some additional data:
fr: Disons que lorsque la vue ``foo`` est récupérée, nous voulons également envoyer au client quelques données supplémentaires :

source: To capture the metadata send back to the client, we use the client-side ``ajax_response_data`` hook:
fr: Pour capturer les métadonnées renvoyées au client, nous utilisons le hook ``ajax_response_data`` côté client :

source: Only ``data.value`` is returned to the ``success`` function or available via the `Deferred` interface.
fr: Seule la valeur ``data.value`` est renvoyée à la fonction ``success``, ou disponible via l’interface `Deferred`.

source: Elgg uses these same hooks to deliver system messages over ``elgg/Ajax`` responses.
fr: Elgg utilise ces mêmes hooks pour diffuser des messages système via les réponses ``elgg/Ajax`` .

source: Handling errors
fr: Gérer les erreurs

source: Responses basically fall into three categories:
fr: Les réponses correspondent à l'une de ces trois catégories :

source: HTTP success (200) with status ``0``. No ``elgg_register_error_message()`` calls were made on the server.
fr: Succès HTTP (200) avec un statut ``0``. Aucun appel ``elgg_register_error_message()`` n'a été fait sur le serveur.

source: HTTP success (200) with status ``-1``. ``elgg_register_error_message()`` was called.
fr: Succès HTTP (200) avec le statut ``-1``. ``elgg_register_error_message()`` a été appelé.

source: HTTP error (4xx/5xx). E.g. calling an action with stale tokens, or a server exception. In this case the ``done`` callbacks are not called.
fr: Erreur HTTP (4xx/5xx). Par ex. appeler une action avec des jetons expirés, ou une exception sur le serveur. Dans ce cas les fonctions de callback ``done`` ne sont pas appelées.

source: The first and third case are the most common cases in the system. Use the ``done`` and ``fail`` callbacks to differentiate behaviour on success and error.
fr: Le premier et le troisième cas sont les plus courants dans le système. Utilisez les callbacks ``done`` et ``fail`` pour différencier le comportement en cas de succès et d'erreur.

source: Requiring ES modules
fr: Requérir des modules ES

source: Each response from an Ajax service will contain a list of ES modules required server side with `elgg_import_esm()`. When response data is unwrapped, these modules will be loaded asynchronously - plugins should not expect these modules to be loaded in their `$.done()` and `$.then()` handlers and must use `import` for any modules they depend on. Additionally modules should not expect the DOM to have been altered by an Ajax request when they are loaded - DOM events should be delegated and manipulations on DOM elements should be delayed until all Ajax requests have been resolved.
fr: Chaque réponse d’un service Ajax contiendra une liste de modules ES requis côté serveur avec `elgg_import_esm()`. Lorsque les données de réponse sont déballées, ces modules seront chargés de façon asynchrone - les plugins ne doivent pas s’attendre à ce que ces modules soient chargés dans leurs gestionnaires `$.done()` et `$.then()` et doivent utiliser `import` pour tous les modules dont ils dépendent. En outre, les modules ES ne doivent pas s’attendre à ce que le DOM ait été modifié par une demande Ajax lorsqu’ils sont chargés - les événements DOM doivent être délégués et les manipulations sur les éléments DOM doivent être retardées jusqu’à ce que toutes les requêtes Ajax aient été résolues.

source: Authentication
fr: Authentification

source: Elgg provides everything needed to authenticate users via username/email and password out of the box, including:
fr: Elgg fournit d'emblée tout ce qui est nécessaire pour authentifier les utilisateurs via le nom d’utilisateur/l'e-mail et le mot de passe, y compris :

source: remember-me cookies for persistent login
fr: cookie permanent pour une connexion persistante

source: password reset logic
fr: logique de réinitialisation de mot de passe

source: secure storage of passwords
fr: stockage sécurisé des mots de passe

source: logout
fr: déconnexion

source: UIs for accomplishing all of the above
fr: Interfaces utilisateurs - UI - pour accomplir tout ce qui précède

source: All that's left for you to do as a developer is to use the built-in authentication functions to secure your pages and actions.
fr: Il ne vous reste plus en tant que développeur qu’à utiliser les fonctions d’authentification intégrées pour sécuriser vos pages et vos actions.

source: Working with the logged in user
fr: Travailler avec l’utilisateur connecté

source: Check whether the current user is logged in with ``elgg_is_logged_in()``:
fr: Vérifiez si l’utilisateur actuel est connecté avec ``elgg_is_logged_in()`` :

source: Check if the current user is an admin with ``elgg_is_admin_logged_in()``:
fr: Vérifiez si l’utilisateur actuel est un administrateur avec ``elgg_is_admin_logged_in()`` :

source: Get the currently logged in user with ``elgg_get_logged_in_user_entity()``:
fr: Récupérez l’utilisateur actuellement connecté avec ``elgg_get_logged_in_user_entity()`` :

source: The returned object is an ``ElggUser`` so you can use all the methods and properties of that class to access information about the user. If the user is not logged in, this will return ``null``, so be sure to check for that first.
fr: L’objet retourné est un ``ElggUser`` de sorte que vous pouvez utiliser toutes les méthodes et propriétés de cette classe pour accéder à des informations sur l’utilisateur. Si l’utilisateur n’est pas connecté, cela vous renvoie ``null``, aussi assurez-vous de vérifier cela en premier.

source: Gatekeepers
fr: Gestionnaires d'accès - gatekeepers

source: Gatekeeper functions allow you to manage how code gets executed by applying access control rules.
fr: Les fonctions de gestion d'accès "gatekeeper" vous permettent de gérer l’exécution du code en appliquant des règles de contrôle d’accès.

source: Forward a user to the front page if they are not logged in with ``elgg_gatekeeper()``:
fr: Redirigez vers la page d'accueil un utilisateur qui n’est pas connecté avec ``elgg_gatekeeper()`` :

source: Forward a user to the front page unless they are an admin with ``elgg_admin_gatekeeper()``:
fr: Redirigez vers la page d'accueil un utilisateur, sauf s'il s'agit d'un administrateur avec ``elgg_admin_gatekeeper()`` :

source: Pluggable Authentication Modules
fr: Modules d'authentification enfichables - Pluggable Authentication Modules

source: Elgg has support for Pluggable Authentication Modules (PAM), which enables you to write your own authentication handlers. Whenever a request needs to get authenticated the system will call ``elgg_pam_authenticate()`` which probes the registered PAM handlers until one returns success.
fr: Elgg est compatible avec des modules d'authentification enfichables (PAM = Pluggable Authentication Modules), qui vous permettent d'écrire vos propres gestionnaires d'authentification. A chaque fois qu'une requête a besoin d'être authentifiée, le système va appeler ``elgg_pam_authenticate()`` qui va vérifier tous les gestionnaires de PAM enregistrés jusqu'à-ce que l'un d'entre eux renvoie un succès.

source: The preferred approach is to create a separate Elgg plugin which will have one simple task: to process an authentication request. This involves setting up an authentication handler in the plugin's :doc:`Bootstrap <plugins>` class, and to register it with the PAM module so it will get processed whenever the system needs to authenticate a request.
fr: L’approche privilégiée est de créer un plugin Elgg séparé qui aura une tâche simple : traiter une demande d’authentification. Il s’agit de configurer un gestionnaire d’authentification dans la classe :doc:`Bootstrap <plugins>`, et de l’enregistrer auprès du module PAM pour traité chaque fois que le système doit authentifier une requête.

source: The authentication handler is a function and takes a single parameter. Registering the handler is being done by ``elgg_register_pam_handler()`` which takes the name of the authentication handler, the importance and the policy as parameters. It is advised to register the handler in the plugin's init function, for example:
fr: Le gestionnaire d’authentification est une fonction qui prend un seul paramètre. L’enregistrement du gestionnaire se fait par ``elgg_register_pam_handler()`` qui prend le nom du gestionnaire d’authentification, l’importance et la politique de validité comme paramètres. Il est conseillé d’enregistrer le gestionnaire dans la fonction d'initialisation du plugin, par exemple :

source: By default an authentication module is registered with an importance of **sufficient**.
fr: Par défaut, un module d’authentification est enregistré avec une importance **suffisante**.

source: In a list of authentication modules; if any one marked *sufficient* returns ``true``, ``elgg_pam_authenticate()`` will also return ``true``. The exception to this is when an authentication module is registered with an importance of **required**. All required modules must return ``true`` for ``elgg_pam_authenticate()`` to return ``true``, regardless of whether all sufficient modules return ``true``.
fr: Dans une liste de modules d’authentification ; si n'importe lequel des modules marqués *sufficient* renvoie ``true``, ``elgg_pam_authenticate()`` renverra également ``true``. L’exception à cela est lorsqu’un module d’authentification est enregistré avec une importance marquée **required**. Tous ces modules requis doivent renvoyer ``true`` pour que ``elgg_pam_authenticate()`` renvoie ``true``, indépendamment du fait que les modules suffisants renvoient ``true``.

source: Passed credentials
fr: Informations d’identification transmises

source: The format of the credentials passed to the handler can vary, depending on the originating request. For example, a regular login via the login form will create a named array, with the keys ``username`` and ``password``. If a request was made for example via XML-RPC then the credentials will be set in the HTTP header, so in this case nothing will get passed to the authentication handler and the handler will need to perform steps on its own to authenticate the request.
fr: Le format des informations d’identification transmises au gestionnaire peut varier en fonction de la demande d’origine. Par exemple, une connexion classique via le formulaire de connexion créera un tableau indexé, avec les clefs ``username`` et ``password``. Si une requête a été faite par exemple via XML-RPC, les informations d’identification seront définies dans l’entête HTTP, de sorte que dans ce cas rien ne sera transmis au gestionnaire d’authentification, et que le gestionnaire devra effectuer ses propres étapes pour authentifier la demande.

source: Return value
fr: Valeur de retour

source: The authentication handle should return a ``boolean``, indicating if the request could be authenticated or not. One caveat is that in case of a regular user login where credentials are available as username and password the user will get logged in. In case of the XML-RPC example the authentication handler will need to perform this step itself since the rest of the system will not have any idea of either possible formats of credentials passed nor its contents. Logging in a user is quite simple and is being done by ``elgg_login()``, which expects an ``ElggUser`` object.
fr: Le gestionnaire d’authentification doit renvoyer un ``booléen``, indiquant si la demande peut être authentifiée ou non. Une mise en garde est que dans le cas d’une connexion utilisateur classique où les informations d’identification sont disponibles sous la forme d'un nom d’utilisateur et d'un mot de passe, l’utilisateur sera connecté. Dans le cas de l’exemple XML-RPC, le gestionnaire d’authentification devra effectuer cette étape lui-même puisque le reste du système n’aura aucune idée des formats possibles des informations d’authentification passées ni de leur contenu. La connexion d'un utilisateur est assez simple et se fait par ``login()``, qui s’attend à recevoir un objet ``ElggUser``.

source: Capabilities
fr: Capacités

source: Entity Capabilities
fr: Capacités des entités

source: Defining capabilities
fr: Définition des capacités

source: There is no need to explicitly define or register a new capability to the system. For example the `search` plugin uses the `searchable` capability.
fr: Il n'est pas nécessaire de définir ou d'enregistrer explicitement une nouvelle capacité dans le système. Par exemple, le plugin `search` utilise la capacité `searchable`.

source: Registering for capabilities
fr: Enregistrement des capacités

source: If an entity supports a certain capability (or feature) this should be registered in the system. This can be done by registering the capability in the `entities` section of the `elgg-plugin.php` of the plugin.
fr: Si une entité prend en charge une certaine capacité (ou fonctionnalité), celle-ci doit être enregistrée dans le système. Cela peut être fait en enregistrant la capacité dans la section `entities` du `elgg-plugin.php` du plugin.

source: There is also the option to enable (or disable) a capability for a certain entity type/subtype using one of the following functions:
fr: Il existe également une option pour activer (ou désactiver) une capacité pour un certain type/sous-type d'entité à l'aide de l'une des fonctions suivantes :

source: ``elgg_entity_enable_capability($type, $subtype, $capability)`` use this for enabling a certain capability
fr: ``elgg_entity_enable_capability($type, $subtype, $capability)`` utilisez ceci pour activer une certaine capacité

source: ``elgg_entity_disable_capability($type, $subtype, $capability)`` use this for disabling a certain capability
fr: ``elgg_entity_disable_capability($type, $subtype, $capability)`` utilisez ceci pour désactiver une certaine capacité

source: Checking for capabilities
fr: Vérification des capacités

source: There are helper functions to check if a certain capability is supported in the system. You can check if an entity supports a certain capability using the `$entity->hasCapability($capability)` function. Alternatively if you do not have an entity at your disposal, you can use `elgg_entity_has_capability($type, $subtype, $capability)`.
fr: Il existe plusieurs fonctions d'aide pour vérifier si une certaine capacité est prise en charge dans le système. Vous pouvez vérifier si une entité prend en charge une certaine capacité en utilisant la fonction `$entity->hasCapability($capability)`. Alternativement, si vous n'avez pas d'entité à votre disposition, vous pouvez utiliser `elgg_entity_has_capability($type, $subtype, $capability)`.

source: There is also a function available to get an array of all type/subtypes in the system that support a certain capability.
fr: Il existe également une fonction pour obtenir un tableau de tous les types/sous-types du système prenant en charge une certaine capacité.

source: Context
fr: Contexte

source: The contents of this page are outdated. While the functionality is still in place, using global context to determine your business logic is bad practice, and will make your code less testable and succeptive to bugs.
fr: Le contenu de cette page est obsolète. Bien que la fonctionnalité soit toujours en place, l’utilisation du contexte global pour déterminer votre logique de fonctionnement est une mauvaise pratique, et rendra votre code moins testable et plus sujet aux bogues.

source: Within the Elgg framework, context can be used by your plugin's functions to determine if they should run or not. You will be registering callbacks to be executed when particular :doc:`events are triggered <events-list>`. Sometimes the events are generic and you only want to run your callback when your plugin caused the event to be triggered. In that case, you can use the page's context.
fr: Au sein du framework Elgg, le contexte peut être utilisé par les fonctions de votre plugin pour déterminer s’ils doivent s’exécuter ou non. Vous allez enregistrer des fonctions de rappel à exécuter lorsque des :doc:`événements sont déclenchés <events-list>`. Parfois, les événements sont génériques et vous souhaitez uniquement exécuter votre fonction de rappel quand votre plugin est à l'origine du déclenchement de l’événement. Dans ce cas, vous pouvez utiliser le contexte de la page.

source: You can explicitly set the context with ``set_context()``. The context is a string and typically you set it to the name of your plugin. You can retrieve the context with the function ``get_context()``. It's however better to use ``elgg_push_context($string)`` to add a context to the stack. You can check if the context you want in in the current stack by calling ``elgg_in_context($context)``. Don't forget to pop (with ``elgg_pop_context()``) the context after you push one and don't need it anymore.
fr: Vous pouvez définir explicitement le contexte avec ``set_context()``. Le contexte est une chaîne de caractères, et généralement vous la définissez au nom de votre plugin. Vous pouvez récupérer le contexte avec la fonction ``get_context()``. Il est toutefois préférable d’utiliser ``elgg_push_context($string)`` pour ajouter un contexte à la pile. Vous pouvez vérifier si le contexte que vous souhaitez ajouter est déjà dans la pile actuelle en appelant ``elgg_in_context($context)``. N’oubliez pas de dépiler (avec ``elgg_pop_context()``) le contexte après l'avoir empilé, si vous n’en avez plus besoin.

source: If you don't set it, Elgg tries to guess the context. If the page was called through the router, the context is set to the first segment of the current route, e.g. ``profile`` in ``profile/username``.
fr: Si vous ne le définissez pas, Elgg essaie de deviner le contexte. Si la page a été appelée via le routeur, le contexte est défini sur le premier segment de la route actuelle, par exemple ``profile`` dans ``profile/username``.
