Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Triggered by ``elgg_send_email()``. Applies to all outgoing system and notification emails. This event allows you to alter an instance of ``\Elgg\Email`` before it is passed to the email transport. This event can be used to alter the sender, recipient, subject, body, and/or headers of the email.
fr: Déclenché par ``elgg_send_email()``. S’applique à tous les emails système et de notification sortants. Cet événement vous permet de modifier une instance de ``\Elgg\Email`` avant qu'elle soit transmise à l'agent de transport de courrier électronique. Cet événement peut être utilisé pour modifier l'expéditeur, le destinataire, l'objet, le corps et/ou les entêtes de l'email.

source: ``$params`` are empty. The ``$return`` value is an instance of ``\Elgg\Email``.
fr: ``$params`` est vide. La valeur de retour ``$return`` est une instance de ``\Elgg\Email``.

source: Triggered by ``elgg_send_email()``. Applies to all outgoing system and notification emails. This event allows you to implement a custom email transport, e.g. delivering emails via a third-party proxy service such as SendGrid or Mailgun. The handler must return ``true`` to indicate that the email was transported.
fr: Déclenché par ``elgg_send_email()``. S’applique à tous les emails système et de notification sortants. Cet événement vous permet d'implémenter un transport de courrier électronique personnalisé, par ex. envoyer des emails via un service proxy tiers tel que SendGrid ou Mailgun. Le gestionnaire doit retourner ``true`` pour indiquer que l'email a bien été transporté.

source: ``$params`` contains:
fr: ``$params`` contient :

source: ``email`` - An instance of ``\Elgg\Email``
fr: ``email`` - Une instance de ``\Elgg\Email``

source: Triggered by ``elgg_send_email()``. Applies to all outgoing system and notification emails. This event allows you to suppress or whitelist outgoing emails, e.g. when the site is in a development mode. The handler must return ``false`` to supress the email delivery.
fr: Déclenché par ``elgg_send_email()``. S’applique à tous les emails système et de notification sortants. Cet événement vous permet de supprimer ou de mettre sur liste blanche les emails sortants, par ex. lorsque le site est en mode développement. Le gestionnaire doit retourner ``false`` pour supprimer l'envoi du courrier électronique.

source: Triggered by the default email transport handler (Elgg uses ``laminas/laminas-mail``). Applies to all outgoing system and notification emails that were not transported using the **transport, system:email** event. This event allows you to alter an instance of ``\Laminas\Mail\Message`` before it is passed to the Laminas email transport.
fr: Déclenché par le gestionnaire de transport de courrier électronique par défaut (Elgg utilise ``laminas/laminas-mail``). S'applique à tous les emails système et de notification sortants qui n'ont pas été transportés à l'aide de l'événement **transport, system:email**. Cet événement vous permet de modifier une instance de ``\Laminas\Mail\Message`` avant qu'elle soit transmise au transport de courrier électronique Laminas.

source: File events
fr: Événements des fichiers

source: Allows plugins to filter the download URL of the file.
fr: Permet aux plugins de filtrer l’URL de téléchargement du fichier.

source: By default, the download URL is generated by the file service.
fr: Par défaut, l’URL de téléchargement est générée par le service de fichiers.

source: ``entity`` - instance of ``ElggFile``
fr: ``entity`` - instance de ``ElggFile``

source: ``use_cookie`` - whether or not to use a cookie to secure download link
fr: ``use_cookie`` - utiliser ou non un cookie pour sécuriser le lien de téléchargement

source: ``expires`` - a string representation of when the download link should expire
fr: ``expires`` - une représentation sous forme de chaîne indiquant quand le lien de téléchargement doit expirer

source: Allows plugins to filter the inline URL of the image file.
fr: Permet aux plugins de filtrer l’URL en ligne du fichier image.

source: By default, the inline URL is generated by the file service.
fr: Par défaut, l’URL en ligne - inline - est générée par le service de fichiers.

source: Return the mimetype for the filename ``$params['filename']`` with original filename ``$params['original_filename']`` and with the default detected mimetype of ``$params['default']``.
fr: Renvoie le type MIME pour le nom de fichier ``$params['filename']`` avec le nom de fichier original ``$params['original_filename']`` et avec le type MIME détecté par défaut de ``$params['default']``.

source: The event provides ``$params['mime_type']`` (e.g. ``application/pdf`` or ``image/jpeg``) and determines an overall category like ``document`` or ``image``. The bundled file plugin and other-third party plugins usually store ``simpletype`` metadata on file entities and make use of it when serving icons and constructing ``ege*`` filters and menus.
fr: L'événement fournit ``$params['mime_type']`` (par exemple ``application/pdf`` ou ``image/jpeg``) et détermine une catégorie globale comme ``document`` ou ``image``. Le plugin file fourni et les autres plugins tiers stockent généralement les métadonnées ``simpletype`` sur les entités de fichiers et les utilisent lors du service d'icônes et de la construction de filtres et de menus ``ege*``.

source: Allows plugins to implement custom logic for moving an uploaded file into an instance of ``ElggFile``. The handler must return ``true`` to indicate that the uploaded file was moved. The handler must return ``false`` to indicate that the uploaded file could not be moved. Other returns will indicate that ``ElggFile::acceptUploadedFile`` should proceed with the default upload logic.
fr: Permet aux plugins d’implémenter une logique personnalisée pour déplacer un fichier téléchargé dans une instance de ElggFile. Le gestionnaire doit renvoyer ``true`` pour indiquer que le fichier téléchargé a été déplacé. Le gestionnaire doit renvoyer ``false`` pour indiquer que le fichier téléchargé n’a pas pu être déplacé. D’autres valeurs de retour indiqueront que ``ElggFile::acceptUploadedFile`` devrait poursuivre la logique de téléchargement par défaut.

source: ``file`` - instance of ``ElggFile`` to write to
fr: ``file`` - instance de ``ElggFile`` dans laquelle écrire

source: ``upload`` - instance of Symfony's ``UploadedFile``
fr: ``upload`` - instance de ``UploadedFile`` de Symfony

source: Called after an uploaded file has been written to filestore. Receives an instance of ``ElggFile`` the uploaded file was written to. The ``ElggFile`` may or may not be an entity with a GUID.
fr: Appelé après qu’un fichier téléchargé a été écrit dans le répertoire de fichiers. Reçoit une instance du ``ElggFile`` dans lequel le fichier téléchargé a été écrit. Le ``ElggFile`` peut ou non être une entité avec un GUID.

source: Action events
fr: Événements des actions

source: Trigger before action script/controller is executed. This event should be used to validate/alter user input, before proceeding with the action. The event handler can throw an instance of ``\Elgg\Exceptions\Http\ValidationException`` or return ``false`` to terminate further execution.
fr: Déclenchement avant l'exécution du script d'action/du contrôleur. Cet événement doit être utilisé pour valider/modifier la saisie de l'utilisateur, avant de poursuivre l'action. Le gestionnaire d'événements peut lancer une instance de ``\Elgg\Exceptions\Http\ValidationException`` ou renvoyer ``false`` pour interrompre l'exécution.

source: ``request`` - instance of ``\Elgg\Request``
fr: ``request`` - instance de ``\Elgg\Request``

source: Triggered after a CSRF token is validated. Return false to prevent validation.
fr: Déclenché après la validation d’un jeton CSRF. Renvoyez false pour empêcher la validation.

source: Filter the URL to forward a user to when ``forward($url, $reason)`` is called. In certain cases, the ``params`` array will contain an instance of ``\Elgg\Exceptions\HttpException`` that triggered the error.
fr: Filtre l’URL pour rediriger un utilisateur lorsque ``forward($url, $reason)`` est appelé. Dans certains cas, le tableau ``params`` va contenir une instance de ``\Elgg\Exceptions\HttpException`` qui a déclenché l’erreur.

source: Filter an instance of ``\Elgg\Http\ResponseBuilder`` before it is sent to the client. This event can be used to modify response content, status code, forward URL, or set additional response headers. Note that the ``<action>`` value is parsed from the request URL, therefore you may not be able to filter the responses of `action()` calls if they are nested within the another action script file.
fr: Filtrez une instance de ``\Elgg\Http\ResponseBuilder`` avant qu'elle ne soit envoyée au client. Cet événement peut être utilisé pour modifier le contenu de la réponse, le code d'état, l'URL de transfert ou définir des en-têtes de réponse supplémentaires. Notez que la valeur ``<action>`` est analysée à partir de l'URL de la requête, vous ne pourrez donc peut-être pas filtrer les réponses des appels `action()` si elles sont imbriquées dans un autre fichier de script d'action.

source: elgg/Ajax method
fr: méthode elgg/Ajax

source: event type
fr: type d'événement

source: Filters ``action/`` responses before they're sent back to the ``elgg/Ajax`` module.
fr: Filtre les réponses ``action/`` avant qu’elles soient renvoyées au module ``elgg/Ajax``.

source: Filters ajax responses before they're sent back to the ``elgg/Ajax`` module. This event type will only be used if the path did not start with "action/" or "ajax/".
fr: Filtre les réponses ajax avant qu'elles soient renvoyées au module ``elgg/Ajax``. Ce type d'événement ne sera utilisé que si le chemin ne commence pas par "action/" ou "ajax/".

source: Filters ``ajax/view/`` responses before they're sent back to the ``elgg/Ajax`` module.
fr: Filtre les réponses ``ajax/view/`` avant qu’elles soient renvoyées au module ``elgg/Ajax``.

source: Filters ``ajax/form/`` responses before they're sent back to the ``elgg/Ajax`` module.
fr: Filtre les réponses ``ajax/form/`` avant qu’elles soient renvoyées au module ``elgg/Ajax``.

source: Routing
fr: Routage

source: Filter an instance of ``\Elgg\Http\ResponseBuilder`` before it is sent to the client. This event type will only be used if the path did not start with "action/" or "ajax/". This event can be used to modify response content, status code, forward URL, or set additional response headers. Note that the ``<path>`` value is parsed from the request URL, therefore plugins using the ``route`` event should use the original ``<path>`` to filter the response, or switch to using the ``route:rewrite`` event.
fr: Filtre une instance de ``\Elgg\Http\ResponseBuilder`` avant qu'elle ne soit envoyée au client. Ce type d'événement ne sera utilisé que si le chemin ne commence pas par "action/" ou "ajax/". Cet événement peut être utilisé pour modifier le contenu de la réponse, le code d'état, l'URL de transfert ou définir des entêtes de réponse supplémentaires. Notez que la valeur ``<path>`` est analysée à partir de l'URL de la requête, donc les plugins utilisant l'événement ``route`` doivent utiliser le ``<path>`` d'origine pour filtrer la réponse, ou passer à l'utilisation de ``route:rewrite`` événement.

source: Allows altering the route configuration before it is registered. This event can be used to alter the path, default values, requirements, as well as to set/remove middleware. Please note that the handler for this event should be registered outside of the ``init`` event handler, as core routes are registered during ``plugins_boot`` event.
fr: Permet de modifier la configuration de la route avant son enregistrement. Cet événement peut être utilisé pour modifier le chemin, les valeurs par défaut, les pré-requis, ainsi que pour définir/supprimer un middleware. Veuillez noter que le gestionnaire de cet événement doit être enregistré en dehors du gestionnaire d'événement ``init``, car les routes principales sont enregistrées lors de l'événement ``plugins_boot``.

source: Allows altering the site-relative URL path for an incoming request. See :doc:`routing` for details. Please note that the handler for this event should be registered outside of the ``init`` event handler, as route rewrites take place after ``plugins_boot`` event has completed.
fr: Permet de modifier le chemin de l'URL relative au site pour une demande entrante. Voir :doc:`routing` pour plus de détails. Veuillez noter que le gestionnaire de cet événement doit être enregistré en dehors du gestionnaire d'événement ``init``, car les réécritures de route ont lieu après la fin de l'événement ``plugins_boot``.

source: Views
fr: Vues

source: Allows changes to individual attributes.
fr: Permet de modifier des attributs individuels.

source: Configure allowed styles for HTMLawed.
fr: Configure les styles autorisés pour HTMLawed.

source: Filter the HTMLawed ``$config`` array.
fr: Filtre le tableau HTMLawed ``$config``.

source: Prepare field values for use in the form. Eg. when editing a blog, fill this with the current values of the blog. Sticky form values will automatically be added to the field values (when available).
fr: Préparez les valeurs des champs à utiliser dans le formulaire. Par ex. lors de la modification d'un blog, remplissez-le avec les valeurs actuelles du blog. Les valeurs du formulaire collant seront automatiquement ajoutées aux valeurs des champs (si disponibles).

source: In ``elgg_view_page()``, filters ``$vars['head']`` Return value contains an array with ``title``, ``metas`` and ``links`` keys, where ``metas`` is an array of elements to be formatted as ``<meta>`` head tags, and ``links`` is an array of elements to be formatted as ``<link>`` head tags. Each meta and link element contains a set of key/value pairs that are formatted into html tag attributes, e.g.
fr: Dans ``elgg_view_page()``, filtre la valeur de retour de ``$vars['head']``, qui contient un tableau avec les clefs ``title``, ``metas`` et ``links``, où ``metas`` est un tableau d’éléments à formater sous la forme de balises d'entête ``<meta>``, et ``links`` est un tableau d’éléments à formater sous la forme de baslises d'entête ``<link>``. Chaque élément meta et link contient un ensemble de paires de clés/valeurs qui sont formatées en attributs de balise html, par ex.

source: In ``elgg_view_layout()``, filters the layout name. ``$params`` array includes:
fr: Dans ``elgg_view_layout()``, filtre le nom de la disposition. Le tableau ``$params`` comprend :

source: ``identifier`` - ID of the page being rendered
fr: ``identifier`` - identifiant de la page en cours de rendu

source: ``segments`` - URL segments of the page being rendered
fr: ``segments`` - Segments d’URL de la page en cours de rendu

source: other ``$vars`` received by ``elgg_view_layout()``
fr: autres ``$vars`` reçues par ``elgg_view_layout()``

source: Filter an instance of ``\Elgg\Http\ResponseBuilder`` before it is sent to the client. Applies to request to ``/ajax/form/<form_name>``. This event can be used to modify response content, status code, forward URL, or set additional response headers.
fr: Filtrez une instance de ``\Elgg\Http\ResponseBuilder`` avant qu'elle ne soit envoyée au client. S'applique à la demande adressée à ``/ajax/form/<form_name>``. Cet événement peut être utilisé pour modifier le contenu de la réponse, le code d'état, l'URL de transfert ou définir des entêtes de réponse supplémentaires.

source: Filter an instance of ``\Elgg\Http\ResponseBuilder`` before it is sent to the client. Applies to request to ``/ajax/view/<view_name>``. This event can be used to modify response content, status code, forward URL, or set additional response headers.
fr: Filtrez une instance de ``\Elgg\Http\ResponseBuilder`` avant qu'elle soit envoyée au client. S'applique à la requête adressée à ``/ajax/view/``. Cet événement peut être utilisé pour modifier le contenu de la réponse, le code d'état, l'URL de transfert ou définir des entêtes de réponse supplémentaires.

source: In ``elgg_view_page()``, filters the page shell name
fr: Dans ``elgg_view_page()``, filtre le nom de la coquille - page shell - de la page

source: Filter the HTMLawed ``$spec`` string (default empty).
fr: Filtre la chaîne HTMLawed ``$spec`` (vide par défaut).

source: When the method ``elgg()->table_columns->$name()`` is called, this event is called to allow plugins to override or provide an implementation. Handlers receive the method arguments via ``$params['arguments']`` and should return an instance of ``Elgg\Views\TableColumn`` if they wish to specify the column directly.
fr: Lorsque la méthode ``elgg()->table_columns->$name()`` est appelée, cet événement est appelé pour permettre aux plugins de remplacer ou de fournir une implémentation. Les gestionnaires reçoivent les arguments de la méthode via ``$params['arguments']`` et doivent renvoyer une instance de ``Elgg\Views\TableColumn`` s'ils souhaitent spécifier la colonne directement.

source: Allows plugins to alter CSS variables passed to CssCrush during compilation. See `CSS variables <_guides/theming#css-vars>`.
fr: Permet aux plugins de modifier les variables CSS transmises à CssCrush pendant la compilation. Voyez les `variables CSS <_guides/theming#css-vars>`.

source: Filters the returned content of the view
fr: Filtre le contenu renvoyé par la vue

source: Filters the ``$vars`` array passed to the view
fr: Filtre le tableau ``$vars`` passé à la vue

source: Search
fr: Recherche

source: Implemented in the **search** plugin. Filters an array of custom search types. This allows plugins to add custom search types (e.g. tag or location search). Adding a custom search type will extend the search plugin user interface with appropriate links and lists.
fr: Implémenté dans le plugin **search**. Filtre un tableau de types de recherche personnalisés. Cela permet aux plugins d’ajouter des types de recherche personnalisés (par ex. une recherche par mots-clefs ou par localisation géographique). L’ajout d’un type de recherche personnalisé permettra d’étendre l’interface utilisateur du plugin de recherche avec des liens et des listes appropriés.

source: Implemented in the **search** plugin. Filters entity type/subtype pairs before entity search is performed. Allows plugins to remove certain entity types/subtypes from search results, group multiple subtypes together, or to reorder search sections.
fr: Implémenté dans le plugin **search**. Filtre les paires de types/sous-types d’entités avant l’exécution de la recherche d’entité. Permet aux plugins de supprimer certains types/sous-types d’entités des résultats de recherche, de regrouper plusieurs sous-types, ou de réorganiser des sections de recherche.

source: Triggered by ``elgg_search()``. Filters search fields before search clauses are prepared. ``$return`` value contains an array of names for each entity property type, which should be matched against the search query. ``$params`` array contains an array of search params passed to and filtered by ``elgg_search()``.
fr: Déclenché par ``elgg_search()``. Filtre les champs de recherche avant que les clauses de recherche ne soient préparées. La valeur ``$return`` contient un tableau avec les noms de chaque type de propriété d’entité, qui devrait être comparé à la requête de recherche. Le tableau ``$params`` contient un tableau de paramètres de recherche transmis et filtrés par ``elgg_search()``.

source: See **search:fields, <entity_type>**
fr: Voyez **search:fields, <entity_type>**

source: Implemented in the **search** plugin. Allows plugins to populate entity's volatile data before it's passed to search view. This is used for highlighting search hit, extracting relevant substrings in long text fields etc.
fr: Implémenté dans le plugin **search**. Permet aux plugins de renseigner les données volatiles de l’entité avant qu’elles ne soient transmises à la vue de recherche. Ceci est utilisé pour mettre en surbrillance les correspondances de la recherche, extraire les sous-chaînes pertinentes dans les champs de texte long, etc.

source: Triggered by ``elgg_search()``. Prepares search clauses (options) to be passed to ``elgg_get_entities()``.
fr: Déclenché par ``elgg_search()``. Prépare les clauses de recherche (options) à transmettre à ``elgg_get_entities()``.

source: See **search:options, <entity_type>**
fr: Voyez **search:options, <entity_type>**

source: Triggered by ``elgg_search()``. Filters search parameters (query, sorting, search fields etc) before search clauses are prepared for a given search type. Elgg core only provides support for ``entities`` search type.
fr: Déclenché par ``elgg_search()``. Filtre les paramètres de recherche (requête, tri, champs de recherche, etc.) avant que les clauses de recherche ne soient préparées pour un type de recherche donné. Le noyau de Elgg ne prend en charge que le type de recherche ``entities``.

source: Triggered by ``elgg_search()``. Receives normalized options suitable for ``elgg_get_entities()`` call and must return an array of entities matching search options. This event is designed for use by plugins integrating third-party indexing services, such as Solr and Elasticsearch.
fr: Déclenché par ``elgg_search()``. Reçoit les options normalisées adaptées à l'appel ``elgg_get_entities()`` et doit renvoyer un tableau d'entités correspondant aux options de recherche. Cet événement est conçu pour être utilisé par des plugins intégrant des services d'indexation tiers, tels que Solr et Elasticsearch.

source: Other
fr: Autres

source: Filters the number of comments displayed per page. Default is 25. ``$params['entity']`` will hold the containing entity or null if not provided. Use ``elgg_comments_per_page()`` to get the value.
fr: Filtre le nombre de commentaires affichés par page. La valeur par défaut est 25. ``$params['entity']`` contiendra l'entité contenant ou null si elle n'est pas fournie. Utilisez ``elgg_comments_per_page()`` pour obtenir la valeur.

source: Filters the order of comments. Default is ``true`` for latest first. ``$params['entity']`` will hold the containing entity or null if not provided.
fr: Filtre l’ordre des commentaires. Vaut ``true`` par défaut pour le plus récent en premier. ``$params['entity']`` indique l’entité contenante, ou null si elle n’est pas fournie.

source: In ``elgg_get_default_access()``, this event filters the return value, so it can be used to alter the default value in the input/access view. For core plugins, the value "input_params" has the keys "entity" (ElggEntity|false), "entity_type" (string), "entity_subtype" (string), "container_guid" (int) are provided. An empty entity value generally means the form is to create a new object.
fr: Dans ``elgg_get_default_access()``, cet événement filtre la valeur de retour, afin de pouvoir l'utiliser pour modifier la valeur par défaut dans la vue input/access. Pour les plugins principaux, la valeur "input_params" fournit les clés "entity" (ElggEntity|false), "entity_type" (string), "entity_subtype" (string), "container_guid" (int). Une valeur d'entité vide signifie généralement que le formulaire doit créer un nouvel objet.

source: Can be used to filter CSS classes applied to icon glyphs. By default, Elgg uses FontAwesome. Plugins can use this event to switch to a different font family and remap icon classes.
fr: Peut être utilisé pour filtrer les classes CSS appliquées aux glyphes d'icônes. Par défaut, Elgg utilise FontAwesome. Les plugins peuvent utiliser cet événement pour passer à une autre famille de polices et remapper les classes d'icônes.
