Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: The private API Key provided by Elgg (that is companion to the public key)
fr: La clef privée d'API fournie par Elgg (qui accompagne la clef publique)

source: The current unix time in seconds
fr: L'heure unix actuelle en secondes

source: A nonce to guarantee two requests the same second have different signatures
fr: Une valeur "nonce" créée pour l'occasion afin de garantir que deux requêtes faites à la même seconde ont des signatures différentes

source: URL encoded string representation of any GET variable parameters, eg ``method=test.test&foo=bar``
fr: Une représentation encodée pour l'URL de la chaîne de caractères des paramètres GET, par ex. ``method=test.test&foo=bar``

source: If you are sending post data, the hash of this data
fr: Si vous envoyez des données post, le hash de ces données

source: Some extra information must be added to the HTTP header in order for this data to be correctly processed:
fr: Quelques informations supplémentaires doivent être ajoutées à l'entête HTTP pour que ces données soient traitées correctement :

source: **X-Elgg-apikey** - The public API key
fr: **X-Elgg-apikey** - La clef publique d'API

source: **X-Elgg-time** - Unix time used in the HMAC calculation
fr: **X-Elgg-time** - L'heure Unix utilisée dans le calcul HMAC

source: **X-Elgg-nonce** - a random string
fr: **X-Elgg-nonce** - une chaîne aléatoire

source: **X-Elgg-hmac** - The HMAC as base64 encoded
fr: **X-Elgg-hmac** - Le HMAC encodé en base64

source: **X-Elgg-hmac-algo** - The algorithm used in the HMAC calculation
fr: **X-Elgg-hmac-algo** - L’algorithme utilisé dans le calcul HMAC

source: If you are sending POST data you must also send:
fr: Si vous envoyez des données POST vous devez également envoyer :

source: **X-Elgg-posthash** - The hash of the POST data
fr: **X-Elgg-posthash** - Le hash des données POST

source: **X-Elgg-posthash-algo** - The algorithm used to produce the POST data hash
fr: **X-Elgg-posthash-algo** - Algorithme utilisé pour le hachage des données POST

source: **Content-Length** - The length in bytes of your POST data
fr: **Content-Length** - La longueur en octets de vos données POST

source: Elgg provides a sample API client that implements this HMAC signature: ``\Elgg\WebServices\ElggApiClient``. It serves as a good reference on how to implement it.
fr: Elgg fournit un exemple de client API qui implémente cette signature HMAC : ``\Elgg\WebServices\ElggApiClient``. Il constitue une bonne référence sur la manière de le mettre en œuvre.

source: Supported hashing algorithms
fr: Algorithmes de hachage pris en charge

source: ``sha256``: recommended
fr: ``sha256`` : recommandé

source: ``sha1``: fast however less secure
fr: ``sha1`` : rapide mais moins sûr

source: ``md5``: weak and will be removed in the future
fr: ``md5`` : faible et sera supprimé à l’avenir

source: POST hash calculation
fr: Calcul du hachage POST

source: HMAC hash calculation
fr: Calcul du hachage HMAC

source: The overall HMAC needs to be calculated over the following data (in order) using the API secret as the HMAC secret and with one of the supported hashing algorithms:
fr: Le HMAC global doit être calculé sur les données suivantes (dans l’ordre) en utilisant la clef secrète d'API comme le secret HMAC et avec l’un des algorithmes de hachage pris en charge :

source: a UNIX timestamp, report this timestamp in the ``X-Elgg-time`` header
fr: un horodatage UNIX, indiquez cet horodatage dans l’en-tête ``X-Elgg-time``

source: a random string, report this string in the ``X-Elgg-nonce`` header
fr: une chaîne aléatoire, indiquez cette chaîne dans l’en-tête ``X-Elgg-nonce``

source: the public API key, report this API key in the ``X-Elgg-apikey`` header
fr: la clef publique d'API, indiquer cette clef d'API dans l’en-tête ``X-Elgg-apikey``

source: the url query string (for example ``method=test.test&foo=bar``)
fr: la chaîne de requête url (par exemple ``method=test.test&foo=bar``)

source: when the request is a POST add the ``posthash`` as reported in the ``X-Elgg-posthash`` header
fr: lorsqu'il s'agit d'une requête POST, ajoutez le ``posthash`` tel qu'indiqué dans l’entête ``X-Elgg-posthash``

source: Hashing cache
fr: Cache de hachage

source: For security reasons each HMAC hash needs to be unique, all submitted hashes are stored for 25 hours to prevent reuse.
fr: Pour des raisons de sécurité, chaque hachage HMAC doit être unique, tous les hachages soumis sont stockés pendant 25 heures pour éviter la réutilisation.

source: API results
fr: Résultats de l’API

source: Success result structure
fr: Structure d'un résultat réussi

source: A successful API result looks like this:
fr: Un résultat d’API réussi ressemble à ceci :

source: Depending on the API call ``result`` can contain any type of content (string, number, array, object, etc.).
fr: Selon l’appel API, ``result`` peut contenir n’importe quel type de contenu (chaîne, nombre, tableau, objet, etc.).

source: An example of a numeric result (for example a user count):
fr: Un exemple de résultat numérique (par exemple un nombre d’utilisateurs) :

source: An example of an object result (for example a user):
fr: Exemple d'objet de résultat (par exemple un utilisateur) :

source: Error result structure
fr: Structure d'un résultat d’erreur

source: When an API call fails the result will look like this:
fr: Lorsqu’un appel API échoue, le résultat ressemble à ceci :

source: Default status codes
fr: Codes d’état par défaut

source: The ``status`` field always contains a number representing the result. Any value other than ``0`` is considered an error.
fr: Le champ ``status`` contient toujours un nombre représentant le résultat. Toute valeur autre que ``0`` est considérée comme une erreur.

source: ``0``: This is a success result
fr: ``0`` : C’est un résultat réussi

source: ``-1``: This is a generic error result
fr: ``-1`` : Il s’agit d’un résultat d’erreur générique

source: ``-20``: The user authentication token is missing, is invalid or has expired
fr: ``-20`` : le jeton d’authentification utilisateur est manquant, est invalide ou a expiré

source: ``-30``: The api key has been disabled
fr: ``-30`` : La clé api a été désactivée

source: ``-31``: The api key is inactive
fr: ``-31`` : La clé api est inactive

source: ``-32``: The api key is invalid
fr: ``-32`` : La clef api est invalide

source: Developers can implement their own status codes to represent different error states, so the request doesn't have to rely on the error message to know what went wrong.
fr: Les développeurs peuvent implémenter leurs propres codes d’état pour représenter différents états d’erreur, de sorte que la demande n’a pas à s’appuyer sur le message d’erreur pour savoir ce qui s’est passé.

source: ``result`` and ``message`` can contain messages in different languages. This is depending on the user language when using user authenticated API calls or the site language for other API calls. Keep in mind that the language can change, eighter by the user or by a site administrator for the site language.
fr: ``result`` et ``message`` peuvent contenir des messages dans différentes langues. Cela dépend de la langue utilisateur lors de l’utilisation d’appels API authentifiés par l’utilisateur ou de la langue de site pour les autres appels API. Gardez à l’esprit que la langue peut changer, que ce soit par l’utilisateur ou par un administrateur du site pour la langue du site.

source: Widgets are content areas that users can drag around their page to customize the layout. They can typically be customized by their owner to show more/less content and determine who sees the widget. By default Elgg provides plugins for customizing the profile page and dashboard via widgets.
fr: Les widgets sont des zones de contenu que les utilisateurs peuvent déplacer dans leur page pour personnaliser la mise en page. Ils peuvent typiquement être personnalisés par leur propriétaire pour afficher plus ou moins de contenu et déterminer qui peut voir le widget. Par défaut, Elgg fournit des plugins pour personnaliser la page de profil et le tableau de bord avec des widgets.

source: To create a widget, create two views:
fr: Pour créer un widget, créez deux vues :

source: ``content.php`` is responsible for all the content that will output within the widget. The ``edit.php`` file contains any extra edit functions you wish to present to the user. You do not need to add access level as this comes as part of the widget framework.
fr: ``content.php`` est responsable pour tout le contenu qui sera affiché dans le widget. Le fichier ``edit.php`` contient toutes les fonctions d'édition supplémentaires que vous souhaitez proposer à l'utilisateur. Vous n'avez pas besoin d'ajouter de niveau d'accès car ceci est pris en charge par le framework des widgets.

source: Using HTML checkboxes to set widget flags is problematic because if unchecked, the checkbox input is omitted from form submission. The effect is that you can only set and not clear flags. The "input/checkboxes" view will not work properly in a widget's edit panel.
fr: L'utilisation de cases à cocher HTML pour définir des drapeaux pour le widget est problématique parce que si la case n'est pas cochée, le champ de la case à cocher est omis de l'envoi du formulaire. Le résultat est que vous pouvez seulement définir ces champs, et pas les supprimer. La vue "input/checkboxes" ne va pas fonctionner correctement dans le panneau d'édition d'un widget.

source: Register the widget
fr: Enregistrez le widget

source: Once you have created your edit and view pages, you need to initialize the plugin widget.
fr: Une fois que vous avez créé vos pages edit et view, vous devez initialiser le widget du plugin.

source: The easiest way to do this is to add the ``widgets`` section to your ``elgg-plugin.php`` config file.
fr: La manière la plus simple de faire cela est d'ajouter la section ``widgets`` à votre fichier de configuration ``elgg-plugin.php``.

source: Alternatively you can also use an function to add a widget. This is done within the plugins ``init()`` function.
fr: Alternativement, vous pouvez aussi utiliser une fonction pour ajouter un widget. Ceci est effectué au sien de la fonction ``init()`` du plugin.

source: The only required attribute is the ``id``.
fr: Le seul attribut requis est l'``id``.

source: Multiple widgets
fr: Widgets multiples

source: It is possible to add multiple widgets for a plugin. You just initialize as many widget directories as you need.
fr: Il est possible d'ajouter plusieurs widgets pour un plugin. Vous n'avez qu'à initialiser autant de répertoires de widgets que vous voulez.

source: Make sure you have the corresponding directories within your plugin views structure:
fr: Assurez-vous que les répertoires correspondants suivants existent dans la structure de votre plugin :

source: Magic widget name and description
fr: Nom et description magiques du widget

source: When registering a widget you can omit providing a name and a description. If a translation in the following format is provided, they will be used. For the name: ``widgets:<widget_id>:name`` and for the description ``widgets:<widget_id>:description``. If you make sure these translation are available in a translation file, you have very little work registering the widget.
fr: Quand vous enregistrez un widget vous pouvez omettre de lui donner un nom et une description. Si la traduction est fournie dans le format suivant, elle sera utilisée. Pour le nom : ``widgets:<widget_id>:name`` et pour la description ``widgets:<widget_id>:description``. Si vous vous vous assurez que ces traductions existent bien dans le fichier de traduction, vous avez très peu de travail pour enregistrer le widget.

source: How to restrict where widgets can be used
fr: Comment restreindre les emplacements où les widgets peuvent être utilisés

source: The widget can specify the context that it can be used in (just profile, just dashboard, etc.).
fr: Le widget peut définir le contexte dans lequel il peut être utilisé (uniquement sur le profil avec le contexte "profile", sur le tableau de bord avec "dashboard", etc.).

source: Allow multiple widgets on the same page
fr: Autoriser des widgets multiples sur la même page

source: By default you can only add one widget of the same type on the page. If you want more of the same widget on the page, you can specify this when registering the widget:
fr: Par défaut vous ne pouvez ajouter qu'un seul widget du même type sur une page. Si vous voulez plus d'un widget du même type sur la page, vous pouvez le spécifier quand vous enregistrez le widget :

source: Register widgets in an event
fr: Enregistrez des widgets dans un événement

source: If, for example, you wish to conditionally register widgets you can also use an event to register widgets.
fr: Si, par exemple, vous souhaitez enregistrer des widgets de manière conditionnelle, vous pouvez également utiliser un événement pour enregistrer des widgets.

source: Modify widget properties of existing widget registration
fr: Modifiez les propriétés de widget d'un enregistrement de widget existant

source: If, for example, you wish to change the allowed contexts of an already registered widget you can do so by re-registering the widget with ``elgg_register_widget_type`` as it will override an already existing widget definition. If you want even more control you can also use the ``handlers, widgets`` event to change the widget definition.
fr: Si, par exemple, vous souhaitez modifier les contextes autorisés d'un widget déjà enregistré, vous pouvez le faire en ré-enregistrant le widget avec ``elgg_register_widget_type``, car cela remplacera une définition de widget déjà existante. Si vous souhaitez encore plus de contrôle, vous pouvez également utiliser l'événement ``handlers, widgets`` pour modifier la définition du widget.

source: Default widgets
fr: Widgets par défaut

source: If your plugin uses the widget canvas, you can register default widget support with Elgg core, which will handle everything else.
fr: Si votre plugin utilise le canevas des widgets, vous pouvez enregistrer le support d'un widget par défaut avec le noyau de Elgg, qui va se charger de tout le reste.

source: To announce default widget support in your plugin, register for the ``get_list, default_widgets`` event:
fr: Pour annoncer le support des widgets par défaut dans votre plugin, enregistrez-vous à l'événement ``get_list, default_widgets`` :

source: In the event handler, push an array into the return value defining your default widget support and when to create default widgets. Arrays require the following keys to be defined:
fr: Dans le gestionnaire d'événements, poussez un tableau dans la valeur de retour définissant votre prise en charge de widget par défaut et quand créer des widgets par défaut. Les tableaux nécessitent la définition des clés suivantes :

source: name - The name of the widgets page. This is displayed on the tab in the admin interface.
fr: name - Le nom de la page des widgets. Ceci est affiché sur l'onglet dans l'interface d'administration.

source: widget\_context - The context the widgets page is called from. (If not explicitly set, this is your plugin's id.)
fr: widget\_context - Le contexte depuis lequel la page des widgets est appelée. (Si ce n'est pas défini explicitement, ce sera l'id de votre plugin.)

source: widget\_columns - How many columns the widgets page will use.
fr: widget\_columns - Combien de colonnes la page widgets va utiliser.

source: event\_name - The Elgg event name to create new widgets for. This is usually ``create``.
fr: event\_name - Le nom de l'événement Elgg pour créer de nouveaux widgets.

source: event\_type - The Elgg event type to create new widgets for.
fr: event\_type - Le type de l'événement Elgg pour créer de nouveaux widgets.

source: entity\_type - The entity type to create new widgets for.
fr: entity\_type - Le type d'entité pour lequel créer de nouveaux widgets.

source: entity\_subtype - The entity subtype to create new widgets for. The can be ELGG\_ENTITIES\_ANY\_VALUE to create for all entity types.
fr: entity\_subtype - Le sous-type d'entité pour lequel créer de nouveaux widgets. Peut être ELGG\_ENTITIES\_ANY\_VALUE pour le créer pour tous les types d'entités.

source: To have widgets be created you need to register the following event:
fr: Pour créer des widgets, vous devez enregistrer l'événement suivant :

source: When an object triggers an event that matches the event, entity\_type, and entity\_subtype parameters passed, Elgg core will look for default widgets that match the widget\_context and will copy them to that object's owner\_guid and container\_guid. All widget settings will also be copied.
fr: Quand un objet déclenche un événement qui correspond à event, entity\_type, et entity\_subtype, le noyau de Elgg va regarder les widgets par défaut qui correspondent au widget\_context et va les copier vers l'owner\_guid et le container\_guid de l'objet. Tous les paramètres du widget seront également copiés.
