Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Sometimes a view will return different HTML depending on the context. A plugin can take advantage of that by setting the context before calling ``elgg_view()`` on the view and then setting the context back. This is frequently done with the search context.
fr: Parfois, une vue va renvoyer un code HTML différent selon le contexte. Un plugin peut en profiter en définissant le contexte avant d’appeler ``elgg_view()`` sur la vue, puis en rétablissant le contexte d'origine. Cela se fait fréquemment avec le contexte de recherche - search.

source: If you setup cron correctly as described in :doc:`/admin/cron` special events will be triggered so you can register for these events from your own code.
fr: Si vous configurez correctement cron comme décrit dans :doc:`/admin/cron`, des événements spéciaux seront déclenchés afin que vous puissiez vous inscrire à ces événements à partir de votre propre code.

source: The example below registers a function for the daily cron.
fr: L’exemple ci-dessous enregistre une fonction pour le cron quotidien.

source: If timing is important in your cron event be advised that the functions are executed in order of registration. This could mean that your function may start (a lot) later then you may have expected. However the parameters provided in the event contain the original starting time of the cron, so you can always use that information.
fr: Si le timing est important dans votre événement cron, sachez que les fonctions sont exécutées par ordre d'enregistrement. Cela pourrait signifier que votre fonction pourrait démarrer (beaucoup) plus tard que prévu. Cependant, les paramètres fournis dans l'événement contiennent l'heure de début d'origine du cron, vous pouvez donc toujours utiliser cette information.

source: Custom intervals
fr: Intervalles personnalisés

source: Plugin developers can configure there own custom intervals.
fr: Les développeurs de plugins peuvent configurer leurs propres intervalles personnalisés.

source: It's **NOT** recommended to do this, as the users of your plugin may also need to configure your custom interval. Try to work with the default intervals. If you only need to do a certain task at for example 16:30 you can use the ``halfhour`` interval and check that ``date('G', $start_time) == 16`` and ``date('i', $start_time) == 30``
fr: Il n'est **PAS** recommandé de faire cela, car les utilisateurs de votre plugin pourraient aussi avoir besoin de configurer votre intervalle personnalisé. Essayez de travailler avec les intervalles par défaut. Si vous avez seulement à effectuer une certaine tâche à 16:30, vous pouvez utiliser l’intervalle d'une demi-heure ``halfhour`` et vérifier que ``date('G', $start_time) == 16`` et ``date('i', $start_time) == 30``

source: :doc:`/design/events` has more information about events
fr: :doc:`/design/events` donne plus d'informations sur les événements

source: For more information about the supported cron interval definition see `the PHP Scheduler documentation`_
fr: Pour plus d’informations sur la définition des intervalles de cron pris en charge, voir la `documentation PHP Scheduler`_

source: Database
fr: Base de données

source: Persist user-generated content and settings with Elgg's generic storage API.
fr: Persistez le contenu et les paramètres générés par l’utilisateur avec l’API de stockage générique de Elgg.

source: Entities
fr: Entités

source: Creating an object
fr: Création d'un objet

source: To create an object in your code, you need to instantiate an ``ElggObject``. Setting data is simply a matter of adding instance variables or properties. The built-in properties are:
fr: Pour créer un objet dans votre code, vous devez instancier un ``ElggObject``. La définition des données est simplement une question d’ajout de variables ou de propriétés d’instance. Les propriétés intégrées sont :

source: **``guid``** The entity's GUID; set automatically
fr: **``guid``** Le GUID de l'entité ; défini automatiquement

source: **``owner_guid``** The owning user's GUID
fr: **``owner_guid``** Le GUID de l'utilisateur propriétaire

source: **``subtype``** A single-word arbitrary string that defines what kind of object it is, for example ``blog``
fr: **``subtype``** Une chaîne arbitraire en un seul mot qui définit de quel type d'objet il s'agit, par exemple `blog``

source: **``access_id``** An integer representing the access level of the object
fr: **``access_id``** Un entier qui représente le niveau d'accès de l'objet

source: **``title``** The title of the object
fr: **``title``** Le titre de l'objet

source: **``description``** The description of the object
fr: **``description``** La description de l'objet

source: The object subtype is a special property. This is an arbitrary string that describes what the object is. For example, if you were writing a blog plugin, your subtype string might be *blog*. It's a good idea to make this unique, so that other plugins don't accidentally try and use the same subtype. For the purposes of this document, let's assume we're building a simple forum. Therefore, the subtype will be *forum*:
fr: Le sous-type d’objet est une propriété spéciale. Il s’agit d’une chaîne arbitraire qui décrit ce qu’est l’objet. Par exemple, si vous écriviez un plugin de blog, votre chaîne de sous-type pourrait être *blog*. C’est une bonne idée de faire en sorte que cette chaîne soit unique, de sorte que d’autres plugins n’essaient et n'utilisent pas accidentellement le même sous-type. Pour les besoins de ce document, supposons que nous construisons un forum simple. Par conséquent, le sous-type sera *forum* :

source: ``access_id`` is another important property. If you don't set this, your object will be private, and only the creator user will be able to see it. Elgg defines constants for the special values of ``access_id``:
fr: ``access_id`` est une autre propriété importante. Si vous ne la définissez pas, votre objet sera privé, et seul l’utilisateur qui l'a créé sera en mesure de le voir. Elgg définit des constantes pour les valeurs spéciales de ``access_id`` :

source: **ACCESS_PRIVATE** Only the owner can see it
fr: **ACCESS_PRIVATE** Seul son propriétaire peut le voir

source: **ACCESS_LOGGED_IN** Any logged in user can see it
fr: **ACCESS_LOGGED_IN** Tout utilisateur connecté peut le voir

source: **ACCESS_PUBLIC** Even visitors not logged in can see it
fr: **ACCESS_PUBLIC** Même les visiteurs non connectés peuvent le voir

source: Saving the object will automatically populate the ``$object->guid`` property if successful. If you change any more base properties, you can call ``$object->save()`` again, and it will update the database for you.
fr: L’enregistrement de l’objet remplira automatiquement la propriété ``$object->guid`` en cas de succès. Si vous modifiez d’autres propriétés de base, vous pouvez appeler à nouveau ``$object->save()``, ce qui va mettre à jour la base de données pour vous.

source: You can set metadata on an object just like a standard property. Let's say we want to set the SKU of a product:
fr: Vous pouvez définir des métadonnées sur un objet comme une propriété standard. Disons que nous voulons définir le SKU - référence unique pour les stocks - d’un produit :

source: If you assign an array, all the values will be set for that metadata. This is how, for example, you set tags.
fr: Si vous affectez un tableau, toutes les valeurs seront définies pour ces métadonnées. C’est ainsi que, par exemple, vous définissez des balises.

source: Metadata cannot be persisted to the database until the entity has been saved, but for convenience, ElggEntity can cache it internally and save it when saving the entity.
fr: Les métadonnées ne peuvent pas être conservées dans la base de données tant que l’entité n’a pas été enregistrée, mais pour plus de commodité, ElggEntity peut la mettre en cache en interne et l’enregistrer lors de l’enregistrement de l’entité.

source: Loading an object
fr: Charger un objet

source: By GUID
fr: Par GUID

source: But what if you don't know the GUID? There are several options.
fr: Mais que faire si vous ne connaissez pas le GUID ? Il y a plusieurs options.

source: By user, subtype or site
fr: Par utilisateur, sous-type ou site

source: If you know the user ID you want to get objects for, or the subtype, you have several options. The easiest is probably to call the procedural function ``elgg_get_entities``:
fr: Si vous connaissez l’ID de l'utilisateur pour lequel vous souhaitez obtenir des objets, ou leur sous-type, vous disposez de plusieurs options. Le plus simple est probablement d’appeler la fonction procédurale ``elgg_get_entities`` :

source: This will return an array of ``ElggEntity`` objects that you can iterate through. ``elgg_get_entities`` paginates by default, with a limit of 10; and offset 0.
fr: Celle-ci renvoie un tableau d’objets ``ElggEntity`` que vous pouvez parcourir. ``elgg_get_entities`` dispose d'une pagination par défaut, avec une limite de 10, et un décalage - offset - de 0.

source: You can leave out ``owner_guid`` to get all objects and leave out subtype or type to get objects of all types/subtypes.
fr: Vous pouvez laisser de côté ``owner_guid`` pour obtenir tous les objets, et laisser de côté le sous-type ou le type pour obtenir des objets de tous types/sous-types.

source: If you already have an ``ElggUser`` – e.g. ``elgg_get_logged_in_user_entity``, which always has the current user's object when you're logged in – you can simply use:
fr: Si vous avez déjà un ``ElggUser`` – par exemple via ``elgg_get_logged_in_user_entity``, qui renvoie toujours l’objet de l’utilisateur actuel lorsque vous êtes connecté – vous pouvez simplement utiliser :

source: But what about getting objects with a particular piece of metadata?
fr: Mais comment fait-on pour obtenir des objets avec une valeur de métadonnée particulière ?

source: By properties
fr: Par propriétés

source: You can fetch entities by their properties using ``elgg_get_entities``. Using specific parameters passed to ``$options`` array, you can retrieve entities by their attributes, metadata, annotations and relationships.
fr: Vous pouvez récupérer des entités par leurs propriétés en utilisant ``elgg_get_entities``. En utilisant des paramètres spécifiques passés au tableau ``$options``, vous pouvez récupérer des entités par leurs attributs, métadonnées, annotations et relations.

source: Displaying entities
fr: Affichage des entités

source: In order for entities to be displayed in listing functions you need to provide a view for the entity in the views system.
fr: Pour que les entités s’affichent dans les fonctions de liste, vous devez fournir une vue pour l’entité dans le système de vues.

source: To display an entity, create a view EntityType/subtype where EntityType is one of the following:
fr: Pour afficher une entité, créez une vue EntityType/subtype où EntityType a l'une des valeurs suivantes :

source: object: for entities derived from ElggObject user: for entities derived from ElggUser site: for entities derived from ElggSite group: for entities derived from ElggGroup
fr: object : pour les entités dérivées de ElggObject, user : pour les entités dérivées de ElggUser, site : pour les entités dérivées de ElggSite, group : pour les entités dérivées de ElggGroup

source: A default view for all entities has already been created, this is called EntityType/default.
fr: Une vue par défaut pour toutes les entités a déjà été créée, elle s'appelle EntityType/default.

source: Entity Icons
fr: Icônes des entités

source: Entity icons can be saved from uploaded files, existing local files, or existing ElggFile objects. These methods save the `master` size of the icon defined in the system. The other defined sizes will be generated when requested.
fr: Les icônes d’entité peuvent être enregistrées à partir de fichiers téléchargés, de fichiers locaux existants, ou d’objets ElggFile existants. Ces méthodes enregistrent la taille ``master`` de l’icône définie dans le système. Les autres tailles définies seront générées sur demande.

source: The following sizes exist by default:
fr: Les tailles d'images suivantes existent par défaut :

source: ``master`` - 10240px at longer edge (not upscaled)
fr: ``master`` - 10240px dans la plus grande longueur (sans agrandissement)

source: ``large`` - 200px at longer edge (not upscaled)
fr: ``large`` - 200px dans la plus grande dimension (sans agrandissement)

source: ``medium`` - 100px square
fr: ``medium`` - carré de 100px de côté

source: ``small`` - 40px square
fr: ``small`` - carré de 40px de côté

source: ``tiny`` - 25px square
fr: ``tiny`` - carré de 25px de côté

source: ``topbar`` - 16px square
fr: ``topbar`` - carré de 16px de côté

source: Use ``elgg_get_icon_sizes()`` to get all possible icon sizes for a specific entity type and subtype. The function triggers the ``entity:icon:sizes`` :ref:`event <guides/events-list#other>`.
fr: Utilisez ``elgg_get_icon_sizes()`` pour obtenir toutes les tailles d'icône possibles pour un type et un subtype d'entité spécifiques. La fonction déclenche l'événement ``entity:icon:sizes`` :ref:`event <guides/events-list#other>`.

source: To check if an icon is set, use ``$object->hasIcon($size)``.
fr: Pour vérifier si une icône est définie, utilisez ``$object->hasIcon($size)``.

source: You can retrieve the URL of the generated icon with ``ElggEntity::getIconURL($params)`` method. This method accepts a ``$params`` argument as an array that specifies the size, type, and provide additional context for the event to determine the icon to serve. The method triggers the ``entity:icon:url`` :ref:`event <guides/events-list#other>`.
fr: Vous pouvez récupérer l'URL de l'icône générée avec la méthode ``ElggEntity::getIconURL($params)``. Cette méthode accepte un argument ``$params`` comme tableau qui spécifie la taille, le type et fournit un contexte supplémentaire pour l'événement afin de déterminer l'icône à servir. La méthode déclenche l'événement ``entity:icon:url`` :ref:`event <guides/events-list#other>`.

source: Use ``elgg_view_entity_icon($entity, $size, $vars)`` to render an icon. This will scan the following locations for a view and include the first match to .
fr: Utilisez ``elgg_view_entity_icon($entity, $size, $vars)`` pour afficher une icône. Cela analysera les emplacements suivants pour trouver une vue et inclura la première qui correspond.

source: Where
fr: Où

source: Type of view, e.g. ``'default'`` or ``'json'``.
fr: Type de vue, par ex. ``'default'`` ou ``'json'``.

source: Type of entity, e.g. ``'group'`` or ``'user'``.
fr: Type d'entité, par ex. ``'group'`` ou ``'user'``.

source: Entity subtype, e.g. ``'blog'`` or ``'page'``.
fr: Sous-type d'entité, par ex. ``'blog'`` ou ``'page'``.

source: You do not have to return a fallback icon from the event handler. If no uploaded icon is found, the view system will scan the views (in this specific order):
fr: Vous n'êtes pas obligé de renvoyer une icône de secours du gestionnaire d'événements. Si aucune icône téléchargée n'est trouvée, le système de visualisation analysera les vues (dans cet ordre spécifique) :

source: Icon type, e.g. ``'icon'`` or ``'cover_image'``.
fr: Type d'icône, par ex. ``'icon'`` ou ``'cover_image'``.

source: Entity subtype, e.g. ``'blog'`` or ``'page'`` (or ``'default'`` if entity has not subtype).
fr: Sous-type d’entité, par ex. ``'blog'`` ou ``'page'`` (ou ``'default'`` si l’entité n’a pas de sous-type).

source: Icon size (note that we do not use the size with svg icons)
fr: Taille de l’icône (notez que nous n’utilisons pas la taille avec les icônes svg)

source: Icon methods support passing an icon type if an entity has more than one icon. For example, a user might have an avatar and a cover photo icon. You would pass ``'cover_photo'`` as the icon type:
fr: Les méthodes des icônes permettent de passer un type d’icône si une entité possède plus d’une icône. Par exemple, un utilisateur peut avoir un avatar et une icône de photo de couverture. Vous passeriez ``'cover_photo'`` comme type d’icône :

source: Custom icon types (e.g. cover photos) only have a preset for `master` size, to add custom sizes use ``entity:<icon_type>:url`` :ref:`event <guides/events-list#other>` to configure them.
fr: Les types d'icônes personnalisées (par ex. les photos de couverture) n'ont qu'un préréglage pour la taille `master`, pour ajouter des tailles personnalisées, utilisez l':ref:`événement <guides/events-list#other>` ``entity::url`` pour les configurer.

source: By default icons will be stored in ``/icons/<icon_type>/<size>.jpg`` relative to entity's directory on filestore. To provide an alternative location, use the ``entity:<icon_type>:file`` :ref:`event <guides/events-list#other>`.
fr: Par défaut, les icônes seront stockées dans ``/icons/<icon_type>/<size>.jpg`` par rapport au répertoire de l'entité sur le répertoire de fichiers. Pour fournir un autre emplacement, utilisez l':ref:`événement <guides/events-list#other>` ``entity:<icon_type>:file``.

source: Adding, reading and deleting annotations
fr: Ajout, lecture et suppression des annotations

source: Annotations could be used, for example, to track ratings. To annotate an entity you can use the object's ``annotate()`` method. For example, to give a blog post a rating of 5, you could use:
fr: Les annotations peuvent être utilisées, par exemple, pour suivre les évolutions des notes. Pour annoter une entité, vous pouvez utiliser la méthode ``annotate()`` de l’objet. Par exemple, pour donner à un article de blog une note de 5, vous pouvez utiliser :

source: To retrieve the ratings on the blog post, use ``$blogpost->getAnnotations('rating')`` and if you want to delete an annotation, you can operate on the ``ElggAnnotation`` class, eg ``$annotation->delete()``.
fr: Pour récupérer les notes sur l'article de blog, utilisez ``$blogpost->getAnnotations('rating')`` et si vous souhaitez supprimer une annotation, vous pouvez opérer sur la classe ``ElggAnnotation``, par ex. ``$annotation->delete()``.

source: Retrieving a single annotation can be done with ``get_annotation()`` if you have the annotation's ID. If you delete an ElggEntity of any kind, all its metadata, annotations, and relationships will be automatically deleted as well.
fr: La récupération d’une seule annotation peut être faite avec ``get_annotation()`` si vous avez l’ID de l’annotation. Si vous supprimez une ElggEntity de quelque nature que ce soit, toutes ses métadonnées, annotations et relations seront également supprimées automatiquement.

source: Extending ElggEntity
fr: Étendre ElggEntity

source: If you derive from one of the Elgg core classes, you'll need to tell Elgg how to properly instantiate the new type of object so that get\_entity() et al. will return the appropriate PHP class. For example, if I customize ElggGroup in a class called "Committee", I need to make Elgg aware of the new mapping. Following is an example class extension:
fr: Si vous dérivez de l’une des classes du noyau Elgg, vous devrez dire à Elgg comment instancier correctement le nouveau type d’objet afin que get\_entity() et assimilés renvoient la classe PHP appropriée. Par exemple, si je personnalise ElggGroup dans une classe appelée ``Committee``, je dois faire connaître à Elgg le nouveau mappage. Voici un exemple d'extension de classe :

source: In your plugins ``elgg-plugin.php`` file add the ``entities`` section.
fr: Dans votre fichier ``elgg-plugin.php`` ajoutez la section ``entities``.

source: The entities will be registered upon activation of the plugin.
fr: Les entités seront enregistrées lors de l’activation du plugin.

source: Now if you invoke ``get_entity()`` with the GUID of a committee object, you'll get back an object of type Committee.
fr: Maintenant, si vous invoquez ``get_entity()`` avec le GUID d’un objet de comité, vous récupérerez un objet de type Comité - Committee.

source: Advanced features
fr: Fonctionnalités avancées

source: Entity URLs
fr: URLs des entités

source: Entity urls are provided by the ``getURL()`` interface and provide the Elgg framework with a common way of directing users to the appropriate display handler for any given object.
fr: Les URLs d’entité sont fournies par l’interface ``getURL()`` et fournissent au framework Elgg un moyen commun de diriger les utilisateurs vers le gestionnaire d’affichage approprié pour n’importe quel objet donné.

source: For example, a profile page in the case of users.
fr: Par exemple, une page de profil dans le cas des utilisateurs.

source: The url is set using the ``elgg\_register\_entity\_url\_handler()`` function. The function you register must return the appropriate url for the given type - this itself can be an address set up by a page handler.
fr: L’URL est définie à l’aide de la fonction ``elgg\_register\_entity\_url\_handler()``. La fonction que vous enregistrez doit renvoyer l’URL appropriée pour le type donné - qui peut elle-même être une adresse configurée par un gestionnaire de page.

source: The default handler is to use the default export interface.
fr: Le gestionnaire par défaut doit utiliser l’interface d’export par défaut.

source: Entity loading performance
fr: Performance de chargement des entités

source: ``elgg_get_entities`` has a couple options that can sometimes be useful to improve performance.
fr: ``elgg_get_entities`` dispose de quelques options qui peuvent être utiles pour améliorer les performances.

source: **preload_owners**: If the entities fetched will be displayed in a list with the owner information, you can set this option to ``true`` to efficiently load the owner users of the fetched entities.
fr: **preload_owners** : Si les entités récupérées sont affichées dans une liste avec des informations sur le propriétaire, vous pouvez définir cette option sur ``true`` pour charger efficacement les utilisateurs propriétaires des entités récupérées.

source: **preload_containers**: If the entities fetched will be displayed in a list using info from their containers, you can set this option to ``true`` to efficiently load them.
fr: **preload_containers** : Si les entités récupérées sont affichées dans une liste avec des informations sur leurs conteneurs, vous pouvez définir cette option sur ``true`` pour les charger efficacement.

source: **distinct**: When Elgg fetches entities using an SQL query, Elgg must be sure that each entity row appears only once in the result set. By default it includes a ``DISTINCT`` modifier on the GUID column to enforce this, but some queries naturally return unique entities. Setting the ``distinct`` option to false will remove this modifier, and rely on the query to enforce its own uniqueness.
fr: **distinct** : Quand Elgg récupère des entités à l’aide d’une requête SQL, Elgg doit être sûr que chaque ligne d’entité n’apparaît qu’une seule fois dans le jeu de résultats. Par défaut, il inclut un modificateur ``DISTINCT`` sur la colonne GUID pour l’appliquer, mais certaines requêtes renvoient naturellement des entités uniques. La définition de l’option ``distinct`` sur false supprime ce modificateur et s’appuie sur la requête pour s'assurer de l'unicité des résultats.

source: The internals of Elgg entity queries is a complex subject and it's recommended to seek help on the Elgg Community site before using the ``distinct`` option.
fr: Le fonctionnement interne des requêtes d’entités Elgg est un sujet complexe et il est recommandé de demander de l’aide sur le site de la communauté Elgg avant d’utiliser l’option ``distinct``.

source: Custom database functionality
fr: Fonctionnalité de base de données personnalisée
