Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: **Example 1:** Change the URL for menu item called "albums" in the ``owner_block`` menu:
fr: **Exemple 1 :** Modifier l’URL de l’élément de menu appelé "albums" dans le menu ``owner_block`` :

source: **Example 2:** Modify the ``entity`` menu for the ``ElggBlog`` objects
fr: **Exemple 2 :** Modifier le menu ``entity`` pour les objets ``ElggBlog``

source: Remove the thumb icon
fr: Supprimer l’icône du pouce

source: Change the "Edit" text into a custom icon
fr: Modifier le texte "Modifier" en une icône personnalisée

source: Creating a new menu
fr: Créer un nouveau menu

source: Elgg provides multiple different menus by default. Sometimes you may however need some menu items that don't fit in any of the existing menus. If this is the case, you can create your very own menu with the ``elgg_view_menu()`` function. You must call the function from the view, where you want to menu to be displayed.
fr: Elgg fournit plusieurs menus différents par défaut. Vous pouvez cependant avoir besoin de certains éléments de menu qui ne figurent pas dans l’un des menus existants. Si tel est le cas, vous pouvez créer votre propre menu avec la fonction ``elgg_view_menu()``. Vous devez appeler la fonction à partir de la vue dans laquelle vous souhaitez afficher le menu.

source: **Example:** Display a menu called "my_menu" that displays it's menu items in alphapetical order:
fr: **Exemple:** Afficher un menu appelé « my_menu » qui affiche ses éléments de menu dans l’ordre alphabétique :

source: You can now add new items to the menu like this:
fr: Vous pouvez maintenant ajouter de nouveaux éléments au menu comme ceci :

source: Furthermore it is now possible to modify the menu using the events ``'register', 'menu:my_menu'`` and ``'prepare', 'menu:my_menu'``.
fr: De plus il est désormais possible de modifier le menu à l'aide des événements ``'register', 'menu:my_menu'`` et ``'prepare', 'menu:my_menu'``.

source: Child Dropdown Menus
fr: Sous-menus déroulants

source: Child menus can be configured using ``child_menu`` factory option on the parent item.
fr: Les sous-menus peuvent être configurés à l’aide de l’option ``child_menu`` de l’élément parent.

source: ``child_menu`` options array accepts ``display`` parameter, which can be used to set the child menu to open as ``dropdown`` or be displayed via ``toggle``. All other key value pairs will be passed as attributes to the ``ul`` element.
fr: Le tableau d’options ``child_menu`` accepte le paramètre ``display``, qui peut être utilisé pour définir que le menu enfant s'ouvre sous forme de liste déroulante ``dropdown``, ou être affiché via une bascule ``toggle``. Toutes les autres paires de clefs/valeurs seront transmises en tant qu’attributs à l’élément ``ul``.

source: Theming
fr: Création de thèmes

source: The menu name, section names, and item names are all embedded into the HTML as CSS classes (normalized to contain only hyphens, rather that underscores or colons). This increases the size of the markup slightly but provides themers with a high degree of control and flexibility when styling the site.
fr: Le nom du menu, les noms de sections et les noms des éléments sont tous intégrés dans le HTML sous forme de classes CSS (normalisées pour ne contenir que des traits d’union, plutôt que des soulignements ou des points). Cela augmente légèrement la taille du balisage, mais procure aux intégrateurs un haut degré de contrôle et de flexibilité lors de la mise en forme du site.

source: **Example:** The following would be the output of the ``foo`` menu with sections ``alt`` and ``default`` containing items ``baz`` and ``bar`` respectively.
fr: **Exemple :** Voici la sortie du menu ``foo`` avec les sections ``alt`` et ``default`` contenant respectivement les éléments ``baz`` et ``bar``.

source: Toggling Menu Items
fr: Basculer des éléments de menu

source: There are situations where you wish to toggle menu items that are actions that are the opposite of each other and ajaxify them. E.g. like/unlike, friend/unfriend, ban/unban, etc. Elgg has built-in support for this kind of actions. When you register a menu item you can provide a name of the menu item (in the same menu) that should be toggled. An ajax call will be made using the href of the menu item.
fr: Il y a des situations où vous souhaitez basculer entre des éléments de menu qui sont des actions contraires l'une de l’autre, et les ajaxifier. Par exemple ajouter/retirer un contact, bannir/réintégrer, etc. Elgg dispose d'une prise en charge intégrée pour ce genre d’actions. Lorsque vous enregistrez un élément de menu, vous pouvez fournir le nom de l’élément de menu (dans le même menu) qui doit être basculé. Un appel ajax sera fait en utilisant le href de l’élément de menu.

source: The menu items are optimistically toggled. This means the menu items are toggled before the actions finish. If the actions fail, the menu items will be toggled back.
fr: Les éléments de menu sont basculés de manière optimiste. Cela signifie que les éléments de menu sont basculés avant la fin des actions. Si les actions échouent, les éléments de menu seront rétablis.

source: There are two ways to send notifications in Elgg:
fr: Il existe deux manières d’envoyer des notifications dans Elgg :

source: Instant notifications
fr: Notifications instantanées

source: Event-based notifications send using a notifications queue
fr: Les notifications basées sur les événements sont envoyées à l’aide d’une file d’attente de notifications

source: The generic method to send a notification to a user is via the function `notify_user()`__. It is normally used when we want to notify only a single user. Notification like this might for example inform that someone has liked or commented the user's post.
fr: La méthode générique pour envoyer une notification à un utilisateur utilise la fonction `notify_user()`__. Celle-ci devrait être principalement utilisée lorsque nous voulons notifier un seul utilisateur. Une notification comme celle-ci peut, par exemple, informer que quelqu’un a aimé ou commenté la publication de l’utilisateur.

source: The function usually gets called in an :doc:`action <actions>` file.
fr: La fonction est habituellement appelée dans un fichier d':doc:`action <actions>`.

source: In this example a user (``$user``) is triggering an action to rate a post created by another user (``$owner``). After saving the rating (``ElggAnnotation $rating``) to database, we could use the following code to send a notification about the new rating to the owner.
fr: Dans cet exemple, un utilisateur (``$user``) déclenche une action pour noter une publication créée par un autre utilisateur (``$owner``). Après avoir enregistré la note (``ElggAnnotation $rating``) dans la base de données, nous pourrions utiliser le code suivant pour envoyer une notification concernant cette nouvelle note au propriétaire.

source: The language used by the recipient isn't necessarily the same as the language of the person who triggers the notification. Therefore you must always remember to pass the recipient's language as the third parameter to ``elgg_echo()``.
fr: La langue utilisée par le destinataire n’est pas nécessairement la même que celle de la personne qui déclenche la notification. Par conséquent, vous devez toujours penser à transmettre la langue du destinataire en tant que troisième paramètre à ``elgg_echo()``.

source: The ``'summary'`` parameter is meant for notification plugins that only want to display a short message instead of both the subject and the body. Therefore the summary should be terse but still contain all necessary information.
fr: Le paramètre ``'summary'`` est destiné aux plugins de notification qui ne souhaitent afficher qu’un message court au lieu du sujet et du corps de message. Par conséquent, le résumé doit être laconique, mais toujours contenir toutes les informations nécessaires.

source: Enqueued notifications
fr: Notifications en file d'attente

source: On large sites there may be many users who have subscribed to receive notifications about a particular event. Sending notifications immediately when a user triggers such an event might remarkably slow down page loading speed. This is why sending of such notifications shoud be left for Elgg's notification queue.
fr: Sur les grands sites, il peut y avoir de nombreux utilisateurs qui se sont abonnés pour recevoir des notifications lors d’un événement particulier. L’envoi immédiat de notifications lorsqu’un utilisateur déclenche un tel événement peut ralentir considérablement la vitesse de chargement des pages. C’est pourquoi l’envoi de ces notifications devrait être mis dans la file d’attente de notification de Elgg.

source: New notification events can be registered with the ``elgg_register_notification_event()`` function or in the :doc:`elgg-plugin </guides/plugins>` configuration. Notifications about registered events will be sent automatically to all subscribed users.
fr: De nouveaux événements de notification peuvent être enregistrés avec la fonction ``elgg_register_notification_event()`` ou dans la configuration de :doc:`elgg-plugin </guides/plugins>`. Des notifications sur les événements enregistrés seront envoyées automatiquement à tous les utilisateurs abonnés.

source: This is the workflow of the notifications system:
fr: Voici le workflow du système de notifications :

source: Someone does an action that triggers an event within Elgg
fr: Quelqu’un effectue une action qui déclenche un événement au sein de Elgg

source: The action can be ``create``, ``update`` or ``delete``
fr: L’action peut être ``create``, ``update`` ou ``delete``

source: The target of the action can be any instance of the ``ElggEntity`` class (e.g. a Blog post)
fr: La cible de l’action peut être n’importe quelle instance de la classe ``ElggEntity`` (par exemple un article de blog)

source: The notifications system saves this event into a notifications queue in the database
fr: Le système de notifications enregistre cet événement dans une file d’attente de notifications dans la base de données

source: When the event handler for the one-minute interval gets triggered, the event is taken from the queue and it gets processed
fr: Lorsque le gestionnaire d'événements pour l'intervalle d'une minute est déclenché, l'événement est retiré de la file d'attente et traité.

source: Subscriptions are fetched for the user who triggered the event
fr: Les abonnements sont récupérés pour l’utilisateur qui a déclenché l’événement

source: By default this includes all the users who have enabled any notification method for the user at ``www.site.com/notifications/personal/<username>``
fr: Par défaut, ceci comprend tous les utilisateurs qui ont activé au moins une méthode de notification pour les utilisateurs via ``www.site.com/notifications/personal/<username>``

source: Plugins are allowed to alter the subscriptions using the ``[get, subscriptions]`` event
fr: Les plugins sont autorisés à modifier les abonnements en utilisant l'événement ``[get, souscriptions]``

source: Plugins are allowed to terminate notifications queue processing with the ``[send:before, notifications]`` event
fr: Les plugins sont autorisés à interrompre le traitement de la file d'attente des notifications avec l'événement ``[send:before, notifications]``

source: Plugins are allowed to alter the notification parameters with the ``[prepare, notification]`` event
fr: Les plugins sont autorisés à modifier les paramètres de notification avec l'événement ``[send:before, notifications]``

source: Plugins are allowed to alter the notification subject/message/summary with the ``[prepare, notification:<action>:<type>:<subtype>]`` event
fr: Les plugins sont autorisés à modifier le subject/message/summary de la notification avec l'événement ``[prepare, notification:<action>:<type>:<subtype>]``

source: Plugins are allowed to format notification subject/message/summary for individual delivery methods with ``[format, notification:<method>]`` event
fr: Les plugins sont autorisés à formater le sujet/message/résumé de notification pour des méthodes de livraison individuelles avec l'événement ``[format, notification:<method>]``

source: Notifications are sent to each subscriber using the methods they have chosen
fr: Les notifications sont envoyées à chaque abonné en utilisant les méthodes qu’il a choisies

source: Plugins can take over or prevent sending of each individual notification with the ``[send, notification:<method>]`` event
fr: Les plugins peuvent remplacer ou empêcher l'envoi de chaque notification individuelle avec l'événement ``[send, notification:<method>]``

source: The ``[send:after, notifications]`` event is triggered for the event after all notifications have been sent
fr: L'événement ``[send:after, notifications]`` est déclenché pour l'événement après que toutes les notifications ont été envoyées

source: Notification event registration example
fr: Exemple d'enregistrement d'un événement de notification

source: Tell Elgg to send notifications when a new object of subtype "photo" is created:
fr: Indiquez à Elgg d’envoyer des notifications lorsqu’un nouvel objet de sous-type ``photo`` est créé :

source: Or in the ``elgg-plugin.php``:
fr: Ou dans ``elgg-plugin.php``

source: In order to send the event-based notifications you must have the one-minute :doc:`CRON </admin/cron>` interval configured.
fr: Pour envoyer les notifications lors des événements, vous devez configurer l’intervalle :doc:`CRON </admin/cron>` d’une minute.

source: Contents of the notification message can be defined with the ``'prepare', 'notification:[action]:[type]:[subtype]'`` event.
fr: Le contenu du message de notification peut être défini avec l'événement ``'prepare', 'notification:[action]:[type]:[subtype]'``.

source: Custom notification event registration example
fr: Exemple d'enregistrement d'un événement de notification personnalisé

source: Tell Elgg to send notifications when a new object of the subtype "album" is created:
fr: Indiquer à Elgg d’envoyer des notifications lorsqu’un nouvel objet de sous-type ``album`` est créé :

source: Make sure the notification will be in the correct language by passing the reciepient's language into the ``elgg_echo()`` function.
fr: Assurez-vous que la notification sera dans la bonne langue en passant la langue du destinataire à la fonction ``elgg_echo()``.

source: Custom notification content example
fr: Exemple de contenu de notification personnalisé

source: Tell Elgg to use the function ``photos_prepare_notification()`` to format the contents of the notification when a new objects of subtype 'photo' is created:
fr: Indique à Elgg d’utiliser la fonction ``photos_prepare_notification()`` pour formater le contenu de la notification quand un nouvel objet de sous-type 'photo' est créé :

source: Make sure the notification will be in the correct language by passing the recipient's language into the ``elgg_echo()`` function.
fr: Assurez-vous que la notification sera dans la bonne langue en passant la langue du destinataire dans la fonction ``elgg_echo()``.

source: Notification salutation and sign-off
fr: Salutation et signature de la notification

source: Elgg will by default prepend a salutation to all outgoing notification body text. Also a sign-off will be appended. This means you will not need to add text like ``Hi Admin,`` or ``Kind regards, your friendly site administrator`` to your notifications body. If for some reason you do not need this magic to happen, you can prevent it by setting the notification parameter ``add_salutation`` to ``false``. You can do this as part of the parameters in ``notify_user()`` or in the ``prepare, notifications`` event. You can change the salutation and sign-off texts in the translations.
fr: Elgg ajoutera par défaut une formule de salutation au corps du message des notifications sortantes. Une signature sera également annexée. Cela signifie que vous n'aurez pas besoin d'ajouter du texte comme ``Bonjour Administrateur`` ou ``Cordialement, votre sympathique administrateur de site`` dans le corps de vos notifications. Si pour une raison quelconque vous n'avez pas besoin que cette magie se produise, vous pouvez l'empêcher en définissant le paramètre de notification ``add_salutation`` à ``false``. Vous pouvez le faire dans le cadre des paramètres de ``notify_user()`` ou de l'événement ``prepare, notifications``. Vous pouvez modifier les textes de salutation et de signature dans les traductions.

source: You can also customize the salutation by overruling the view ``notifications/elements/salutation`` the sign-off can be customized by overruling the view ``notifications/elements/sign-off``.
fr: Vous pouvez également personnaliser la salutation en remplaçant la vue ``notifications/elements/salutation``. La signature peut être personnalisée en remplaçant la vue ``notifications/elements/sign-off``.

source: Notification methods
fr: Méthodes de notification

source: By default Elgg has three notification methods: email, delayed_email and the bundled site_notifications plugin.
fr: Par défaut, Elgg propose trois méthodes de notification : email, delayed_email et le plugin site_notifications fourni avec Elgg.

source: Will send an email notification to to the recipient.
fr: Enverra une notification par e-mail au destinataire.

source: Delayed email
fr: E-mail différé

source: Will save the notifications and deliver them in one bundled email at the interval the recipient has configured (daily or weekly).
fr: Enregistre les notifications pour les envoyer dans un e-mail groupé à l'intervalle configuré par le destinataire (quotidien ou hebdomadaire).

source: The availability of this delivery method can be configured by the site administrator in the Site settings section.
fr: La disponibilité de cette méthode d'envoi peut être configurée par l'administrateur du site dans la section Paramètres du site.

source: The layout of the bundled email can be customized by overruling the view ``email/delayed_email/plain_text`` for the plain text part of the email and ``email/delayed_email/html`` for the HTML part of the email.
fr: La mise en page de l'e-mail groupé peut être personnalisée en remplaçant la vue ``email/delayed_email/plain_text`` pour la partie en texte brut de l'e-mail et ``email/delayed_email/html`` pour la partie HTML de l'e-mail.

source: Site notification
fr: Notification sur le site

source: Will show the notification on the site.
fr: Affichera la notification sur le site.

source: Registering a new notification method
fr: Enregistrement d’une nouvelle méthode de notification

source: You can register a new notification method with the ``elgg_register_notification_method()`` function.
fr: Vous pouvez enregistrer une nouvelle méthode de notification avec la fonction ``elgg_register_notification_method()``.

source: Register a handler that will send the notifications via SMS.
fr: Enregistrez un gestionnaire qui enverra les notifications par SMS.

source: After registering the new method, it will appear on the notification settings page at ``www.example.com/notifications/personal/[username]``.
fr: Après avoir enregistré la nouvelle méthode, celle-ci apparaîtra sur la page des paramètres de notification à l’adresse ``www.example.com/notifications/personal/[username]``.

source: Sending the notifications using your own method
fr: Envoyer des notifications avec votre propre méthode

source: Besides registering the notification method, you also need to register a handler that takes care of actually sending the SMS notifications. This happens with the ``'send', 'notification:[method]'`` event.
fr: Outre l'enregistrement de la méthode de notification, vous devez également enregistrer un gestionnaire qui se charge d'envoyer réellement les notifications SMS. Cela se produit avec l'événement ``'send', 'notification:[method]'``.

source: Subscriptions
fr: Abonnements

source: In most cases Elgg core takes care of handling the subscriptions, so notification plugins don't usually have to alter them.
fr: Dans la plupart des cas, le noyau de Elgg s’occupe de la gestion des abonnements, de sorte que les plugins de notification n’ont généralement pas besoin de les modifier.

source: Subscriptions can however be:
fr: Les abonnements peuvent toutefois être :

source: Added using the ``\ElggEntity::addSubscription()`` function
fr: Ajoutés à l’aide de la fonction ``\ElggEntity::addSubscription()``

source: Removed using the ``\ElggEntity::removeSubscription()`` function
fr: Supprimés à l’aide de la fonction ``\ElggEntity::removeSubscription()``

source: It's possible to modify the recipients of a notification dynamically with the ``'get', 'subscriptions'`` event.
fr: Il est possible de modifier dynamiquement les destinataires d'une notification avec l'événement ``'get', 'subscriptions'``.

source: Muted notifications
fr: Notifications en sourdine

source: Notifications can be muted in order to no longer receive notifications, for example no longer receive notifications about new comments on a discussion.
fr: Les notifications peuvent être désactivées afin de ne plus recevoir de notifications, par exemple pour ne plus recevoir de notifications concernant de nouveaux commentaires sur une discussion.

source: In order to mute notifications call ``\ElggEntity::muteNotifications($user_guid)`` the ``$user_guid`` is defaulted to the current logged in user. This will cause all subscriptions on the entity to be removed and a special flag will be set to know that notifications are muted.
fr: Afin de désactiver les notifications, appelez ``\ElggEntity::muteNotifications($user_guid)`` le ``$user_guid`` est par défaut l'utilisateur actuellement connecté. Cela entraînera la suppression de tous les abonnements sur l'entité et un indicateur spécial sera défini pour savoir que les notifications sont désactivées.

source: The muting rules are applied after the subscribers of a notification event are requested and are applied for the following entities of the notification event: - the event actor ``\Elgg\Notifications\NotificationEvent::getActor()`` - the event object entity ``\Elgg\Notifications\NotificationEvent::getObject()`` - the event object container entity ``\Elgg\Notifications\NotificationEvent::getObject()::getContainerEntity()`` - the event object owner entity ``\Elgg\Notifications\NotificationEvent::getObject()::getOwnerEntity()``
fr: Les règles de désactivation sont appliquées après que les abonnés d'un événement de notification ont été demandées et appliquées pour les entités suivantes de l'événement de notification : - l'acteur de l'événement ``\Elgg\Notifications\NotificationEvent::getActor()`` - l'entité objet de l'événement ``\Elgg\Notifications\NotificationEvent::getObject()`` - l'entité conteneur de l'objet de l'événement ``\Elgg\Notifications\NotificationEvent::getObject()::getContainerEntity()`` - l'entité propriétaire de l'objet de l'événement ``\ Elgg\Notifications\NotificationEvent::getObject()::getOwnerEntity()``

source: To unmute the notifications call ``\ElggEntity::unmuteNotifications($user_guid)`` the ``$user_guid`` is defaulted to the current logged in user.
fr: Pour réactiver les notifications, appelez ``\ElggEntity::unmuteNotifications($user_guid)`` le ``$user_guid`` est par défaut l'utilisateur actuellement connecté.

source: To check if a user has the notifications muted call ``\ElggEntity::hasMutedNotifications($user_guid)`` the ``$user_guid`` is defaulted to the current logged in user.
fr: Pour vérifier si un utilisateur a les notifications désactivées, appelez ``\ElggEntity::hasMutedNotifications($user_guid)`` le ``$user_guid`` est par défaut l'utilisateur actuellement connecté.

source: Helper page
fr: Page d'aide
