Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: Returns Elgg's public DI container. This can be helpfull if you wish to register event listeners.
fr: Renvoie le conteneur DI public de Elgg. Cela peut être utile si vous souhaitez enregistrer des écouteurs d'événements.

source: Returns plugin entity this bootstrap is related to. This makes it easier to get plugin settings.
fr: Renvoie l’entité du plugin à laquelle cette initialisation est liée. Il est ainsi plus facile d’obtenir des paramètres de plugin.

source: Plugin Dependencies
fr: Dépendances du plugin

source: In Elgg the plugin dependencies system is there to prevent plugins from being used on incompatible systems.
fr: Dans Elgg, le système de dépendances de plugin est présent pour empêcher les plugins d’être utilisés sur des systèmes incompatibles.

source: The dependencies system is controlled through a plugin's ``elgg-plugin.php`` file or ``composer.json``. Plugin authors can specify that a plugin:
fr: Le système de dépendances est contrôlé par le fichier ```elgg-plugin.php`` file ou ``composer.json`` d’un plugin. Les auteurs de plugins peuvent spécifier qu’un plugin :

source: Requires certain Elgg plugins, PHP version or PHP extensions.
fr: Nécessite certains plugins Elgg, une version de PHP ou des extensions PHP.

source: Conflicts with certain Elgg versions or plugins.
fr: Est en conflit avec certains plugins ou versions de Elgg.

source: PHP version or extension
fr: Version de PHP ou extension

source: Add a section in your ``composer.json`` as described in de `Composer JSON reference <https://getcomposer.org/doc/04-schema.md#package-links>`_
fr: Ajoutez une section dans votre ``composer.json`` comme décrit dans la `Documentation de référence Composer JSON <https://getcomposer.org/doc/04-schema.md#package-links>`_

source: Require an Elgg plugin
fr: Nécessite un plugin Elgg

source: Add a section to the ``elgg-plugin.php``, also see :doc:`/guides/plugins`
fr: Ajoutez une section à ``elgg-plugin.php``, voyez aussi :doc:`/guides/plugins`

source: Conflicts
fr: Est en conflit avec

source: Plugin skeleton
fr: Squelette du plugin

source: The following is the standard for plugin structure in Elgg as of Elgg 2.0.
fr: Ce qui suit est le standard pour la structure d'un plugin dans Elgg à partir de Elgg 2.0.

source: Example Structure
fr: Exemple de structure

source: The following is an example of a plugin with standard structure. For further explanation of this structure, see the details in the following sections. Your plugin may not need all the files listed
fr: Voici un exemple de plugin avec un structure standard. Pour plus d'explications sur cette structure, voyez les informations dans les sections suivantes. Votre plugin peut ne pas avoir besoin de tous les fichiers listés

source: The following files for plugin ``example`` would go in ``/mod/example/``
fr: Les fichiers suivants pour le plugin ``example`` iraient dans ``/mod/example/``

source: Required Files
fr: Fichiers requis

source: Plugins **must** provide a ``composer.json`` file in the plugin root in order to be recognized by Elgg.
fr: Les plugins **doivent** fournir un fichier ``composer.json`` dans la racine du plugin afin d'être reconnus par Elgg.

source: Therefore the following is the minimally compliant structure:
fr: De ce fait, voici la structure conforme minimale :

source: Plugins *should* place scripts for actions an ``actions/`` directory, and furthermore *should* use the name of the action to determine the location within that directory.
fr: Les plugins *devraient* placer les scripts pour les actions dans un dossier ``actions/``, et *devraient* en outre utiliser le nom de l'action pour déterminer l'emplacement dans ce dossier.

source: For example, the action ``my/example/action`` would go in ``my_plugin/actions/my/example/action.php``. This makes it very obvious which script is associated with which action.
fr: Par exemple, l'action ``my/example/action`` irait dans ``my_plugin/actions/my/example/action.php``. Ceci permet de rendre évident quel script est associé avec quelle action.

source: Similarly, the body of the form that submits to this action should be located in ``forms/my/example/action.php``. Not only does this make the connection b/w action handler, form code, and action name obvious, but it allows you to use the ``elgg_view_form()`` function easily.
fr: De même, le corps du formulaire qui est soumis à cette action doit être situé dans ``forms/my/example/action.php``. Non seulement cela rend évident le lien entre le gestionnaire d’action, le code du formulaire, et le nom de l’action, mais cela vous permet aussi d’utiliser facilement la fonction ``elgg_view_form()``.

source: Text Files
fr: Fichiers texte

source: Plugins *may* provide various \*.txt as additional documentation for the plugin. These files **must** be in Markdown syntax and will generate links on the plugin management sections.
fr: Les plugins *peuvent* fournir divers fichiers \*.txt comme documentation supplémentaire pour le plugin. Ces fichiers **doivent** utiliser la syntaxe Markdown et vont générer des liens vers les sections de gestion du plugins.

source: *should* provide additional information about the plugin of an unspecified nature
fr: *devrait* fournir des informations supplémentaires de toute nature sur le plugin

source: If included, **must** provide an explanation of the plugin's copyright.
fr: Si inclus, **doit** fournir une description du droit d’auteur du plugin.

source: If included, **must** provide the text of the license that the plugin is released under.
fr: Si inclus, **doit** fournir le texte de la licence sous laquelle le plugin est publié.

source: If included, **must** provide additional instructions for installing the plugin if the process is sufficiently complicated (e.g. if it requires installing third party libraries on the host machine, or requires acquiring an API key from a third party).
fr: Si inclus, **doit** fournir des instructions supplémentaires pour l’installation du plugin si le processus est suffisamment compliqué (par exemple, s’il nécessite l’installation de bibliothèques tierces sur l’hôte, ou nécessite l’acquisition d’une clef API provenant d’un tiers).

source: If included, **must** provide a list of changes for their plugin, grouped by version number, with the most recent version at the top.
fr: Si inclus, **doit** fournir une liste de modifications pour le plugin, regroupées par numéro de version, avec la version la plus récente au début.

source: Plugins *may* include additional \*.txt files besides these, but no interface is given for reading them.
fr: Les plugins *peuvent* inclure des fichiers supplémentaires \*.txt en plus de ceux-ci, mais aucune interface n’est fournie pour les lire.

source: To render full pages, plugins should use **resource views** (which have names beginning with ``resources/``). This allows other plugins to easily replace functionality via the view system.
fr: Pour afficher des pages complètes, les plugins doivent utiliser les **vues de ressources** (qui ont des noms commençant par ``resources/``). Cela permet à d’autres plugins de remplacer facilement certaines fonctionnalités via le système de vue.

source: The reason we encourage this structure is
fr: La raison pour laquelle nous encourageons cette structure est

source: To form a logical relationship between urls and scripts, so that people examining the code can have an idea of what it does just by examining the structure.
fr: Pour former une relation logique entre URLs et scripts, de sorte que les personnes qui examinent le code puissent avoir une idée de ce qu'il fait rien qu'en examinant la structure du code.

source: To clean up the root plugin directory, which historically has quickly gotten cluttered with the page handling scripts.
fr: Pour nettoyer le répertoire racine des plugins, qui avait historiquement été rapidement encombré avec les scripts de gestion des pages.

source: Elgg provides `PSR-0 <http://www.php-fig.org/psr/psr-0/>`_ autoloading out of every active plugin's ``classes/`` directory.
fr: Elgg fournit un autochargement `PSR-0 <http://www.php-fig.org/psr/psr-0/>`_ de toutes les classes du répertoire ``classes/`` des plugins actifs.

source: You're encouraged to follow the `PHP-FIG <http://www.php-fig.org/>`_ standards when writing your classes.
fr: Vous êtes encouragés à suivre les standards `PHP-FIG <http://www.php-fig.org/>`_ quand vous écrivez vos classes.

source: Files with a ".class.php" extension will **not** be recognized by Elgg.
fr: Les fichiers avec une extension ".class.php" ne seront **pas** reconnus par Elgg.

source: When organizing you classes Elgg does not require a specific structure. Use what works best for your plugin but keep in mind that it should be easy to read, funtionality should be easy to find and having seperated functions into different classes will improve maintainability and testability.
fr: Lors de l’organisation de vos classes, Elgg n'impose pas une structure spécifique. Utilisez ce qui fonctionne le mieux pour votre plugin, mais gardez à l’esprit qu’il devrait être facile à lire, et que ses fonctionnalités devraient être faciles à trouver, et qu'avoir des fonctions séparées dans différentes classes permettra d’améliorer la maintenabilité et la testabilité.

source: Vendors
fr: Fournisseurs - vendors

source: Included third-party libraries of any kind *should* be included in the ``vendors/`` folder in the plugin root. Though this folder has no special significance to the Elgg engine, this has historically been the location where Elgg core stores its third-party libraries, so we encourage the same format for the sake of consistency and familiarity.
fr: Les bibliothèques tierce-partie de tout type *devraient* être placées dans le dossier ``vendors/`` de la racine du plugin. Quoique ce dossier n'ait pas de signification particulière pour le moteur de Elgg, il a été historiquement l'emplacement où le noyau de Elgg conservait ses bibliothèques tierces-parties, aussi nous encourageons le même format au nom de la cohérence et de la familiarité.

source: In order to override core views, a plugin's views can be placed in ``views/``, or an ``elgg-plugin.php`` config file can be used for more detailed file/path mapping. See :doc:`/guides/views`.
fr: Afin de surcharger des vues du noyau, les vues d'un plugin peuvent être placées dans ``views/``, ou un fichier de configuration ``elgg-plugin.php`` peut être utilisé pour un mappage fichier/chemin plus détaillé. Voyez :doc:`/guides/views`.

source: Javascript and CSS will live in the views system. See :doc:`/guides/javascript`.
fr: Javascript et CSS seront hébergés dans le système de vues. Voyez :doc:`/guides/javascript`.

source: Restore capability
fr: Capacité de restauration

source: Site setting
fr: Paramètre du site

source: Registration
fr: Inscription

source: Entity menu
fr: Menu d'entité

source: View deleted items
fr: Voir les éléments supprimés

source: Custom views
fr: Vues personnalisées

source: Restore a deleted item
fr: Restaurer un élément supprimé

source: ElggEntity functions
fr: Fonctions ElggEntity

source: There are 3 functions in an ``ElggEntity`` related to the deletion of that entity:
fr: Il existe dans une ``ElggEntity`` 3 fonctions relatives à la suppression de cette entité :

source: Function: delete
fr: Fonction : delete

source: Function: persistentDelete
fr: Fonction : persistentDelete

source: This will trigger the ``'delete', '<entity_type>'`` event sequence.
fr: Ceci déclenchera la séquence d'événement ``'delete', '<entity_type>'``.

source: Function: trash
fr: Fonction : trash

source: This will trigger the ``'trash', '<entity_type>'`` event sequence.
fr: Ceci déclenchera la séquence d'événement ``'trash', '<entity_type>'``.

source: Function: isDeleted
fr: Fonction : isDeleted

source: To check if an entity is marked as deleted.
fr: Pour indiquer qu'une entité est marquée comme supprimée.

source: Show deleted items
fr: Montrer les éléments supprimés

source: Cleanup of deleted entities
fr: Nettoyage des entités supprimées

source: More information
fr: Plus d'informations

source: Check out the :doc:`/guides/capabilities` documentation
fr: Consultez la documentation :doc:`/guides/capabilities`

source: River
fr: Rivière - Flux d'activité

source: Elgg natively supports the "river", an activity stream containing descriptions of activities performed by site members. This page gives an overview of adding events to the river in an Elgg plugin.
fr: Elgg supporte nativement la "rivière" - river -, un flux d'activité qui contient des descriptions des activités effectuées par les membres du site. Cette page donne un aperçu de comment un plugin Elgg ajoute des événements à la rivière.

source: Pushing river items
fr: Pousser des éléments vers la rivière

source: Items are pushed to the activity river through a function call, which you must include in your plugins for the items to appear.
fr: Des éléments sont poussés vers la rivière d'activité à travers l'appel à une fonction, que vous devez inclure dans vos plugins pour que ces éléments apparaissent.

source: Here we add a river item telling that a user has created a new blog post:
fr: Ici nous ajoutons un élément à la rivière, qui indique qu'un utilisateur a créé un nouvel article de blog :

source: All available parameters:
fr: Tous les paramètres disponibles :

source: ``view`` => STR The view that will handle the river item (must exist)
fr: ``view`` => STR La vue qui va gérer l'élément de la rivière (doit exister)

source: ``action_type`` => STR An arbitrary string to define the action (e.g. 'create', 'update', 'vote', 'review', etc)
fr: ``action_type`` => STR Une chaîne arbitraire pour définir l'action (par ex. 'create', 'update', 'vote', 'review', etc.)

source: ``subject_guid`` => INT The GUID of the entity doing the action (default: the logged in user guid)
fr: ``subject_guid`` => INT Le GUID de l'entité qui effectue l'action (par défaut : le guid de l'utilisateur connecté)

source: ``object_guid`` => INT The GUID of the entity being acted upon
fr: ``object_guid`` => INT Le GUID de l'entité sur laquelle est effectuée l'action

source: ``target_guid`` => INT The GUID of the object entity's container (optional)
fr: ``target_guid`` => INT Le GUID du conteneur de l'entité de l'objet (optionnel)

source: ``access_id`` => INT The access ID of the river item (default: same as the object)
fr: ``access_id`` => INT L'ID d'accès de l'élément de la rivière (par défaut : identique à celui de l'objet)

source: ``posted`` => INT The UNIX epoch timestamp of the river item (default: now)
fr: ``posted`` => INT Le timestamp UNIX de l'élément de la rivière (par défaut : maintenant)

source: ``annotation_id`` => INT The annotation ID associated with this river entry (optional)
fr: ``annotation_id`` => INT L'ID de l'annotation ID associée avec cette entrée de la rivière (optionnel)

source: When an item is deleted or changed, the river item will be updated automatically.
fr: Quand un élément est supprimé ou modifié, l'élément de la rivière sera mis à jour automatiquement.

source: River views
fr: Vues de la rivière

source: As of Elgg 3.0 the ``view`` parameter is no longer required. A fallback logic has been created to check a series of views for you:
fr: A partir de Elgg 3.0 le paramètre ``view`` n'est plus requis. Une logique de rechange a été créée pour vérifier une série de vues pour vous :

source: ``/river/{$type}/{$subtype}/{$action_type}``: eg. ``river/object/blog/create`` only the ``create`` action will come to this view
fr: ``/river/{$type}/{$subtype}/{$action_type}`` : par ex. ``river/object/blog/create`` seule l'action ``create`` parviendra à cette vue

source: ``river/{$type}/{$subtype}/default``: eg. ``river/object/blog/default`` all river activity for ``object`` ``blog`` will come here
fr: ``river/{$type}/{$subtype}/default`` : par ex. ``river/object/blog/default`` toute l'activité de la rivière pour ``object`` ``blog`` arrivera ici

source: ``river/{$type}/{$action_type}``: eg. ``river/object/create`` all ``create`` actions for ``object`` will come here
fr: ``river/{$type}/{$action_type}`` : par ex. ``river/object/create`` toutes les actions ``create`` pour ``object`` arriveront ici

source: ``river/{$type}/default``: eg. ``river/object/default`` all actions for all ``object`` will come here
fr: ``river/{$type}/default`` : par ex. ``river/object/default`` toutes les actions pour tous les ``object`` arriveront ici

source: ``river/elements/layout``: ultimate fall back view, this should always be called in any of the river views to make a consistent layout
fr: ``river/elements/layout`` : solution de rechange en dernier recours, qui devrait toujours être appelée dans n'importe laquelle des vues de la rivière afin de créer une mise en page cohérente

source: Both ``type`` and ``subtype`` are based on the ``type`` and ``subtype`` of the ``object_guid`` for which the river item was created.
fr: A la fois ``type`` et ``subtype`` sont basés sur le ``type`` et le ``subtype`` de l'``object_guid`` pour lequel l'élément de la rivière a été créé.

source: If no ``summary`` parameter is provided to the ``river/elements/layout`` the view will try to create it for you. The basic result will be a text with the text `Somebody did something on Object`, where `Somebody` is based on ``subject_guid`` and `Object` is based on ``object_guid``. For both `Somebody` and `Object` links will be created. These links are passed to a series of language keys so you can create a meaningfull summary.
fr: Si aucun paramètre ``summary`` n’est fourni à ``river/elements/layout`` la vue va tenter de le créer pour vous. Le résultat de base sera un texte avec le texte `Untel a fait quelque chose sur Ceci`, où `Untel` est basé sur ``subject_guid`` et ``Ceci`` est basé sur ``object_guid``. Des liens seront créés pour `Untel` et `Ceci`. Ces liens sont transmis à une série de clefs de traduction afin que vous puissiez générer un résumé informatif.

source: The language keys are:
fr: Les clefs de traduction sont :

source: ``river:{$type}:{$subtype}:{$action_type}``: eg. ``river:object:blog:create``
fr: ``river:{$type}:{$subtype}:{$action_type}``: par ex. ``river:object:blog:create``

source: ``river:{$type}:{$subtype}:default``: eg. ``river:object:blog:default``
fr: ``river:{$type}:{$subtype}:default``: par ex. ``river:object:blog:default``

source: ``river:{$type}:{$action_type}``: eg. ``river:object:create``
fr: ``river:{$type}:{$action_type}``: par ex. ``river:object:create``

source: ``river:{$type}:default``: eg. ``river:object:default``
fr: ``river:{$type}:default``: par ex. ``river:object:default``

source: Custom river view
fr: Vue personnalisée de la rivière

source: If you wish to add some more information to the river view, like an attachment (image, YouTube embed, etc), you must specify the :doc:`view <views>` when creating the river item. This view **MUST** exist.
fr: Si vous souhaitez ajouter plus d’informations à la vue de la rivière, comme par ex. une pièce jointe (une image, une vidéo YouTube embarquée, etc.), vous devez spécifier la :doc:`vue <views>` lors de la création de l’élément de la rivière. Cette vue **DOIT** exister.

source: We recommend ``/river/{type}/{subtype}/{action}``, where:
fr: Nous recommandons ``/river/{type}/{subtype}/{action}``, où :

source: ``{type}`` is the entity type of the content we're interested in (``object`` for objects, ``user`` for users, etc)
fr: ``{type}`` est le type d’entité du contenu qui nous intéresse (``object`` pour les objets, ``user`` pour les utilisateurs, etc.)

source: ``{subtype}`` is the entity subtype of the content we're interested in (``blog`` for blogs, ``photo_album`` for albums, etc)
fr: ``{subtype}`` est le sous-type d’entité du contenu qui nous intéresse (``blog`` pour les articles de blog, ``photo_album`` pour les albums photo, etc.)

source: ``{action}`` is the action that took place (``create``, ``update``, etc)
fr: ``{action}`` est l’action qui a eu lieu (``create``, ``update``, etc.)

source: River item information will be passed in an object called ``$vars['item']``, which contains the following important parameters:
fr: Les informations relatives à un élément de la rivière seront transmises dans un objet appelé ``$vars['item']``, qui contient les paramètres importants suivants :

source: ``$vars['item']->subject_guid`` The GUID of the user performing the action
fr: ``''$vars['item']->subject_guid`` Le GUID de l’utilisateur qui effectue l’action

source: ``$vars['item']->object_guid`` The GUID of the entity being acted upon
fr: ``$vars['item']->object_guid`` Le GUID de l’entité sur laquelle l'action est effectuée

source: Timestamps etc will be generated for you.
fr: Les horodatages, etc. seront générés pour vous.

source: For example, the blog plugin uses the following code for its river view:
fr: Par exemple, le plugin blog utilise le code suivant pour sa vue dans la rivière :

source: Elgg has two mechanisms to respond to HTTP requests that don't already go through the :doc:`/design/actions` and :doc:`/guides/views/simplecache` systems.
fr: Elgg dispose de deux mécanismes pour répondre aux requêtes HTTP qui ne passent pas déjà par les systèmes des :doc:`/design/actions` et du :doc:`/guides/views/simplecache`.

source: URL Identifier and Segments
fr: Identifiant d'URL et segments

source: After removing the site URL, Elgg splits the URL path by ``/`` into an array. The first element, the **identifier**, is shifted off, and the remaining elements are called the **segments**. For example, if the site URL is ``http://example.com/elgg/``, the URL ``http://example.com/elgg/blog/owner/jane?foo=123`` produces:
fr: Après avoir retiré l’URL du site, Elgg découpe le chemin de l’URL par ``/`` dans un tableau. Le premier élément, l’**identificateur**, est mis de côté, et les éléments restants sont appelés les **segments**. Par exemple, si l’URL du site est ``http://example.com/elgg/``, l’URL ``http://example.com/elgg/blog/owner/jane?foo=123`` produit :

source: Identifier: ``'blog'``. Segments: ``['owner', 'jane']``. (the query string parameters are available via ``get_input()``)
fr: Identificateur : ``'blog'``. Segments : ``['owner', 'jane']``. (les paramètres de la chaîne de requête sont disponibles via ``get_input()``)

source: The site URL (home page) is a special case that produces an empty string identifier and an empty segments array.
fr: L’URL du site (page d’accueil) est un cas spécial qui produit un identificateur de chaîne vide et un tableau de segments vide.

source: URL identifier/segments should be considered potentially dangerous user input. Elgg uses ``htmlspecialchars`` to escapes HTML entities in them.
fr: Les identificateurs/segments d’URL doivent être considérés comme des entrées utilisateur potentiellement dangereuses. Elgg utilise dessus ``htmlspecialchars`` pour échapper les entités HTML.

source: Page Handling
fr: Gestion des pages

source: Elgg offers a facility to manage your plugin pages via custom routes, enabling URLs like ``http://yoursite/my_plugin/section``. You can register a new route using ``elgg_register_route()``, or via ``routes`` config in ``elgg-plugin.php``. Routes map to resource views, where you can render page contents.
fr: Elgg offre des outils pour gérer les pages de votre plugin via des routes personnalisées, permettant des URLs comme ``http://yoursite/my_plugin/section``. Vous pouvez enregistrer une nouvelle route en utilisant ``elgg_register_route()`` ou via la configuration ``routes`` dans ``elgg-plugin.php``. Les routes assurent la correspondance avec les vues de ressources, où vous pouvez générer le contenu de la page.
