Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/guides.po
Languages: fr

source: You don’t need to add a save button or the form, this will be handled by the framework.
fr: Vous n’avez pas besoin d’ajouter de bouton d’enregistrement ni le formulaire, cela sera géré par le framework.

source: You cannot use form components that send no value when "off." These include radio inputs and check boxes.
fr: Vous ne pouvez pas utiliser des composants de formulaire qui n’envoient aucune valeur lorsqu’ils sont "off". Il s’agit notamment des entrées radio et des cases à cocher.

source: If your plugin settings require a cache flush you can add a (hidden) input on the form with the name 'flush_cache' and value '1'
fr: Si vos paramètres de plugin ont besoin d'un vidage des caches, vous pouvez ajouter une entrée (cachée) sur le formulaire avec le nom 'flush_cache' et la valeur '1'

source: User settings
fr: Paramètres de l'utilisateur

source: Your plugin might need to store per user settings too, and you would like to have your plugin's options to appear in the user's settings page. This is also easy to do and follows the same pattern as setting up the global plugin configuration explained earlier. The only difference is that instead of using a ``settings`` file you will use ``usersettings``. So, the path to the user edit view for your plugin would be ``plugins/<your_plugin>/usersettings.php``.
fr: Votre plugin peut également avoir besoin de stocker des paramètres pour chaque utilisateur, et vous voudrez voir les options de votre plugin apparaître dans la page des paramètres de l’utilisateur. Ceci est également facile à faire et suit le même modèle que la configuration globale du plugin expliquée plus tôt. La seule différence est qu’au lieu d’utiliser un fichier ``settings``, vous utiliserez ``usersettings``. Ainsi, le chemin d’accès à la vue de modification des paramètres utilisateur de votre plugin serait ``plugins/<your_plugin>/usersettings.php``.

source: The title of the usersettings form will default to the plugin name. If you want to change this, add a translation for ``<plugin_id>:usersettings:title``.
fr: Le titre du formulaire des paramètres utilisateur sera par défaut le nom du plugin. Si vous souhaitez modifier cela, ajoutez une traduction pour ``<plugin_id>:usersettings:title``.

source: Group settings
fr: Paramètres du groupe

source: If your plugin needs settings per group you can extend the view ``groups/edit/settings`` to show your settings. The settings are shown during group creation and edit. In order for the settings to be saved correctly they need a name in the format ``settings[<plugin id>][<setting name>]``.
fr: Si votre plugin a besoin de paramètres pour chaque groupe, vous pouvez étendre la vue ``groups/edit/settings`` pour afficher vos paramètres. Les paramètres sont affichés lors de la création et de la modification du groupe. Pour que les paramètres soient enregistrés correctement, ils ont besoin d'un nom au format ``settings[<plugin id>][<setting name>]``.

source: Retrieving settings in your code
fr: Récupérer des paramètres dans votre code

source: To retrieve settings from your code use:
fr: Pour récupérer les paramètres depuis votre code utilisez :

source: or for user settings:
fr: ou pour les paramètres utilisateur :

source: where:
fr: où :

source: ``$name`` Is the value you want to retrieve
fr: ``$name`` Est la valeur que vous souhaitez récupérer

source: ``$user_guid`` Is the user you want to retrieve these for (defaults to the currently logged in user)
fr: ``$user_guid`` Est l’utilisateur pour lequel vous souhaitez récupérer ces valeurs (par défaut l’utilisateur actuellement connecté)

source: ``$plugin_name`` Is the name of the plugin (detected if run from within a plugin)
fr: ``$plugin_name`` Est le nom du plugin (détecté s’il s’exécute à partir d’un plugin)

source: or for group settings:
fr: ou pour les paramètres du groupe :

source: Setting values while in code
fr: Définir des valeurs via le code

source: Values may also be set from within your plugin code, to do this use one of the following functions:
fr: Les valeurs peuvent également être définies à partir du code de votre plugin, pour cela utilisez l’une des fonctions suivantes :

source: The ``$plugin_id`` needs to be provided when setting plugin (user)settings.
fr: Le ``$plugin_id`` doit être fourni lors de la définition des paramètres du plugin (ou de l'utilisateur).

source: Default plugin (group|user) settings
fr: Paramètres par défaut (groupe|utilisateur) du plugin

source: If a plugin or a user not have a setting stored in the database, you sometimes have the need for a certain default value. You can pass this when using the getter functions.
fr: Si un plugin ou un utilisateur n’a pas de paramètre stocké dans la base de données, vous avez parfois besoin d’une certaine valeur par défaut. Vous pouvez passer cela lors de l’utilisation des fonctions de récupération - getter.

source: Alternatively you can also provide default plugin and user settings in the ``elgg-plugin.php`` file.
fr: Vous pouvez également fournir des paramètres par défaut du plugin et de l'utilisateur dans le fichier ``elgg-plugin.php``.

source: Group settings don't have a default value available in the ``elgg-plugin.php`` file.
fr: Les paramètres de groupe n'ont pas de valeur par défaut disponible dans le fichier ``elgg-plugin.php``.

source: Themes
fr: Thèmes

source: Customize the look and feel of Elgg.
fr: Personnaliser l'apparence et le comportement de Elgg.

source: A theme is a type of :doc:`plugin </admin/plugins>` that overrides display aspects of Elgg.
fr: Un thème est un type de :doc:`plugin </admin/plugins>` qui surcharge des aspects d'affichage de Elgg.

source: This guide assumes you are familiar with:
fr: Ce guide suppose que vous connaissez :

source: Theming Principles and Best Practices
fr: Principes de création d'un thème et Bonnes Pratiques

source: **No third-party CSS frameworks**
fr: **Pas de framework CSS tierce-partie**

source: Elgg does not use a CSS framework, because such frameworks lock users into a specific HTML markup, which in the end makes it much harder for plugins to collaborate on the appearance. What's `is-primary` in one theme, might be something else in the other. Having no framework allows plugins to alter appearance using pure css, without having to overwrite views and append framework-specific selectors to HTML markup elements.
fr: Elgg n’utilise pas de framework CSS, car ces frameworks enferment les utilisateurs dans un balisage HTML spécifique, ce qui rend finalement beaucoup plus difficile pour les plugins de collaborer sur l’apparence. Ce qui est `is-primary` dans un thème pourrait être quelque chose d’autre dans un autre. L'absence de framework permet aux plugins de modifier l’apparence à l’aide de css pur, sans avoir à remplacer des vues ni devoir ajouter aux éléments de balisage HTML des sélecteurs spécifiques à un framework particulier.

source: **8-point grid system**
fr: **système de grille à 8 points**

source: Elgg uses an `8-point grid system <https://builttoadapt.io/intro-to-the-8-point-grid-system-d2573cde8632>`, so sizing of elements, their padding, margins etc is done in increments and fractions of `8px`. Because our default font-size is ``16px``, we use fractions of `rem`, so ``0.5rem = 8px``. 8-point grid system makes it a lot easier for developers to collaborate on styling elements: we no longer have to think if the padding should be ``5px`` or ``6px``.
fr: Elgg utilise un `système de grille à 8 points <https://builttoadapt.io/intro-to-the-8-point-grid-system-d2573cde8632>`, aussi les dimensions des éléments, leurs marges internes et externes, etc se font par incréments et fractions de ``8px``. Étant donné que notre taille de police par défaut est ``16px``, nous utilisons des fractions de `rem`, de sorte que ``0.5rem = 8px``. Le système de grille à 8 points permet aux développeurs de collaborer beaucoup plus facilement sur des éléments de style : cela évite de se demander si la marge interne doit être de ``5px`` ou de ``6px``.

source: **Mobile first**
fr: **Mobile first - Conçu d'abord pour les mobiles**

source: We write mobile-first CSS. We use two breakpoints: ``50rem`` and ``80rem`` (800px and 1280px at 16px/rem).
fr: Nous écrivons un CSS mobile-first. Nous utilisons deux points de rupture : ``50rem`` et ``80rem`` (800px et 1280px à 16px/rem).

source: **Flexbox driven**
fr: **piloté par Flexbox**

source: Flexbox provides simplicity in stacking elements into grids. Flexbox is used for everything from menus to layout elements.
fr: Flexbox offre une simplicité d'empilement d'éléments dans des grilles. Flexbox est utilisé pour tout, des menus aux éléments de mise en page.

source: **Symmetrical**
fr: **Symétrique**

source: We maintain symmetry.
fr: Nous maintenons la symétrie.

source: **Simple color transitions**
fr: **Des transitions de couleur simples**

source: We maintain 4 sets of colors for text, background and border: ``soft``, ``mild``, ``strong`` and ``highlight``. When transitioning to hover or active state, we go one level up, e.g. from ``soft`` to ``mild``, or use ``highlight``. When transition to inactive or disabled state, we go one level down.
fr: Nous maintenons 4 ensembles de couleurs pour le texte, les arrière-plans et les bordures : ``soft`` - doux, ``mild`` - modéré, ``strong`` - fort et ``highlight`` - en exergue. Lors de la transition vers l’état hover ou active, nous montons d’un niveau, par exemple de ``soft`` à ``mild``, ou utilisons ``highlight``. Lorsque nous passons à un état inactif ou désactivé, nous descendons d’un niveau.

source: **Increase the click area**
fr: **Augmentez la zone de clic**

source: When working with nested anchors, we increase the click area of the anchor, rather than the parent
fr: En travaillant avec des ancres imbriquées, nous augmentons la zone de clic de l’ancre, plutôt que le parent

source: **No z-index 999999**
fr: **Pas de z-index 999999**

source: z-indexes are incremented with a step of 1.
fr: les z-index sont incrémentés par pas de 1.

source: **Wrap HTML siblings**
fr: **Envelopper les parents HTML**

source: We make sure that there are no orphaned strings within a parent and that siblings are wrapped in a way that they can be targeted by CSS.
fr: Nous nous assurons qu’il n’y a pas de chaîne orpheline au sein d’un parent et que les frères et sœurs sont enveloppés d’une manière qui permet de les cibler par CSS.

source: Create your plugin
fr: Créez votre plugin

source: Create your plugin as described in the :doc:`developer guide </guides/index>`.
fr: Créez votre plugin tel que décrit dans le :doc:`guide de développement </guides/index>`.

source: Create a new directory under mod/
fr: Créez un nouveau dossier dans mod/

source: Create a new elgg-plugin.php
fr: Créer un nouveau fichier elgg-plugin.php

source: Create a composer.json file describing your theme.
fr: Créez un fichier composer.json décrivant votre thème.

source: Customize the CSS
fr: Personnalisez les CSS

source: The css is split into several files based on what aspects of the site you're theming. This allows you to tackle them one at a time, giving you a chance to make real progress without getting overwhelmed.
fr: Le css est découpé en plusieurs fichiers en fonction des aspects du site que vous êtes en train de styler. Cela vous permet de les aborder un à la fois, vous donnant une chance de faire de réelles améliorations sans être submergé.

source: Here is a list of the existing CSS views:
fr: Voici la liste des vues CSS existantes :

source: elements/buttons.css: Provides a way to style all the different kinds of buttons your site will use. There are 5 kinds of buttons that plugins will expect to be available: action, cancel, delete, submit, and special.
fr: elements/buttons.css : fournit un moyen de styler tous les différents types de boutons que votre site utilise. Il existe 5 types de boutons que les plugins s’attendent à trouver disponibles : action, cancel - annuler, delete - supprimer, submit - envoyer, et special.

source: elements/chrome.css: This file has some miscellaneous look-and-feel classes.
fr: elements/chrome.css : ce fichier comporte diverses classes de présentation.

source: elements/components.css: This file contains many “css objects” that are used all over the site: media block, list, gallery, table, owner block, system messages, river, tags, photo, and comments.
fr: elements/components.css : ce fichier contient de nombreux “objets css” qui sont utilisés sur tout le site : media block - bloc multimédia, list, gallery, table - tableau, owner block - propriétaire, system, messages, river, tags, photo et comments.

source: elements/forms.css: This file determines what your forms and input elements will look like.
fr: elements/forms.css : ce fichier détermine à quoi ressembleront vos formulaires et éléments d'entrées

source: elements/icons.css: Contains styles for the icons and avatars used on your site.
fr: elements/icons.css : contient des styles pour les icônes et avatars utilisés sur votre site.

source: elements/layout.css: Determines what your page layout will look like: sidebars, page wrapper, main body, header, footer, etc.
fr: elements/layout.css : détermine à quoi ressemblera votre page : barres latérales, emballage de la page, corps principal, entête, pied de page, etc.

source: elements/modules.css: Lots of content in Elgg is displayed in boxes with a title and a content body. We called these modules. There are a few kinds: info, aside, featured, dropdown, popup, widget. Widget styles are included in this file too, since they are a subset of modules.
fr: elements/modules.css : Beaucoup de contenu dans Elgg s’affiche dans des boîtes avec un titre et un corps de contenu. Nous les avons appelées des modules. Il en existe de quelques sortes: info, aside - sur le côté, featured - en vedette, dropdown - déroulant, popup, widget. Les styles des widgets sont également inclus dans ce fichier, car ils sont un sous-ensemble des modules.

source: elements/navigation.css: This file determines what all your menus will look like.
fr: elements/navigation.css : Ce fichier détermine à quoi ressembleront tous vos menus.

source: elements/typography.css: This file determines what the content and headings of your site will look like.
fr: elements/typography.css : ce fichier détermine à quoi ressemblera le contenu et les titres de votre site.

source: rtl.css: Custom rules for users viewing your site in a right-to-left language.
fr: rtl.css : des règles personnalisées pour les utilisateurs qui consultent votre site dans une langue de droite à gauche.

source: admin.css: A completely separate theme for the admin area (usually not overridden).
fr: admin.css : un thème totalement distinct pour la zone d’administration (généralement pas remplacé).

source: elgg.css: Compiles all the core elements/\* files into one file (DO NOT OVERRIDE).
fr: elgg.css : compile tous les fichiers du noyau du dossier elements/\* dans un seul fichier (NE PAS REMPLACER).

source: elements/reset.css: Contains a reset stylesheet that forces elements to have the same default
fr: éléments/reset.css : contient une feuille de style de réinitialisation qui force les éléments à avoir le même rendu par défaut

source: CSS variables
fr: Variables CSS

source: Elgg uses CssCrush for preprocessing CSS files. This gives us the flexibility of using global CSS variables. Plugins should, wherever possible, use global CSS variables, and extend the core theme with their plugin variables, so they can be simply altered by other plugins.
fr: Elgg utilise CssCrush pour prétraiter les fichiers CSS. Cela nous donne la flexibilité d’utiliser des variables CSS globales. Les plugins devraient, dans la mesure du possible, utiliser des variables CSS globales et étendre le thème de base avec leurs variables plugin, afin qu’ils puissent être simplement modifiés par d’autres plugins.

source: To add or alter variables, use the ``vars:compiler, css`` event. Note that you may need to flush the cache to see your changes in action.
fr: Pour ajouter ou modifier des variables, utilisez l'événement ``vars:compiler, css``. Notez que vous devrez peut-être vider le cache pour voir vos modifications en action.

source: For a list of default core variables, see ``engine/theme.php``.
fr: Pour obtenir une liste des variables par défaut du noyau, voyez ``engine/theme.php``.

source: View extension
fr: Extension d'une vue

source: There are two ways you can modify views:
fr: Il existe deux manières de modifier les vues :

source: The first way is to add extra stuff to an existing view via the ``views_extensions`` section within your elgg-plugin.php definition.
fr: La première façon est d'ajouter des éléments supplémentaires à une vue existante via la section ``views_extensions`` dans la définition de votre elgg-plugin.php.

source: For example, the following configuration will add mytheme/css to Elgg's core css file:
fr: Par exemple, la configuration suivante va ajouter mytheme/css au fichier css du noyau de Elgg :

source: View overloading
fr: Surcharge des vues

source: Plugins can have a view hierarchy, any file that exists here will replace any files in the existing core view hierarchy... so for example, if my plugin has a file:
fr: Les plugins peuvent avoir une arborescence des vues, n’importe quel fichier qui existe ici remplacera tout fichier dans l'arborescence des vues du noyau existante... ainsi par exemple, si mon plugin a un fichier :

source: it will replace:
fr: ceci va remplacer :

source: But only when the plugin is active.
fr: Mais seulement quand le plugin est actif.

source: This gives you total control over the way Elgg looks and behaves. It gives you the option to either slightly modify or totally replace existing views.
fr: Cela vous donne un contrôle total sur l'apparence et le comportement de Elgg. Cela vous offre la possibilité de modifier légèrement ou de remplacer totalement les vues existantes.

source: Icons
fr: Icônes

source: As of Elgg 2.0 the default Elgg icons come from the FontAwesome_ library. You can use any of these icons by calling:
fr: À partir de Elgg 2.0, les icônes par défaut de Elgg proviennent de la bibliothèque FontAwesome_. Vous pouvez utiliser l’une de ces icônes en appelant :

source: ``icon-name`` can be any of the `FontAwesome icons`_ without the ``fa-``-prefix.
fr: ``icon-name`` peut être n'importe laquelle des `icônes de FontAwesome`_ sans le préfixe ``fa-``-.

source: By default you will get the solid styled variant of the icons. Postfixing the icon name with ``-solid``, ``-regular`` or ``-light`` allows you to target a specific style. Be advised; the light styled variant is only available as a FontAwesome Pro licensed icon.
fr: Par défaut, vous obtiendrez la variante de style solid des icônes. En ajoutant au nom de l’icône l'un des suffixes ``-solid``, ``-regular`` ou ``-light``, vous pouvez cibler un style spécifique. Soyez avisé ; la variante de style light n’est disponible qu’en tant qu’icône sous licence FontAwesome Pro.

source: Tools
fr: Outils

source: We've provided you with some development tools to help you with theming: Turn on the “Developers” plugin and go to the “Theme Preview” page to start tracking your theme's progress.
fr: Nous vous avons fourni quelques outils de développement pour vous aider à mettre en place des thèmes : activez le plugin “Developers” et accédez à la page “Theme Preview” - Aperçu du thème - pour commencer à suivre les progrès de votre thème.

source: Customizing the front page
fr: Personnaliser la page d'accueil

source: The main Elgg index page is served via a resource view.
fr: La page d'index principale de Elgg est servie via une vue des ressource.

source: Therefore, you can override it by providing your own resource file in ``your_plugin/views/default/resources/index.php``.
fr: Par conséquent, vous pouvez le remplacer en fournissant votre propre fichier de ressources dans ``your_plugin/views/default/resources/index.php``.

source: Writing a plugin upgrade
fr: Écrire une mise à niveau de plugin

source: Every now and then there comes a time when a plugin needs to change the contents or the structure of the data it has stored either in the database or the dataroot.
fr: De temps en temps, il arrive un moment où un plugin doit modifier le contenu ou la structure des données qu’il a stockées soit dans la base de données, soit dans le répertoire des données.

source: The motivation for this may be that the data structure needs to be converted to more efficient or flexible structure. Or perhaps due to a bug the data items have been saved in an invalid way, and they needs to be converted to the correct format.
fr: La raison de ceci pourrait être que la structure des données doit être convertie en une structure plus efficace ou plus flexible. Ou peut-être en raison d’un bogue les éléments de données ont été enregistrés d’une manière non valide, et ils doivent être convertis dans le format correct.

source: Migrations and convertions like this may take a long time if there is a lot of data to be processed. This is why Elgg provides the ``Elgg\Upgrade\AsynchronousUpgrade`` class that can be used for implementing long-running upgrades.
fr: De telles migrations et conversions peuvent prendre beaucoup de temps s'il y a beaucoup de données à traiter. C'est pourquoi Elgg fournit la classe ``Elgg\Upgrade\AsynchronousUpgrade`` qui peut être utilisée pour implémenter des mises à niveau de longue durée.

source: Declaring a plugin upgrade
fr: Déclarer la mise à niveau d'un plugin

source: Plugin can communicate the need for an upgrade under the ``upgrades`` key in ``elgg-plugin.php`` file. Each value of the array must be the fully qualified name of an upgrade class that extends the ``Elgg\Upgrade\AsynchronousUpgrade`` class.
fr: Le plugin peut communiquer la nécessité d'une mise à niveau avec la clé ``upgrades`` dans le fichier ``elgg-plugin.php``. Chaque valeur du tableau doit être le nom complet d'une classe de mise à niveau qui étend la classe ``Elgg\Upgrade\AsynchronousUpgrade``.

source: Example from ``mod/blog/elgg-plugin.php`` file:
fr: Exemple tiré du fichier ``mod/blog/elgg-plugin.php`` :

source: The class names in the example refer to the classes:
fr: Les noms de classe dans l’exemple se réfèrent aux classes :

source: Elgg core upgrade classes can be declared in ``engine/lib/upgrades/async-upgrades.php``.
fr: Les classes de mise à niveau du noyau Elgg peuvent être déclarées dans ``engine/lib/upgrades/async-upgrades.php``.

source: The upgrade class
fr: La classe de mise à niveau

source: A class extending the ``Elgg\Upgrade\AsynchronousUpgrade`` class has a lot of freedom on how it wants to handle the actual processing of the data. It must however declare some constant variables and also take care of marking whether each processed item was upgraded successfully or not.
fr: Une classe qui étend la classe ``Elgg\Upgrade\AsynchronousUpgrade`` a beaucoup de liberté sur la façon dont elle souhaite gérer le traitement réel des données. Elle doit cependant déclarer certaines variables constantes et également prendre soin de marquer si chaque élément traité a été mis à niveau avec succès ou non.

source: The basic structure of the class is the following:
fr: La structure de base de la classe est la suivante :

source: Do not assume when your class will be instantiated or when/how often its public methods will be called.
fr: Ne présumez pas quand votre classe sera instanciée ou quand/combien de fois ses méthodes publiques seront appelées.

source: Class methods
fr: Méthodes de la classe
