Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ca, de, fr, it, pt_br

source: Elgg Documentation (|version|)
fr: Documentation Elgg (|version|)

source: Elgg_ (:download:`pronunciation <_elgg_files/How_to_say_Elgg.mp3>`) is an open source rapid development framework for socially aware web applications. It is a great fit for building any app where users log in and share information.
fr: Elgg_ (:download:`pronunciation <_elgg_files/How_to_say_Elgg.mp3>`) est un framework de développement rapide pour construire des applications web sociales. C'est un excellent choix pour construire tout type d'application où des utilisateurs se connectent et partagent des informations.

source: Features
fr: Fonctionnalités

source: **Well-documented core API** that allows developers to kick start their new project with a simple learning curve
fr: **Une API bien documentée** qui permet aux développeurs d'accélérer leurs nouveaux projets avec une courbe d'apprentissage simple

source: **Composer** is the package manager of choice that greatly simplifes installation and maintenance of Elgg core and plugins
fr: **Composer** est le gestionnaire de paquets qui simplifie grandement l'installation et la maintenance du coeur d'Elgg et des plugins

source: **Flexible system of hooks and events** that allows plugins to extend and modify most aspects of application's functionality and behavior
fr: **Un système flexible de hooks et d'événements** qui permet aux plugins d'étendre et de modifier la majorité des aspects du fonctionnement et du comportement des fonctionnalités des applications

source: **Extendable system of views** that allows plugins to collaborate on application's presentation layer and built out complex custom themes
fr: **Un système de vues extensible** qui permet aux plugins de collaborer sur la couche de présentation des applications et de construire des thèmes personnalisés complexes

source: **Cacheable system of static assets** that allows themes and plugins to serve images, stylesheets, fonts and scripts bypassing the engine
fr: **Un système d'assets statiques mis en cache** qui permet aux thèmes et aux plugins de servir des images, feuilles de style, polices et scripts sans charger le moteur

source: **User authentication** is powered by pluggable auth modules, which allow applications to implement custom authentication protocols
fr: **L'authentication des utilsateurs** s'appuie sur des modules d'authentification enfichables, ce qui permet aux applications d'implémenter des protocoles d'authentification personnalisés

source: **Security** is ensured by built-in anti CSRF validation, strict XSS filters, HMAC signatures, latest cryptographic approaches to password hashing
fr: **La Sécurité** est assurée par une validation anti CSRF native, des filtres XSS stricts, des signatures HMAC, et les dernières approches cryptographiques pour le hachage des mots de passe

source: **Client-side API** powered by asynchronous JavaScript modules via RequireJS and a build-in Ajax service for easy communication with the server
fr: **Une API côté client** motorisée par des modules JavaScript asynchrones chargés via RequireJS et un service Ajax natif pour une communication aisée avec le serveur

source: **Flexible entity system** that allows applications to prototype new types of content and user interactions
fr: **Un système d'Entités flexible** qui permet aux applications de prototyper de nouveaux types de contenus et d'interactions entre utilisateurs

source: **Opinionated data model** with a consolidated API layer that allows the developers to easily interface with the database
fr: **Un modèle de données très bien conçu** avec une couche d'API consolidée qui permet aux développeurs de créer facilement les interfaces avec la base de données

source: **Access control system** that allows applications to build granular content access policies, as well as create private networks and intranets
fr: **Une système de contrôle d'accès** qui permet aux applications de construire des politiques d'accès aux contenus granulaires, comme de créer des réseaux privés et des intranets

source: **Groups** - out of the box support for user groups
fr: **Groupes** - support d'emblée pour des groupes d'utilisateurs

source: **File storage** powered by flexible API that allows plugins to store user-generated files and serve/stream them without booting the engine
fr: **Stockage de fichiers** supporté par une API flexible qui permet aux plugins de stocker les fichiers créés par les utilisateurs et de les servir/streamer sans démarrer le moteur

source: **Notifications service** that allows applications to subscribe users to on-site and email notifications and implement integrations with other their-party services
fr: **Un Service de Notifications** qui permet aux applications d'abonner des utilisateurs aux notifications sur le site ou par email, et d'implémenter l'intégration avec d'autres services tierce-partie

source: **RPC web services** that can be used for complex integrations with external applications and mobile clients
fr: **Des Services Web RPC** qui peuvent être utilisés pour des intégrations complexes avec des applications externes et des clietns mobiles

source: **Internationalization** and localization of Elgg applications is simple and can be integrated with third-party services such as Transifex
fr: **L'Internationalisation** et la localisation des applications Elgg est simple et peut être intégrée avec des services tierce-partie tels que Transifex

source: **Elgg community** that can help with any arising issues and hosts a repository of **1000+ open source plugins**
fr: **La communauté Elgg** peut aider sur n'importe quelle problématique qui survienne, et héberge un répertoire de plus de **1000+ plugins open source**

source: Under the hood:
fr: Sous le capot :

source: Elgg is a modular OOP framework that is driven by DI services
fr: Elgg est un framework modulaire orienté objet (OOP) qui est dirigé par des services DI

source: NGINX or Apache compatible
fr: compatible NGINX ou Apache

source: Symfony2 HTTP Foundation handles requests and responses
fr: Symfony2 HTTP Foundation gère les requêtes et réponses

source: RequireJS handles AMD
fr: RequireJS gère les modules AMD

source: Zend Mail handles outgoing email
fr: Zend Mail gère les emails sortants

source: htmLawed XSS filters
fr: Filtres XSS htmLawed

source: Phinx database migrations
fr: Migrations de base de donnée Phinx

source: CSS-Crush for CSS preprocessing
fr: CSS-Crush pour le pré-traitement CSS

source: Imagine for image manipulation
fr: Imagine pour la manipulation d'image

source: Persistent caching with Memcached and/or Redis
fr: Cache persistant avec Memcached et/ou Redis

source: Error handling with Monolog
fr: Gestion des erreurs avec Monolog

source: Examples
fr: Exemples

source: It has been used to build `all kinds of social apps`__:
ca: S'ha utilitzat per construir `tot tipus d'aplicacions socials`__:
de: Es wurde bereits für die Erstellung der `verschiedensten Social Network-Anwendungen`__ verwendet:
fr: Elgg a été utilisé pour construire `tous types d'applications sociales`__:
it: È stato utilizzato per costruire `all kinds of social apps`__:
pt_br: Tem sido utilizado para `todos tipos de aplicativos sociais`__:

source: open networks (similar to Facebook)
ca: xarxes obertes (similar a Facebook)
de: offene Social Network-Webseiten (ähnlich zu Facebook)
fr: réseau sociaux ouverts (similaires à Facebook)
it: social aperto (simile a Facebook)
pt_br: redes abertas (similar ao Facebook)

source: topical (like the Elgg Community)
ca: tòpica (com la Comunitat Elgg)
de: themenbezogene Social Network-Webseiten (wie der Elgg-Community-Seite)
fr: thématiques (comme la communauté Elgg)
it: basato sugli argomenti (come la community di Elgg)
pt_br: tópica (como a Comunidade Elgg)

source: private/corporate intranets
fr: intranets privés ou professionnels

source: dating
ca: cites
de: Partnervermittlungs-Webseiten
fr: rencontres
it: incontri
pt_br: encontros

source: educational
ca: educatiu
de: Webseiten für Bildungseinrichtungen
fr: éducatifs
it: didattico
pt_br: educacional

source: company blog
ca: bloc de companyia
de: Firmenblogs
fr: blog d'entreprise
it: blog aziendale
pt_br: blog da empresa

source: This is the canonical documentation for the Elgg_ project.
de: Im Folgenden ist die Gliederung der Dokumentation für Elgg_ dargestellt.
fr: Ceci constitue la documentation officielle du projet Elgg_.
it: Questa è la documentazione canonica per il progetto Elgg__

source: Continue Reading
fr: Poursuivre le lecture

source: Elgg |version| Documentation
ca: Documentació d'Elgg |version|
de: Dokumentation für Elgg |version|
it: Documentazione di Elgg |version|
pt_br: Elgg |versão| Documentação

source: Elgg_ (`pronunciation`__) is a rapid development framework with built-in social features. It is a great fit for building any app where users log in and share information.
ca: Elgg_ (`pronunciation`__) és un entorn de treball de desenvolupament ràpid amb característiques socials integrades. És una excel·lent opció per a la construcció de qualsevol aplicació on els usuaris inicien sessió i comparteixen informació.
pt_br: Elgg_ (`pronunciation`__) é um framework de desenvolvimento rápido, com recursos sociais integrados. É uma excelente opção para a construção de qualquer aplicativo onde os usuários fazem login e compartilhar informações.

source: private intranets
ca: xarxes privades
de: geschlossene Intranet-Seiten
it: intranet privata
pt_br: intranets privativas

source: There is also a `demo site`_ running a standard installation of Elgg.
ca: També hi ha un `lloc de demostració`_ amb una instal·lació estàndard d'Elgg
de: Es steht auch eine `Demo-Webseite`_ mit einer Standard-Elgg-Installation zur Verfügung
it: C'è anche un `demo site`_ che esegue un'installazione standard di Elgg.
pt_br: Existe também uma site 'demo' funcionando como instalação padrão do Elgg.

source: This is the canonical documentation for the Elgg_ project. This aims to replace the wiki_, which is out-of-date in many areas.
ca: Aquesta és la documentació canònica per al projecte Elgg_. Això té com a objectiu reemplaçar el wiki_, que desactualitzat en moltes àrees.
pt_br: Esta é a documentação (canonical documentation) para o projeto Elgg. Este tem como objetivo substituir o wiki_, que está desatualizado em muitas áreas.

source: Elgg_ (:download:`pronunciation <_elgg_files/How_to_say_Elgg.mp3>`) is a rapid development framework with built-in social features. It is a great fit for building any app where users log in and share information.
de: Elgg_ (:download:`Aussprache <_elgg_files/How_to_say_Elgg.mp3>`) ist ein Rapid Development-Framework mit integrierter Social Network-Funktionalität. Es eignet sich besonders für die Erstellung von Anwendungen, bei denen die Erzeugung und Verwaltung von Benutzeraccounts notwendig ist und bei denen es den Anwendern möglich sein soll, untereinander Daten und Informationen zu teilen.
it: Elgg_ (:download:`pronunciation <_elgg_files/How_to_say_Elgg.mp3>`) è un ambiente di sviluppo rapido con intrinseche caratteristiche social. Si adatta veramente bene a costruire app in cui gli utenti si registrano a un sito e condividono informazioni.
