Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: fr

source: Developer Overview
fr: Vue d'ensemble pour les développeurs

source: This is a quick developer introduction to Elgg. It covers the basic approach to working with Elgg as a framework, and mentions some of the terms and technologies used.
fr: Cette page constitue une rapide introduction à Elgg pour les développeurs. Elle couvre les approches de base pour travailler avec Elgg en tant que framework, et mentionne certains des termes et des technologies utilisées.

source: See the :doc:`/guides/index` for tutorials or the :doc:`/design/index` for in-depth discussion on design.
fr: Voyez :doc:`/guides/index` pour des tutoriels ou :doc:`/design/index` pour une discussion approfondie sur le design.

source: Database and Persistence
fr: Base de données et persistence

source: Elgg uses MySQL 5.5 or higher for data persistence, and maps database values into Entities (a representation of an atomic unit of information) and Extenders (additional information and descriptions about Entities). Elgg supports additional information such as relationships between Entities, activity streams, and various types of settings.
fr: Elgg utilise MySQL 5.5 ou supérieur pour la persistance des données, et les données de la base sont rranscrites (mappées) dans des Entités (une représentation d'une unité d'information atomique) et des Extenseurs (Extenders) (des informations additionnelles et des descriptions à propos des Entités). Elgg supporte des informations additionnelles telles que des relations entre des Entités, des flux d'activités, et divers types de réglages.

source: Plugins change the behavior or appearance of Elgg by overriding views, or by handling events and plugin hooks. All changes to an Elgg site should be implemented through plugins to ensure upgrading core is easy.
fr: Les Plugins modifient le comportement ou l'apparence d'Elgg en surchargeant les vues, ou en gérant des événements et des hooks des plugins. Toutes les modifications d'un site Elgg devraient être implémentées via des plugins pour garantir que la mise à niveau du coeur reste simple.

source: Actions are the primary way users interact with an Elgg site. Actions are registered by plugins.
fr: Les actions sont le premier moyen pour les utilisateurs d'interagir avec un site Elgg. Les actions sont définies par les plugins.

source: Events and Plugin Hooks
fr: Événements et hooks du plugin

source: Events and Plugin Hooks are used in Elgg Plugins to interact with the Elgg engine under certain circumstances. Events and hooks are triggered at strategic times throughout Elgg's boot and execution process, and allows plugins to modify or cancel the default behavior.
fr: Les Événements et les Hooks des plugins sont utilisés dans les plugins Elgg pour interagir avec le moteur d'Elgg dans certaines circonstances. Les Événements et les Hooks sont activés à des moments stratégiques lors des processus de démarrage et d'exécution d'Elgg, et permettent aux plugins de modifier ou d'annuler le comportement par défaut.

source: Views
fr: Vues

source: Views are the primary presentation layer for Elgg. Views can be overridden or extended by Plugins. Views are categories into a Viewtype, which hints at what sort of output should be expected by the view.
fr: Les vues sont la première couche de présentation pour Elgg. Les vues peuvent être surchargées ou étendues par les Plugins. Les vues sont des catégories d'un type de vue (Viewtype), qui définit quel type de sortie devrait être généré par la vue.

source: Elgg uses an AMD-compatible JavaScript system provided by RequireJs. Bundled with Elgg are jQuery, jQuery UI, jQuery Form, and jQuery UI Autocomplete.
fr: Elgg utilise un système JavaScript compatible AMD fourni par RequireJs. jQuery, jQuery UI, jQuery Form, et jQuery UI Autocomplete sont livrés avec Elgg.

source: Plugins can load their own JS libs.
fr: Les plugins peuvent charger leurs propres bibliothèques JS.

source: Internationalization
fr: Internationalisation

source: Elgg's interface supports multiple languages, and uses `Transifex`_ for translation.
fr: L'interface d'Elgg supporte de multiples langues, et utilise `Transifex`_ pour la traduction.

source: Caching
fr: Mise en cache

source: Elgg uses two caches to improve performance: a system cache and SimpleCache.
fr: Elgg utilise deux caches pour améliorer les performances : un cache système et SimpleCache.

source: 3rd party libraries
fr: Bibliothèques tierce-partie

source: The use of 3rd party libraries in Elgg is managed by using `Composer`_ dependencies. Examples of 3rd party libraries are jQuery, RequireJs or Zend mail.
fr: L'utilisation de bibliothèques tierce-partie est gérée par le gestionnaire de dépendances `Composer`_. jQuery, RequireJs ou Zend mail sont des exemples de bibliothèques tierce-partie.

source: To get a list of all the Elgg dependencies check out the `Packagist`_ page for Elgg.
fr: Pour une liste complète des dépendances d'Elgg, consultez la page `Packagist`_ d'Elgg.

source: Database Seeding
fr: Génération de données de test

source: Elgg provides some base database seeds to populate the database with entities for testing purposes.
fr: Elgg fournit un mécanisme de génération de données (ensemencement de base de donénes, ou database seeding) pour remplir la base de données avec des entités à des fins de test.

source: You can run the following commands to seed and unseed the database.
fr: Vous pouvez exécuter les commandes suivantes pour générer des données de test et les supprimer de la base de données.

source: Plugins can register their own seeds via ``'seeds', 'database'`` hook. The handler must return the class name of the seed, which must extend ``\Elgg\Database\Seeder\Seed`` class.
fr: Les plugins peuvent enregistrer leurs propres graines via le hook ``'seeds', 'database'``. Le gestionnaire doit retourner le nom de la classe de la graine, qui doit étendre la classe ``\Elgg\Database\Seeder\Seed``.

source: elgg-cli command line tools
fr: elgg-cli outils en ligne de commande

source: Depending on how you installed Elgg and your server configuration you can access``elgg-cli`` binaries as one of the following from the root of your Elgg installation:
fr: Selon la manière dont vous avez installé Elgg et la configuraiton de votre serveur vous pouvez accéder aux binaires de ``elgg-cli`` de l'une des manières suivantes depuis la racine de votre installation Elgg :

source: Available commands
fr: Commandes disponibles

source: Adding custom commands
fr: Ajouter des commandes personnalisées

source: Plugins can add their commands to the CLI application, by adding command class name via ``'commands','cli'`` hook. Command class must extend ``\Elgg\CLI\Command``.
fr: Les plugins peuvent ajouter leurs propres commandes à l'application CLI, en ajoutant le nom de classe de la commande via le hook ``'commands','cli'``. La classe de la commande doit étendre ``\Elgg\CLI\Command``.

source: Features
fr: Fonctionnalités

source: Showcases: https://elgg.org/showcase
fr: Présentation de sites : https://elgg.org/showcase

source: For developers
fr: Pour les développeurs

source: Permissive license
fr: License permissive

source: Theme framework
fr: Framework pour les thèmes

source: Templating engine
fr: Moteur de templates

source: Widgets framework
fr: Framework de widgets

source: Plugin APIs
fr: APIs pour les plugins

source: Social graph
fr: Graph social

source: Web services API
fr: API pour les services web

source: jQuery-based JS framework
fr: Framework JS basé sur jQuery

source: Session management
fr: Gestion des sessions

source: Custom URL routing
fr: Routage d'URL personnalisé

source: For admins
fr: Pour les administrateurs

source: User profiles and avatars
fr: Page et image du profil des membres

source: Fine-grained access control lists
fr: Listes de contrôle d'accès (ACL) très détaillées

source: Friends and friends lists (ala G+ circles)
fr: Contacts et listes de contacts (à la manière des cercles G+)

source: Responsive, mobile-friendly design
fr: Responsive, design compatible mobile

source: RSS support
fr: Support RSS

source: Activity stream
fr: Flux d'activité

source: Plugins for common content types like blogs, bookmarks, files, microblogging, private messages, documents, message boards, discussion
fr: Plugins pour les types de contenus courants tels que des blogs, signets, fichiers, du microblogging, des messages privés, documents, forums, discussions

source: User authentication and administration
fr: Authentification des utilisateurs et administration

source: If you need more functionality than what Elgg offers out-of-the-box there are a couple of options:
fr: Si vous avez besoin de plus de fonctionnalités que ce qu'Elgg propose d'emblée, voici quelques possibilités :

source: Add more by :doc:`installing plugins </admin/plugins>` - for example, blogs, forums, social bookmarks
fr: Ajoutez-en de nouvelles en :doc:`installant des plugins </admin/plugins>` - par exemple des blogs, des forums, des signets

source: Develop your own features via plugins
fr: Développez vos propres fonctionnalités via des plugins

source: Hire someone to do the above for you
fr: Engagez quelqu'un pour le faire pour vous

source: Getting Started
fr: Pour démarrer

source: Discover if Elgg is right for your community.
fr: Découvrez si Elgg est adapté pour votre communauté.

source: Get your own instance of Elgg running in no time.
fr: Ayez votre propre instance d'Elgg opérationnelle en un rien de temps.

source: Requirements
fr: Pré-requis

source: MySQL 5.5.3+ (5.0.0+ if upgrading an existing installation)
fr: MySQL 5.5.3+ (5.0.0+ si vous mettez à niveau une installation existante)

source: PHP 7.0+ with the following extensions:
fr: PHP 7.0+ avec les extensions suivantes :

source: GD (for graphics processing)
fr: GD (pour les opérations graphiques)

source: PDO (for database connection)
fr: PDO (pour la connexion à la base de données)

source: JSON (for AJAX responses, etc.)
fr: JSON (pour les réponses AJAX, etc.)

source: XML (for reading plugin manifest files, etc.)
fr: XML (pour lire fichiers manifest des plugins, etc.)

source: `Multibyte String support`_ (for i18n)
fr: `Multibyte String support`_ (pour i18n)

source: Proper configuration and ability to send email through an MTA
fr: La configuration appropriée et la capacité d'envoyer des emails via un MTA (Mail Transport Agent)

source: Web server with support for URL rewriting
fr: Serveur web avec le support de la réécriture d'URL (URL rewriting)

source: Official support is provided for the following configurations:
fr: Le support officiel est fourni pour les configurations suivantes :

source: Apache server
fr: Serveur Apache

source: Apache with the `rewrite module`_ enabled
fr: Apache avec le module `rewrite module`_ activé

source: PHP running as an Apache module
fr: PHP exécuté comme un module Apache

source: Nginx server
fr: Serveur Nginx

source: Nginx with PHP-FPM using FastCGI
fr: Nginx avec PHP-FPM utilisant FastCGI

source: By "official support", we mean that:
fr: Par "support officiel", nous entendons que :

source: Most development and testing is performed with these configurations
fr: La plupart des développements et des tests sont effectués avec ces configurations

source: Much of the installation documentation is written assuming Apache or Nginx is used
fr: Une bonne part de la documentation a été écrite en partant du principe qu'Apache ou Nginx est utilisé

source: Priority on bug reports is given to Apache and Nginx users if the bug is web server specific (but those are rare).
fr: La priorité sur les rapports de bug est donnée aux utilisateurs d'Apache et Nginx si le bug est propre au serveur web (mais ces cas sont rares).

source: Browser support policy
fr: Politique de support des navigateurs

source: Feature branches support the latest 2 versions of all major browsers as were available at the time of the first stable release on that branch.
fr: Les branches de fonctionnalités supportent les 2 dernières versions de tous les principaux navigateurs disponibles au moment de la première publication d'une version stable pour cette branche.

source: Bugfix release will not alter browser support, even if a new version of the browser has since been released.
fr: Les versions de correction de bugs ne modifient pas le support des navigateurs, même si une nouvelle version du navigateur a été publiée depuis.

source: Major browsers here means all of the following, plus their mobile counterparts:
fr: Les principaux navigateurs signifie ici les navigateurs suivants, ainsi que leurs homologues mobiles :

source: Android Browser
fr: Navigateur Android

source: "Support" may mean that we take advantage of newer, unimplemented technologies but provide a JavaScript polyfill for the browsers that need it.
fr: "Support" peut signifier que nous prenons avantage des technologies nouvelles et non implémentées, mais fournissons un polyfill JavaScript pour les navigateurs qui en ont besoin.

source: You may find that Elgg happens to work on unsupported browsers, but compatibility may break at any time, even during a bugfix release.
fr: Il se peut qu'Elgg fonctionne avec des navigateurs non supportés, cependant la compatibilité peut être perdue à tout moment, y compris lors de la publication d'une correction de bug.

source: Overview
fr: Vue d'ensemble

source: Upload Elgg
fr: Chargez Elgg

source: With Composer (recommended if comfortable with CLI):
fr: Avec Composer (recommandé si vous êtes à l'aise avec la ligne de commande) :

source: From pre-packaged zip (recommended if not comfortable with CLI):
fr: A partir du fichier ZIP (recommandé si vous n'êtes pas à l'aise avec la ligne de commande) :

source: Download the `latest version of Elgg`_
fr: Télécharger la `dernière version d'Elgg`_

source: Upload the ZIP file with an FTP client to your server
fr: Chargez le fichier ZPI avec un client FTP sur votre serveur

source: Unzip the files in your domain's document root.
fr: Dézippez les fichiers dans la racine web de votre domaine.

source: Create a data folder
fr: Créer un fichier pour les données

source: Elgg needs a special folder to store uploaded files including profile icons and photos. You will need to create this directory.
fr: Elgg a besoin d'un répertoire particulier pour stocker les fichiers chargés, y compris les images du profil et les photos. Vous devez créer ce répertoire.

source: For security reasons, this folder **MUST** be stored outside of your document root. If you created it under ``/www/`` or ``/public_html/``, you're doing it wrong.
fr: Pour des raisons de sécurité, ce dossier **DOIT** être conservé hors de la racine de vos documents (DocumentRoot). Si vous l'avez créé dans le dossier ``/www/`` ou ``/public_html/``, ce n'est pas la bonne manière de faire.

source: Once this folder has been created, you'll need to make sure the web server Elgg is running on has permission to write to and create directories in it. This shouldn't be a problem on Windows-based servers, but if your server runs Linux, Mac OS X or a UNIX variant, you'll need to `set the permissions on the directory`_.
fr: Une fois que ce répertoire a été créé, vous devez vous assurer que le serveur web sur lequel tourne Elgg a le droit d'écrire et de créer des répertoires à l'intérieur. Ceci ne devrait pas être un problème sur les serveurs basés sur Windows, mais si votre serveur utilise Linux, Mac OS X ou une variante d'UNIX, vous aurez besoin de `définir les droits d'accès du répertoire`_.

source: If you are using a graphical FTP client to upload files, you can usually set permissions by right clicking on the folder and selecting 'properties' or 'Get Info'.
fr: Si vous utilisez un client FTP graphique pour charger les fichiers, vous pouvez habituellement définir les droits en faisant un clic droit sur le dossier et en sélectionnant "propriétés" ou "Informations".

source: Directories must be executable to be read and written to. The suggested permissions depend upon the exact server and user configuration. If the data directory is owned by the web server user, the recommended permissions are ``750``.
fr: Les répertoires doivent pouvoir être lus et écrits. Les permissions suggérées dépendent de votre serveur et de la configuration des utilisateurs. Si le répertoire de données a pour propriétaire l'utilisateur du serveur web, les droits d'accès recommandés sont ``750``.

source: Setting your data directory to ``777`` will work, but it is insecure and is not recommended. If you are unsure how to correctly set permissions, contact your host for more information.
fr: Définir les droits de votre répertoire de données à ``777`` va fonctionner, mais c'est dangereux et n'est pas recommandé. Si vous hésitez sur la bonne configuration à choisir pour les permissions, contactez votre hébergeur pour plus d'informations.

source: Create a MySQL database
fr: Créer une base de données MySQL

source: Using your database administration tool of choice (if you're unsure about this, ask your system administrator), create a new MySQL database for Elgg. You can create a MySQL database with any of the following tools:
fr: En utilisant l'outil d'administration de base de données de votre choix (si vous ne savez pas lequel, demandez à votre administrateur système), créez une nouvelle base de données MySQL pour Elgg. Vous pouvez créer une base de données MySQL avec n'importe lequel des outils suivants :

source: Make sure you add a user to the database with all privileges and record the database name, username and password. You will need this information when installing Elgg.
fr: Assurez-vous d'ajouter un utilisateur à la base de données avec tous les privilèges et notez le nom de la base de données, l'identifiant et le mot de passe. Vous aurez besoin de ces informations pour installer Elgg.

source: Set up Cron
fr: Mettre en place le Cron

source: Elgg uses timed requests to your site to perform background tasks like sending notifications or performing database cleanup jobs. You need to configure the :doc:`cron</admin/cron>` to be able to use those kind of features.
fr: Elgg utilise des requêtes paramétrées pour effectuer des tâches de fond telles qu'envoyer des notifications ou effectuer des travaux de nettoyage de la base de données. Vous devez configurer le :doc:`cron</admin/cron>` pour pouvoir utiliser ce type de fonctionnalités.

source: Visit your Elgg site
fr: Visiter votre site Elgg

source: Once you've performed these steps, visit your Elgg site in your web browser. Elgg will take you through the rest of the installation process from there. The first account that you create at the end of the installation process will be an administrator account.
fr: Une fois ces étapes terminées, visitez votre site Elgg dans votre navigateur web. A partir de là, Elgg vous guidera à travers le reste du processus d'installation. Le premier compte que vous créerez à la fin de l'installation sera le compte administrateur.

source: A note on settings.php and .htaccess
fr: Une note sur settings.php et .htaccess

source: The Elgg installer will try to create two files for you:
fr: L'installeur d'Elgg va essayer de créer deux fichiers pour vous :

source: ``elgg-config/settings.php``, which contains local environment configuration for your installation
fr: ``elgg-config/settings.php``, qui contient la configuration de votre environnement local pour votre installation

source: ``.htaccess``, which allows Elgg to generate dynamic URLs
fr: ``.htaccess``, qui permet à Elgg de générer des URLs dynamiques

source: If these files can't be automatically generated, for example because the web server doesn't have write permissions in the directories, Elgg will tell you how to create them. You could also temporarily change the permissions on the root directory and the engine directory. Set the permissions on those two directories so that the web server can write those two files, complete the install process, and them change the permissions back to their original settings. If, for some reason, this won't work, you will need to:
fr: Si ces fichiers ne peuvent pas être générés automatiquement, par exemple parce que le serveur web n'a pas les droits d'accès en écriture dans les répertoires, Elgg vous dira comment les créer. Vous pouvez aussi modifier temporairement les droits d'accès sur la racine du répertoire et le répertoire engine. Définissez les droits d'accès sur ces deux répertoires de sorte que le serveur web puisse écrire ces deux fichiers, terminez le processus d'installation, et modifiez à nouveau les droits d'accès pour rétablir les droits d'origine. Si, pour quelque raison que ce soit, ceci ne fonctionne pas, vous devrez :

source: In ``elgg-config/``, copy ``settings.example.php`` to ``settings.php``, open it up in a text editor and fill in your database details
fr: Depuis ``elgg-config/``, copiez ``settings.example.php`` vers ``settings.php``, puis ouvrez-le dans un éditeur de texte et complétez les informations de la base de données

source: On Apache server, copy ``install/config/htaccess.dist`` to ``.htaccess``
fr: Sur le serveur Apache, copiez ``install/config/htaccess.dist`` vers ``.htaccess``

source: On Nginx server copy ``install/config/nginx.dist`` to ``/etc/nginx/sites-enabled`` and adjust it's contents
fr: SUr un serveur Nginx copiez ``install/config/nginx.dist`` vers ``/etc/nginx/sites-enabled`` et modifiez son contenu

source: Other Configurations
fr: Autres configurations

source: :doc:`Virtual hosts <./install/virtual>`
fr: :doc:`Hôtes virtuels <./install/virtual>`

source: Troubleshooting
fr: Dépannage

source: Help! I'm having trouble installing Elgg
fr: Au secours ! J'ai des soucis pour installer Elgg

source: First:
fr: D'abord :

source: Recheck that your server meets the technical requirements for Elgg.
fr: Re-vérifiez que votre serveur répond bien aux pré-requis pour Elgg.

source: Follow the environment-specific instructions if need be
fr: Suivez si besoin les instructions spécifiques à un environnement

source: Have you verified that ``mod_rewrite`` is being loaded?
fr: Avez-vous vérifié que ``mod_rewrite`` est bien chargé ?

source: Is the mysql apache being loaded?
fr: Est-ce que le module mysql de apache est bien chargé ?

source: Keep notes on steps that you take to fix the install. Sometimes changing some setting or file to try to fix a problem may cause some other problem later on. If you need to start over, just delete all the files, drop your database, and begin again.
fr: Conservez des notes sur ce que vous faites pour résoudre les problèmes d'installation. Parfois la modification d'un paramètre ou d'un fichier pour essayer de résoudre un problème peut être à l'origine d'un autre problème plus tard. Si vous devez recommencer depuis le début, supprimez simplement tous les fichiers, videz votre base de données, et commencez à nouveau.

source: I can't save my settings on installation (I get a 404 error when saving settings)
fr: Je ne peux pas enregistrer mon fichier de configuration sur une installation (j'ai une erreur 404 lors de l'enregistrement du fichier de configuration)
