Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: fr

source: Edit Homestead.yaml to include the details of your new Elgg project(s). In the following example, we will set up two Elgg apps - one from git source and one using the starter project. Note that when configuring sites, you can use the "elgg" site type, which will automatically bootstrap nginx vhosts, using the `shell config script`_
fr: Éditez Homestead.yaml pour inclure les informations de votre nouveau projet Elgg (ou vos projets). Dans l'exemple suivant, nous allons mettre en place deux applications Elgg - l'une depuis la source git et l'autre en utilisant le starter project. Notez qu'en configurant les sites, vous pouvez utliser le type de site "elgg", qui va automatiquement mettre en place les vhosts nginx, en utilisant le script shell de configuration `shell config script`_

source: `NFS`_ is not supported on Windows, but you can try `WinNFSd`_ plugin
fr: `NFS`_ n'est pas supporté sous Windows, mais vous pouvez essayer le plugin `WinNFSd`_

source: 3. Update hosts
fr: 3. Mettre à jour les hôtes

source: Update your hosts file to point domains configured in Homestead to the Vagrant box IP address. This will allow yout to access your sites by domain name from the browser
fr: Mettez à jour votre fichier d'hôte pour pointer les domaines configurés dans Homestead vers l'adresse IP de la box Vagrant. Ceci va vous permettre d'accéder à vos sites par nom de domaine depuis votre navigateur.

source: 4.a Install Elgg using starter-project
fr: 4.a Installer Elgg en utilisant starter-project

source: 4.b Install Elgg from source
fr: 4.b Installer Elgg depuis les sources

source: Now we can install our second git project, which we can use to contribute code back to core.
fr: Maintenant nous pouvons installer notre second projet git, que nous pouvons utiliser pour contribuer du code en retour vers le noyau.

source: 5. Other
fr: 5. Autre

source: Installing Elgg on IIS
fr: Installer Elgg sous IIS

source: You can follow the :doc:`standard installation instructions <../install>` with the following caveats:
fr: Vous pouvez suivre le :doc:`mode d'emploi d'installation standard <../install>` avec les mises en garde suivantes :

source: When installing on IIS, the problem is that the Apache mod\_rewrite rules will not be recognized, and this breaks the application. You need to convert the mod\_rewrite rules to the `IIS URL Rewrite`_ module format.
fr: Quand vous faites l'installation sur IIS, le problème est que les règles de réécriture (mod\_rewrite) d'Apache ne sont pas reconnues, ce qui empêche l'application de fonctionner. Vous devez convertir les règles de réécriture au format du module `IIS URL Rewrite`_.

source: You can do this using the IIS 7+ management console, and the "Import Rules" feature that will do the conversion, as described in the tutorial "`importing Apache mod\_rewrite rules`_\ ".
fr: Vous pouvez faire ceci en utilisant la console de gestion d'IIS 7+, et la fonctionnalité "Importer les règles" ("Import Rules") qui va effectuer la conversion, comme c'est décrit dans le tutoriel "`importer les règles de réécriture d'Apache`_\ ".

source: Installing Elgg on MAMP
fr: Installer Elgg sous MAMP

source: Follow the :doc:`standard installation instructions <../install>`.
fr: Suivez le :doc:`mode d'emploi d'installation standard <../install>`.

source: On certain versions of MAMP, Elgg will either fail to install or have intermittent problems while running.
fr: Sur certaines versions de MAMP, l'installation d'Elgg va échouer, ou avoir des problèmes intermittents en cours d'exécution.

source: This is a known issue with MAMP and is related to the Zend Optimizer. Until Zend/MAMP have resolved this issue it is recommended that you **turn off the Zend Optimizer** in your PHP settings.
fr: Il s'agit d'un problème connu avec MAMP qui est lié à l'optimiseur Zend (Zend Optimizer). Tant que Zend/MAMP n'a pas résolu ce problème il est recommandé que vous désactiviez Zend Optimizer dans vos paramètres PHP.

source: Installing Elgg on MariaDB
fr: Installer Elgg sous MariaDB

source: You should be able to follow the :doc:`standard installation instructions <../install>`, since this DBMS is supposed to be a drop-in replacement for MySQL.
fr: Vous devriez pouvoir suivre le :doc:`mode d'emploi d'installation standard <../install>`, dans la mesure où ce DBMS est supposé être une solution de remplacement prête à l'emploi pour MySQL.

source: Let us know how it goes!
fr: Dites-nous comment ça se passe !

source: Here is some historical community discussion, for reference: https://community.elgg.org/discussion/view/1455994/alternative-dbmss
fr: Voici une discussion historique de la communauté, pour référence : https://community.elgg.org/discussion/view/1455994/alternative-dbmss

source: Installing Elgg on Nginx
fr: Installer Elgg sous Nginx

source: To run Elgg on Nginx, you will need to:
fr: Pour exécuter Elgg sur Nginx, vous devez :

source: configure Nginx to talk to a PHP process in either CGI or FPM mode
fr: configurez Nginx pour qu'il puisse communiquer avec un process PHP en mode CGI ou FPM

source: Port the following rewrite rules
fr: Porter les règles de réécriture (rewrite rules) suivantes

source: Other than that, you should be able to follow the :doc:`standard installation instructions <../install>`.
fr: Mis à part cela, vous devriez pouvoir suivre le :doc:`mode d'emploi d'installation standard <../install>`.

source: Installing Elgg on Ubuntu Linux
fr: Installer Elgg sous Ubuntu Linux

source: Install the dependencies::
fr: Installez les dépendances ::

source: Edit ``/etc/apache2/sites_available/default`` to enable .htaccess processing (set AllowOverride to All)
fr: Modifiez ``/etc/apache2/sites_available/default`` pour activer la prise en compte des fichiers .htaccess (définissez AllowOverride à All)

source: Restart Apache: ``sudo /etc/init.d/apache2 restart``
fr: Redémarrez Apache: ``sudo /etc/init.d/apache2 restart``

source: Follow the :doc:`standard installation instructions <../install>`
fr: Suivez le :doc:`mode d'emploi d'installation standard <../install>`

source: Installing Elgg on a Virtual Host
fr: Installer Elgg sur un hôte virtuel (Virtual Host)

source: Examples of "virtual hosts" are Rackspace, Amazon EC2, etc.
fr: Des exemples d'"hôtes virtuels" ("virtual hosts") sont Rackspace, Amazon EC2, etc.

source: For installation to proceed successfully, modify the .htaccess file in the root, and uncomment::
fr: Pour que l'installation fonctionne bien, modifiez le fichier .htaccess à la racine, et décommentez ::

source: To be::
fr: Pour :

source: Then follow the :doc:`standard installation instructions <../install>`.
fr: Puis suivez les :doc:`instructions d'installation standard <../install>`.

source: Installing Elgg on XAMPP
fr: Installer Elgg sur XAMPP

source: These intructions are provided in case you want to test your Elgg installation on your local computer running Windows.
fr: Ce mode d'emploi est fourni pour le cas où vous voudriez tester votre installation Elgg sur votre ordinateur local sous Windows.

source: Download and install XAMPP to your computer from http://www.apachefriends.org/en/xampp.html
fr: Téléchargez et installez XAMPP sur votre ordinateur depuis https://www.apachefriends.org/fr/index.html

source: Once the installation is completed, it will prompt you to start the XAMPP controller panel. Leave it for now.
fr: Une fois l'installation terminée, vous aurez la possibilité de démarrer le panneau de contrôle de XAMPP. Ne le faites pas pour le moment.

source: Open ``C:\xampp\apache\conf\httpd.conf`` file with notepad and uncomment these lines::
fr: Ouvrez le fichier ``C:\xampp\apache\conf\httpd.conf`` avec notepad et décommentez ces lignes :

source: Edit the php.ini file and change ``arg_separator.output = &amp;amp;`` to ``arg_separator.output = &``
fr: Éditez le fichier php.ini et modifiez ``arg_separator.output = &amp;amp;`` pour ``arg_separator.output = &``

source: Go to ``C:\xampp`` and double click on the xampp_start application
fr: Rendez-vous sur ``C:\xampp`` et double-cliquez sur l'application xampp_start

source: Go to http://localhost/
fr: Rendez-vous sur http://localhost/

source: Change your server's password in the security option
fr: Modifiez le mot de passe de votre serveur dans les options de sécurité

source: Go to http://localhost/phpmyadmin and login with the username and the password of your server
fr: Rendez-vous sur http://localhost/phpmyadmin et connectez-vous avec l'identifiant et le mot de passe de votre serveur

source: Create a database called "elgg" in your phpmyadmin panel
fr: Créez une base de données appelée "elgg" dans votre panneau phpmyadmin

source: Now download Elgg. Unzip it and extract to ``C:\xampp\htdocs\sites\elgg``
fr: Téléchargez maintenant Elgg. Décompressez-le et copiez-le dans ``C:\xampp\htdocs\sites\elgg``

source: Create the Elgg data folder as ``C:\xampp\htdocs\sites\data``
fr: Créez le répertoire de données d'Elgg sous ``C:\xampp\htdocs\sites\data``

source: Go to http://localhost/sites/elgg
fr: Rendez-vous sur http://localhost/sites/elgg

source: You will be taken to the Elgg installation steps. Install it and enjoy.
fr: Vous allez être dirigé(e) vers les étapes de l'installation d'Elgg. Installez-le et savourez.

source: A note on XAMPP 1.7.4 and eAccelerator
fr: Une note sur XAMPP 1.7.4 et eAccelerator

source: Elgg is compatible with opcode caches and it is highly recommended that you enable a PHP opcode caching tool for a faster experience. XAMPP comes with support for eAccelerator out of the box, but unfortunately, the 1.7.4 build of XAMPP leaves out the DLL that's required. To get eAccelerator working, follow these steps:
fr: Elgg est compatible avec les caches d'opcode et il est fortement recommandé que vous activiez un outil de cache d'opcode PHP pour améliorer les performances. XAMPP est fourni d'emblée avec le support d'eAccelerator, mais malheureusement la version 1.7.4 de XAMPP n'inclut pas la DLL requise. Pour qu'eAccelerator fonctionne, suivez ces étapes :

source: Download the DLL from http://eac.qme.nl/eAccelerator_v1_0_svn427_for_v5_3_5-VC6.zip
fr: Téléchargez la DLL depuis http://eac.qme.nl/eAccelerator_v1_0_svn427_for_v5_3_5-VC6.zip

source: Copy eAccelerator_ts.dll to ``C:\xampp\php\ext\php_eaccelerator.dll``
fr: Copiez eAccelerator_ts.dll vers ``C:\xampp\php\ext\php_eaccelerator.dll``

source: Uncomment this line in ``C:\xampp\php\php.ini``::
fr: Décommentez cette ligne dans ``C:\xampp\php\php.ini``::

source: Restart apache
fr: Redémarrer apache

source: To verify that it is on:
fr: Pour vérifier que c'est activé :

source: Go to localhost/xampp
fr: Rendez-vous sur localhost/xampp

source: Click on phpinfo() from the left sidebar
fr: Cliquez sur phpinfo() dans la barre latérale gauche

source: Ctrl+F for eaccelerator. If you get no results, eAccelerator is not active
fr: Faites un Ctrl+F pour chercher eaccelerator. Si vous n'avez aucun résultat,, eAccelerator n'est pas activé

source: MIT or GPLv2
fr: MIT ou GPLv2

source: A full Elgg package that includes the framework and a core set of plugins is available under version 2 of the `GNU General Public License`__ (GPLv2). We also make the framework (without the plugins) available under the MIT license.
fr: Un package Elgg complet comprenant le framework et un noyau de plugins est disponible sous la ersion 2 de la licence `GNU General Public License`__ (GPLv2). Nous distribbuons également le framework (sans les plugins) sous la licence MIT.

source: The following answers are provided as a convenience to you; they are not legal counsel. Consult with a lawyer to be sure about the answers to these questions. The Elgg Foundation cannot be held responsible for decisions you make based on what you read on this page.
fr: Les réponses suivantes vous sont proposées à titre informatif ; elles ne constituent pas un conseil légal. Consultez un juriste si vous voulez être sûr(e) des réponses à ces questions. La Fondation Elgg ne peut pas être tenues pour responsable des décisions que vous prendrez sur la base de ce que vous lisez sur cette page.

source: For questions not answered here, please refer to the `official FAQ for the GPLv2`__.
fr: Pour les questions qui n'ont pas réponse ici, veuillez vous référer à la FAQ officielle pour GPLv2 : `official FAQ for the GPLv2`__.

source: How much does Elgg cost?
fr: Combien coûte Elgg ?

source: Elgg is free to download, install, and use. If you’d like to donate, we do appreciate our `financial supporters`__!
fr: Elgg peut être téléchargé, installé et utilisé gratuitement. Si vous souhaitez faire un don, nous apprécions d'avoir des partenaires financiers `financial supporters`__ !

source: Can I remove the Elgg branding/links?
fr: Puis-je enlever les liens / le branding Elgg ?

source: Yes.
fr: Oui.

source: Can I modify the source code?
fr: Puis-je modifier le code source ?

source: Yes, but in general we recommend you make your modifications as plugins so that when a new version of Elgg is released, the upgrade process is as painless as possible.
fr: Oui, mais en général nous vous recommandons de faire vos modifications sous forme de plugins de sorte que lorsque une nouvelle version d'Elgg est publiée le processus de mise à niveau reste aussi simple que possible.

source: Can I charge my users membership fees?
fr: Puis-je demander des frais d'adhésion à mes utilisateurs ?

source: If I modify Elgg, do I have to make the changes available?
fr: Si je modifie Elgg, dois-je rendre mes modifications disponibles ?

source: No, if you are using Elgg to provide a service, you do not have to make the source available. If you distribute a modified version of Elgg, then you must include the source code for the changes.
fr: Non, si vous utilisez Elgg pour fournir un service, vous n'avez pas à rendre les sources disponibles. Si vous distribuez une version modifiée d'Elgg, alors vous devez inclure le code sources des modifications.

source: If I use Elgg to host a network, does The Elgg Foundation have any rights over my network?
fr: Si j'utilise Elgg pour héberger un réseau, est-ce que la Fondation Elgg a quelques droits que ce soit sur mon réseau ?

source: No.
fr: Non.

source: What’s the difference between the MIT and GPL versions?
fr: Quelle est la différence entre la version MIT et la version GPL ?

source: Plugins are not included with the MIT version.
fr: Les plugins ne sont pas inclus avec la version MIT.

source: You can distribute a commercial product based on Elgg using the MIT version without making your modifications available.
fr: Vous pouvez distribuer un produit commercial construit avec Elgg en utilisant la version MIT sans devoir rendre disponibles vos modifications.

source: With the GPL licensed version, you have to include make your modifications of the framework public if you redistribute the framework.
fr: Avec la version sous licence GPL, vous devez rendre vos modifications du framework publiques si vous redistribuez le framework.

source: Why are plugins missing from the MIT version?
fr: Pourquoi certains plugins sont-ils absents de la version MIT ?

source: The plugins were developed under the GPL license, so they cannot be released under an MIT license. Also, some plugins include external dependencies that are not compatible with the MIT license.
fr: Les plugins ont été développés sous licence GPL, et ne peuvent donc pas être diffusés sous une licence MIT. De plus, certains plugins font appel à des dépendances externes qui ne sont pas compatibles avec la licence MIT.

source: May I distribute a plugin for Elgg under a commercial license?
fr: Ai-je le droit de distribuer un plugin pour Elgg sous une licence commerciale ?

source: We believe you can, since plugins typically depend only the core framework and the framework is available under the MIT license. That said, we really recommend you consult with a lawyer on this particular issue to be absolutely sure.
fr: Nous pensons que vous le pouvez, puisque les plugins ne dépendent habituellement que du cœur du framework (core) et que le framework est disponible sous la licence MIT. Ceci dit, nous vous conseillons vraiment de consulter un juriste sur ce point particulier si vous voulez être absolument sûr(e).

source: Note that plugins released via the community site repository must be licensed under a GPLv2-compatible license. They do not necessarily have to be GPLv2, just compatible (like MIT).
fr: Notez que les plugins distribués via la communauté doivent être publiés sous une licence compatible GPLv2. Ils n'ont pas à être publiés sous licence GPLv2, seulement sous une licence compatible (comme la MIT).

source: Can we build our own tool that uses Elgg and sell that tool to our clients?
fr: Pouvons-nous construire notre propore outil utilisant Elgg et vendre cet outil à nos clients ?

source: Yes, but then your clients will be free to redistribute that tool under the terms of the GPLv2.
fr: Oui, mais dans ce cas vos clients seront libres de redistribuer cet outil sous les termes de la licence GPLv2.
