Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: fr

source: Elgg relies on the ``mod_rewrite`` Apache extension in order to simulate certain URLs. For example, whenever you perform an action in Elgg, or when you visit a user's profile, the URL is translated by the server into something Elgg understands internally. This is done using rules defined in an ``.htaccess`` file, which is Apache's standard way of defining extra configuration for a site.
fr: Elgg dépend de l'extension Apache ``mod_rewrite`` pour simuler certaines URLs. Par exemple à chaque fois que vous effectuez une action dans Elgg, or lorsque vous visitez la page de profil d'un utilisateur, l'URL est translatée par le serveur en quelque chose qu'Elgg comprend en interne. Ceci est fait en utilisant des règles définies dans un fichier ``.htaccess``, qui est le moyen standard d'Apache pour définir des éléments de configuration supplémentaires pour un site.

source: This error suggests that the ``mod_rewrite`` rules aren't being picked up correctly. This may be for several reasons. If you're not comfortable implementing the solutions provided below, we strongly recommend that you contact your system administrator or technical support and forward this page to them.
fr: Cette erreur suggère que les règles de ``mod_rewrite``ne sont pas traitées correctement. Ceci peut arriver pour différentes raisons. Si vous n'êtes pas à l'aise pour mettre en œuvre les solutions indiquées ci-dessous, nous vous recommandons vivement de contacter votre administrateur système ou le support technique et de leur faire suivre cette page.

source: The ``.htaccess``, if not generated automatically (that happens when you have problem with ``mod_rewrite``), you can create it by renaming ``install/config/htaccess.dist`` file you find with elgg package to ``.htaccess``. Also if you find a ``.htaccess`` file inside the installation path, but you are still getting 404 error, make sure the contents of ``.htaccess`` are same as that of ``install/config/htaccess.dist``.
fr: Le ``.htaccess``, s'il n'est pas créé automatiquement (cela se produit quand vous avez un problème avec ``mod_rewrite``), vous pouvez le créer en renommant le fichier ``install/config/htaccess.dist`` distribué avec Elgg en ``.htaccess``. Par ailleurs, si vous trouvez un fichier ``.htaccess`` dans le répertoire d'installation, mais avez toujours une erreur 404, vérifiez que le contenu de ``.htaccess`` est identique à celui de ``install/config/htaccess.dist``.

source: **``mod_rewrite`` isn't installed.**
fr: **``mod_rewrite`` n'est pas installé.**

source: Check your ``httpd.conf`` to make sure that this module is being loaded by Apache. You may have to restart Apache to get it to pick up any changes in configuration. You can also use `PHP info`_ to check to see if the module is being loaded.
fr: Contrôlez votre ``httpd.conf`` pour vérifier que ce module est bien chargé par Apache. Vous pouvez avoir besoin de redémarrer Apache pour qu'il tienne compte de tout changement de configuration. Vous pouvez également utiliser `PHP info`_ pour contrôler que le module est chargé.

source: **The rules in ``.htaccess`` aren't being obeyed.**
fr: **Les règles définies dans ``.htaccess`` ne sont pas respectées.**

source: In your virtual host configuration settings (which may be contained within ``httpd.conf``), change the AllowOverride setting so that it reads:
fr: Dans les paramètres de configuration de votre hôte virtuel (qui peut être intégrée dans ``httpd.conf``), modifiez la paramètre AllowOverride pour qu'il ressemble à :

source: This will tell Apache to pick up the ``mod_rewrite`` rules from ``.htaccess``.
fr: Ceci va indiquer à Apache de prendre les règles de ``mod_rewrite`` depuis ``.htaccess``.

source: **Elgg is not installed in the root of your web directory (ex: http://example.org/elgg/ instead of http://example.org/)**
fr: **Elgg n'est pas installé à la racine de votre répertoire web ("Elgg is not installed in the root of your web directory") (par ex.: http://example.org/elgg/ au lieu de http://example.org/)**

source: The install script redirects me to "action" when it should be "actions"
fr: Le script d'installation me redirige vers "action" alors que cela devrait être vers "actions"

source: This is a problem with your ``mod_rewrite`` setup.
fr: Il s'agit d'un problème avec votre configuration de ``mod_rewrite``.

source: DO NOT, REPEAT, DO NOT change any directory names!
fr: NE CHANGEZ PAS, RÉPÉTEZ, NE CHANGEZ PAS quelque nom de répertoire que ce soit !

source: I installed in a subdirectory and my install action isn't working!
fr: J'ai installé Elgg dans un sous-répertoire et mon action d'installation ne fonctionne pas !

source: If you installed Elgg so that it is reached with an address like http://example.org/mysite/ rather than http://example.org/, there is a small chance that the rewrite rules in .htaccess will not be processed correctly. This is usually due to using an alias with Apache. You may need to give mod\_rewrite a pointer to where your Elgg installation is.
fr: Si vous installez Elgg de sorte qu'il soit accessible avec une adresse comme http://example.org/monsite/ plutôt que http://example.org/, il existe une faible possibilité que les règles de réécriture dans .htaccess ne soient pas traitées correctement. Ceci est généralement lié à l'utilisation d'un alias dans Apache. Vous pouvez avoir besoin d'indiquer à mod\_rewrite où se situe votre installation Elgg.

source: Open up .htaccess in a text editor
fr: Ouvrez .htaccess dans un éditeur de texte

source: Where prompted, add a line like ``RewriteBase /path/to/your/elgg/installation/`` (Don't forget the trailing slash)
fr: Lorsqu'on vous y invite, ajoutez une ligne comme ``RewriteBase /chemin/vers/votre/installation/elgg/`` (N'oubliez pas le slash final)

source: Save the file and refresh your browser.
fr: Enregistrez le fichier et rafraîchissez votre navigateur.

source: Please note that the path you are using is the **web** path, minus the host.
fr: Veuillez noter que le chemin que vous utilisez est le chemin **web**, moins l'hôte.

source: For example, if you reach your elgg install at http://example.org/elgg/, you would set the base like this:
fr: Par exemple, si votre installation Elgg s'affiche sur http://example.org/elgg/, vous devriez définir la base comme ceci :

source: Please note that installing in a subdirectory does not require using RewriteBase. There are only some rare circumstances when it is needed due to the set up of the server.
fr: Veuillez noter qu'installer dans un sous-répertoire ne nécessite pas d'utiliser RewriteBase. Il y a seulement quelques rares circonstances dans lesquelles c'est imposé par la configuration du serveur.

source: I did everything! mod\_rewrite is working fine, but still the 404 error
fr: J'ai tout fait ! mod\_rewrite fonctionne correctement, mais j'ai toujours l'erreur 404

source: Maybe there is a problem with the file .htaccess. Sometimes the elgg install routine is unable to create one and unable to tell you that. If you are on this point and tried everything that is written above:
fr: Il y a peut-être un problème avec le fichier .htaccess. Parfois la routine d'installation d'Elgg n'arrive pas à en créer un ni à vous le signaler. Si vous en êtes à ce stade et avez essayé tout ce qui est indiqué ci-dessus :

source: check if it is really the elgg-created .htaccess (not only a dummy provided from the server provider)
fr: vérifiez qu'il s'agit bien du .htaccess créé par Elgg (et pas d'un fichier d'exemple fourni par le fournisseur du serveur)

source: if it is not the elgg provided htaccess file, use the htaccess\_dist (rename it to .htaccess)
fr: s'il ne s'agit pas du fichier htaccess fourni par Elgg, utilisez htaccess\_dist (renommez-le en .htaccess)

source: I get an error message that the rewrite test failed after the requirements check page
fr: J'ai un message d'erreur indiquant que le test de réécriture a échoué après la page de vérification des pré-requis

source: I get the following messages after the requirements check step (step 2) of the install:
fr: J'ai les messages suivants après l'étape de vérification des pré-requis (étape 2) de l'installation :

source: We think your server is running the Apache web server.
fr: Nous pensons que votre serveur utilise un serveur web Apache.

source: The rewrite test failed and the most likely cause is that AllowOverride is not set to All for Elgg's directory. This prevents Apache from processing the .htaccess file which contains the rewrite rules.
fr: Le test de réécriture a échoué et la cause al plus probable est que AllowOverride n'est pas définie à All pour le répertoire d'Elgg. Ceci empêche Apache de traiter le fichier .htaccess qui contient les règles de réécriture.

source: A less likely cause is Apache is configured with an alias for your Elgg directory and you need to set the RewriteBase in your .htaccess. There are further instructions in the .htaccess file in your Elgg directory.
fr: Une cause moins probable est qu'Apache est configuré avec un alais pour votre répertoire Elgg et que vous deviez définir RewriteBase dans votre .htaccess. Vous trouverez des instructions complémentaires dans le fichier .htaccess de votre répertoire Elgg.

source: After this error, everinteraction with the web interface results in a error 500 (Internal Server Error)
fr: Après cette erreur, toute interaction avec l'interface web produit une erreur 500 (Erreur interne du serveur - Internal Server Error)

source: This is likely caused by not loading the "filter module by un-commenting the
fr: Ceci est probablement causé par le non-chargement du module de filtre en dé-commentant la ligne

source: line in the "httpd.conf" file.
fr: ligne dans le fichier "httpd.conf".

source: the Apache "error.log" file will contain an entry similar to:
fr: le fichier de journal d'Apache "error.log" va contenir une entrée similaire à :

source: ... .htaccess: Invalid command 'AddOutputFilterByType', perhaps misspelled or defined by a module not included in the server configuration
fr: ... .htaccess: Invalid command 'AddOutputFilterByType', perhaps misspelled or defined by a module not included in the server configuration (Commande 'AddOutputFilterByType' invalide, peut-être mal écrite ou définie par un module qui n'est pas inclus dans la configuration du serveur)

source: There is a white page after I submit my database settings
fr: Il y a une page blanche après que j'ai soumis ma configuration de base de données

source: Check that the Apache mysql module is installed and is being loaded.
fr: Vérifiez que le module d'Apache mysql est installé et est bien chargé.

source: I'm getting a 404 error with a really long url
fr: J'obtiens une erreur 404 avec une URL très longue

source: If you see a 404 error during the install or on the creation of the first user with a url like: ``http://example.com/homepages/26/d147515119/htdocs/elgg/action/register`` that means your site url is incorrect in your sites\_entity table in your database. This was set by you on the second page of the install. Elgg tries to guess the correct value but has difficulty with shared hosting sites. Use phpMyAdmin to edit this value to the correct base url.
fr: Si vous voyez une erreur 404 pendant l'installation ou lors de la création du premier compte utilisateur, avec une URL telle que : ``http://example.com/homepages/26/d147515119/htdocs/elgg/action/register`` ceci signifie que l'URL de votre site est incorrecte dans la table sites\_entity table de votre base de données. Cette valeur a été définie par vous lors de la deuxième étape de l'installation. Elgg essaie de deviner la bonne valeur mais a des difficultés avec les hébergements mutualisés. Utilisez phpMyAdmin pour modifier cette valeur avec la bonne URL de base du site.

source: I am having trouble setting my data path
fr: J'ai des difficultés pour définir le chemin vers le répertoire de données

source: This is highly server specific so it is difficult to give specific advice. If you have created a directory for uploading data, make sure your http server can access it. The easiest (but least secure) way to do this is give it permissions ``777``. It is better to give the web server ownership of the directory and limit the permissions.
fr: Ceci est fortement spécifique au serveur utilisé aussi il est difficile de donner des conseils spécifiques. Si vous avez créé un répertoire pour les données, vérifiez que votre serveur HTTP arrive bien à y accéder. Le moyen le plus simple (mais le moins sécurisé) d'y parvenir est de lui donner les droits d'accès ``777``. Il est largement préférable de donner au serveur web la propriété du répertoire et de limiter les droits d'accès.

source: Setting directory permissions to ``777`` allows the **ENTIRE** internet to place files in your directory structure an possibly infect you webserver with malware. Setting permissions to ``750`` should be more than enough.
fr: Définir les permissions du répertoire à ``777`` permet à **L'INTÉGRALITÉ** d'Internet de placer des fichiers dans la structure de votre répertoire et ainsi d'infecter votre serveur avec des malwares et autres virus. Définir les permissions à ``750`` devrait être plus que suffisant.

source: The top cause of this issue is PHP configured to prevent access to most directories using `open\_basedir`_. You may want to check with your hosting provider on this.
fr: L'origine la plus probable de ce problème est que PHP est configuré pour interdire l'accès à la plupart des répertoires qui utilisent `open\_basedir`_. Vous pouvez souhaiter vérifier ce point avec votre fournisseur d'hébergement.

source: Make sure the path is correct and ends with a /. You can check the path in your database in the config table.
fr: Assurez-vous que le chemin est correct et se termine par un /. Vous pouvez vérifier le chemin dans la table config de votre base de données.

source: If you only have ftp access to your server and created a directory but do not know the path of it, you might be able to figure it out from the www file path set in your config database table. Asking for help from your hosting help team is recommended at this stage.
fr: Si vous n'avez qu'un accès FTP à votre serveur et avez créé un répertoire mais n'en connaissez pas le chemin, vous devriez pouvoir le trouver à partir du chemin www défini dans la table config de votre base de données. A ce stade il est recommandé de demander de l'aide à l'équipe support de votre fournisseur d'hébergement.

source: I can't validate my admin account because I don't have an email server!
fr: Je ne peux pas valider mon compte admin car je n'ai pas de serveur d'email !

source: While it's true that normal accounts (aside from those created from the admin panel) require their email address to be authenticated before they can log in, the admin account does not.
fr: Bien qu'il soit exact que les comptes utilisateur normaux (à l'exception de ceux créés depuis le panneau d'administration) nécessitent que leur adresse email soit authentifiée avant de pouvoir se connecter, ceci n'est pas nécessaire pour le compte administrateur.

source: Once you have registered your first account you will be able to log in using the credentials you have provided!
fr: Une fois que vous avez créé votre premier compte utilisateur vous pouvez vous connecter en utilisant les accès que vous avez fourni !

source: I have tried all of these suggestions and I still cannot install Elgg
fr: J'ai essayé toutes ces suggestions et je n'arrive toujours pas à installer Elgg

source: It is possible that during the process of debugging your install you have broken something else. Try doing a clean install:
fr: Il est possible que quelque chose d'autre ait été cassé lors du débogage de l'installation. Essayez de faire une nouvelle installation propre :

source: drop your elgg database
fr: supprimez votre base de données Elgg

source: delete your data directory
fr: supprimez votre répertoire de données

source: delete the Elgg source files
fr: supprimez les fichiers source d'Elgg

source: start over
fr: recommencez l'installation

source: If that fails, seek the help of the `Elgg community`_. Be sure to mention what version of Elgg you are installing, details of your server platform, and any error messages that you may have received including ones in the error log of your server.
fr: SI cette méthode ne fonctionne pas, demandez de l'aide à la `communauté Elgg`_. Pensez à indiquer quelle version d'Elgg vous essayez d'installer, à fournir des détails sur le serveur et la plateforme utilisés, ainsi que tous les messages d'erreur que vous pouvez avoir reçus, y compris ceux du journal d'erreur de votre serveur.

source: Installing Elgg on Cloud9 IDE
fr: Installer Elgg sur Cloud9 IDE

source: 1. Create a c9 workspace
fr: 1. Créez un espace de travail (workspace) c9

source: Go to http://c9.io
fr: Rendez-vous sur http://c9.io

source: Login with GitHub
fr: Se connecter avec GitHub

source: On the Dashboard, click "Create new workspace" => "Create a new workspace"
fr: Sur le tableau de bord (Dashboard), cliquez sur "Créer un nouvel espace de travail" ("Create new workspace") => "Create a new workspace"

source: Choose a project name (e.g. "elgg")
fr: Choisissez un nom de projet (par ex. "elgg")

source: Choose "PHP" for project type
fr: Choisissez "PHP" comme type de projet

source: Click "Create"
fr: Cliquez sur "Créer" ("Create")

source: Wait... (~1 min for c9 workspace to be ready)
fr: Attendez... (~1 minute pour qu'un espace de travail c9 soit prêt)

source: Click "Start editing" for the workspace
fr: Cliquez sur "Démarrer l'édition" ("Start editing") pour l'espace de travail (workspace)

source: 2. Set up the workspace for Elgg
fr: 2. Mettez en place l'espace de travail (workplace) pour Elgg

source: Run the following in cloud9's terminal:
fr: Exécutez les commandes suivantes dans le terminal de cloud9 :

source: Configure ``settings.php`` to be like so:
fr: Configurez ``settings.php`` de sorte qu'il ressemble à ceci :

source: 3. Complete the install process from Elgg's UI
fr: 3. Terminez l'installation à partir de l'interface web ²d'Elgg

source: Hit "Run" at the top of the page to start Apache.
fr: Appuyez sur "Exécuter" en haut de la page pour démarrer Apache.

source: Go to ``https://{workspace}-{username}.c9.io/install.php?step=database``
fr: Rendez-vous sur ``https://{workspace}-{username}.c9.io/install.php?step=database``

source: Change Site URL to ``http://your-workspace.your-username.c9.io/``
fr: Modifiez l'URL du site pour ``http://your-workspace.your-username.c9.io/``

source: Put in the data directory path. Should be something like ``/var/..../app-root/data/elgg-data/``.
fr: Indiquez le chemin du répertoire de données. Cela devrait être quelque chose comme ``/var/..../app-root/data/elgg-data/``.

source: Click "Next"
fr: Cliquez sur "Suivant" ("Next")

source: Create the admin account
fr: Créez le compte admin

source: Click "Go to site"
fr: Cliquez sur "Go to site" (Aller sur le site)

source: You may have to manually visit ``https://{workspace}-{username}.c9.io/`` and login with the admin credentials you just configured.
fr: Vous aurez peut-être besoin de vous rendre sur ``https://{workspace}-{username}.c9.io/`` et de vous identifier avec les accès admin que vous venez de créer.

source: Installing Elgg on EasyPHP
fr: Installer Elgg sur EasyPHP

source: You should first be familiar with the :doc:`standard installation instructions <../install>`.
fr: Vous devriez d'abord être familier(ère) avec :doc:`les instructions d'installation standard <../install>`.

source: Assuming no MySQL, PHP or Apache installations exist already.
fr: En supposant que ni MySQL, ni PHP ni Apache ne sont déjà installés.

source: Best run as a development/test server
fr: Exécutez de préférence comme un serveur de test/développement

source: Stop IIS running if installed
fr: Stoppez IIS s'il est installé et en cours d'exécution

source: Download and install the latest Easy PHP from http://www.easyphp.org
fr: Téléchargez et installez la dernière version d'Easy PHP depuis http://www.easyphp.org

source: Set up the database and point the web server to your Elgg folder (all done from the EasyPHP tray icon) - Right click EasyPHP tray icon, select "Administration" - A new tab is created in your browser for managing Easy PHP - Add your Elgg folder to Apache in "Alias" section - Click "Manage MySQL with PhpMyAdmin", create a database and account for Elgg
fr: Mettez en place la base de données et faites pointer le serveur web vers votre répertoire Elgg (tout cela à partir de l'icône d'EasyPHP) - Faites un clic droit sur l'icône d'EasyPHP, sélectionnez "Administration" - Un nouvel onglet est créé dans votre navigateur pour gérer Easy PHP - Ajoutez votre dossier Elgg à Apache dans la section "Alias" - Cliquez sur "Gérer MySQL avec PhpMyAdmin" ("Manage MySQL with PhpMyAdmin"), créez une base de données et un compte utilisateur pour Elgg

source: (Ignore this step for v5.3 or later) From the tray icon go Configuration/Apache and uncomment this line::
fr: (Ignorez cette étape pour la v5.3 et ultérieures) Depuis l'icône allez sur Configuration/Apache et décommentez cette ligne ::

source: (Ignore this step for v5.3 or later) Change ``AllowOverride None`` to ``AllowOverride All`` in the relevant directory entry in Configuration/Apache
fr: (Ignorez cette étape pour la v5.3 ou plus) Changez ``AllowOverride None`` en ``AllowOverride All`` dans l'entrée de répertoire correspondante dans Configuration/Apache

source: (Ignore this step for v5.3 or later) From the tray icon fo Configuration/PHP and uncomment this line::
fr: (Ignorez cette étape pour la v5.3 ou plus) A partir de l'icône rendez-vous dans Configuration/PHP et décommentez cette ligne ::

source: A reboot is best Elgg should run via http://127.0.0.1
fr: Un redémarrage est recommandé, Elgg devrait tourner sur http://127.0.0.1

source: Installing Elgg on Homestead
fr: Installer Elgg sur Homestead

source: `Homestead`_ is an excellent Vagrant box tailored for PHP development made by the developers of `Laravel`_. It allows you to set up an Ubuntu virtual machine in a matter of minutes, saving time installing and configuring an Apache server and all the other tools necessary for local development and testing.
fr: `Homestead`_ est une excellente boîte Vagrant taillée pour le développement PHP créée par les développeurs de `Laravel`_. Elle permet de mettre en place une machine virtuelle Ubuntu en quelques minutes, économisant ainsi le temps d'installation et de configuration d'un serveur Apache et de tous les autres outils nécessaire pour le développement et les tests en local.

source: 1. Install Homestead
fr: 1. Installer Homestead

source: Install one of the preferred virtual machine providers, Vagrant and Homestead following the instructions at https://laravel.com/docs/5.4/homestead
fr: Installez l'un des fournisseurs de machines virtuelles préféré, Vagrant et Homestead en suivant les instructions de https://laravel.com/docs/5.4/homestead

source: If you have the virtual machine and Vagrant installed, you can use the following commands
fr: Si vous avez la machine virtuelle et Vagrant installés, vous pouvez utiliser les commandes suivantes

source: On Windows, make sure to run your command line tool as an Administrator.
fr: Sous Windows, assurez-vous de lancer l'outil de ligne de commande en tant qu'Administrateur

source: 2. Configure Homestead
fr: 2. Configurer Homestead
