Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/plugins.po
Languages: fr

source: To replace the profile icon, or provide more content, extend the ``icon/user/default`` view.
fr: Pour remplacer l'icône de profil, ou fournir plus de contenu, étendre la vue ``icon/user/default``.

source: Adding to the context menu
fr: Ajouter des éléments au menu contextuel

source: The context menu can be expanded by registering a :doc:`event </design/events>` for 'register' 'menu:user_hover', the following sections have special meaning:
fr: Le menu contextuel peut être étendu en enregistrant un :doc:`event </design/events>` pour 'register' 'menu:user_hover', les sections suivantes ont une signification spécifique :

source: **default** for non-active links (eg to read a blog)
fr: **default** pour les liens non actifs (par ex. pour lire un blog)

source: **admin** for links accessible by administrators only
fr: **admin** pour les liens accessibles seulement par les administrateurs

source: In each case, the user in question will be passed as ``$params['entity']``.
fr: Dans tous les cas, l'utilisateur en question sera passé en tant que ``$params['entity']``.

source: Site Notifications
fr: Notifications du site

source: The Site notifications plugin offers a way for your users to keep up to date with what's happening on your community by sending a on-site notification.
fr: Le plugin Site notifications offre à vos utilisateurs un moyen de se tenir au courant de ce qui se passe dans votre communauté en envoyant une notification directement sur le site.

source: Features
fr: Fonctionnalités

source: Get a notification when content is posted on the community
fr: Recevez une notification lorsque du contenu est publié

source: Unread notifications will automatically be marked as read when you view the content it relates to
fr: Les notifications non lues seront automatiquement marquées comme lues quand vous afficherez le contenu auquel elles se rapportent

source: Notifications will automatically be removed if the content it relates to is removed
fr: Les notifications seront automatiquement supprimées si le contenu auquel elles se rapportent est supprimé

source: Plugin settings are available to automatically cleanup unread/read notifications
fr: Les paramètres du plugin permettent de nettoyer automatiquement les notifications lues / non lues

source: The cron based cleanup of (un)read site notifications removes the entities directly from the database. It isn't using ``$entity->delete()`` to help with performance. This means that no events are triggered for the entities which are removed during the cleanup.
fr: Le nettoyage via cron des notifications de site (non) lues supprime directement les entités de la base de données. Il n'utilise pas ``$entity->delete()`` afin d'améliorer les performances. Cela signifie qu'aucun événement n'est déclenché pour les entités supprimées lors du nettoyage.

source: The Wire
fr: Le Fil

source: Elgg wire plugin "The Wire" is Twitter-style microblogging plugin that allows users to post notes to the wire.
fr: Le plugin "The Wire" - Le Fil de Elgg est un plugin de micro-blogging à la manière de Twitter, qui permet aux utilisateurs de publier des notes vers le Fil.

source: User validation by e-mail
fr: Validation des comptes utilisateur via l'e-mail

source: The uservalidationbyemail plugin adds a step to the user registration process. After the user registered on the site, an e-mail is sent to their e-mail address in order to validate that the e-mail address belongs to the user. In the e-mail is an verification link, only after the user clicked on the link will the account of the user be able to login to the site.
fr: Le plugin uservalidationbyemail ajoute une étape au processus d'inscription des utilisateurs. Après que l'utilisateur se soit enregistré sur le site, un e-mail est envoyé à son adresse e-mail afin de valider que cette adresse e-mail appartient bien à l'utilisateur. L'utilisateur ne pourra se connecter qu'après avoir cliqué sur le lien de vérification contenu dans l'e-mail.

source: The process for the user
fr: Déroulement pour l'utilisateur

source: The user creates an account by going to the registration page of your site
fr: L'utilisateur crée un compte en se rendant sur la page d'inscription de votre site

source: After the account is created the user lands on a page with instructions to check their e-mail account for the validation e-mail
fr: Une fois le compte créé l'utilisateur arrive sur une page qui indique de vérifier la présence de l'e-mail de validation sa boîte de messagerie

source: In the validation e-mail is a link to confirm their e-mail address
fr: Dans l'e-mail de validation, un lien permet de confirmer son adresse e-mail

source: After clicking on the link, the account is validated
fr: Après avoir cliqué sur le lien, le compte est validé

source: If possible the user gets logged in
fr: Si possible l'utilisateur est connecté

source: If the user tries to login before validating their account an error is shown to indicate that the user needs to check their e-mail account. Also the validation e-mail is sent again.
fr: Si l'utilisateur tente de s'identifier avant d'avoir validé son compte, une erreur indique que l'utilisateur doit d'abord vérifier sa boite mail. De plus, un nouveau mail de validation est envoyé.

source: Options for site administrators
fr: Options pour les administrateurs du site

source: A site administrator can take some actions on unvalidated accounts. Under Administration -> Users -> Unvalidated is a list of unvalidated users. The administrator can manualy validate or delete the user. Also the option to resend the validation e-mail is present.
fr: Un administrateur du site peut effectuer certaines actions sur les comptes non validés. Une liste des membres non validés se trouve dans Administration -> Utilisateurs -> Non validés. L'administrateur peut manuellement valider ou supprimer l'utilisateur. Il existe également une option pour renvoyer l'e-mail de validation.
