Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/plugins.po
Languages: fr

source: A weblog, or blog, is arguably one of the fundamental DNA pieces of most types of social networking site. The simplest form of personal publishing, it allows for text-based notes to be published in reverse-chronological order. Commenting is also an important part of blogging, turning an individual act of publishing into a conversation.
fr: Un weblog, ou blog, est sans conteste un élément d'ADN fondamental de tous les types de sites de réseautage social. La forme la plus simple de publication personnelle, qui permet de publier des notes textuelles dans un ordre antéchronologique. Les commentaires sont également une part importante des blogs, en transformant un acte de publication personnel en une conversation.

source: Elgg's blog expands this model by providing per-entry access controls and cross-blog tagging. You can control exactly who can see each individual entry, as well as find other entries that people have written on similar topics. You can also see entries written by your friends (that you have access to).
fr: Le blog de Elgg étend ce modèle en fournissant des contrôles d'accès pour chaque entrée et un système de tags transverse aux blogs. Vous pouvez contrôler précisément qui peut voir quel article de blog, et identifier des articles écrits par d'autres personnes sur des sujets similaires. Vous pouvez également voir les entrées écrites par vos contacts (auxquels vous avez accès).

source: `Blogging on Wikipedia <http://en.wikipedia.org/wiki/Blog>`_
fr: `Blog sur Wikipédia <http://fr.wikipedia.org/wiki/Blog>`_

source: With this plugin enabled the longtext input fields will get a WYSIWYG editor which allows for some additional markup options for your text.
fr: Avec ce plugin activé, les champs de saisie de texte long disposent d'un éditeur WYSIWYG avec des options de balisage supplémentaires pour votre texte.

source: Depending on the configuration the editor can be enriched with various text style markup options. Have a look at the CKEditor website for a full featured editor.
fr: Selon la configuration, l'éditeur peut être enrichi de diverses options de balisage de style de texte. Consultez le site web de CKEditor pour un éditeur complet.

source: Elgg also supports uploading images in the editor. You can upload images using a file dialog or just drag/drop or copy/paste the image into the editor.
fr: Elgg prend également en charge le téléchargement d'images dans l'éditeur. Vous pouvez charger des images à l'aide d'une boîte de dialogue de fichier ou simplement glisser/déposer ou copier/coller l'image dans l'éditeur.

source: With the CKEditor plugin you also enable mention capabilities. By default you can mention:
fr: Avec le plugin CKEditor, vous activez également les fonctionnalités de mention. Par défaut, vous pouvez mentionner :

source: Users: use `@` to start autocompleting users
fr: Des utilisateurs : utilisez `@` pour lancer l'autocomplétion pour les utilisateurs

source: Groups: use `!` to start autocompleting groups
fr: Des groupes : utilisez `@` pour lancer l'autocomplétion pour les groupes

source: Searchable content: use `[` to start autocompleting content
fr: Du contenu indexé : utilisez ` [` pour lancer l'autocomplétion pour du contenu

source: When you select something from the autocomplete list a link to the selected user/group/content will be added to the content. Based on the mentioned users preference they will also be notified they have been mentioned.
fr: Lorsque vous sélectionnez quelque chose dans la liste d'autocomplétion, un lien vers l'utilisateur/groupe/contenu sélectionné sera ajouté au contenu. En fonction des préférences des utilisateurs mentionnés, ils seront également informés qu'ils ont été mentionnés.

source: Toolbar configuration
fr: Configuration de la barre d'outils

source: This plugin provides a standard toolbar configuration for the default and simple editor. The plugin settings allow you to configure a custom toolbar config. Almost all CKEditor plugins are available for use. Information on how to configure a toolbar can be found here: https://ckeditor.com/docs/ckeditor5/latest/features/toolbar/toolbar.html
fr: Ce plugin fournit une configuration de barre d'outils standard pour l'éditeur par défaut et l'éditeur simple. Les paramètres du plugin vous permettent de configurer une configuration personnalisée de barre d'outils. Presque tous les plugins CKEditor sont disponibles. Des informations sur la façon de configurer une barre d'outils peuvent être trouvées ici : https://ckeditor.com/docs/ckeditor5/latest/features/toolbar/toolbar.html

source: Dashboard
fr: Tableau de bord

source: A typical Elgg dashboard
fr: Un tableau de bord Elgg typique

source: The dashboard is bundled with both the full and core-only Elgg packages. This is a users portal to activity that is important to them both from within the site and from external sources. Using Elgg's powerful widget API, it is possible to build widgets that pull out relevant content from within an Elgg powered site as well as grab information from third party sources such as Twitter or Flickr (providing those widgets exist). A users dashboard is not the same as their profile, whereas the profile is for consumption by others, the dashboard is a space for users to use for their own needs.
fr: Le tableau de bord est distribué à la fois avec la version complète et avec la version noyau seulement de Elgg. C'est le portail des utilisateurs vers des activités qui leur sont importantes à la fois à l'intérieur du site et depuis des sources externes. En utilisant la puissante API des widgets de Elgg, il est possible de construire des widgets qui extraient du contenu pertinent depuis l'intérieur d'un site Elgg, ou qui récupèrent des informations depuis des sources tierce-partie telles que Twitter ou Flickr (dès lors que ces widgets existent). Le tableau de bord des utilisateurs n'est pas la même chose que leur profil : tandis que le profil est destiné à être consulté par les autres, le tableau de bord est un espace strictement personnel que les utilisateurs utilisent pour leurs propres besoins.

source: Add a forum like place to start a discussion. This feature is mainly meant to used in groups. The group owners can enable/disable this feature for their group.
fr: Ajoutez un forum pour démarrer une discussion. Cette fonctionnalité est principalement destinée à être utilisée dans les groupes. Les propriétaires de groupe peuvent activer/désactiver cette fonctionnalité pour leur groupe.

source: There is a plugin setting to enable global discussions (so outside of a group). This setting is disabled by default but can be enabled by a site administrator.
fr: Il existe un paramètre de plugin pour permettre des discussions globales (donc hors d'un groupe). Ce paramètre est désactivé par défaut mais peut être activé par un administrateur de site.

source: In order to encourage discussion in a group all group members will receive notifications about comments on a discussion topic. This will follow the notification preferences of the group member based on the global group preference or the specific group preference for new discussions.
fr: Afin de favoriser les échanges dans un groupe, tous les membres du groupe recevront des notifications concernant les commentaires sur un sujet de discussion. Cela suivra les préférences de notification définis par chaque membre du groupe, en fonction de ses préférences globales pour les groupes, ou de ses préférences spécifiques pour les nouvelles discussions.

source: File repository
fr: Répertoire de fichiers

source: A file in an Elgg file repository
fr: Un fichier dans un répertoire de fichiers Elgg

source: The file repository allows users to upload any kind of file. As with everything in an Elgg system, you can filter uploaded files by tag and restrict access so that they're only visible by the people you want them to be. Each file may also have comments attached to it.
fr: Le répertoire de fichiers permet à des membres de charger n'importe quel type de fichier. Comme avec tout dans un système Elgg, vous pouvez aisément filtrer les fichiers par tags et restreindre l'accès de sorte qu'ils soient visibles seulement par les personnes que vous souhaitez. Chaque fichier peut également avoir des commentaires associés.

source: There are a number of different uses for this functionality
fr: Il existe plusieurs types d'usages différents pour cette fonctionnalité

source: Photo gallery
fr: Galerie de photo

source: When a user uploads photographs or other pictures, they are automatically collated into an Elgg photo gallery that can be browsed through. Users can also see pictures that their friends have uploaded, or see pictures attached to a group. Clicking into an individual file shows a larger version of the photo.
fr: Quand un utilisateur charge des photographies ou d'autres images, elles sont automatiquement rassemblées dans une galerie de photos Elgg dans laquelle il est possible de naviguer. Les utilisateurs peuvent aussi voir les photos que leurs contacts ont chargées, ou voir des images attachées à un groupe. Une version plus grande de la photo apparaît en cliquant sur l'un des fichiers.

source: Podcasting
fr: Podcasts

source: An Elgg file repository RSS feed automatically doubles as an RSS feed, so you can subscribe to new audio content using programs like iTunes.
fr: Un répertoire de fichiers Elgg est doublé automatiquement par un flux RSS, de sorte que vous pouvez vous abonner à du nouveau contenu audio en utilisant des programmes tels que iTunes.

source: Special content
fr: Contenus spéciaux

source: It is possible for other plugins to add to the players available for different content types. It's possible for a plugin author to embed a viewer for Word documents, for example.
fr: Il est possible pour d'autres plugins d'ajouter de nouveaux lecteurs et visionneuses pour différents types de contenus. L'auteur d'un plugin peut intégrer de cette manière une visionneuse, par exemple pour des documents Word.

source: Note for developers
fr: Note pour les développeurs

source: To add a special content type player, create a plugin with views of the form ``file/specialcontent/mime/type``. For example, to create a special viewer for Word documents, you would create a view called ``file/specialcontent/application/msword``, because ``application/msword`` is the MIME-type for Word documents. Within this view, the ``ElggEntity`` version of the file will be referenced as ``$vars['entity']``. Therefore, the URL of the downloadable file is:
fr: Pour ajouter un lecteur pour un nouveau type de contenu, créez un plugin avec des vues de la forme ``file/specialcontent/mime/type``. Par exemple, pour créer une visionneuse pour des documents Word, vous pouvez créer une vue nommée ``file/specialcontent/application/msword``, puisque ``application/msword`` est le type MIME pour les documents Word. A l'intérieur de cette vue, la version ``ElggEntity`` du fichier sera référencée en tant que ``$vars['entity']``. Dès lors, l'URL du fichier téléchargeable est :

source: Using this, it should be possible to develop most types of embeddable viewers.
fr: En utilisant cela, il devrait être possible de développer des visionneuses intégrées pour la plupart des types des contenus.

source: Friends
fr: Contacts

source: Being a social network framework Elgg supports relationships between users.
fr: En tant que framework de réseau social, Elgg gère les relations entre membres.

source: By default any user can befriend any other user, it's like following the activity of the other user.
fr: Par défaut tout membre peut se mettre en contact avec n'importe quel autre membre : cela revient à suivre l'activité de l'autre membre.

source: After enabling friendship requests as a feature of the Friends plugin, when user A wants to be friends with user B, user B has to approve the request. Upon approval user A will be friends with user B and user B will be friends with user A.
fr: Après avoir activé les demandes de contact en tant que fonctionnalité du plugin Friends, lorsque l’utilisateur A veut être en contact avec l’utilisateur B, l’utilisateur B doit approuver la demande. Lors de l’approbation, l’utilisateur A sera en contact avec l’utilisateur B et l’utilisateur B sera en contact avec l’utilisateur A.

source: Groups
fr: Groupes

source: A typical group profile
fr: Un profil de groupe typique

source: Once you have found others with similar interests - or perhaps you are part of a research groups or a course/class - you may want to have a more structured setting to share content and discuss ideas. This is where Elgg's powerful group building can be used. You can create and moderate as many groups as you like
fr: Une fois que vous avez trouvé d'autres personnes avec des centres d'intérêt similaires - ou peut-être que vous faites partie d'un groupe de recherche ou d'un cours - vous pourriez souhaiter disposer d'un environnement plus structuré pour partager du contenu et discuter d'idées. C'est là qu'interviennent les puissantes fonctionnalités de Elgg en terme de construction de groupes. Vous pouvez créer et modérer autant de groupes que vous le désirez.

source: You can keep all group activity private to the group or you can use the 'make public' option to disseminate work to the wider public.
fr: Vous pouvez conserver toute l'activité du groupe privée pour le groupe, ou utiliser l'option 'rendre public' pour disséminer ses travaux auprès d'un public plus large.

source: Each group produces granular RSS feeds, so it is easy to follow group developments
fr: Chaque groupe produit des flux RSS granulaires, de sorte qu'il est aisé de suivre les développements des groupes

source: Each group has its own URL and profile
fr: Chaque groupe dispose de sa propre URL et page de profil

source: Each group comes with a :doc:`file`, forum, pages and messageboard
fr: Chaque groupe dispose d'un répertoire de fichiers :doc:`file`, d'un forum, de pages et d'un tableau de messages

source: Bundled plugins
fr: Plugins inclus

source: Elgg comes with a set of plugins. These provide the basic functionality for your social network.
fr: Elgg est fourni avec un jeu de plugins. Ils fournissent les fonctionnalités fondamentales pour votre réseau social.

source: The following plugins are also bundled with Elgg, but are not (yet) documented
fr: Les plugins suivants sont également distribués avec Elgg, mais ne sont pas (encore) documentés

source: Allow users to like content on your site. If content supports being likable a 'thumbs up' will appear as a social interaction with this content. Liking content will also notify the content owner about the new like. A counter will show next to the like action reporting about the amount of likes the content has. Clicking on the counter will show a list of users who recently liked the content.
fr: Permet aux utilisateurs d'aimer le contenu de votre site. Si le contenu prend en charge le fait d'être liké, un 'pouce levé' apparaîtra comme une interaction sociale avec ce contenu. Le fait d'aimer le contenu informera également le propriétaire du contenu du nouveau J'aime. Un compteur s'affichera à côté de l'action, indiquant le nombre de likes du contenu. Cliquer sur le compteur affichera une liste d'utilisateurs qui ont récemment aimé le contenu.

source: The likes plugin uses the entity capability `likable`. This capability defines if an entity is likable.
fr: Le plugin likes utilise la capacité d'entité `likable`. Cette capacité définit si une entité peut être aimée.

source: Messageboard
fr: Tableau de messages

source: A sample messageboard placed on the profile
fr: Un exemple de panneau d'affichage placé sur le profil

source: The messageboard - similar to 'The Wall' in Facebook or a comment wall in other networks is a plugin that lets users put a messageboard widget on their profile. Other users can then post messages that will appear on the messageboard. You can then reply directly to any message and view the history between yourself and the person posting the message.
fr: Le tableau de messages - similaire au 'Mur' de Facebook ou à un mur de commentaires dans d'autres réseaux - est un plugin qui permet aux membres de placer un widget tableau de messages sur leur profil. Les autres membres peuvent alors publier des messages qui vont apparaître sur ce tableau de messages. Vous pouvez ensuite répondre directement à n'importe quel message et voir l'historique entre vous et la personne qui a publié le message.

source: Message notification
fr: Notification des messages

source: Private messaging can be sent to users by clicking on their avatar or profile link, providing you have permission. Then, using the built in :doc:`WYSIWYG editor </tutorials/wysiwyg>`, it is possible to format the message. Each user has their own inbox and sentbox. It is possible to be notified via email of new messages.
fr: Des messages privés peuvent être envoyés aux membres en cliquant sur leur avatar ou sur le lien vers leur profil. Puis, en utilisant l':doc:`éditeur WYSIWYG </tutorials/wysiwyg>` intégré, il est possible de mettre en forme le message. Chaque membre dispose de sa propre boîte de réception et d'envoi. Il est possible d'être notifié par e-mail des nouveaux messages.

source: When users first login, they will be notified about any new message by the messages notification mechanism in their top toolbar.
fr: Quand les membres s'identifient, il sont notifiés de tout nouveau message par le mécanisme de notification des messages dans leur barre d'outil supérieure.

source: An Elgg Page
fr: Une page Elgg

source: The pages plugin allows you to save and store hierarchically-organized pages of text, and restrict both reading and writing privileges to them. This means that you can collaboratively create a set of documents with a loose collection of people, participate in a writing process with a formal group, or simply use the functionality to write a document that only you can see, and only choose to share it once it's done. The easy navigation menu allows you to see the whole document structure from any page. You can create as many of these structures as you like; each individual page has its own access controls, so you can reveal portions of the structure while keeping others hidden. In keeping with all other elements in Elgg, you can add comments on a page, or search for pages by tag.
fr: Le plugin pages permet d'enregistrer et de conserver d'une manière organisée et hiérarchisée des pages de texte, et d'en restreindre à la fois les accès en lecture et en écriture. Ceci signifie que vous pouvez créer collaborativement un ensemble de documents avec une liste de personnes choisies, participer à un processus d'écriture au sein d'un groupe formalisé, ou simplement utiliser cette fonctionnalité pour créer un document que vous seul pouvez voir, jusqu'à ce que vous choisissiez de le partager une fois terminé. Le menu de navigation simple vous permet de voir la structure de l'ensemble de documents depuis n'importe quelle page. Vous pouvez créer autant de ces structures que vous le souhaitez ; chaque page individuelle dispose de ses propres contrôles d'accès, de sorte que vous pouvez révéler des portions de la structure tout en conservant les autres invisibles. Dans la ligne des autres éléments dans Elgg, vous pouvez aisément ajouter des commentaires sur une page, ou rechercher des pages par tag.

source: Pages really come into their own in two areas, firstly as a way for users to build up things such as a resume, reflective documentation and so on. The second thing is in the area of collaboration, especially when in the context of groups. With the powerful access controls on both read and write, this plugin is ideal for collaborative document creation.
fr: Les pages expriment vraiment leur potentiel dans deux domaines, d'abord comme moyen pour les utilisateurs de construire des choses telles qu'un CV, un portfolio, une documentation réflexive, et autres constructions de ce type. La seconde est dans le domaine de la collaboration, tout particulièrement dans le cadre d'un groupe. Avec les puissants outils de contrôle d'accès à la fois en lecture et en écriture, ce plugin est idéal pour la création collaborative de documents.

source: Developers should note that there are actually 2 types of pages:
fr: Les développeurs devraient tenir compte du fait qu'il existe en fait 2 types de pages :

source: Top-level pages (with subtype ``page_top``)
fr: Pages racine (avec le sous-type ``page_top``)

source: Normal pages (with subtype ``page``)
fr: Pages normales (avec le sous-type ``page``)

source: Profile
fr: Profil

source: An Elgg profile
fr: Un profil Elgg

source: The profile plugin is bundled with both the full and core-only Elgg packages. The intention is that it can be disabled and replaced with another profile plugin if you wish. It provides a number of pieces of functionality which many consider fundamental to the concept of a social networking site, and is unique within the plugins because the profile icon it defines is referenced as standard from all over the system.
fr: Le plugin profile est distribué à la fois avec la version complète et avec la version noyau seulement de Elgg. L'objectif est qu'il puisse être désactivé et remplacé par un autre plugin de profil si vous le souhaitez. Il fournit un certain nombre d'éléments de fonctionnalités que beaucoup considèrent comme fondamentales pour le concept d'un site de réseautage social, et est unique parmi les plugins parce que l'icône de profil qu'il définit est référencée comme un standard à travers l'ensemble du système.

source: User details
fr: Informations sur l'utilisateur

source: This provides information about a user, which is configurable with the ``fields, user:user`` event. You can change the available profile fields from the admin panel. Each profile field has its own access restriction, so users can choose exactly who can see each individual element. Some of the fields contain tags (for example *skills*) limiting access to a field will also limit who can find you by that tag.
fr: Cela fournit des informations sur un utilisateur, qui sont configurables avec l'événement ``fields, user:user``. Vous pouvez modifier les champs de profil disponibles à partir du panneau d'administration. Chaque champ de profil a sa propre restriction d'accès, de sorte que les utilisateurs peuvent choisir exactement qui peut voir chaque élément individuel. Certains des champs contiennent des tags (par exemple *compétences*) qui limitent l'accès à un champ qui limite également qui peut vous trouver via ce tag.

source: User avatar
fr: Avatar utilisateur

source: The Elgg context menu
fr: Le menu contextuel Elgg

source: The user avatar represents a user (or a group) throughout the site. By default, this includes a context-sensitive menu that allows you to perform actions on the user it belongs to wherever you see their avatar. For example, you can add them as a friend, send an internal message, and more. Each plugin can add to this context menu, so its full contents will vary depending on the functionality active in the current Elgg site.
fr: L'avatar utilisateur représente un utilisateur (ou un groupe) à travers le site. Par défaut, l'avatar intègre un menu contextuel sensitif qui vous permet d'effectuer des actions sur l'utilisateur dès lors que vous voyez son avatar. Par exemple vous pouvez l'ajouter comme contact, lui envoyer un message privé, et plus. Chaque plugin peut ajouter des entrées à ce menu contextuel, de sorte que son contenu final va beaucoup dépendre des fonctionnalités actives dans le site Elgg actuel.

source: Notes for developers
fr: Notes pour les développeurs

source: Using a different profile icon
fr: Utiliser une icône de profil différente
