Repository: Elgg/Elgg
Catalog: docs/locale/*/LC_MESSAGES/tutorials.po
Languages: fr

source: Building a Blog Plugin
fr: Construire un plugin de Blog

source: This tutorial will teach you how to create a simple blog plugin. The basic functions of the blog will be creating posts, saving them and viewing them. The plugin duplicates features that are found in the bundled ``blog`` plugin. You can disable the bundled ``blog`` plugin if you wish, but it is not necessary since the features do not conflict each other.
fr: Ce tutorial va vous apprendre à créer un plugin de blog simple. Les fonctionnalités de base du blog seront de créer des articles, les enregistrer et les afficher. Le plugin duplique des fonctionnalités présentes dans le plugin ``blog`` empaqueté. Vous pouvez désactiver le plugin ``blog`` empaqueté si vous le souhaitez, mais ce n'est pas nécessaire dans la mesure où les fonctionnalités ne seront pas en conflit les unes avec les autres.

source: Prerequisites:
fr: Prérequis :

source: :doc:`Install Elgg</intro/install>`
fr: :doc:`Installation d'Elgg</intro/install>`

source: Create the plugin's directory and manifest file
fr: Créez le répertoire du plugin et le fichier manifest

source: First, choose a simple and descriptive name for your plugin. In this tutorial, the name will be ``my_blog``. Then, create a directory for your plugin in the ``/mod/`` directory found in your Elgg installation directory. Other plugins are also located in ``/mod/``. In this case, the name of the directory should be ``/mod/my_blog/``. This directory is the root of your plugin and all the files that you create for the new plugin will go somewhere under it.
fr: Tout d'abord, choisissez un nom simple et descriptif pour votre plugin. Dans ce tutoriel, le nom sera ``my_blog``. Puis créez un répertoire pour votre plugin dans le répertoire ``/mod/`` qui se trouve dans le répertoire d'installation d'Elgg. D'autres plugins sont également situés dans ``/mod/``. Dans notre cas, le nom de ce répertoire devrait être ``/mod/my_blog/``. Ce répertoire constitue la racine de votre plugin, et tous les fichiers que vous allez créer pour votre nouveau plugin vont l'être quelque part dans ce répertoire.

source: Next, in the root of the plugin, create the plugin's manifest file, ``manifest.xml``:
fr: Ensuite, créez le fichier ``manifest.xml`` à la racine du plugin :

source: See :doc:`Plugins</guides/plugins>` for more information about the manifest file.
fr: Voyez la documentation sur les :doc:`Plugins</guides/plugins>` pour plus d'informations sur le fichier manifest.

source: Create the form for creating a new blog post
fr: Créez le formulaire pour la création d'un nouvel article de blog

source: Create a file at ``/mod/my_blog/views/default/forms/my_blog/save.php`` that contains the form body. The form should have input fields for the title, body and tags of the my_blog post. It does not need form tag markup.
fr: Créez un fichier `/mod/my_blog/views/default/forms/my_blog/save.php`` qui contiendra le corps du formulaire. Le formulaire doit avoir des champs de saisie pour le titre, le corps et les tags de l'article de blog my_blog. Il n'est pas nécessaire d'ajouter les balises <form>.

source: Notice how the form is calling ``elgg_view_field()`` to render inputs. This helper function maintains consistency in field markup, and is used as a shortcut for rendering field elements, such as label, help text, and input. See :doc:`/guides/actions`.
fr: Notez comment le formulaire appelle ``elgg_view_field()`` pour afficher les champs de saisie. Cette fonction d'aide permet de maintenir la cohérence dans les balises des champs de de saisie, et est utilisée comme raccourci pour afficher des éléments des champs, tels que le label, l'aide et le champs de saisie. Voir la :doc:`/guides/actions`.

source: You can see a complete list of input views in the ``/vendor/elgg/elgg/views/default/input/`` directory.
fr: Vous pouvez voir une liste complète des vues d'entrée dans le répertoire ``/vendor/elgg/elgg/views/default/input/``.

source: It is recommended that you make your plugin translatable by using ``elgg_echo()`` whenever there is a string of text that will be shown to the user. Read more at :doc:`Internationalization</guides/i18n>`.
fr: Il est recommandé que vous rendiez votre plugin traduisible en utilisant ``elgg_echo()`` à chaque fois qu'une chaîne de texte sera affichée à l'utilisateur. Lisez-en plus sur l':doc:`Internationalisation</guides/i18n>`.

source: Create a page for composing the blogs
fr: Créez une page pour écrire les articles de blog

source: Create the file ``/mod/my_blog/views/default/resources/my_blog/add.php``. This page will view the form you created in the above section.
fr: Créez le fichier ``/mod/my_blog/views/default/resources/my_blog/add.php``. Cette page va afficher le formulaire que vous avez créé dans la section précédente.

source: The function ``elgg_view_form("my_blog/save")`` views the form that you created in the previous section. It also automatically wraps the form with a ``<form>`` tag and the necessary attributes as well as anti-csrf tokens.
fr: La fonction ``elgg_view_form("my_blog/save")`` affiche le formulaire que vous avez créé dans al section précédente. Elle ajoute automatiquement au formulaire la balise ``<form>`` avec les attributs nécessaires ainsi que des jetons anti-csrf.

source: The form's action will be ``"<?= elgg_get_site_url() ?>action/my_blog/save"``.
fr: L'action du formulaire sera ``"<?= elgg_get_site_url() ?>action/my_blog/save"``.

source: Create the action file for saving the blog post
fr: Créez le fichier d'action pour enregistrer l'article de blog

source: The action file will save the my_blog post to the database. Create the file ``/mod/my_blog/actions/my_blog/save.php``:
fr: Le fichier d'action va enregistrer l'article de blog my_blog dans la base de données. Créez le fichier ``/mod/my_blog/actions/my_blog/save.php``:

source: As you can see in the above code, Elgg objects have several fields built into them. The title of the my_blog post is stored in the ``title`` field while the body is stored in the ``description`` field. There is also a field for tags which are stored as metadata.
fr: Comme vous pouvez le voir dans le code ci-dessus, les objets Elgg disposent de plusieurs champs intégrés. Le titre de l'article my_blog est conservé dans le champs ``title`` tandis que le contenu est conservé dans le champs ``description``. Il y a également un champs pour des tags, qui sont stockés sous la forme de métadonnées.

source: Objects in Elgg are a subclass of something called an "entity". Users, sites, and groups are also subclasses of entity. An entity's subtype allows granular control for listing and displaying, which is why every entity should have a subtype. In this tutorial, the subtype "``my_blog``\ " identifies a my\_blog post, but any alphanumeric string can be a valid subtype. When picking subtypes, be sure to pick ones that make sense for your plugin.
fr: Les objets dans Elgg sont une sous-classe de quelque chose appelé "entité" (entity). Les utilisateurs, sites et groupes sont également des sous-classes d'entité. Le sous-type (subtype) d'une entité permet un contrôle granulaire pour les listings et l'affichage, c'est pourquoi chaque entité devrait avoir un sous-type. Dans ce tutoriel, le sous-type "``my_blog``\ " permet d'identifier un article my\_blog post, mais toute chaîne de caractères alphanumérique peut constituer un sous-type valide. Lorsque vous choisissez des sous-types, veuillez vous assurer d'en choisir un qui soit cohérent avec votre plugin.

source: The ``getURL`` method fetches the URL of the new post. It is recommended that you override this method. The overriding will be done in the ``start.php`` file.
fr: La méthode ``getURL`` charge l'URL du nouvel article. Il est recommandé de surcharger cette méthode. La surcharge sera faite dans le fichier ``start.php``.

source: Create elgg-plugin.php
fr: Créer elgg-plugin.php

source: The ``/mod/my_blog/elgg-plugin.php`` file is used to declare various functionalities of the plugin. It can, for example, be used to configure entities, actions, widgets and routes.
fr: Le fichier ``/mod/my_blog/elgg-plugin.php`` est utilisé pour déclarer diverses fonctionnalités du plugin. Il peut, par exemple, être utilisé pour configurer des entités, des actions, des widgets et des routes.

source: Create start.php
fr: Créez le fichier start.php

source: The ``/mod/my_blog/start.php`` file needs to register a hook to override the URL generation.
fr: Le fichier ``/mod/my_blog/start.php`` doit enregistrer un hook pour surcharger la génération d'URL.

source: Registering the save action will make it available as ``/action/my_blog/save``. By default, all actions are available only to logged in users. If you want to make an action available to only admins or open it up to unauthenticated users, you can pass 'admin' or 'public' as the third parameter of ``elgg_register_action``.
fr: L'enregistrement de l'action de sauvegarde va la rendre disponible via ``/action/my_blog/save``. Par défaut, toutes les actions ne sont disponibles qu'aux utilisateurs identifiés. Si vous souhaitez rendre une action disponible aux seuls administrateurs ou l'ouvrir y compris à des visiteurs non identifiés, vous pouvez passer respectivement 'admin' ou 'public' comme troisième paramètre de ``elgg_register_action``.

source: The URL overriding function will extract the ID of the given entity and use it to make a simple URL for the page that is supposed to view the entity. In this case the entity should of course be a my_blog post. Add this function to your ``start.php`` file:
fr: La fonction de surcharge d'URL va extraire l'ID de l'entité et l'utiliser pour créer une URL simple pour la page qui va afficher cette entité. Dans ce cas l'entité devrait bien sûr être un article my_blog. Ajoutez cette fonction à votre fichier ``start.php`` :

source: The page handler makes it possible to serve the page that generates the form and the page that views the post. The next section will show how to create the page that views the post. Add this function to your ``start.php`` file:
fr: Le gestionnaire de page permet de servir la page qui génère le formulaire et la page qui affiche l'article. La prochaine section va montrer comment créer la page qui affiche l'article. Ajoutez cette fonction à votre fichier `start.php`` :

source: The ``$segments`` variable contains the different parts of the URL as separated by /.
fr: La variable ``$segments`` contient les différentes parties de l'URL une fois séparées par /.

source: Page handling functions need to return ``true`` or ``false``. ``true`` means the page exists and has been handled by the page handler. ``false`` means that the page does not exist and the user will be forwarded to the site's 404 page (requested page does not exist or not found). In this particular example, the URL must contain either ``/my_blog/add`` or ``/my_blog/view/id`` where id is a valid ID of an entity with the ``my_blog`` subtype. More information about page handling is at :doc:`Page handler</guides/routing>`.
fr: Les fonctions de gestionnaires de pages doivent retourner ``true`` ou ``false``. ``true`` signifie que la page existe et a bien été traitée par le gesitonnaire de pages. ``false`` signifie que la page n'existe pas et que l'utilisateur va être redirigé vers la page d'erreur 404 du site (la page demandée n'existe pas ou n'a pas été trouvée). Dans cet exemple, l'URL doit contenir ``/my_blog/add`` ou ``/my_blog/view/id`` où id est un identifiant valide d'une entité avec le sous-type ``my_blog``. Vous trouverez plus d'informations sur les gestionnaires de pages sur :doc:`Page handler</guides/routing>`.

source: Create a page for viewing a blog post
fr: Créez une page pour afficher l'article de blog

source: To be able to view a my_blog post on its own page, you need to make a view page. Create the file ``/mod/my_blog/views/default/resources/my_blog/view.php``:
fr: Pour pouvoir afficher un article my_blog sur sa propre page, vous devez créer une page d'affichage. Créez le fichier ``/mod/my_blog/views/default/resources/my_blog/view.php``:

source: This page has much in common with the ``add.php`` page. The biggest differences are that some information is extracted from the my_blog entity, and instead of viewing a form, the function ``elgg_view_entity`` is called. This function gives the information of the entity to something called the object view.
fr: Cette page a beaucoup de points communs avec la page ``add.php``. Les principales différences sont que les informations sont extraires depuis l'entité my_blog, et qu'au lieu d'afficher un formulaire, la fonction ``elgg_view_entity`` est appelée. Cette fonction donne les informations de l'entité à ce qu'on appelle la vue de l'objet.

source: Create the object view
fr: Créez la vue de l'objet

source: When ``elgg_view_entity`` is called or when my_blogs are viewed in a list for example, the object view will generate the appropriate content. Create the file ``/mod/my_blog/views/default/object/my_blog.php``:
fr: Quand ``elgg_view_entity`` est appelé ou quand des articles my_blogs sont affichés dans une liste par exemple, la vue de l'objet va générer le contenu approprié. Créez le fichier ``/mod/my_blog/views/default/object/my_blog.php`` :

source: As you can see in the previous section, each my\_blog post is passed to the object view as ``$vars['entity']``. (``$vars`` is an array used in the views system to pass variables to a view.)
fr: Comme vous pouvez le voir dans la section précédente, chaque article my\_blog est passé à la vue de l'objet sous la forme ``$vars['entity']``. (``$vars`` est un tableau utilisé dans le système de vues pour passer des variables à une vue.)

source: The last line takes the tags on the my\_blog post and automatically displays them as a series of clickable links. Search is handled automatically.
fr: La dernière ligne prend les tags de l'article my\_blog et les affiche automatiquement sous la forme d'une série de liens cliquables. La recherche est gérée automatiquement.

source: (If you're wondering about the "``default``" in ``/views/default/``, you can create alternative views. RSS, OpenDD, FOAF, mobile and others are all valid view types.)
fr: (Si vous vous interrogez sur le "``default``" dans ``/views/default/``, vous pouvez créer des vues alternatives. RSS, OpenDD, FOAF, mobile et d'autres sont divers types de vues valides.)

source: Trying it out
fr: Tester le plugin

source: Go to your Elgg site's administration page, list the plugins and activate the ``my_blog`` plugin.
fr: Rendez-vous sur la page d'administration d'Elgg, listez les plugins, et activez le plugin ``my_blog``.

source: The page to create a new my\_blog post should now be accessible at ``https://elgg.example.com/my_blog/add``, and after successfully saving the post, you should see it viewed on its own page.
fr: La page pour créer un nouvel article my\_blog devrait désormais être accessible via ``https://elgg.example.com/my_blog/add``, et après avoir enregistré l'article, vous devriez le voir affiché sur sa propre page.

source: Displaying a list of blog posts
fr: Afficher une liste des articles de blog

source: Let's also create a page that lists my\_blog entries that have been created.
fr: Créons également une page qui liste les entrées my_blog qui ont été créées

source: Create ``/mod/my_blog/views/default/resources/my_blog/all.php``:
fr: Créez ``/mod/my_blog/views/default/resources/my_blog/all.php`` :

source: The ``elgg_list_entities`` function grabs the latest my_blog posts and passes them to the object view file. Note that this function returns only the posts that the user can see, so access restrictions are handled transparently. The function (and its cousins) also transparently handles pagination and even creates an RSS feed for your my\_blogs if you have defined that view.
fr: La fonction ``elgg_list_entities`` prend les derniers articles my_blog et les passe à la vue d'affichage de l'objet. Notez que cette fonction ne retourne que les articles que l'utilisateur a le droit de voir, aussi le contrôle d'accès est géré de manière transparente. La fonction (et ses cousines) gère également de manière transparente la pagination, et crée même un flux RSS pour votre my\_blogs si vous avez défini cette vue.

source: The list function can also limit the my_blog posts to those of a specified user. For example, the function ``elgg_get_logged_in_user_guid`` grabs the Global Unique IDentifier (GUID) of the logged in user, and by giving that to ``elgg_list_entities``, the list only displays the posts of the current user:
fr: La fonction de liste peut également restreindre les articles my_blog à ceux d'un utilisateur spécifique. Par exemple, la fonction ``elgg_get_logged_in_user_guid`` récupère l'identifiant unique (GUID) de l'utilisateur connecté, et en le passant à ``elgg_list_entities`` la liste n'affichera que les articles de l'utilisateur connecté :

source: Next, you will need to modify your my\_blog page handler to grab the new page when the URL is set to ``/my_blog/all``. Change the ``my_blog_page_handler`` function in ``start.php`` to look like this:
fr: Puis vous devez modifier votre gestionnaire de page my\_blog pour récupérer la nouvelle page quand l'URL est ``/my_blog/all``. Modifiez la fonction ``my_blog_page_handler`` dans ``start.php`` pour qu'elle ressemble à ceci :

source: Now, if the URL contains ``/my_blog/all``, the user will see an "All Site My_Blogs" page. Because of the default case, the list of all my_blogs will also be shown if the URL is something invalid, like ``/my_blog`` or ``/my_blog/xyz``.
fr: Maintenant, si l'URL contient ``/my_blog/all``, l'utilisateur verra une page "Tous les My_Blogs du site". Grâce au cas par défaut, la liste de tous les my_blogs sera également affichée si l'URL n'est pas valide, comme par exemple``/my_blog`` ou ``/my_blog/xyz``.

source: You might also want to update the object view to handle different kinds of viewing, because otherwise the list of all my_blogs will also show the full content of all my_blogs. Change ``/mod/my_blog/views/default/object/my_blog.php`` to look like this:
fr: Vous pouvez aussi choisir de mettre à jour la vue de l'objet pour gérer différents types d'affichage, faute de quoi la liste de tous les my_blogs va également afficher le contenu complet de tous les my_blogs. Modifiez ``/mod/my_blog/views/default/object/my_blog.php`` pour qu'il ressemble à ceci :

source: Now, if ``full_view`` is ``true`` (as it was pre-emptively set to be in :ref:`this section <tutorials/blog#view>`), the object view will show the post's content and tags (the title is shown by ``view.php``). Otherwise the object view will render just the title and tags of the post.
fr: Désormais, si ``full_view`` est à ``true`` (tel qu'il avait été préalablement défini dans :ref:`cette section <tutorials/blog#view>`), la vue de l'objet va afficher le contenu et les tags de l'article (le titre est affiché par ``view.php``). Sinon la vue de l'objet ne va afficher que le titre et les tags de l'article.

source: The end
fr: FIN

source: There's much more that could be done, but hopefully this gives you a good idea of how to get started.
fr: Il y a tant d'autres choses qui peuvent être faites, mais espérons que ceci vous donne une bonne idée de comment démarrer.

source: This tutorial shows you how to create a new plugin that consists of a new page with the text "Hello world" on it.
fr: Ce tutoriel vous montre comment créer un nouveau plugin qui consiste en une nouvelle page qui affiche le texte "Hello world".

source: Before anything else, you need to :doc:`install Elgg</intro/install>`.
fr: Avant toute chose, vous devez :doc:`installer Elgg</intro/install>`.

source: In this tutorial we will pretend your site's URL is ``https://elgg.example.com``.
fr: Dans ce tutoriel, nous allons supposer que l'URL de votre site est ``https://elgg.example.com``.

source: First, create a directory that will contain the plugin's files. It should be located under the ``mod/`` directory which is located in your Elgg installation directory. So in this case, create ``mod/hello/``.
fr: Tout d'abord, créez un répertoire qui va contenir les fichiers du plugin. Il devrait être placé dans le répertoire ``mod/`` situé dans le répertoire d'installation d'Elgg. Dans notre cas, créez ``mod/hello/``.

source: Manifest file
fr: Fichier Manifest

source: Elgg requires that your plugin has a manifest file that contains information about the plugin. Therefore, in the directory you just created, create a file called ``manifest.xml`` and copy this code into it:
fr: Elgg a besoin que votre plugin dispose d'un fichier manifest qui contient des informations sur le plugin. A cette fin, créez un fichier nommé ``manifest.xml`` dans le répertoire de votre plugin, et collez ce code dedans :

source: This is the minimum amount of information in a manifest file:
fr: Voici le minimum d'informations qui doivent être présentes dans un fichier manifest :

source: ``<name>`` is the display name of the plugin
fr: ``<name>`` est le nom du plugin tel qu'il sera affiché

source: ``<id>`` must be the same as the directory you just created
fr: ``<id>`` doit correspondre au nom du répertoire que vous venez de créer

source: ``<requires>`` must include which version of Elgg your plugin requires
fr: ``<requires>`` doit indiquer la version minimum d'Elgg dont votre plugin a besoin

source: ``<author>``, ``<version>`` and ``<description>`` should have some appropriate values but can be filled freely
fr: ``<author>``, ``<version>`` et ``<description>`` devraient avoir des valeurs appropriées mais peuvent être renseignés librement

source: Initializer
fr: Initialiseur

source: Next, create ``start.php`` in the ``mod/hello/`` directory and copy this code into it:
fr: Puis créez ``start.php`` dans le répertoire ``mod/hello/`` et copiez ce code dedans :

source: The above code tells Elgg that it should call the function ``hello_world_init()`` once the Elgg core system is initiated.
fr: Le code ci-dessus indique à Elgg qu'il devrait appeler la fonction ``hello_world_init()`` une fois que le coeur du système Elgg est initialisé.

source: Registering a route
fr: Enregistrer une route

source: The next step is to register a route which has the purpose of handling request that users make to the URL ``https://elgg.example.com/hello``.
fr: L'étape suivante est d'enregistrer une route dont l'objectif est de traiter les requêtes que les utilsiateurs font vers l'URL ``https://elgg.example.com/hello``.

source: Update ``elgg-plugin.php`` to look like this:
fr: Modifiez ``elgg-plugin.php`` pour qu'il ressemble à ceci :

source: This registration tells Elgg that it should call the resource view ``hello`` when a user navigates to ``https://elgg.example.com/hello``.
fr: Cet enregistrement indique à Elgg d'appeler la vue ressource ``hello`` quand un utilisateur navigue vers ``https://elgg.example.com/hello``.

source: View file
fr: Voir le fichier

source: Create ``mod/hello/views/default/resources/hello.php`` with this content:
fr: Créez ``mod/hello/views/default/resources/hello.php`` avec ce contenu :

source: The code creates an array of parameters to be given to the ``elgg_view_layout()`` function, including:
fr: Le code crée un tableau de paramètres à passer à la fonction ``elgg_view_layout()``, comprenant :

source: The title of the page
fr: Le titre de la page

source: The contents of the page
fr: Le contenu de la page

source: Filter which is left empty because there's currently nothing to filter
fr: Un filter qui est laissé vide puisqu'il n'y a pour le moment rien à filtrer
