<?php
return array(

	/**
	 * Menu items and titles
	 */
	'bookmarks' => "[Ɓǿǿķḿȧřķş ϕǅΐςſſςǋς]",
	'bookmarks:add' => "[Ȧḓḓ ȧ ƀǿǿķḿȧřķ ϵϕ衋 ǅ ǅſςϐϖΰ]",
	'bookmarks:edit' => "[Ḗḓīŧ ƀǿǿķḿȧřķ ǈΰΰϵ ϕſẛſϰΐ]",
	'bookmarks:owner' => "[%s'ş ƀǿǿķḿȧřķş ǈıǲſ ϕϰϕ衋ǅϐϕ]",
	'bookmarks:friends' => "[Ƒřīḗƞḓş' ƀǿǿķḿȧřķş ϵǅǋǅϰϰǅǲ 靐]",
	'bookmarks:everyone' => "[Ȧŀŀ şīŧḗ ƀǿǿķḿȧřķş ςϐǈ ϑϱǲΐ ẛ]",
	'bookmarks:this' => "[Ɓǿǿķḿȧřķ ŧħīş ƥȧɠḗ ǅϕ衋ΰẛẛǈϰ ϐ]",
	'bookmarks:this:group' => "[Ɓǿǿķḿȧřķ īƞ %s ǲ鶱ϵẛϱϖ靐ǅ ςϰ]",
	'bookmarks:bookmarklet' => "[Ɠḗŧ ƀǿǿķḿȧřķŀḗŧ ϑϐς ϕϕϖϰǲϕ]",
	'bookmarks:bookmarklet:group' => "[Ɠḗŧ ɠřǿŭƥ ƀǿǿķḿȧřķŀḗŧ ǋſϐ ſǈϕ衋ϰ]",
	'bookmarks:inbox' => "[Ɓǿǿķḿȧřķş īƞƀǿẋ ΐſǲ鶱ǲΰς衋ϵ]",
	'bookmarks:with' => "[Şħȧřḗ ẇīŧħ ϵΐϵϕϰ ǈϑςΰ]",
	'bookmarks:new' => "[Ȧ ƞḗẇ ƀǿǿķḿȧřķ ϐ ϖſϱ ϑϕǋıϱΰ]",
	'bookmarks:address' => "[Ȧḓḓřḗşş ǿƒ ŧħḗ ƀǿǿķḿȧřķ ϱς靐ΐςϐ衋 ϕϰ]",
	'bookmarks:none' => '[Ƞǿ ƀǿǿķḿȧřķş 靐ǅ ϐ衋衋ϐϵϖϕ]',

	'bookmarks:notify:summary' => '[Ƞḗẇ ƀǿǿķḿȧřķ ƈȧŀŀḗḓ %s ϵϑſ ẛϕ衋ſϑǅ靐]',
	'bookmarks:notify:subject' => '[Ƞḗẇ ƀǿǿķḿȧřķ: %s ı鶱ϰ ẛ靐ıϕſſǲ]',
	'bookmarks:notify:body' =>
'[%s ȧḓḓḗḓ ȧ ƞḗẇ ƀǿǿķḿȧřķ: %s

Ȧḓḓřḗşş: %s

%s

Ṽīḗẇ ȧƞḓ ƈǿḿḿḗƞŧ ǿƞ ŧħḗ ƀǿǿķḿȧřķ:
%s
 ı衋 ϰ鶱ΐϐǅ ϵ ΰǈ]',

	'bookmarks:delete:confirm' => "[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş řḗşǿŭřƈḗ? ǈΰΰ ΰǲ鶱 ǈΐ]",

	'bookmarks:numbertodisplay' => '[Ƞŭḿƀḗř ǿƒ ƀǿǿķḿȧřķş ŧǿ ḓīşƥŀȧẏ ǋϖǈς衋ϕ ϖ衋]',

	'bookmarks:shared' => "[Ɓǿǿķḿȧřķḗḓ ıǲ衋ǲſϰϖ衋ǅǲ]",
	'bookmarks:visit' => "[Ṽīşīŧ řḗşǿŭřƈḗ ǈ衋ǈΰϵ ǋΰẛϐΰΰ]",
	'bookmarks:recent' => "[Řḗƈḗƞŧ ƀǿǿķḿȧřķş 鶱ςǈſǅϱ 鶱ẛϑǲ]",

	'river:create:object:bookmarks' => '[%s ƀǿǿķḿȧřķḗḓ %s ΐ鶱 ϐϱ靐ıı鶱ϐϵ]',
	'river:comment:object:bookmarks' => '[%s ƈǿḿḿḗƞŧḗḓ ǿƞ ȧ ƀǿǿķḿȧřķ %s ϱϑ ǅ鶱ΰ靐ǋϵϐϖ]',
	'bookmarks:river:annotate' => '[ȧ ƈǿḿḿḗƞŧ ǿƞ ŧħīş ƀǿǿķḿȧřķ 靐 衋ϑϱΰǋϑϵ ſ]',
	'bookmarks:river:item' => '[ȧƞ īŧḗḿ ẛſ ςϑϑ衋]',

	'item:object:bookmarks' => '[Ɓǿǿķḿȧřķş ΐ衋鶱ϖϱǅϕ靐ſ]',

	'bookmarks:group' => '[Ɠřǿŭƥ ƀǿǿķḿȧřķş ϑϱı衋ΰ ǲẛςϖ]',
	'bookmarks:enablebookmarks' => '[Ḗƞȧƀŀḗ ɠřǿŭƥ ƀǿǿķḿȧřķş ıϰΰΰΐǋ ϱǋϖϐ]',
	'bookmarks:nogroup' => '[Ŧħīş ɠřǿŭƥ ḓǿḗş ƞǿŧ ħȧṽḗ ȧƞẏ ƀǿǿķḿȧřķş ẏḗŧ ϱſ靐ϰ ǅǈıϵϱ]',
	
	/**
	 * Widget and bookmarklet
	 */
	'bookmarks:widget:description' => "[Ḓīşƥŀȧẏ ẏǿŭř ŀȧŧḗşŧ ƀǿǿķḿȧřķş. 衋ςϰϑǅΐϐ ſϖ]",

	'bookmarks:bookmarklet:description' =>
			"[Ȧ ƀǿǿķḿȧřķŀḗŧ īş ȧ şƥḗƈīȧŀ ķīƞḓ ǿƒ ƀŭŧŧǿƞ ẏǿŭ şȧṽḗ ŧǿ ẏǿŭř ƀřǿẇşḗř'ş ŀīƞķş ƀȧř. Ŧħīş ȧŀŀǿẇş ẏǿŭ ŧǿ şȧṽḗ ȧƞẏ řḗşǿŭřƈḗ ẏǿŭ ƒīƞḓ ǿƞ ŧħḗ ẇḗƀ ŧǿ ẏǿŭř ƀǿǿķḿȧřķş, ȧƞḓ ǿƥŧīǿƞȧŀŀẏ şħȧřḗ īŧ ẇīŧħ ẏǿŭř ƒřīḗƞḓş. Ŧǿ şḗŧ īŧ ŭƥ, ḓřȧɠ ŧħḗ ƀŭŧŧǿƞ ƀḗŀǿẇ ŧǿ ẏǿŭř ƀřǿẇşḗř'ş ŀīƞķş ƀȧř: ǈ ſΰϑǈϖǅς衋ϕϱϰ ǲǅ ϰ ϱẛΰϖǋǋ衋 ǈıϑſ ǋǅ ſΰϵϖςſ ǈǈǅ ϰẛẛ]",

	'bookmarks:bookmarklet:descriptionie' =>
			"[Īƒ ẏǿŭ ȧřḗ ŭşīƞɠ Īƞŧḗřƞḗŧ Ḗẋƥŀǿřḗř, ẏǿŭ ẇīŀŀ ƞḗḗḓ ŧǿ řīɠħŧ ƈŀīƈķ ǿƞ ŧħḗ ƀǿǿķḿȧřķŀḗŧ īƈǿƞ, şḗŀḗƈŧ 'ȧḓḓ ŧǿ ƒȧṽǿřīŧḗş', ȧƞḓ ŧħḗƞ ŧħḗ Ŀīƞķş ƀȧř. ςς 靐ΰϕ ΐϵ鶱 ϐ靐ϕ衋ΐ ǲǅϰϵΰǲǋǋ]",

	'bookmarks:bookmarklet:description:conclusion' =>
			"[Ẏǿŭ ƈȧƞ ŧħḗƞ ƀǿǿķḿȧřķ ȧƞẏ ƥȧɠḗ ẏǿŭ ṽīşīŧ ƀẏ ƈŀīƈķīƞɠ ŧħḗ ƀŭŧŧǿƞ īƞ ẏǿŭř ƀřǿẇşḗř ȧŧ ȧƞẏ ŧīḿḗ. ϖϖΰ ϑΰϐ ΰΐςΰ ϐ衋]",

	/**
	 * Status messages
	 */

	'bookmarks:save:success' => "[Ẏǿŭř īŧḗḿ ẇȧş şŭƈƈḗşşƒŭŀŀẏ ƀǿǿķḿȧřķḗḓ. 衋ΐ衋ǋ ϱǋΰǈ ı]",
	'bookmarks:delete:success' => "[Ẏǿŭř ƀǿǿķḿȧřķ ẇȧş ḓḗŀḗŧḗḓ. ϑ靐ǲϰ ϕϑϐẛϵẛ]",

	/**
	 * Error messages
	 */

	'bookmarks:save:failed' => "[Ẏǿŭř ƀǿǿķḿȧřķ ƈǿŭŀḓ ƞǿŧ ƀḗ şȧṽḗḓ. Ḿȧķḗ şŭřḗ ẏǿŭ'ṽḗ ḗƞŧḗřḗḓ ȧ ŧīŧŀḗ ȧƞḓ ȧḓḓřḗşş ȧƞḓ ŧħḗƞ ŧřẏ ȧɠȧīƞ. ıǋǅς ıϖ鶱ΰϕςǋǲ ϱſ]",
	'bookmarks:save:invalid' => "[Ŧħḗ ȧḓḓřḗşş ǿƒ ŧħḗ ƀǿǿķḿȧřķ īş īƞṽȧŀīḓ ȧƞḓ ƈǿŭŀḓ ƞǿŧ ƀḗ şȧṽḗḓ. ϕΐΐ ϕǅ靐ϕǋ]",
	'bookmarks:delete:failed' => "[Ẏǿŭř ƀǿǿķḿȧřķ ƈǿŭŀḓ ƞǿŧ ƀḗ ḓḗŀḗŧḗḓ. Ƥŀḗȧşḗ ŧřẏ ȧɠȧīƞ. 衋ϑϐϵ ϖϵ]",
	'bookmarks:unknown_bookmark' => '[Ƈȧƞƞǿŧ ƒīƞḓ şƥḗƈīƒīḗḓ ƀǿǿķḿȧřķ ǈϖϰ鶱ΐ靐 ϱϵı]',
);
