<?php
return array(

	/**
	 * Menu items and titles
	 */
	'bookmarks' => "[Ɓǿǿķḿȧřķş 衋ΐ鶱ǅǅǈϵϱϑ]",
	'bookmarks:add' => "[Ȧḓḓ ȧ ƀǿǿķḿȧřķ ẛǈϖ ϐ 鶱ϐϕſςſ]",
	'bookmarks:edit' => "[Ḗḓīŧ ƀǿǿķḿȧřķ ϱſϱΰ ϖϰẛϐǲı]",
	'bookmarks:owner' => "[%s'ş ƀǿǿķḿȧřķş 鶱ıǲ靐 ſϰϵϱıςΐ]",
	'bookmarks:friends' => "[Ƒřīḗƞḓş' ƀǿǿķḿȧřķş ϑ鶱ϱϱ衋ΐẛϰ ẛ]",
	'bookmarks:everyone' => "[Ȧŀŀ şīŧḗ ƀǿǿķḿȧřķş 靐ſẛ ϰǋǲſ ϱ]",
	'bookmarks:this' => "[Ɓǿǿķḿȧřķ ŧħīş ƥȧɠḗ ıǋϰẛſǋΰı ǅ]",
	'bookmarks:this:group' => "[Ɓǿǿķḿȧřķ īƞ %s ǈϐſıϕıϕſ ϕſ]",
	'bookmarks:bookmarklet' => "[Ɠḗŧ ƀǿǿķḿȧřķŀḗŧ ϖς衋 ϰǅǋǲıǋ]",
	'bookmarks:bookmarklet:group' => "[Ɠḗŧ ɠřǿŭƥ ƀǿǿķḿȧřķŀḗŧ ϰϰǅ ΐϑǅϱΐ]",
	'bookmarks:inbox' => "[Ɓǿǿķḿȧřķş īƞƀǿẋ ſǅǲϖ衋ϱϵςϱ]",
	'bookmarks:with' => "[Şħȧřḗ ẇīŧħ 衋ǈΐǋ鶱 ǋϰϑſ]",
	'bookmarks:new' => "[Ȧ ƞḗẇ ƀǿǿķḿȧřķ ǋ ϐ鶱ΐ ϱϖ靐ΐϱϕ]",
	'bookmarks:address' => "[Ȧḓḓřḗşş ǿƒ ŧħḗ ƀǿǿķḿȧřķ 衋ϖǅǋǈǋϱ ΰΰ]",
	'bookmarks:none' => '[Ƞǿ ƀǿǿķḿȧřķş ıſ ǋϖ靐ςϵǋϕ]',

	'bookmarks:notify:summary' => '[Ƞḗẇ ƀǿǿķḿȧřķ ƈȧŀŀḗḓ %s ϑςϖ 衋ǲςϑ鶱ıϵ]',
	'bookmarks:notify:subject' => '[Ƞḗẇ ƀǿǿķḿȧřķ: %s ǈǋϖ ǲϖ鶱ϖΰẛ鶱]',
	'bookmarks:notify:body' =>
'[%s ȧḓḓḗḓ ȧ ƞḗẇ ƀǿǿķḿȧřķ: %s

Ȧḓḓřḗşş: %s

%s

Ṽīḗẇ ȧƞḓ ƈǿḿḿḗƞŧ ǿƞ ŧħḗ ƀǿǿķḿȧřķ:
%s
 ǅǅ ϖ鶱ǈϵẛ ΰ ǅϕ]',

	'bookmarks:delete:confirm' => "[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş řḗşǿŭřƈḗ? ςϵǅ ϖǲϑ 鶱ΐ]",

	'bookmarks:numbertodisplay' => '[Ƞŭḿƀḗř ǿƒ ƀǿǿķḿȧřķş ŧǿ ḓīşƥŀȧẏ ϑςϑΐςϐ ΐǅ]',

	'bookmarks:shared' => "[Ɓǿǿķḿȧřķḗḓ 鶱ſǅϖϰ鶱ſϰẛ鶱]",
	'bookmarks:visit' => "[Ṽīşīŧ řḗşǿŭřƈḗ ẛſϰ鶱ẛ ΰϖ靐ϐϑǈ]",
	'bookmarks:recent' => "[Řḗƈḗƞŧ ƀǿǿķḿȧřķş ıΰϐΰ衋ϖ ǈ鶱ſǈ]",

	'river:create:object:bookmarks' => '[%s ƀǿǿķḿȧřķḗḓ %s ΐǋ 靐ǅıǈǋıǈı]',
	'river:comment:object:bookmarks' => '[%s ƈǿḿḿḗƞŧḗḓ ǿƞ ȧ ƀǿǿķḿȧřķ %s ςϰ ǅǋ靐ǈǈΰϵϖ]',
	'bookmarks:river:annotate' => '[ȧ ƈǿḿḿḗƞŧ ǿƞ ŧħīş ƀǿǿķḿȧřķ ǋ ǋϐϵẛςǲẛ ſ]',
	'bookmarks:river:item' => '[ȧƞ īŧḗḿ 鶱靐 ǈ衋ϕǈ]',

	'item:object:bookmarks' => '[Ɓǿǿķḿȧřķş ΐẛϰ靐ϵϑϐ靐ϖ]',

	'bookmarks:group' => '[Ɠřǿŭƥ ƀǿǿķḿȧřķş ǅϐΰǈẛ ǅẛǅϵ]',
	'bookmarks:enablebookmarks' => '[Ḗƞȧƀŀḗ ɠřǿŭƥ ƀǿǿķḿȧřķş ǈϱϑςϖϕ ϱϱǲǋ]',
	'bookmarks:nogroup' => '[Ŧħīş ɠřǿŭƥ ḓǿḗş ƞǿŧ ħȧṽḗ ȧƞẏ ƀǿǿķḿȧřķş ẏḗŧ 靐ǈǈǅ ϱϑϰǈ靐]',
	
	/**
	 * Widget and bookmarklet
	 */
	'bookmarks:widget:description' => "[Ḓīşƥŀȧẏ ẏǿŭř ŀȧŧḗşŧ ƀǿǿķḿȧřķş. ẛϰϰϕſΐǲ ǲ衋]",

	'bookmarks:bookmarklet:description' =>
			"[Ȧ ƀǿǿķḿȧřķŀḗŧ īş ȧ şƥḗƈīȧŀ ķīƞḓ ǿƒ ƀŭŧŧǿƞ ẏǿŭ şȧṽḗ ŧǿ ẏǿŭř ƀřǿẇşḗř'ş ŀīƞķş ƀȧř. Ŧħīş ȧŀŀǿẇş ẏǿŭ ŧǿ şȧṽḗ ȧƞẏ řḗşǿŭřƈḗ ẏǿŭ ƒīƞḓ ǿƞ ŧħḗ ẇḗƀ ŧǿ ẏǿŭř ƀǿǿķḿȧřķş, ȧƞḓ ǿƥŧīǿƞȧŀŀẏ şħȧřḗ īŧ ẇīŧħ ẏǿŭř ƒřīḗƞḓş. Ŧǿ şḗŧ īŧ ŭƥ, ḓřȧɠ ŧħḗ ƀŭŧŧǿƞ ƀḗŀǿẇ ŧǿ ẏǿŭř ƀřǿẇşḗř'ş ŀīƞķş ƀȧř: ǅ ς鶱ϵ鶱ϐǋΰ靐靐ϑǅ ϐΰ 衋 鶱衋ẛ衋ı靐ϰ ΰǈϕϕ ϑϱ ΰϵſ衋ϰϕ ǲẛı ǅ靐ΐ]",

	'bookmarks:bookmarklet:descriptionie' =>
			"[Īƒ ẏǿŭ ȧřḗ ŭşīƞɠ Īƞŧḗřƞḗŧ Ḗẋƥŀǿřḗř, ẏǿŭ ẇīŀŀ ƞḗḗḓ ŧǿ řīɠħŧ ƈŀīƈķ ǿƞ ŧħḗ ƀǿǿķḿȧřķŀḗŧ īƈǿƞ, şḗŀḗƈŧ 'ȧḓḓ ŧǿ ƒȧṽǿřīŧḗş', ȧƞḓ ŧħḗƞ ŧħḗ Ŀīƞķş ƀȧř. ϐϰ 靐ǈϖ ϖϑϵ ΰϵ鶱ẛ鶱 ſıϑ鶱ıϖϖ衋]",

	'bookmarks:bookmarklet:description:conclusion' =>
			"[Ẏǿŭ ƈȧƞ ŧħḗƞ ƀǿǿķḿȧřķ ȧƞẏ ƥȧɠḗ ẏǿŭ ṽīşīŧ ƀẏ ƈŀīƈķīƞɠ ŧħḗ ƀŭŧŧǿƞ īƞ ẏǿŭř ƀřǿẇşḗř ȧŧ ȧƞẏ ŧīḿḗ. ςςǲ ΐςǲ 鶱ϐΰϱ ϕ靐]",

	/**
	 * Status messages
	 */

	'bookmarks:save:success' => "[Ẏǿŭř īŧḗḿ ẇȧş şŭƈƈḗşşƒŭŀŀẏ ƀǿǿķḿȧřķḗḓ. ϑǅϵϕ ǋϑςǲ ϖ]",
	'bookmarks:delete:success' => "[Ẏǿŭř ƀǿǿķḿȧřķ ẇȧş ḓḗŀḗŧḗḓ. ſΐςϐ ϱ衋ϕſϱϵ]",

	/**
	 * Error messages
	 */

	'bookmarks:save:failed' => "[Ẏǿŭř ƀǿǿķḿȧřķ ƈǿŭŀḓ ƞǿŧ ƀḗ şȧṽḗḓ. Ḿȧķḗ şŭřḗ ẏǿŭ'ṽḗ ḗƞŧḗřḗḓ ȧ ŧīŧŀḗ ȧƞḓ ȧḓḓřḗşş ȧƞḓ ŧħḗƞ ŧřẏ ȧɠȧīƞ. ǲςǋϱ ǈϰǲϕΐ鶱衋ϵ ΐǅ]",
	'bookmarks:save:invalid' => "[Ŧħḗ ȧḓḓřḗşş ǿƒ ŧħḗ ƀǿǿķḿȧřķ īş īƞṽȧŀīḓ ȧƞḓ ƈǿŭŀḓ ƞǿŧ ƀḗ şȧṽḗḓ. ſϖſ ϑϑſϖΐ]",
	'bookmarks:delete:failed' => "[Ẏǿŭř ƀǿǿķḿȧřķ ƈǿŭŀḓ ƞǿŧ ƀḗ ḓḗŀḗŧḗḓ. Ƥŀḗȧşḗ ŧřẏ ȧɠȧīƞ. ϖǲΰϕ ϵſ]",
	'bookmarks:unknown_bookmark' => '[Ƈȧƞƞǿŧ ƒīƞḓ şƥḗƈīƒīḗḓ ƀǿǿķḿȧřķ ǋϑϰϕẛǅ ϵ鶱ϱ]',
);
