<?php
return array(
	'likes:this' => '[ŀīķḗḓ ŧħīş ϑϰ鶱ϖϖ ϐϐϐǈ]',
	'likes:deleted' => '[Ẏǿŭř ŀīķḗ ħȧş ƀḗḗƞ řḗḿǿṽḗḓ ϑϐςǋ ǅΰ衋ǲ ϰ]',
	'likes:see' => '[Şḗḗ ẇħǿ ŀīķḗḓ ŧħīş ǋǲϱ ϑϱẛ 衋ǈ]',
	'likes:remove' => '[Ŭƞŀīķḗ ŧħīş ΰǈϱǅıẛ ςǋϵǅ]',
	'likes:notdeleted' => '[Ŧħḗřḗ ẇȧş ȧ ƥřǿƀŀḗḿ řḗḿǿṽīƞɠ ẏǿŭř ŀīķḗ ϖſϖſǅ ı靐ǈ ǲ]',
	'likes:likes' => '[Ẏǿŭ ƞǿẇ ŀīķḗ ŧħīş īŧḗḿ ẛẛς ǲ衋ΐ ϖıϖ]',
	'likes:failure' => '[Ŧħḗřḗ ẇȧş ȧ ƥřǿƀŀḗḿ ŀīķīƞɠ ŧħīş īŧḗḿ ϕǈϖςſ ϑǅϵ]',
	'likes:alreadyliked' => '[Ẏǿŭ ħȧṽḗ ȧŀřḗȧḓẏ ŀīķḗḓ ŧħīş īŧḗḿ ϱǋı ϱſ衋ϐ 鶱ı]',
	'likes:notfound' => '[Ŧħḗ īŧḗḿ ẏǿŭ ȧřḗ ŧřẏīƞɠ ŧǿ ŀīķḗ ƈȧƞƞǿŧ ƀḗ ƒǿŭƞḓ 衋ΐϖ ϐ靐ϐǲ ΐ]',
	'likes:likethis' => '[Ŀīķḗ ŧħīş ΰϖϕϕ ſϐϖǲ]',
	'likes:userlikedthis' => '[%s ŀīķḗ 衋ΐ ςǋſΐ]',
	'likes:userslikedthis' => '[%s ŀīķḗş ϵǈ ϵ靐ẛ衋ǈ]',
	'likes:river:annotate' => '[ŀīķḗş ΐǈϐ衋ΰ]',
	'likes:delete:confirm' => '[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş ŀīķḗ? ϐϱǅ ǋΰϱ ẛϑ]',

	'river:likes' => '[ŀīķḗş %s %s ϱǅǈ鶱ΰ ǈϰ ϕẛ]',

	// notifications. yikes.
	'likes:notifications:subject' => '[%s ŀīķḗş ẏǿŭř ƥǿşŧ "%s" ϕẛ 靐衋ſϖǲ ς鶱]',
	'likes:notifications:body' =>
'[Ħī %1$s,

%2$s ŀīķḗş ẏǿŭř ƥǿşŧ "%3$s" ǿƞ %4$s

Şḗḗ ẏǿŭř ǿřīɠīƞȧŀ ƥǿşŧ ħḗřḗ:

%5$s

ǿř ṽīḗẇ %2$s\'ş ƥřǿƒīŀḗ ħḗřḗ:

%6$s

Ŧħȧƞķş,
%4$s
 ΰǅ ϖǅ衋衋靐ΰǅ鶱ϰϰǈ 衋ϖẛϐǅ ϰϕ]',
	
);
