<?php
return array(
	'likes:this' => '[ŀīķḗḓ ŧħīş ǋẛϰẛſ ϰςϕϱ]',
	'likes:deleted' => '[Ẏǿŭř ŀīķḗ ħȧş ƀḗḗƞ řḗḿǿṽḗḓ ϕẛϖϑ ǋǈϱ衋 ϕ]',
	'likes:see' => '[Şḗḗ ẇħǿ ŀīķḗḓ ŧħīş ſϵς ϰϰǋ ΐẛ]',
	'likes:remove' => '[Ŭƞŀīķḗ ŧħīş ΰΐǅϱ鶱鶱 ΐǋςΐ]',
	'likes:notdeleted' => '[Ŧħḗřḗ ẇȧş ȧ ƥřǿƀŀḗḿ řḗḿǿṽīƞɠ ẏǿŭř ŀīķḗ ẛǲϑΐ衋 ſϐϖ ϱ]',
	'likes:likes' => '[Ẏǿŭ ƞǿẇ ŀīķḗ ŧħīş īŧḗḿ ϱϖϑ ϖ衋ſ ǋϕǋ]',
	'likes:failure' => '[Ŧħḗřḗ ẇȧş ȧ ƥřǿƀŀḗḿ ŀīķīƞɠ ŧħīş īŧḗḿ ǋ鶱ǋϑΰ ΐϵϑ]',
	'likes:alreadyliked' => '[Ẏǿŭ ħȧṽḗ ȧŀřḗȧḓẏ ŀīķḗḓ ŧħīş īŧḗḿ 靐ſΰ ϕǋǈǈ ϵϐ]',
	'likes:notfound' => '[Ŧħḗ īŧḗḿ ẏǿŭ ȧřḗ ŧřẏīƞɠ ŧǿ ŀīķḗ ƈȧƞƞǿŧ ƀḗ ƒǿŭƞḓ ϖΐ靐 ΐǅΐǈ 衋]',
	'likes:likethis' => '[Ŀīķḗ ŧħīş ϑǅϵẛ ΰ靐ẛ鶱]',
	'likes:userlikedthis' => '[%s ŀīķḗ ϑǋ 靐ǲǲΰ]',
	'likes:userslikedthis' => '[%s ŀīķḗş ǅϑ ǈıǋ衋靐]',
	'likes:river:annotate' => '[ŀīķḗş ııϵǈ衋]',
	'likes:delete:confirm' => '[Ȧřḗ ẏǿŭ şŭřḗ ẏǿŭ ẇȧƞŧ ŧǿ ḓḗŀḗŧḗ ŧħīş ŀīķḗ? ϐǈ鶱 ςẛ鶱 ẛϐ]',

	'river:likes' => '[ŀīķḗş %s %s ẛΐΰΐς ϰẛ ϰ衋]',

	// notifications. yikes.
	'likes:notifications:subject' => '[%s ŀīķḗş ẏǿŭř ƥǿşŧ "%s" ϵı ſϕϵ衋鶱 ϱ靐]',
	'likes:notifications:body' =>
'[Ħī %1$s,

%2$s ŀīķḗş ẏǿŭř ƥǿşŧ "%3$s" ǿƞ %4$s

Şḗḗ ẏǿŭř ǿřīɠīƞȧŀ ƥǿşŧ ħḗřḗ:

%5$s

ǿř ṽīḗẇ %2$s\'ş ƥřǿƒīŀḗ ħḗřḗ:

%6$s

Ŧħȧƞķş,
%4$s
 ſϖ ϰΐΰẛſϕıǋ靐ςϱ ϐ衋ſ衋ϵ ΐϱ]',
	
);
