<?php
return array(
	'embed:embed' => 'Ενσωμάτωση',
	'embed:media' => 'Ενσωματωμένο περιεχόμενο',
	'embed:instructions' => 'Κάντε κλικ σε οποιοδήποτε αρχείο για να το ενσωματώσετε στο περιεχόμενό σας.',
	'embed:upload' => 'Ανέβασμα αρχείου',
	'embed:upload_type' => 'Τύπος:',

	// messages
	'embed:no_upload_content' => 'Δεν ανεβάσατε περιεχόμενο!',
	'embed:no_section_content' => 'Δεν βρέθηκε περιεχόμενο.',

	'embed:no_sections' => 'Δεν βρέθηκαν plugins ενσωμάτωσης. Ζητήστε από το διαχειριστή του ιστότοπου να ενεργοποιήσει τη λειτουργικότητα ενσωμάτωσης αρχείων.',
);