<?php
return array(
	'embed:embed' => '[Ḗḿƀḗḓ ϰẛϕϖǈ]',
	'embed:media' => '[Ḗḿƀḗḓ ƈǿƞŧḗƞŧ ǈϖẛςı ıΰ鶱ẛ靐]',
	'embed:instructions' => '[Ƈŀīƈķ ǿƞ ȧƞẏ ƒīŀḗ ŧǿ ḗḿƀḗḓ īŧ īƞŧǿ ẏǿŭř ƈǿƞŧḗƞŧ. ϕϐẛǋϰ ς靐 鶱]',
	'embed:upload' => '[Ŭƥŀǿȧḓ ḿḗḓīȧ ǲϰǅǈıΐ ǲǅǲ]',
	'embed:upload_type' => '[Ŭƥŀǿȧḓ ŧẏƥḗ:  ϰϑǲϑΰ鶱 ΐΐẛϖ]',

	// messages
	'embed:no_upload_content' => '[Ƞǿ ŭƥŀǿȧḓ ƈǿƞŧḗƞŧ! ςϑ 鶱ΰſ鶱ıϰ]',
	'embed:no_section_content' => '[Ƞǿ īŧḗḿş ƒǿŭƞḓ. ϵ鶱 ǋϕǲǈǅ 衋]',

	'embed:no_sections' => '[Ƞǿ şŭƥƥǿřŧḗḓ ḗḿƀḗḓ ƥŀŭɠīƞş ƒǿŭƞḓ. Ȧşķ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ŧǿ ḗƞȧƀŀḗḓ ȧ ƥŀŭɠīƞ ẇīŧħ ḗḿƀḗḓ şŭƥƥǿřŧ. ϐı ϖ衋ϕǋϕς靐ϕϑ ΰϖϕϰ]',
);