<?php
return array(
	'embed:embed' => '[Ḗḿƀḗḓ ẛϱ靐ςϱ]',
	'embed:media' => '[Ḗḿƀḗḓ ƈǿƞŧḗƞŧ ϱſẛςı ϐ鶱衋ǈΰ]',
	'embed:instructions' => '[Ƈŀīƈķ ǿƞ ȧƞẏ ƒīŀḗ ŧǿ ḗḿƀḗḓ īŧ īƞŧǿ ẏǿŭř ƈǿƞŧḗƞŧ. ϐǋ鶱ς衋 ϑǲ ς]',
	'embed:upload' => '[Ŭƥŀǿȧḓ ḿḗḓīȧ ΐϰςǲϑϐ 衋ϱǅ]',
	'embed:upload_type' => '[Ŭƥŀǿȧḓ ŧẏƥḗ:  ϰΐϕǲϑϵ 靐衋ẛς]',

	// messages
	'embed:no_upload_content' => '[Ƞǿ ŭƥŀǿȧḓ ƈǿƞŧḗƞŧ! ϱϰ ϑǋǲǲϖǈ]',
	'embed:no_section_content' => '[Ƞǿ īŧḗḿş ƒǿŭƞḓ. ϖϕ ϐ鶱ϵϵſ ϱ]',

	'embed:no_sections' => '[Ƞǿ şŭƥƥǿřŧḗḓ ḗḿƀḗḓ ƥŀŭɠīƞş ƒǿŭƞḓ. Ȧşķ ŧħḗ şīŧḗ ȧḓḿīƞīşŧřȧŧǿř ŧǿ ḗƞȧƀŀḗḓ ȧ ƥŀŭɠīƞ ẇīŧħ ḗḿƀḗḓ şŭƥƥǿřŧ. ǲ靐 ǅǋςϑϖϖ鶱ΐſ ϕǲǈ鶱]',
);