<?php
return array(

	'friends:invite' => '[Īƞṽīŧḗ ƒřīḗƞḓş ıǋϑϵǋǈ ΐ靐ϱϑǋ]',
	
	'invitefriends:registration_disabled' => '[Ƞḗẇ ŭşḗř řḗɠīşŧřȧŧīǿƞ ħȧş ƀḗḗƞ ḓīşȧƀŀḗḓ ǿƞ ŧħīş şīŧḗ; ẏǿŭ ȧřḗ ŭƞȧƀŀḗ ŧǿ īƞṽīŧḗ ƞḗẇ ŭşḗřş. ıϰǈ ϵǅ靐ǋ ϕſΐςǲ]',
	
	'invitefriends:introduction' => '[Ŧǿ īƞṽīŧḗ ƒřīḗƞḓş ŧǿ ĵǿīƞ ẏǿŭ ǿƞ ŧħīş ƞḗŧẇǿřķ, ḗƞŧḗř ŧħḗīř ḗḿȧīŀ ȧḓḓřḗşşḗş ȧƞḓ ȧ ḿḗşşȧɠḗ ŧħḗẏ ẇīŀŀ řḗƈḗīṽḗ ẇīŧħ ẏǿŭř īƞṽīŧȧŧīǿƞ ıı ǅϑǅϱςǅ ςϖǈſΐϵϱ ϐ靐 ϵ]',
	'invitefriends:emails' => '[Ḗḿȧīŀ ȧḓḓřḗşşḗş (ǿƞḗ ƥḗř ŀīƞḗ) ǈϐϕΰς ẛǲẛϑ]',
	'invitefriends:message' => '[Ḿḗşşȧɠḗ ϖſϱϖǈϰϱ]',
	'invitefriends:subject' => '[Īƞṽīŧȧŧīǿƞ ŧǿ ĵǿīƞ %s ǋſǈǲıϵǋǲΰϵ]',

	'invitefriends:success' => '[Ẏǿŭř ƒřīḗƞḓş ẇḗřḗ īƞṽīŧḗḓ. ǈıẛϐ ẛẛǈΰǅϕ]',
	'invitefriends:invitations_sent' => '[Īƞṽīŧḗş şḗƞŧ: %s. Ŧħḗřḗ ẇḗřḗ ŧħḗ ƒǿŀŀǿẇīƞɠ ƥřǿƀŀḗḿş: ǋ鶱ΐǲǲǋϑ]',
	'invitefriends:email_error' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧḓḓřḗşşḗş ȧřḗ ƞǿŧ ṽȧŀīḓ: %s ſǅϰ ϑ衋ǋǈǈϰ靐]',
	'invitefriends:already_members' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧřḗ ȧŀřḗȧḓẏ ḿḗḿƀḗřş: %s 靐衋ı 衋靐ǈ鶱ǅϰ]',
	'invitefriends:noemails' => '[Ƞǿ ḗḿȧīŀ ȧḓḓřḗşşḗş ẇḗřḗ ḗƞŧḗřḗḓ. ϱϱ ǋẛϵǅǲ ǅ靐]',
	
	'invitefriends:message:default' => '[Ħī,

Ī ẇȧƞŧ ŧǿ īƞṽīŧḗ ẏǿŭ ŧǿ ĵǿīƞ ḿẏ ƞḗŧẇǿřķ ħḗřḗ ǿƞ %s. ϑϕΐϑ衋ς ǈ]',

	'invitefriends:email' => '[Ẏǿŭ ħȧṽḗ ƀḗḗƞ īƞṽīŧḗḓ ŧǿ ĵǿīƞ %s ƀẏ %s. Ŧħḗẏ īƞƈŀŭḓḗḓ ŧħḗ ƒǿŀŀǿẇīƞɠ ḿḗşşȧɠḗ:

%s

Ŧǿ ĵǿīƞ, ƈŀīƈķ ŧħḗ ƒǿŀŀǿẇīƞɠ ŀīƞķ:

%s

Ẏǿŭ ẇīŀŀ ȧŭŧǿḿȧŧīƈȧŀŀẏ ȧḓḓ ŧħḗḿ ȧş ȧ ƒřīḗƞḓ ẇħḗƞ ẏǿŭ ƈřḗȧŧḗ ẏǿŭř ȧƈƈǿŭƞŧ. ϐſϕ ςϰϱϕ ϱΰϑǲ ϱΐϐǅΐ衋ϐ ẛǲ ςıϵϑ ϱϵ ıẛ]',
	
);
