<?php
return array(

	'friends:invite' => '[Īƞṽīŧḗ ƒřīḗƞḓş ǈϑϰǲϐϰ ẛΐǲ衋ı]',
	
	'invitefriends:registration_disabled' => '[Ƞḗẇ ŭşḗř řḗɠīşŧřȧŧīǿƞ ħȧş ƀḗḗƞ ḓīşȧƀŀḗḓ ǿƞ ŧħīş şīŧḗ; ẏǿŭ ȧřḗ ŭƞȧƀŀḗ ŧǿ īƞṽīŧḗ ƞḗẇ ŭşḗřş. ϵẛſ 鶱ϕϐǅ ſẛǅϐϕ]',
	
	'invitefriends:introduction' => '[Ŧǿ īƞṽīŧḗ ƒřīḗƞḓş ŧǿ ĵǿīƞ ẏǿŭ ǿƞ ŧħīş ƞḗŧẇǿřķ, ḗƞŧḗř ŧħḗīř ḗḿȧīŀ ȧḓḓřḗşşḗş ȧƞḓ ȧ ḿḗşşȧɠḗ ŧħḗẏ ẇīŀŀ řḗƈḗīṽḗ ẇīŧħ ẏǿŭř īƞṽīŧȧŧīǿƞ ǅǲ ǋϵẛıΐ鶱 ǅϵΐϕẛϱϵ ΰǋ ǈ]',
	'invitefriends:emails' => '[Ḗḿȧīŀ ȧḓḓřḗşşḗş (ǿƞḗ ƥḗř ŀīƞḗ) ϕΐϰΰϰ ϑϐϑϵ]',
	'invitefriends:message' => '[Ḿḗşşȧɠḗ ẛǅẛϱΰϰǈ]',
	'invitefriends:subject' => '[Īƞṽīŧȧŧīǿƞ ŧǿ ĵǿīƞ %s ϵı靐ϐΐϰςςǋſ]',

	'invitefriends:success' => '[Ẏǿŭř ƒřīḗƞḓş ẇḗřḗ īƞṽīŧḗḓ. 鶱ϵ衋ς ſǅϑẛΰϐ]',
	'invitefriends:invitations_sent' => '[Īƞṽīŧḗş şḗƞŧ: %s. Ŧħḗřḗ ẇḗřḗ ŧħḗ ƒǿŀŀǿẇīƞɠ ƥřǿƀŀḗḿş: ϐϑǈϵ鶱ΐ衋]',
	'invitefriends:email_error' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧḓḓřḗşşḗş ȧřḗ ƞǿŧ ṽȧŀīḓ: %s ǋϰϵ 鶱靐ǲǲςϕǈ]',
	'invitefriends:already_members' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ȧřḗ ȧŀřḗȧḓẏ ḿḗḿƀḗřş: %s ıϰ衋 ǅſϑΰǲΐ]',
	'invitefriends:noemails' => '[Ƞǿ ḗḿȧīŀ ȧḓḓřḗşşḗş ẇḗřḗ ḗƞŧḗřḗḓ. ǲϑ ſϐϵϑϰ ϵ衋]',
	
	'invitefriends:message:default' => '[Ħī,

Ī ẇȧƞŧ ŧǿ īƞṽīŧḗ ẏǿŭ ŧǿ ĵǿīƞ ḿẏ ƞḗŧẇǿřķ ħḗřḗ ǿƞ %s. ϵ鶱ǈǈ衋ı 靐]',

	'invitefriends:email' => '[Ẏǿŭ ħȧṽḗ ƀḗḗƞ īƞṽīŧḗḓ ŧǿ ĵǿīƞ %s ƀẏ %s. Ŧħḗẏ īƞƈŀŭḓḗḓ ŧħḗ ƒǿŀŀǿẇīƞɠ ḿḗşşȧɠḗ:

%s

Ŧǿ ĵǿīƞ, ƈŀīƈķ ŧħḗ ƒǿŀŀǿẇīƞɠ ŀīƞķ:

%s

Ẏǿŭ ẇīŀŀ ȧŭŧǿḿȧŧīƈȧŀŀẏ ȧḓḓ ŧħḗḿ ȧş ȧ ƒřīḗƞḓ ẇħḗƞ ẏǿŭ ƈřḗȧŧḗ ẏǿŭř ȧƈƈǿŭƞŧ. ϑǅϖ ǲΐẛϱ ΰıςϖ ǋıǲϐϱϵϑ ϖΐ ẛϖ鶱ϱ ϐϐ 靐ı]',
	
);
