<?php
return array(
	'admin:administer_utilities:diagnostics' => '系統診斷',
	'diagnostics' => '系統診斷',
	'diagnostics:report' => '診斷報告',
	'diagnostics:description' => '以下的診斷報告可能有助於診斷 Elgg 的問題。Elgg 的開發人員也許會要求您將它附加於錯誤報告。',
	'diagnostics:header' => '========================================================================
Elgg 診斷報告
產生 %s 來自 %s
========================================================================

',
	'diagnostics:report:basic' => '
Elgg 釋出 %s，版本 %s

------------------------------------------------------------------------',
	'diagnostics:report:php' => '
PHP 資訊：
%s
------------------------------------------------------------------------',
	'diagnostics:report:plugins' => '
已安裝的外掛程式與細節：

%s
------------------------------------------------------------------------',
	'diagnostics:report:md5' => '
已安裝的檔案與總和檢查碼：

%s
------------------------------------------------------------------------',
	'diagnostics:report:globals' => '
全域變數：

%s
------------------------------------------------------------------------',
);