<?php
return array(
	'admin:administer_utilities:diagnostics' => '[Şẏşŧḗḿ Ḓīȧɠƞǿşŧīƈş ǲǲΐϐϱς ϕǈϑ]',
	'diagnostics' => '[Şẏşŧḗḿ ḓīȧɠƞǿşŧīƈş ϕǋϐϕΰ靐 ΐΰẛ]',
	'diagnostics:report' => '[Ḓīȧɠƞǿşŧīƈş Řḗƥǿřŧ 鶱ǅΐϱẛǈΐǋϖϱ]',
	'diagnostics:description' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ḓīȧɠƞǿşŧīƈ řḗƥǿřŧ ƈȧƞ ƀḗ ŭşḗƒŭŀ ƒǿř ḓīȧɠƞǿşīƞɠ ƥřǿƀŀḗḿş ẇīŧħ Ḗŀɠɠ. Ŧħḗ ḓḗṽḗŀǿƥḗřş ǿƒ Ḗŀɠɠ ḿȧẏ řḗɋŭḗşŧ ŧħȧŧ ẏǿŭ ȧŧŧȧƈħ īŧ ŧǿ ȧ ƀŭɠ řḗƥǿřŧ. ΐϖϰ ϐϵϑϐǅǲϕϕϱ ϐϕǅẛı鶱ϵΰϖǋ ı鶱]',
	'diagnostics:header' => '[========================================================================
Ḗŀɠɠ Ḓīȧɠƞǿşŧīƈ Řḗƥǿřŧ
Ɠḗƞḗřȧŧḗḓ %s ƀẏ %s
========================================================================

 ǅϵ靐ϖıΐıϕϱϱẛϖ衋ϱǋϰ鶱ϱςϕǅϕς靐ΰǅϖſϖΰǅǲǋϐ]',
	'diagnostics:report:basic' => '[
Ḗŀɠɠ Řḗŀḗȧşḗ %s, ṽḗřşīǿƞ %s

------------------------------------------------------------------------ ı衋ıΐ ǈϐǋẛςẛϰ ǈẛ衋]',
	'diagnostics:report:php' => '[
ƤĦƤ īƞƒǿ:
%s
------------------------------------------------------------------------ ΰǈ衋 ẛϱſϐϑı衋ϵ]',
	'diagnostics:report:plugins' => '[
Īƞşŧȧŀŀḗḓ ƥŀŭɠīƞş ȧƞḓ ḓḗŧȧīŀş:

%s
------------------------------------------------------------------------ ϵϰϕς鶱ςϱΰϱ ǈςΐẛǋϵ靐]',
	'diagnostics:report:md5' => '[
Īƞşŧȧŀŀḗḓ ƒīŀḗş ȧƞḓ ƈħḗƈķşŭḿş:

%s
------------------------------------------------------------------------ ϖẛϵ鶱ϵſ衋ẛ衋 ϐ靐ıǋǈ ϐ]',
	'diagnostics:report:globals' => '[
Ɠŀǿƀȧŀ ṽȧřīȧƀŀḗş:

%s
------------------------------------------------------------------------ ẛǈ鶱ϱǋǅ ϑıΰϵ衋ǲǋ衋]',
);