<?php
return array(
	'admin:administer_utilities:diagnostics' => '[Şẏşŧḗḿ Ḓīȧɠƞǿşŧīƈş ǲǅΐ衋ǋΰ 靐ςǲ]',
	'diagnostics' => '[Şẏşŧḗḿ ḓīȧɠƞǿşŧīƈş ϵẛǲǋǅΐ ſϑϐ]',
	'diagnostics:report' => '[Ḓīȧɠƞǿşŧīƈş Řḗƥǿřŧ ϰϰϰǲ靐ϕ衋ΐΐΰ]',
	'diagnostics:description' => '[Ŧħḗ ƒǿŀŀǿẇīƞɠ ḓīȧɠƞǿşŧīƈ řḗƥǿřŧ ƈȧƞ ƀḗ ŭşḗƒŭŀ ƒǿř ḓīȧɠƞǿşīƞɠ ƥřǿƀŀḗḿş ẇīŧħ Ḗŀɠɠ. Ŧħḗ ḓḗṽḗŀǿƥḗřş ǿƒ Ḗŀɠɠ ḿȧẏ řḗɋŭḗşŧ ŧħȧŧ ẏǿŭ ȧŧŧȧƈħ īŧ ŧǿ ȧ ƀŭɠ řḗƥǿřŧ. ϵıǅ ẛı靐ǲΰΰ靐ϵϖ ϕϵϖ鶱鶱ςϵΐςẛ ΐϰ]',
	'diagnostics:header' => '[========================================================================
Ḗŀɠɠ Ḓīȧɠƞǿşŧīƈ Řḗƥǿřŧ
Ɠḗƞḗřȧŧḗḓ %s ƀẏ %s
========================================================================

 ϑǅϕΰ衋ϕ靐ςϐǋǅΐϐǲǋẛ衋ϑϖςıǅϕϑϰϱςǋǅϰϑ鶱ſϖ]',
	'diagnostics:report:basic' => '[
Ḗŀɠɠ Řḗŀḗȧşḗ %s, ṽḗřşīǿƞ %s

------------------------------------------------------------------------ ΰ鶱ϖſ ϕΐϱϐΰǋ衋 ǅǋΰ]',
	'diagnostics:report:php' => '[
ƤĦƤ īƞƒǿ:
%s
------------------------------------------------------------------------ 鶱ϖſ ǋϖ衋衋ǋ鶱ǅǅ]',
	'diagnostics:report:plugins' => '[
Īƞşŧȧŀŀḗḓ ƥŀŭɠīƞş ȧƞḓ ḓḗŧȧīŀş:

%s
------------------------------------------------------------------------ ǋϖΐϕ衋ǋςϱǲ ϰϐϐſ衋ςϕ]',
	'diagnostics:report:md5' => '[
Īƞşŧȧŀŀḗḓ ƒīŀḗş ȧƞḓ ƈħḗƈķşŭḿş:

%s
------------------------------------------------------------------------ ẛϖẛǋıſϑϱſ ẛǲΰΐϱ ǈ]',
	'diagnostics:report:globals' => '[
Ɠŀǿƀȧŀ ṽȧřīȧƀŀḗş:

%s
------------------------------------------------------------------------ ϖϕǅϱϐϐ ǲΰΰϕϐ衋衋ϵ]',
);