<?php
return array(
	'admin:diagnostics' => '시스템 진단',
	'diagnostics' => '시스템 진단',
	'diagnostics:report' => '진단 보고서',
	'diagnostics:description' => '아래의 진단보고서는 Elgg의 문제점을 진단하는데 유용할 수 있습니다. Elgg의 개발자들은 오류보고서에 이것을 포함하도록 요청할 수 있습니다.',
	'diagnostics:header' => '========================================================================
엘그 진단 보고서
작성  %s  작성자 %s
========================================================================

',
	'diagnostics:report:basic' => '
엘그 공개 %s, 버전 %s

------------------------------------------------------------------------',
	'diagnostics:report:php' => '
PHP 정보:
%s
------------------------------------------------------------------------',
	'diagnostics:report:md5' => '
설치된 파일과 체크섬:

%s
------------------------------------------------------------------------',
	'diagnostics:report:globals' => '
전역 변수:

%s
------------------------------------------------------------------------',
);
