<?php
return array(
	'admin:administer_utilities:diagnostics' => '시스템 진단',
	'diagnostics' => '시스템 진단',
	'diagnostics:report' => '진단 보고서',
	'diagnostics:description' => '아래의 진단보고서는 Elgg의 문제점을 진단하는데 유용할 수 있습니다. Elgg의 개발자들은 오류보고서에 이것을 포함하도록 요청할 수 있습니다.',
	'diagnostics:header' => '========================================================================
Elgg 진단보고서
 %s 를 %s 가 만듬.
========================================================================

',
	'diagnostics:report:basic' => '
Elgg Release %s, version %s

------------------------------------------------------------------------',
	'diagnostics:report:php' => '
PHP 정보:
%s
------------------------------------------------------------------------',
	'diagnostics:report:plugins' => '
설치된 플러긴과 세부정보:

%s
------------------------------------------------------------------------',
	'diagnostics:report:md5' => '
설치된 파일과 검증값:

%s
------------------------------------------------------------------------',
	'diagnostics:report:globals' => '
전역변수:

%s
------------------------------------------------------------------------',
);