<?php
return array(
	'admin:administer_utilities:diagnostics' => 'Диагностика системы',
	'diagnostics' => 'Диагностика системы',
	'diagnostics:report' => 'Диагностические отчеты',
	'diagnostics:description' => 'Этот отчет о диагностике полезен для диагностирования проблем Elgg и должен быть приложен к любому сообщаемому багу.',
	'diagnostics:header' => '========================================================================
Elgg Diagnostic Report
Generated %s by %s
========================================================================

',
	'diagnostics:report:basic' => '
Elgg релиз %s, версия %s

------------------------------------------------------------------------',
	'diagnostics:report:php' => '
PHP-сведения:
%s
------------------------------------------------------------------------',
	'diagnostics:report:plugins' => '
Установленные плагины и детали:

%s
------------------------------------------------------------------------',
	'diagnostics:report:md5' => '
Установленные файлы и их сумма:

%s
------------------------------------------------------------------------',
	'diagnostics:report:globals' => '
Глобальные переменные:

%s
------------------------------------------------------------------------',
);